     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    DSPF NAME    : ARA014C                                   */
     /*    AUTHOR       : TINA WHANG                                */
     /*    CREATE DATE  : 82/03/03                                  */
     /*    PROGRAM NAME : ARA015C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款作業                             */
     /*    REMARK       :沖帳批次作業                             */
     /***************************************************************/
             PGM

             DCL        VAR(&IN98) TYPE(*LGL) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)

             DCL        VAR(&DAC01) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAD10S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAD10E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAC02)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&DAC08) TYPE(*DEC) LEN(9)
             DCL        VAR(&DAC12) TYPE(*CHAR) LEN(14)
             DCL        VAR(&DAC04) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WAC04) TYPE(*CHAR) LEN(8)

 START:      CALL       PGM(ARA014) PARM(&IN03 &IN14 &IN98)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)

             OVRPRTF    FILE(ARR014P) PAGESIZE(*N 198) CPI(15)

             CHGVAR     VAR(&DAC01) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DAD10S) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DAD10E) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DAC02)  VALUE(%SST(*LDA 607 5))
             CHGVAR     VAR(&DAC08) VALUE(%SST(*LDA 612 9))
             CHGVAR     VAR(&DAC12) VALUE(%SST(*LDA 621 14))
             CHGVAR     VAR(&DAC04) VALUE(%SST(*LDA 637 6))
             CHGVAR     VAR(&WAC04) VALUE(%SST(*LDA 643 8))

             OVRDBF     FILE(SOSIPF) SHARE(*YES)
             OVRPRTF    FILE(ARA014P) USRDTA('沖帳批次')
   /*發票日期＋發票公司＋發票號碼  */
             OPNQRYF    FILE((SOSIPF)) OPTION(*ALL) QRYSLT('SI01 *EQ +
                          %RANGE("' *CAT &DAD10S *CAT '" "' *CAT +
                          &DAD10E *CAT '") & SI08 *EQ "A0002" & +
                          SI30 *NE 0 & SI18 *EQ " " & SI19 *NE "V" +
                          ') KEYFLD((SI21) (SI01) (SI02))


             CALL       PGM(ARA0141)

             CLOF       OPNID(SOSIPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             CHGVAR     VAR(&IN98) VALUE('1')

             GOTO       START
             ENDPGM
