             PGM

             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)

             RTVJOBA    JOB(&JOB)
             SBMJOB     CMD(CALL PGM(ARB001)) JOB(ARB001) JOBQ(QBATCH)
             SNDBRKMSG  +
                          MSG('銷退價差檢核批次作業已開始，請稍後領+
                          取報表！') TOMSGQ(&JOB)

             ENDPGM
