     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : 910074 TINA                               */
     /*    CREATE DATE  : 82/03/30                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARI027C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款系統                             */
     /*    REMARK       :發票未作廢重開查詢                       */
     /***************************************************************/
             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DSI01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&WSI21S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WSI21E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)


 START:      CALL       PGM(ARI027) PARM(&IN03)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 300)) VALUE(' ')
             RETURN
             ENDDO

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&DSI01S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DSI01E) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&WSI21S) VALUE(%SST(*LDA 617 6))
             CHGVAR     VAR(&WSI21E) VALUE(%SST(*LDA 623 6))
             OVRDBF     FILE(SOSILF2) SHARE(*YES)
             OPNQRYF    FILE((SOSILF2)) QRYSLT('SI01 *EQ %RANGE("' +
                          *CAT &DSI01S *CAT '" "' *CAT &DSI01E *CAT +
                          '") & MSI21 *EQ %RANGE("' *CAT &YMD8S  +
                          *CAT '" "' *CAT &YMD8E  *CAT '")') +
                          KEYFLD(*FILE) MAPFLD((MSI21 SI21 *CHAR 8))
/*M001D                   '") & MSI21 *EQ %RANGE("' *CAT &WSI21S +
                          *CAT '" "' *CAT &WSI21E *CAT '")') +
                          KEYFLD(*FILE) MAPFLD((MSI21 SI21 *CHAR 6)) */

             CALL       PGM(ARI0271)

             CLOF       OPNID(SOSILF2)
             DLTOVR     FILE(*ALL)

             GOTO       START

             ENDPGM
