             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/ARM001D) RCDFMT(DSPC1)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')
             IF         COND(&IN03 *EQ '1') THEN(RETURN)

             IF         COND(&DOPID *EQ '41') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR041C')
             ENDDO
             IF         COND(&DOPID *EQ '42') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR042C')
             ENDDO
             IF         COND(&DOPID *EQ '43') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR043C')
             ENDDO
             IF         COND(&DOPID *EQ '44') THEN(DO)
                        CHGVAR VAR(&S0102I) VALUE('ARR044C')
             ENDDO
             IF         COND(&DOPID *EQ '45') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR045C')
             ENDDO
             IF         COND(&DOPID *EQ '46') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR046C')
             ENDDO
             IF         COND(&DOPID *EQ '47') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR047C')
             ENDDO
             IF         COND(&DOPID *EQ '48') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR048C')
             ENDDO
             IF         COND(&DOPID *EQ '49') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR049C')
             ENDDO
             IF         COND(&DOPID *EQ '50') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR050C')
             ENDDO
             IF         COND(&DOPID *EQ '51') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR051C')
             ENDDO
             IF         COND(&DOPID *EQ '52') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR052C')
             ENDDO
             IF         COND(&DOPID *EQ '53') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR053C')
             ENDDO
             IF         COND(&DOPID *EQ '54') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR054C')
             ENDDO
             IF         COND(&DOPID *EQ '55') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR056C')
             ENDDO
             IF         COND(&DOPID *EQ '56') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR057C')
             ENDDO
             IF         COND(&DOPID *EQ '57') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR058C')
             ENDDO
             IF         COND(&DOPID *EQ '58') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR059C')
             ENDDO
             IF         COND(&DOPID *EQ '59') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR060C')
             ENDDO
             IF         COND(&DOPID *EQ '60') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SOR063C')
             ENDDO
             IF         COND(&DOPID *EQ '61') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR061C')
             ENDDO
             IF         COND(&DOPID *EQ '62') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR062C')
             ENDDO
             IF         COND(&DOPID *EQ '63') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR063C')
             ENDDO
             IF         COND(&DOPID *EQ '64') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR064C')
             ENDDO
             IF         COND(&DOPID *EQ '65') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR065C')
             ENDDO
             IF         COND(&DOPID *EQ '66') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR066C')
             ENDDO
             IF         COND(&DOPID *EQ '67') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR067C')
             ENDDO
             IF         COND(&DOPID *EQ '68') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR068C')
             ENDDO
             IF         COND(&DOPID *EQ '69') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR069C')
             ENDDO
             IF         COND(&DOPID *EQ '70') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR070C')
             ENDDO
             IF         COND(&DOPID *EQ '71') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR071C')
             ENDDO
             IF         COND(&DOPID *EQ '72') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR072C')
             ENDDO
             IF         COND(&DOPID *EQ '73') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR073C')
             ENDDO
             IF         COND(&DOPID *EQ '74') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR067C')
             ENDDO
             IF         COND(&DOPID *EQ '75') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR068C')
             ENDDO
             IF         COND(&DOPID *EQ '76') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR074C')
             ENDDO
             IF         COND(&DOPID *EQ '77') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR075C')
             ENDDO
             IF         COND(&DOPID *EQ '78') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR076C')
             ENDDO
             IF         COND(&DOPID *EQ '79') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR077C')
             ENDDO
             IF         COND(&DOPID *EQ '80') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR078C')
             ENDDO
             IF         COND(&DOPID *EQ '81') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR079C')
             ENDDO
             IF         COND(&DOPID *EQ '82') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR080C')
             ENDDO
             IF         COND(&DOPID *EQ '83') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR082C')
             ENDDO
             IF         COND(&DOPID *EQ '84') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR077C')
             ENDDO
             IF         COND(&DOPID *EQ '85') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SOR087C')
             ENDDO
             IF         COND(&DOPID *EQ '86') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SOR089C')
             ENDDO
             IF         COND(&DOPID *EQ '87') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR083C')
             ENDDO
             IF         COND(&DOPID *EQ '88') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARR090C')
             ENDDO
             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

             ENDPGM
