             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/ARM000D) RCDFMT(DSPC1)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')
             IF         COND(&IN03 *EQ '1') THEN(RETURN)

             IF         COND(&DOPID *EQ '01') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA001')
             ENDDO
             IF         COND(&DOPID *EQ '02') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('CKA1D0')
             ENDDO
             IF         COND(&DOPID *EQ '03') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA003')
             ENDDO
             IF         COND(&DOPID *EQ '04') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA004')
             ENDDO
             IF         COND(&DOPID *EQ '05') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA005')
             ENDDO
             IF         COND(&DOPID *EQ '06') THEN(DO)
             GOTO       START
   /*                     CHGVAR VAR(&S0102I) VALUE('ARA006')   */
             ENDDO
             IF         COND(&DOPID *EQ '07') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA007')
             ENDDO
             IF         COND(&DOPID *EQ '08') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA008') /*M001M*/
             ENDDO
     /*      IF         COND(&DOPID *EQ '09') THEN(DO)          */
     /*                   CHGVAR VAR(&S0102I) VALUE('ARA009C1') */
     /*      ENDDO                                              */
             IF         COND(&DOPID *EQ '10') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA010C')
             ENDDO
     /*      IF         COND(&DOPID *EQ '11') THEN(DO)          */
     /*                   CHGVAR VAR(&S0102I) VALUE('ARA012C')  */
     /*      ENDDO                                              */
             IF         COND(&DOPID *EQ '12') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA013C')
             ENDDO
             IF         COND(&DOPID *EQ '13') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA013X')
             ENDDO
             IF         COND(&DOPID *EQ '14') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA014C')
             ENDDO
             IF         COND(&DOPID *EQ '15') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA015C')
             ENDDO
             IF         COND(&DOPID *EQ '16') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARA016')
             ENDDO
             IF         COND(&DOPID *EQ '17') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARB001C')
             ENDDO
             IF         COND(&DOPID *EQ '21') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARI021')
             ENDDO
             IF         COND(&DOPID *EQ '22') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARI022')
             ENDDO
             IF         COND(&DOPID *EQ '23') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARI023')
             ENDDO
             IF         COND(&DOPID *EQ '24') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARI024')
             ENDDO
             IF         COND(&DOPID *EQ '25') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARI025')
             ENDDO
             IF         COND(&DOPID *EQ '26') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARI026')
             ENDDO
             IF         COND(&DOPID *EQ '27') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARI027C')
             ENDDO
             IF         COND(&DOPID *EQ '28') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARI028')
             ENDDO
             IF         COND(&DOPID *EQ '29') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('ARI029')
             ENDDO
             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

             ENDPGM
