     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 07/12/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR071C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :                                           */
     /*    REMARK       :折讓成本差異表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSG04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSG04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&YSG26S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSG26E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DSG04S) VALUE(%SST(*LDA 630 5))
             CHGVAR     VAR(&DSG04E) VALUE(%SST(*LDA 635 5))
             CHGVAR     VAR(&YSG26S) VALUE(%SST(*LDA 652 6))
             CHGVAR     VAR(&YSG26E) VALUE(%SST(*LDA 658 6))

             CPYF       FROMFILE(REWF78) TOFILE(QTEMP/REWF78) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF78))
             OVRDBF     FILE(REWF78) TOFILE(QTEMP/REWF78) SHARE(*YES)

             OVRPRTF    FILE(ARR071P) PAGESIZE(*N 158) CPI(12) +
                        USRDTA('折成本差')
             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OPNQRYF    FILE((SOSGPF)) QRYSLT(' SG01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SG04 *EQ %RANGE("' *CAT &DSG04S +
                          *CAT '" "' *CAT &DSG04E *CAT '") & MSG26 +
                          *EQ %RANGE("' *CAT &YMD8S  *CAT '" "' +
                          *CAT &YMD8E  *CAT '") & SG02A *LT "0" & +
                          SG01B *NE "K"  ') +
                          MAPFLD((SG02A '%SST(SG02 4 1)' *CHAR 1) +
                          (SG01A '%sst(sg01 2 1)' *CHAR 1) +
                          (SG01B '%sst(sg01 1 1)' *CHAR 1) +
                          (MSG26 SG26 *CHAR 8))

             CALL       ARR0711
             CALL       ARR0712
             CLOF       OPNID(SOSGPF)
             DLTOVR     FILE(*ALL)

             CHGVAR     VAR(&P6601I) VALUE('ARR071P')
             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
