     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/04/06                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR048C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收系統                                 */
     /*    REMARK       :應收帳款明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSI89S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSI89E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSI35S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSI35E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSI01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI03S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSI03E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSI31S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSI31E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

             CPYF       FROMFILE(REFLIB/REWF80) TOFILE(QTEMP/REWF80) +
                          CRTFILE(*YES)

             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF80))
             OVRDBF     FILE(REWF80) TOFILE(QTEMP/REWF80) SHARE(*YES)

             CHGVAR     VAR(&DSI89S) VALUE(%SST(*LDA 601 9))
             CHGVAR     VAR(&DSI89E) VALUE(%SST(*LDA 610 9))
             CHGVAR     VAR(&DSI35S) VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&DSI35E) VALUE(%SST(*LDA 646 6))
             CHGVAR     VAR(&DSI01S) VALUE(%SST(*LDA 661 2))
             CHGVAR     VAR(&DSI01E) VALUE(%SST(*LDA 663 2))
             CHGVAR     VAR(&DSI03S) VALUE(%SST(*LDA 665 1))
             CHGVAR     VAR(&DSI03E) VALUE(%SST(*LDA 666 1))
             CHGVAR     VAR(&DSI31S) VALUE(%SST(*LDA 671 6))
             CHGVAR     VAR(&DSI31E) VALUE(%SST(*LDA 677 6))
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))


             OVRPRTF    FILE(ARR048P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('應收帳明')
             OVRDBF     FILE(SOSIPF) SHARE(*YES)

             OPNQRYF    FILE((SOSIPF)) QRYSLT(' (SI01 *EQ %RANGE("' +
                          *CAT &DSI01S *CAT '" "' *CAT &DSI01E *CAT +
                          '")) & (DSI89 *EQ %RANGE("' *CAT &DSI89S +
                          *CAT '"  "' *CAT &DSI89E *CAT '")) & +
                          (SI35 *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' +
                          *CAT &YMD8E  *CAT ')) & (SI18 *EQ "  " ) +
                          & SI03 *EQ %RANGE("' *CAT &DSI03S *CAT '" +
                          "' *CAT &DSI03E *CAT '") & SI31 *EQ +
                          %RANGE("' *CAT &DSI31S *CAT '" "' *CAT +
                          &DSI31E *CAT '")') KEYFLD((SI01) (SI12) +
                          (SI13) (SI35) (SI02)) MAPFLD((DSI89 'SI12 +
                          || SI13'))

             CALL       ARR0481
             OVRDBF     FILE(SOSIPF) TOFILE(REFLIB/SOSILF) SHARE(*YES)
             CALL       ARR0482

             CLOF       OPNID(SOSIPF)
             DLTOVR     FILE(SOSIPF)
             DLTOVR     FILE(ARR048P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('ARR048P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
