     /****************************************************************/
     /* 00A需求單號: 1040761                                       */
     /* 00A 2015/08/17 DEREK產生為EXCEL 格式                     */
     /****************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DAK03S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAK03E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAK04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DAK04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DME15S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DME15E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DYM) TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)
/*00A*/      DCL        VAR(&LIB)   TYPE(*CHAR) LEN(10)
/*00A*/      DCL        VAR(&FILE)  TYPE(*CHAR) LEN(10)


             CHGVAR     VAR(&DAK03S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DAK03E) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DAK04S) VALUE(%SST(*LDA 631 5))
             CHGVAR     VAR(&DAK04E) VALUE(%SST(*LDA 641 5))
             CHGVAR     VAR(&DME15S) VALUE(%SST(*LDA 646 6))
             CHGVAR     VAR(&DME15E) VALUE(%SST(*LDA 652 6))
             CHGVAR     VAR(&DYM) VALUE(%SST(*LDA 621 4))
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))
/*00A*/      CHGVAR     VAR(&LIB)   VALUE('QTEMP')
/*00A*/      CHGVAR     VAR(&FILE)  VALUE('ARR063PF')

/*00A*/      CPYF       FROMFILE(ARR063PF) TOFILE(QTEMP/ARR063PF) +
                          CRTFILE(*YES)
/*00A*/      MONMSG     MSGID(CPF2817) EXEC(CLRPFM +
                          FILE(QTEMP/ARR063PF))

/*00A*/      OVRDBF     FILE(ARR063PF) TOFILE(QTEMP/ARR063PF) +
                          SHARE(*YES)

             OVRPRTF    FILE(ARR063P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('應收彙總')
             OVRDBF     FILE(ARAKLF02) SHARE(*YES)
             OPNQRYF    FILE((ARAKLF02)) QRYSLT(' AK03 *EQ %RANGE("' +
                          *CAT &DAK03S *CAT '" "' *CAT &DAK03E *CAT +
                          '") & AK04 *EQ %RANGE("' *CAT &DAK04S +
                          *CAT '" "' *CAT &DAK04E *CAT '") & AK01 +
                          *EQ ' *CAT &YMD8S  *CAT ' & ME15 *EQ +
                          %RANGE("' *CAT &DME15S *CAT '" "' *CAT +
                          &DME15E *CAT '")') KEYFLD(*FILE)
/*M001D                   *EQ ' *CAT &DYM *CAT ' & ME15 *EQ +  */
             CALL       ARR0631

             CLOF       OPNID(ARAKLF02)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('ARR063P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

/*00A*/      /*將ARR063PF轉換成CSV FILE AND FTP TO PC */
/*00A*/         CALL       PGM(ECL100C) PARM(&LIB &FILE)

             ENDPGM
