     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/04/06                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR049C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收系統                                 */
     /*    REMARK       :票據預計兌現明細表                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DAC01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&YAC07S) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&YAC07E) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&DAC23S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DAC23E) TYPE(*CHAR) LEN(9)

             CHGVAR     VAR(&DAC01)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&YAC07S) VALUE(%SST(*LDA 620 8)) /*M001M*/
             CHGVAR     VAR(&YAC07E) VALUE(%SST(*LDA 628 8)) /*M001M*/
             CHGVAR     VAR(&DAC23S) VALUE(%SST(*LDA 641 9))
             CHGVAR     VAR(&DAC23E) VALUE(%SST(*LDA 651 9))


             OVRPRTF    FILE(ARR049P) PAGESIZE(*N 157) CPI(12) +
                        USRDTA('票據預兌')
             OVRDBF     FILE(ARACPF) SHARE(*YES)


             OPNQRYF    FILE((ARACPF)) QRYSLT(' (AC01 *EQ "' *CAT +
                          &DAC01 *CAT '") & (AC07 *EQ %RANGE(' *CAT +
                          &YAC07S *CAT ' ' *CAT &YAC07E *CAT ')) & +
                          AC23 *EQ %RANGE("' *CAT &DAC23S *CAT '" +
                          "' *CAT &DAC23E *CAT '") & (AC05 *EQ "10" +
                          ) & (AC11 *EQ 0) ') KEYFLD((AC01) (AC07) +
                          (AC02) (AC06)) MAPFLD((AC23 'AC02 || +
                          AC03' *CHAR 10))

             CALL       ARR0491

             CLOF       OPNID(ARACPF)
             DLTOVR     FILE(ARACPF)
             DLTOVR     FILE(ARR049P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('ARR049P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
