     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : SAM                                       */
     /*    CREATE DATE  : 97/01/24                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR083C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :　　　　　　                             */
     /*    REMARK       :收款未分配明表　　　                     */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DAC01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAC01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAC02S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DAC02E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&WAC04S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WAC04E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DAC09S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DAC09E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&DAC01S) VALUE(%SST(*LDA 600 2))
             CHGVAR     VAR(&DAC01E) VALUE(%SST(*LDA 602 2))
             CHGVAR     VAR(&DAC02S) VALUE(%SST(*LDA 604 5))
             CHGVAR     VAR(&DAC02E) VALUE(%SST(*LDA 609 5))
             CHGVAR     VAR(&DAC09S) VALUE(%SST(*LDA 614 6))
             CHGVAR     VAR(&DAC09E) VALUE(%SST(*LDA 620 6))
             CHGVAR     VAR(&WAC04S) VALUE(%SST(*LDA 626 6))
             CHGVAR     VAR(&WAC04E) VALUE(%SST(*LDA 632 6))
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))

             OVRPRTF    FILE(ARR083P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('收款未配')
             OVRDBF     FILE(ARACPF) SHARE(*YES)
             OPNQRYF    FILE((ARACPF)) QRYSLT(' AC01 *EQ %RANGE("' +
                          *CAT &DAC01S *CAT '" "' *CAT &DAC01E *CAT +
                          '") & AC02 *EQ %RANGE("' *CAT &DAC02S +
                          *CAT '" "' *CAT &DAC02E *CAT '") & AC04 +
                          *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & AC09 *EQ %RANGE("' *CAT +
                          &DAC09S *CAT '" "' *CAT &DAC09E *CAT '") +
                          & AC10  *NE 0 ') KEYFLD((AC01))
/*M001D                   *EQ %RANGE(' *CAT &WAC04S *CAT ' ' *CAT +
                        &WAC04E *CAT ') & AC09 *EQ %RANGE("' *CAT + */

             CALL       ARR0831

             CLOF       OPNID(ARACPF)
             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('ARR083P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
