     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1087  JOYCE                              */
     /*    CREATE DATE  : 81/04/06                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR053C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款作業                             */
     /*    REMARK       :票據兌現明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DAC01S)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAC01E)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAC12S) TYPE(*CHAR) LEN(14)
             DCL        VAR(&DAC12E) TYPE(*CHAR) LEN(14)
             DCL        VAR(&DAC11S) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&DAC11E) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&DAC23S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DAC23E) TYPE(*CHAR) LEN(9)

             CHGVAR     VAR(&DAC01S)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DAC01E)  VALUE(%SST(*LDA 670 2))
             CHGVAR     VAR(&DAC12S) VALUE(%SST(*LDA 603 14))
             CHGVAR     VAR(&DAC12E) VALUE(%SST(*LDA 617 14))
  /*M001M    CHGVAR     VAR(&DAC11S) VALUE(%SST(*LDA 635 +
                          2) || %SST(*LDA 631 4)) +
             CHGVAR     VAR(&DAC11E) VALUE(%SST(*LDA 641 +
                          2) || %SST(*LDA 637 4)) */
  /*M001M*/  CHGVAR     VAR(&DAC11S) VALUE(%SST(*LDA 681 8))
  /*M001M*/  CHGVAR     VAR(&DAC11E) VALUE(%SST(*LDA 691 8))
             CHGVAR     VAR(&DAC23S) VALUE(%SST(*LDA 643 9))
             CHGVAR     VAR(&DAC23E) VALUE(%SST(*LDA 652 9))

             OVRPRTF    FILE(ARR053P) USRDTA('票據兌明')
             OVRDBF     FILE(ARACPF) SHARE(*YES)
             OPNQRYF    FILE((ARACPF)) QRYSLT(' (AC01 *EQ %RANGE("' +
                          *CAT &DAC01S *CAT '" "' *CAT &DAC01E *CAT +
                          '")) & (AC12 *EQ %RANGE("' *CAT &DAC12S +
                          *CAT '" "' *CAT &DAC12E *CAT '")) & (AC11 +
                          *EQ %RANGE(' *CAT &DAC11S *CAT ' ' *CAT +
                          &DAC11E *CAT ')) & AC23A *EQ %RANGE("' +
                          *CAT &DAC23S *CAT '" "' *CAT &DAC23E *CAT +
                          '") ') KEYFLD((AC12) (AC11) (AC01)) +
                          MAPFLD((AC23A 'AC02 || AC03' *CHAR 9))

             CALL       ARR0531

             CLOF       OPNID(ARACPF)
             DLTOVR     FILE(ARACPF)
             DLTOVR     FILE(ARR053P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)


             CHGVAR     VAR(&P6601I) VALUE('ARR053P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
