     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1118   PHILIP TSAI                       */
     /*    CREATE DATE  : 81/04/09                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR0521                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款子系統                           */
     /*    REMARK       :應收帳款管理表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSI01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI89S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSI89E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&WSI29) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8)  TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&DSI01S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DSI01E) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DSI89S) VALUE(%SST(*LDA 621 9))
             CHGVAR     VAR(&DSI89E) VALUE(%SST(*LDA 631 9))
             CHGVAR     VAR(&WSI29) VALUE(%SST(*LDA 611 6))
/*M001A*/    CHGVAR     VAR(&YMD8)   VALUE(%SST(*LDA 850 8))

             OVRPRTF    FILE(ARR052P) PAGESIZE(*N 120) CPI(15) +
                        USRDTA('應收管理')
             OVRDBF     FILE(SOSILF07) SHARE(*YES)

             OPNQRYF    FILE((SOSILF07)) QRYSLT('(SI01 *EQ +
                          %RANGE("' *CAT &DSI01S *CAT '" "' *CAT +
                          &DSI01E *CAT '")) & (SI89 *EQ %RANGE("' +
                          *CAT &DSI89S *CAT '" "' *CAT &DSI89E +
/*M001A*/                 *CAT '")) & (SI29 *LE (' *CAT &YMD8  +
                          *CAT '))') KEYFLD((SI01) (SI29) +
                          (SI12) (SI02)) MAPFLD((SI89 'SI08 || SI09'))
/*M001D                   *CAT '")) & (SI29 *LE (' *CAT &WSI29 +   */

             CALL       ARR0521

             CLOF       OPNID(SOSILF07)
             DLTOVR     FILE(SOSILF07)
           /*DLTOVR     FILE(ARR052P)*/

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('ARR052P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
