             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSI01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DYM) TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)

             CPYF       FROMFILE(REWF44) TOFILE(QTEMP/REWF44) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF44))
             OVRDBF     FILE(REWF44) TOFILE(QTEMP/REWF44) SHARE(*YES)


             OVRPRTF    FILE(ARR062P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('發票調節')
             CHGVAR     VAR(&DSI01S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DSI01E) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DYM) VALUE(%SST(*LDA 609 4))
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))

             OVRDBF     FILE(SOSIPF) SHARE(*YES)
             OPNQRYF    FILE((SOSIPF)) QRYSLT('SI01 *EQ %RANGE("' +
                          *CAT &DSI01S *CAT '" "' *CAT &DSI01E *CAT +
                          '") & SI16 *NE "Y" & SI18 *NE "V" & +
                          ((MSI21 *EQ "' *CAT &YMD8S *CAT '"  & +
                          (MSI35 *GT MSI21 *OR SI18 *NE "D")) *OR +
                          (MSI35 *NE MSI21 & MSI35 *EQ "' *CAT &YMD8S +
                          *CAT '" & SI35 *NE 0 )) ') KEYFLD(*FILE) +
                          MAPFLD((CSI21 SI21 *CHAR 8) (MSI21 +
                          '%SST(CSI21 1 6)' *CHAR 6) (CSI35 SI35 +
                          *CHAR 8) (MSI35 '%SST(CSI35 1 6)' *CHAR 6))
 /*M001D                  ((MSI21 *EQ "' *CAT &DYM *CAT '"  & +
                          (MSI35 *GT MSI21 *OR SI18 *NE "D")) *OR +
                          (MSI35 *NE MSI21 & MSI35 *EQ "' *CAT &DYM +
                          *CAT '" & SI35 *NE 0 )) ') KEYFLD(*FILE) +
                          MAPFLD((CSI21 SI21 *CHAR 6) (MSI21 +
                          '%SST(CSI21 1 4)' *CHAR 4) (CSI35 SI35 +
                   *CHAR 6) (MSI35 '%SST(CSI35 1 4)' *CHAR 4))   */
             CALL       ARR0621
             CALL       ARR0622

             CLOF       OPNID(SOSIPF)
             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('ARR062P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
