     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266     */
     /*                                                             */
     /*    AUTHOR       : MERCURY                                   */
     /*    CREATE DATE  : 83/02/14                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR077                                    */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :進銷存系統                               */
     /*    REMARK       :折讓單簽收明細表                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSG01S)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSG01E)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSG01)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSG26S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG26E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG11S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG11E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATES)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEE)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSG04E) TYPE(*CHAR) LEN(5)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&DSG01S)  VALUE(%SST(*LDA 651 1))
             CHGVAR     VAR(&DSG01E)  VALUE(%SST(*LDA 652 1))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSG26S) VALUE(%SST(*LDA 604 6))
             CHGVAR     VAR(&DSG26E) VALUE(%SST(*LDA 610 6))
             CHGVAR     VAR(&DSG11S) VALUE(%SST(*LDA 616 6))
             CHGVAR     VAR(&DSG11E) VALUE(%SST(*LDA 622 6))
             CHGVAR     VAR(&DATES)  VALUE(%SST(*LDA 628 6))
             CHGVAR     VAR(&DATEE)  VALUE(%SST(*LDA 634 6))
             CHGVAR     VAR(&DSG04S) VALUE(%SST(*LDA 641 5))
             CHGVAR     VAR(&DSG04E) VALUE(%SST(*LDA 646 5))
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))

             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OVRDBF     FILE(ARAFPF) SHARE(*YES)

             OVRPRTF    FILE(ARR077P) CPI(13.3) USRDTA('折讓簽收')

             OPNQRYF    FILE((SOSGPF)) QRYSLT(' (SG01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
/*M001A*/                 '")) & (CSG26 *EQ %RANGE("' *CAT &YMD8S +
/*M001A*/                 *CAT '" "' *CAT &YMD8E *CAT '")) & SG01B +
                          *EQ %RANGE("' *CAT &DSG01S *CAT '"  "' +
                          *CAT &DSG01E *CAT '") & SG17 *EQ " " & +
                          (SG11 *EQ %RANGE("' *CAT &DSG11S *CAT '" +
                          "' *CAT &DSG11E *CAT '")) & (SG04 *EQ +
                          %RANGE("' *CAT &DSG04S *CAT '" "' *CAT +
                          &DSG04E *CAT '"))') KEYFLD((SG04) (SG26)) +
                          MAPFLD((SG01A '%SST(SG01 2 1)' *CHAR 1) +
                          (SG01B '%SST(SG01 1 1)' *CHAR 1) (CSG26 +
/*M001A*/                 SG26 *CHAR 8))
/*M001D                   '")) & (CSG26 *EQ %RANGE("' *CAT &DATES +
                          *CAT '" "' *CAT &DATEE *CAT '")) & SG01B + */
/*M001D                   SG26 *CHAR 6))  */
             OPNQRYF    FILE((ARAFPF)) QRYSLT('(AF01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
/*M001A*/                 '")) & (CAF05 *EQ %RANGE("' *CAT &YMD8S +
/*M001A*/                 *CAT '" "' *CAT &YMD8E *CAT '")) & ( AF03 +
                          *EQ %RANGE("' *CAT &DSG04S *CAT '" "' +
                          *CAT &DSG04E *CAT '")) &  AF01B *EQ +
                          %RANGE("' *CAT &DSG01S *CAT '" "' *CAT +
                          &DSG01E *CAT '")') KEYFLD((AF03) (AF06)) +
                          MAPFLD((AF01A '%SST(AF01 2 1)' *CHAR 1) +
                          (AF01B '%SST(AF01 1 1)' *CHAR 1) (CAF05 +
/*M001A*/                 AF05 *CHAR 8))

/*M001D                   '")) & (CAF05 *EQ %RANGE("' *CAT &DATES +
                        *CAT '" "' *CAT &DATEE *CAT '")) & ( AF03 + */
/*M001D                   AF05 *CHAR 6))   */
             CALL       ARR0771
             CHGVAR     VAR(&P6601I) VALUE('ARR077P')


             CLOF       OPNID(SOSGPF)
             CLOF       OPNID(ARAFPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
