     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1087  JOYCE                              */
     /*    CREATE DATE  : 81/01/27                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR047C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款作業                             */
     /*    REMARK       :銷退折讓明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSG01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSG01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSG04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSG04E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSG26S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG26E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMDS8)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMDE8)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATA)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DATA1)   TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DSG01S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DSG01E) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DSG04S) VALUE(%SST(*LDA 622 9))
             CHGVAR     VAR(&DSG04E) VALUE(%SST(*LDA 631 9))
             CHGVAR     VAR(&DSG26S) VALUE(%SST(*LDA 609 +
                          2) || %SST(*LDA 605 4))
             CHGVAR     VAR(&DSG26E) VALUE(%SST(*LDA 615 +
                          2) || %SST(*LDA 611 4))
             CHGVAR     VAR(&DATA)   VALUE(%SST(*LDA 617 1))
             CHGVAR     VAR(&DATA1)   VALUE(%SST(*LDA 618 1))
             CHGVAR     VAR(&YMDS8)   VALUE(%SST(*LDA 850 8))
             CHGVAR     VAR(&YMDE8)   VALUE(%SST(*LDA 858 8))

             IF         COND(&DATA *EQ 'A') THEN(DO)
             OVRPRTF    FILE(ARR047AP) PAGESIZE(*N 157) CPI(12) +
                        USRDTA('銷退折讓')

             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OPNQRYF    FILE((SOSGPF)) QRYSLT('(SG01 *EQ %RANGE("' +
                          *CAT &DSG01S *CAT '" "' *CAT &DSG01E *CAT +
                          '")) & (SG01A *NE "K" )& (SG45 *EQ +
                          %RANGE("' *CAT &DSG04S *CAT '" "' *CAT +
/*M001A*/                 &DSG04E *CAT '"))& (SG26 *EQ %RANGE(' +
/*M001A*/                 *CAT &YMDS8  *CAT ' ' *CAT &YMDE8  *CAT +
                          '))') KEYFLD((SG01) (SG26) (SG04)) +
                          MAPFLD((SG45 'SG04 *CAT SG05' *CHAR 9) +
                          (SG01A '%SST(SG01 1 1)' *CHAR 1))
/*M001D                   &DSG04E *CAT '"))& (SG26 *EQ %RANGE(' +
                          *CAT &DSG26S *CAT ' ' *CAT &DSG26E *CAT + */
             OVRDBF     FILE(ARAGPF) SHARE(*YES)

             CALL       ARR0471
             DLTOVR     FILE(ARR047AP)

             CLOF       OPNID(SOSGPF)
             DLTOVR     FILE(SOSGPF)
             DLTOVR     FILE(ARAGPF)
                        ENDDO
             ELSE       CMD(DO)
             OVRDBF     FILE(ARAFPF) SHARE(*YES)
             OPNQRYF    FILE((ARAFPF)) QRYSLT('(AF01 *EQ %RANGE("' +
                          *CAT &DSG01S *CAT '" "' *CAT &DSG01E *CAT +
                          '")) & (AF01A *NE "K" ) & (AF34 *EQ +
                          %RANGE("' *CAT &DSG04S *CAT '" "' *CAT +
/*M001A*/                 &DSG04E *CAT '")) & (AF05 *EQ %RANGE(' +
/*M001A*/                 *CAT &YMDS8  *CAT ' ' *CAT &YMDE8  *CAT +
                          '))') KEYFLD((AF01) (AF05) (AF02)) +
                          MAPFLD((AF34 'af03 *cat af04' *CHAR 9) +
                          (AF01A '%SST(af01 1 1)' *CHAR 1))
/*M001D                   &DSG04E *CAT '")) & (AF05 *EQ %RANGE(' +
                          *CAT &DSG26S *CAT ' ' *CAT &DSG26E *CAT +  */

             CALL       ARR0472

             CLOF       OPNID(ARAFPF)
             DLTOVR     FILE(ARAFPF)
                        ENDDO


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             IF         COND(&DATA *EQ 'A') THEN(DO)
               CHGVAR     VAR(&P6601I) VALUE('ARR047AP')
                        ENDDO
             ELSE
             IF         COND(&DATA *EQ 'B') THEN(DO)
               CHGVAR     VAR(&P6601I) VALUE('ARR047BP')
                        ENDDO

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
