     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 01/13/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR075C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收系統                                 */
     /*    REMARK       :應收帳款週轉率分析表                     */
     /***************************************************************/
     PGM
             DCL        VAR(&$EVR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY) TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC) LEN(2 0)

             DCL        VAR(&DCD03S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCD03E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCD13S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCD13E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCD06S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DCD06E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DCD09S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DCD09E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YCD01S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&YCD01E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&Y01S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&Y01E) TYPE(*CHAR) LEN(6)

             OVRPRTF    FILE(ARR075P) PAGESIZE(*N 158) CPI(12) +
                          USRDTA('應收週轉')

             CHGVAR     VAR(&DCD03S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DCD03E) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 605 1))
             CHGVAR     VAR(&DCD13S) VALUE(%SST(*LDA 606 1))
             CHGVAR     VAR(&DCD13E) VALUE(%SST(*LDA 607 1))
             CHGVAR     VAR(&DCD06S) VALUE(%SST(*LDA 610 5))
             CHGVAR     VAR(&DCD06E) VALUE(%SST(*LDA 620 5))
             CHGVAR     VAR(&DCD09S) VALUE(%SST(*LDA 625 6))
             CHGVAR     VAR(&DCD09E) VALUE(%SST(*LDA 631 6))
             CHGVAR     VAR(&YCD01S) VALUE(%SST(*LDA 648 4))
             CHGVAR     VAR(&YCD01E) VALUE(%SST(*LDA 652 4))
 /*M001A*/   CHGVAR     VAR(&Y01S) VALUE(%SST(*LDA 851 6))
 /*M001A*/   CHGVAR     VAR(&Y01E) VALUE(%SST(*LDA 861 6))

             OVRDBF     FILE(SOCDLF2) SHARE(*YES)
             OPNQRYF    FILE((SOCDLF2)) QRYSLT('CD03A *EQ %RANGE("' +
                          *CAT &DCD03S *CAT '" "' *CAT &DCD03E *CAT +
                          '") & CD02 *EQ %RANGE("' *CAT &COMPS *CAT +
                          '" "' *CAT &COMPE *CAT '") & CD13 *EQ +
                          %RANGE("' *CAT &DCD13S *CAT '"  "' *CAT +
                          &DCD13E *CAT '") & CD01 *EQ %RANGE(' *CAT +
                          &Y01S *CAT ' ' *CAT &Y01E *CAT ' ) & +
                          CD05 *EQ " " & CD09 *EQ %RANGE("' *CAT +
                          &DCD09S *CAT '" "' *CAT &DCD09E *CAT '") +
                          & CD06 *EQ %RANGE("' *CAT &DCD06S *CAT '" +
                          "' *CAT &DCD06E *CAT '") & CD15 *EQ " " +
                          ') KEYFLD(*FILE)

             CALL       PGM(ARR0751)
             CLOF       OPNID(SOCDLF2)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('ARR075P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
