     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/04/25                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : IMR056C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :庫存系統                                 */
     /*    REMARK       :送貨數量差異報表                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSG01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSG01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YSG06S) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&YSG06E) TYPE(*CHAR) LEN(8) /*M001M*/

             CHGVAR     VAR(&DSG01S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DSG01E) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&YSG06S) VALUE(%SST(*LDA 650 8)) /*M001M*/
             CHGVAR     VAR(&YSG06E) VALUE(%SST(*LDA 658 8)) /*M001M*/

             OVRPRTF    FILE(ARR056P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('銷折差異')
             OVRDBF     FILE(SOSGPF) SHARE(*YES)


             OPNQRYF    FILE((SOSGPF)) QRYSLT(' (SG01 *EQ %RANGE("' +
                          *CAT &DSG01S *CAT '" "' *CAT &DSG01E *CAT +
                          '")) & (SG06 *EQ %RANGE(' *CAT &YSG06S +
                          *CAT ' ' *CAT &YSG06E *CAT ')) & (SG17 +
                          *NE " ")') KEYFLD((SG01) (SG02))

             CALL       ARR0561

             CLOF       OPNID(SOSGPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('ARR056P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
