     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/04/02                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR043C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收系統                                 */
     /*    REMARK       :現金收入明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DAD01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&YAD04S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YAD04E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&DAD04)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
/*M001A      CHGVAR     VAR(&DAD04)  VALUE('        ') */

             CHGVAR     VAR(&DAD01)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&YAD04S) VALUE(%SST(*LDA 620 6))
             CHGVAR     VAR(&YAD04E) VALUE(%SST(*LDA 626 6))


             OVRPRTF    FILE(ARR043P) PAGESIZE(*N 157) CPI(12) +
                        USRDTA('現金收入')
             OVRDBF     FILE(ARADPF) SHARE(*YES)


             OPNQRYF    FILE((ARADPF)) QRYSLT('     +
               (AD01 *EQ "' *CAT &DAD01 *CAT '") & +
               (AD04 *EQ %RANGE(' *CAT &YMD8S *CAT ' ' *CAT  +
                          &YMD8E *CAT ')) & (AD05 +
                          *EQ "20"  *OR  AD05 *EQ "30")') +
                          KEYFLD((AD01) (AD02) (AD04) (AD07))
                    /*    MAPFLD((DAD04 AD04 *CHAR 8)) */

             CALL       ARR0431

             CLOF       OPNID(ARADPF)
             DLTOVR     FILE(ARADPF)
             DLTOVR     FILE(ARR043P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('ARR043P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
