     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1118   PHILIP                            */
     /*    CREATE DATE  : 81/04/28                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR051C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款子系統                           */
     /*    REMARK       :統一發票申報表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN87)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&ERRCD)  TYPE(*CHAR) LEN(1)
             CHGVAR     VAR(%SST(*LDA 162   1)) VALUE('2')
             CHGVAR     VAR(%SST(*LDA 125   3)) VALUE('001')
             CHGVAR     VAR(%SST(*LDA 598   2)) VALUE('00')

 START:      CALL       PGM(ARR051) PARM(&IN03 &IN98 &IN97 &IN87)
             IF         COND(&IN03) THEN(DO)
/*M001D      CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')   */
/*M001A*/    CHGVAR     VAR(%SST(*LDA 601 300)) VALUE(' ')
             RETURN
             ENDDO
             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             IF         COND(&$EVR *EQ '1') THEN(DO)
             CALL       PGM(ARR051C1)
             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             CHGVAR     VAR(&ERRCD)  VALUE(%SST(*LDA 680 1))
             IF         COND(&ERRCD *EQ ' ') THEN(DO)
                        CHGVAR     VAR(&IN98)  VALUE('1')
                        ENDDO
             ELSE       CMD(DO)
                        CHGVAR     VAR(&IN87)  VALUE('1')
                        ENDDO
                        ENDDO
             ELSE       CMD(DO)
                        SBMJOB    JOB(ARR051C1) RQSDTA('CALL ARR051C1')
             IF         COND(&ERRCD *EQ ' ') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
                        ENDDO
             ELSE       CMD(DO)
                        CHGVAR     VAR(&IN87)  VALUE('1')
                        ENDDO
                        ENDDO

             GOTO       START
             ENDPGM
