             PGM        PARM(&PRTNAM)
             DCL        VAR(&PRTNAM) TYPE(*CHAR) LEN(10)
             WRKOUTQ    OUTQ(&PRTNAM)
             MONMSG     MSGID(CPF9999)
 ENDLBL:     ENDPGM
