             PGM
             DCL        VAR(&WSTN) TYPE(*CHAR) LEN(10)
             RTVJOBA    JOB(&WSTN)
 /*  NANKONG */
             IF         COND(&WSTN = 'RMNKD01') THEN(DO)
             VRYCFG     CFGOBJ(RMNKD02) CFGTYPE(*DEV) STATUS(*ON) +
                          RESET(*YES)
             MONMSG     MSGID(CPF0000)
             ENDDO
             IF         COND(&WSTN = 'RMNKD02') THEN(DO)
             VRYCFG     CFGOBJ(RMNKD01) CFGTYPE(*DEV) STATUS(*ON) +
                          RESET(*YES)
             MONMSG     MSGID(CPF0000)
             ENDDO

 /*  TAICHUNG  */
             IF         COND(&WSTN = 'RMTCD01') THEN(DO)
             VRYCFG     CFGOBJ(RMTCD02) CFGTYPE(*DEV) STATUS(*ON) +
                          RESET(*YES)
             MONMSG     MSGID(CPF0000)
             ENDDO
             IF         COND(&WSTN = 'RMTCD02') THEN(DO)
             VRYCFG     CFGOBJ(RMTCD01) CFGTYPE(*DEV) STATUS(*ON) +
                          RESET(*YES)
             MONMSG     MSGID(CPF0000)
             ENDDO

 /*  HAOHSUNG       */
             IF         COND(&WSTN = 'RMKHD01') THEN(DO)
             VRYCFG     CFGOBJ(RMKHD02) CFGTYPE(*DEV) STATUS(*ON) +
                          RESET(*YES)
             MONMSG     MSGID(CPF0000)
             ENDDO
             IF         COND(&WSTN = 'RMKHD02') THEN(DO)
             VRYCFG     CFGOBJ(RMKHD01) CFGTYPE(*DEV) STATUS(*ON) +
                          RESET(*YES)
             MONMSG     MSGID(CPF0000)
             ENDDO
             IF         COND(&WSTN = 'DSP010001') THEN(DO)
             VRYCFG     CFGOBJ(DSP010702) CFGTYPE(*DEV) STATUS(*ON) +
                          RESET(*YES)
             MONMSG     MSGID(CPF0000)
             ENDDO


 ENDLBL:     ENDPGM
