     PGM PARM(&FLNM &JOBNO &USER &JOBNM)
     DCL VAR(&FLNM) TYPE(*CHAR) LEN(11)
     DCL VAR(&USER) TYPE(*CHAR) LEN(10)
     DCL VAR(&JOBNM) TYPE(*CHAR) LEN(10)
     DCL VAR(&JOBNO) TYPE(*CHAR) LEN(6)
     MONMSG MSGID(CPF0001) EXEC(GOTO CMDLBL(ENDSR))
     MONMSG MSGID(CPA0701) EXEC(GOTO CMDLBL(ENDSR))
     MONMSG MSGID(CPF3342) EXEC(GOTO CMDLBL(ENDSR))
     MONMSG MSGID(CPF3309) EXEC(GOTO CMDLBL(ENDSR))
     CPYSPLF FILE(&FLNM) TOFILE(REFLIB/FORM198) -
     JOB(&JOBNO/&USER/&JOBNM) MBROPT(*ADD)
     MONMSG MSGID(CPF0000) EXEC(GOTO CMDLBL(ENDSR))
ENDSR: +
     ENDPGM
