     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1118   PHILIP TSAI                       */
     /*    CREATE DATE  : 81/04/15                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : ARR0461                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款子系統                           */
     /*    REMARK       :銷貨成本明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)


             OVRPRTF    FILE(CHKSIADP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('檢發票收')

             OVRDBF     FILE(SOSIPF) SHARE(*YES)

             OPNQRYF    FILE((SOSIPF)) QRYSLT(' SI18 *EQ " " & SI19 +
                          *EQ " " ') KEYFLD(*FILE)

             OVRDBF     FILE(ARADPF) SHARE(*YES)

             OPNQRYF    FILE((ARADPF)) KEYFLD((AD10) (AD07))

             CALL       CHKSIAD

             CLOF       OPNID(SOSIPF)
             CLOF       OPNID(ARADPF)
             DLTOVR     FILE(SOSIPF)
             DLTOVR     FILE(ARADPF)
             /*  */

             DLTOVR     FILE(CHKSIADP)

             ENDPGM
