             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(1)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(1 0)

             DCL        VAR(&DBG01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBG02S)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DBG02E)   TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DBG01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DBG02S)   VALUE(%SST(*LDA 503 6))
             CHGVAR     VAR(&DBG02E)   VALUE(%SST(*LDA 509 6))

             OVRDBF     FILE(CKBGPF) SHARE(*YES)

             OPNQRYF    FILE((CKBGPF)) QRYSLT('(BG01 *EQ "' *CAT +
                          &DBG01 *CAT '") *AND (BG02C *EQ %RANGE("' +
                          *CAT &DBG02S *CAT '" "' *CAT &DBG02E *CAT +
                          '"))') KEYFLD((BG01) (BG02) (BG04) (BG03)) +
                          MAPFLD((BG02C BG02 *CHAR 6))
             CALL       CKR3D3
             CLOF       OPNID(CKBGPF)
             DLTOVR     FILE(CKBGPF)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (128 1)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('CKR3D0P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
