             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&YMD8S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YYMM)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CYYMM) TYPE(*DEC)  LEN(6 0)

             CHGVAR     VAR(&$USER) VALUE(%SST(*LDA 101 10))
             CHGVAR     VAR(&YYMM)  VALUE(%SST(*LDA 800 6))
             CHGVAR     VAR(&YMD8S) VALUE(%SST(*LDA 800 8))
             CHGVAR     VAR(&CYYMM) VALUE(&YYMM)

             DLTF       FILE(BKSOCD)
             MONMSG     CPF0000
             CRTPF      FILE(REFLIB/BKSOCD) SRCMBR(SOCDPF) +
                          SIZE(5000000 5000 5) REUSEDLT(*YES) +
                          LVLCHK(*NO)
             MONMSG     CPF0000
             OVRDBF     FILE(SOCDPF) SHARE(*YES)
             OPNQRYF    FILE((SOCDPF)) OPTION(*ALL) QRYSLT(' CD01 +
                          *LE ' *CAT &YYMM *CAT '  ') +
                          KEYFLD(*FILE)

             CALL       PGM(CLR0013)
             CLOF       OPNID(SOCDPF)
             DLTOVR     FILE(*ALL)
             ENDPGM
