             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&YMD8S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YYMM)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CYYMM) TYPE(*DEC)  LEN(6 0)

             CHGVAR     VAR(&$USER) VALUE(%SST(*LDA 101 10))
             CHGVAR     VAR(&YYMM)  VALUE(%SST(*LDA 800 6))
             CHGVAR     VAR(&YMD8S) VALUE(%SST(*LDA 800 8))
             CHGVAR     VAR(&CYYMM) VALUE(&YYMM)

             DLTF       FILE(BKSOSC)
             MONMSG     CPF0000
             CRTPF      FILE(REFLIB/BKSOSC) SRCMBR(SOSCPF) +
                          SIZE(5000000 5000 5) REUSEDLT(*YES) +
                          LVLCHK(*NO)
             MONMSG     CPF0000

             DLTF       FILE(BKSOSD)
             MONMSG     CPF0000
             CRTPF      FILE(REFLIB/BKSOSD) SRCMBR(SOSDPF) +
                          SIZE(5000000 5000 5) REUSEDLT(*YES) +
                          LVLCHK(*NO)
             MONMSG     CPF0000

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) OPTION(*ALL) QRYSLT(' CSC08 +
                          *LE  ("' *CAT &YMD8S *CAT '") +
                        & SC39 *NE 0  +
                     ') KEYFLD(*FILE)  +
                     MAPFLD((CSC08  SC08 *CHAR 8))

             CALL       PGM(CLR0014)
             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)
             ENDPGM
