             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&YMD8S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YYMM)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER) TYPE(*CHAR) LEN(10)

             CHGVAR     VAR(&$USER) VALUE(%SST(*LDA 101 10))
             CHGVAR     VAR(&YYMM)  VALUE(%SST(*LDA 800 6))
             CHGVAR     VAR(&YMD8S) VALUE(%SST(*LDA 800 8))

             DLTF       FILE(BKSOSI)
             MONMSG     CPF0000
             CRTPF      FILE(REFLIB/BKSOSI) SRCMBR(SOSIPF) +
                          SIZE(5000000 5000 5) REUSEDLT(*YES) +
                          LVLCHK(*NO)
             MONMSG     CPF0000

             DLTF       FILE(BKSOSJ)
             MONMSG     CPF0000
             CRTPF      FILE(REFLIB/BKSOSJ) SRCMBR(SOSJPF) +
                          SIZE(5000000 5000 5) REUSEDLT(*YES) +
                          LVLCHK(*NO)
             MONMSG     CPF0000

             OVRDBF     FILE(SOSIPF) SHARE(*YES)
             OPNQRYF    FILE((SOSIPF)) OPTION(*ALL) QRYSLT(' CSI35 +
                          *LE  ("' *CAT &YMD8S *CAT '") +
                        & SI30 *EQ 0  & SI35 *NE 0  +
                      ')  KEYFLD(*FILE) +
                     MAPFLD( (CSI35 SI35 *CHAR 8) )

             CALL       PGM(CLR0015)
             CLOF       OPNID(SOSIPF)
             DLTOVR     FILE(*ALL)
             ENDPGM
