             PGM        PARM(&SPLFIL)
             DCL        VAR(&CMD) TYPE(*CHAR) LEN(7) VALUE('RTOPCB ')
             DCL        VAR(&PCCMD) TYPE(*CHAR) LEN(20)
             DCL        VAR(&SPLFIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOBNUM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&JOBNAM) TYPE(*CHAR) LEN(10)

             RTVJOBA    JOB(&JOBNAM) USER(&USR) NBR(&JOBNUM)
  /*                                                     */
  /* CRTPF  FILE(REFLIB/STDPF) RCDLEN(200) IGCDTA(*YES)  */
  /*                                                     */
             CPYSPLF    FILE(&SPLFIL) TOFILE(*LIBL/STDPF) +
                          JOB(&JOBNUM/&USR/&JOBNAM) SPLNBR(*LAST)

             CHGVAR     VAR(&PCCMD) VALUE(&CMD *CAT &SPLFIL )

             STRPCCMD   PCCMD('CD\AS400') PAUSE(*NO)
             STRPCCMD   PCCMD(&PCCMD) PAUSE(*NO)



 ENDPGM:     ENDPGM
