     /***************************************************************/
     /*   寰盛洋酒股份有限公司－版權所有                          */
     /*                                                             */
     /*    PROGRAM ID   : DCM001C1                                  */
     /*    PROGRAM NAME :捷盟發票下載程式                         */
     /*    AUTHOR       : MICHELLE                                  */
     /*    CREATE DATE  : 03/03/04                                  */
     /*    UPDATE DATE  :                                           */
     /*    SYSTEM       :　　　　　　　　　　　　　　             */
     /***************************************************************  */
             PGM
             DCL        VAR(&D8YM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&P8YM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PYY ) TYPE(*DEC)  LEN(4 0)
             DCL        VAR(&CYY ) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PMM ) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&CMM ) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P3401I) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&P3403I) TYPE(*CHAR) LEN(1) VALUE('2')
             DCL        VAR(&P3404I) TYPE(*CHAR) LEN(1) VALUE('1')
             DCL        VAR(&P3411O) TYPE(*CHAR)  LEN(1)
             DCL        VAR(&P3412O) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&P3401X) TYPE(*CHAR) LEN(2)
 /* GENERATE *LDA */
             CALL       PGM(P63)
             DLTDTAARA  DTAARA(DCDA01SAV)
             MONMSG     MSGID(CPF2105)

             CRTDUPOBJ  OBJ(DCDA01) FROMLIB(REPLIB) +
                          OBJTYPE(*DTAARA) NEWOBJ(DCDA01SAV)

  /*         CALL P63         */

             RTVDTAARA  DTAARA(*LDA (201 4)) RTNVAR(&CYY)
             RTVDTAARA  DTAARA(*LDA (205 2)) RTNVAR(&CMM)
             CHGVAR     VAR(&PYY)    VALUE(&CYY)
             CHGVAR     VAR(&PMM)    VALUE(&CMM)

    /*讀取三個月內的發票資料 */

             CHGVAR     VAR(&PMM)    VALUE(&PMM - 2)

             IF         (&PMM <= 0 ) THEN(DO)
                 CHGVAR VAR(&PMM)    VALUE(&PMM + 12)
                 CHGVAR VAR(&PYY)    VALUE(&PYY -1)
                 ENDDO

             CHGVAR     VAR(&CYY)    VALUE(&PYY)
             CHGVAR     VAR(&CMM)    VALUE(&PMM)
             CHGVAR     VAR(&P8YM)   VALUE(&CYY *CAT &CMM)

             RTVDTAARA  DTAARA(*LDA (201 6)) RTNVAR(&D8YM)
             CHGVAR     VAR(&P3401I) VALUE(&D8YM)
             CHGVAR     VAR(&P3403I) VALUE('2')
             CHGVAR     VAR(&P3404I) VALUE('1')
             CALL       PGM(P34) PARM(&P3401I                 +
                                      &P3403I                 +
                                      &P3404I                 +
                                      &P3411O                 +
                                      &P3412O)

             CHGVAR     VAR(&P3401X) VALUE(&P3412O)

 /*          CHGDTAARA  DTAARA(DCDA01  (1 6)) VALUE(&D8YM)    */
             CHGDTAARA  DTAARA(DCDA01  (1 6)) VALUE(&P8YM)
             CHGDTAARA  DTAARA(DCDA01  (9 6)) VALUE(&D8YM)
             CHGDTAARA  DTAARA(DCDA01  (7 2)) VALUE('01')
             CHGDTAARA  DTAARA(DCDA01 (15 2)) VALUE(&P3401X)

             ENDPGM
