             PGM
             DCL        VAR(&DYS)   TYPE(*CHAR) LEN(2)

             CLRPFM     FILE(REFLIBTST/ARAFPF)
             CLRPFM     FILE(REFLIBTST/ARAGPF)

             CLRPFM     FILE(REFLIBTST/IMIBPF)
             CLRPFM     FILE(REFLIBTST/IMICPF)
             CLRPFM     FILE(REFLIBTST/IMIDPF)
             CLRPFM     FILE(REFLIBTST/IMIEPF)
             CLRPFM     FILE(REFLIBTST/IMIFPF)
             CLRPFM     FILE(REFLIBTST/IMIGPF)
             CLRPFM     FILE(REFLIBTST/IMIHPF)
             CLRPFM     FILE(REFLIBTST/IMIIPF)
             CLRPFM     FILE(REFLIBTST/IMIJPF)
             CLRPFM     FILE(REFLIBTST/IMILPF)
             CLRPFM     FILE(REFLIBTST/IMIMPF)

             CLRPFM     FILE(REFLIBTST/POPBPF)
             CLRPFM     FILE(REFLIBTST/POPCPF)
             CLRPFM     FILE(REFLIBTST/POPDPF)
             CLRPFM     FILE(REFLIBTST/POPEPF)
             CLRPFM     FILE(REFLIBTST/POPFPF)
             CLRPFM     FILE(REFLIBTST/POPGPF)
             CLRPFM     FILE(REFLIBTST/POPHPF)
             CLRPFM     FILE(REFLIBTST/POPIPF)

             CLRPFM     FILE(REFLIBTST/SOSCPF)
             CLRPFM     FILE(REFLIBTST/SOSDPF)
             CLRPFM     FILE(REFLIBTST/SOSEPF)
             CLRPFM     FILE(REFLIBTST/SOSFPF)
             CLRPFM     FILE(REFLIBTST/SOSGPF)
             CLRPFM     FILE(REFLIBTST/SOSHPF)
             CLRPFM     FILE(REFLIBTST/SOSIPF)
             CLRPFM     FILE(REFLIBTST/SOSJPF)
             CLRPFM     FILE(REFLIBTST/SOSNPF)
             CLRPFM     FILE(REFLIBTST/SOSOPF)

             CRTDUPOBJ  OBJ(ARAFPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ARAFPF@)

             CRTDUPOBJ  OBJ(ARAGPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ARAGPF@)

             CRTDUPOBJ  OBJ(IMIBPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIBPF@)

             CRTDUPOBJ  OBJ(IMICPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMICPF@)

             CRTDUPOBJ  OBJ(IMIDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIDPF@)

             CRTDUPOBJ  OBJ(IMIEPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIEPF@)

             CRTDUPOBJ  OBJ(IMIFPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIFPF@)

             CRTDUPOBJ  OBJ(IMIGPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIGPF@)

             CRTDUPOBJ  OBJ(IMIHPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIHPF@)

             CRTDUPOBJ  OBJ(IMIIPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIIPF@)

             CRTDUPOBJ  OBJ(IMIJPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIJPF@)

             CRTDUPOBJ  OBJ(IMILPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMILPF@)

             CRTDUPOBJ  OBJ(IMIMPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIMPF@)

             CRTDUPOBJ  OBJ(POPBPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPBPF@)

             CRTDUPOBJ  OBJ(POPCPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPCPF@)

             CRTDUPOBJ  OBJ(POPDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPDPF@)

             CRTDUPOBJ  OBJ(POPEPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPEPF@)

             CRTDUPOBJ  OBJ(POPFPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPFPF@)

             CRTDUPOBJ  OBJ(POPGPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPGPF@)

             CRTDUPOBJ  OBJ(POPHPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPHPF@)

             CRTDUPOBJ  OBJ(POPIPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPIPF@)

             CRTDUPOBJ  OBJ(SOSCPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSCPF@)

             CRTDUPOBJ  OBJ(SOSDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSDPF@)

             CRTDUPOBJ  OBJ(SOSEPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSEPF@)

             CRTDUPOBJ  OBJ(SOSFPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSFPF@)

             CRTDUPOBJ  OBJ(SOSGPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSGPF@)

             CRTDUPOBJ  OBJ(SOSHPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSHPF@)

             CRTDUPOBJ  OBJ(SOSIPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSIPF@)

             CRTDUPOBJ  OBJ(SOSJPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSJPF@)

             CRTDUPOBJ  OBJ(SOSNPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSNPF@)

             CRTDUPOBJ  OBJ(SOSOPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSOPF@)


             CALL       DPA0431

             CPYF       FROMFILE(QTEMP/ARAFPF@) +
                          TOFILE(REFLIBTST/ARAFPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/ARAGPF@) +
                          TOFILE(REFLIBTST/ARAGPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMIBPF@) +
                          TOFILE(REFLIBTST/IMIBPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMICPF@) +
                          TOFILE(REFLIBTST/IMICPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMIDPF@) +
                          TOFILE(REFLIBTST/IMIDPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMIEPF@) +
                          TOFILE(REFLIBTST/IMIEPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMIFPF@) +
                          TOFILE(REFLIBTST/IMIFPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMIGPF@) +
                          TOFILE(REFLIBTST/IMIGPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMIHPF@) +
                          TOFILE(REFLIBTST/IMIHPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMIIPF@) +
                          TOFILE(REFLIBTST/IMIIPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMIJPF@) +
                          TOFILE(REFLIBTST/IMIJPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMILPF@) +
                          TOFILE(REFLIBTST/IMILPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/IMIMPF@) +
                          TOFILE(REFLIBTST/IMIMPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/POPBPF@) +
                          TOFILE(REFLIBTST/POPBPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/POPCPF@) +
                          TOFILE(REFLIBTST/POPCPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/POPDPF@) +
                          TOFILE(REFLIBTST/POPDPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/POPEPF@) +
                          TOFILE(REFLIBTST/POPEPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/POPFPF@) +
                          TOFILE(REFLIBTST/POPFPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/POPGPF@) +
                          TOFILE(REFLIBTST/POPGPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/POPHPF@) +
                          TOFILE(REFLIBTST/POPHPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/POPIPF@) +
                          TOFILE(REFLIBTST/POPIPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSCPF@) +
                          TOFILE(REFLIBTST/SOSCPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSDPF@) +
                          TOFILE(REFLIBTST/SOSDPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSEPF@) +
                          TOFILE(REFLIBTST/SOSEPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSFPF@) +
                          TOFILE(REFLIBTST/SOSFPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSGPF@) +
                          TOFILE(REFLIBTST/SOSGPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSHPF@) +
                          TOFILE(REFLIBTST/SOSHPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSIPF@) +
                          TOFILE(REFLIBTST/SOSIPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSJPF@) +
                          TOFILE(REFLIBTST/SOSJPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSNPF@) +
                          TOFILE(REFLIBTST/SOSNPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CPYF       FROMFILE(QTEMP/SOSOPF@) +
                          TOFILE(REFLIBTST/SOSOPF) FROMMBR(*ALL) +
                          MBROPT(*ADD) FMTOPT(*MAP *DROP)

             CLRLIB     LIB(QTEMP)

             ENDPGM
