             PGM
             DCL        VAR(&DYS)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTDEV) TYPE(*CHAR) LEN(10)
             CHGVAR     VAR(&DYS)   VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DTDEV) VALUE(%SST(*LDA 621 10))

             CRTDUPOBJ  OBJ(ARACPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ARACPF *CAT &DYS)

             CRTDUPOBJ  OBJ(ARADPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ARADPF *CAT &DYS)

             CRTDUPOBJ  OBJ(ARAEPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ARAEPF *CAT &DYS)

             CRTDUPOBJ  OBJ(ARAFPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ARAFPF *CAT &DYS)

             CRTDUPOBJ  OBJ(ARAGPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ARAGPF *CAT &DYS)

             CRTDUPOBJ  OBJ(ARAIPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ARAIPF *CAT &DYS)

             CRTDUPOBJ  OBJ(ARAJPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(ARAJPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIBPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIBPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMICPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMICPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIDPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIEPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIEPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIFPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIFPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIGPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIGPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIHPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIHPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIIPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIIPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIJPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIJPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIKPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIKPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMILPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMILPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIMPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIMPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMINPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMINPF *CAT &DYS)

             CRTDUPOBJ  OBJ(IMIUPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(IMIUPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPBPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPBPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPCPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPCPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPDPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPEPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPEPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPFPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPFPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPGPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPGPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPHPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPHPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPIPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPIPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSCPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSCPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSDPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSEPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSEPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSFPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSFPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSGPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSGPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSHPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSHPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSIPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSIPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSJPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSJPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSKPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSKPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSLPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSLPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSNPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSNPF *CAT &DYS)

             CRTDUPOBJ  OBJ(SOSOPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(SOSOPF *CAT &DYS)

             OVRDBF     FILE(ARACPF@) TOFILE(QTEMP/(ARACPF *CAT &DYS))
             OVRDBF     FILE(ARADPF@) TOFILE(QTEMP/(ARADPF *CAT &DYS))
             OVRDBF     FILE(ARAEPF@) TOFILE(QTEMP/(ARAEPF *CAT &DYS))
             OVRDBF     FILE(ARAFPF@) TOFILE(QTEMP/(ARAFPF *CAT &DYS))
             OVRDBF     FILE(ARAGPF@) TOFILE(QTEMP/(ARAGPF *CAT &DYS))
             OVRDBF     FILE(ARAIPF@) TOFILE(QTEMP/(ARAIPF *CAT &DYS))
             OVRDBF     FILE(ARAJPF@) TOFILE(QTEMP/(ARAJPF *CAT &DYS))

             OVRDBF     FILE(IMIBPF@) TOFILE(QTEMP/(IMIBPF *CAT &DYS))
             OVRDBF     FILE(IMICPF@) TOFILE(QTEMP/(IMICPF *CAT &DYS))
             OVRDBF     FILE(IMIDPF@) TOFILE(QTEMP/(IMIDPF *CAT &DYS))
             OVRDBF     FILE(IMIEPF@) TOFILE(QTEMP/(IMIEPF *CAT &DYS))
             OVRDBF     FILE(IMIFPF@) TOFILE(QTEMP/(IMIFPF *CAT &DYS))
             OVRDBF     FILE(IMIGPF@) TOFILE(QTEMP/(IMIGPF *CAT &DYS))
             OVRDBF     FILE(IMIHPF@) TOFILE(QTEMP/(IMIHPF *CAT &DYS))
             OVRDBF     FILE(IMIIPF@) TOFILE(QTEMP/(IMIIPF *CAT &DYS))
             OVRDBF     FILE(IMIJPF@) TOFILE(QTEMP/(IMIJPF *CAT &DYS))
             OVRDBF     FILE(IMIKPF@) TOFILE(QTEMP/(IMIKPF *CAT &DYS))
             OVRDBF     FILE(IMILPF@) TOFILE(QTEMP/(IMILPF *CAT &DYS))
             OVRDBF     FILE(IMIMPF@) TOFILE(QTEMP/(IMIMPF *CAT &DYS))
             OVRDBF     FILE(IMINPF@) TOFILE(QTEMP/(IMINPF *CAT &DYS))
             OVRDBF     FILE(IMIUPF@) TOFILE(QTEMP/(IMIUPF *CAT &DYS))

             OVRDBF     FILE(POPBPF@) TOFILE(QTEMP/(POPBPF *CAT &DYS))
             OVRDBF     FILE(POPCPF@) TOFILE(QTEMP/(POPCPF *CAT &DYS))
             OVRDBF     FILE(POPDPF@) TOFILE(QTEMP/(POPDPF *CAT &DYS))
             OVRDBF     FILE(POPEPF@) TOFILE(QTEMP/(POPEPF *CAT &DYS))
             OVRDBF     FILE(POPFPF@) TOFILE(QTEMP/(POPFPF *CAT &DYS))
             OVRDBF     FILE(POPGPF@) TOFILE(QTEMP/(POPGPF *CAT &DYS))
             OVRDBF     FILE(POPHPF@) TOFILE(QTEMP/(POPHPF *CAT &DYS))
             OVRDBF     FILE(POPIPF@) TOFILE(QTEMP/(POPIPF *CAT &DYS))

             OVRDBF     FILE(SOSCPF@) TOFILE(QTEMP/(SOSCPF *CAT &DYS))
             OVRDBF     FILE(SOSDPF@) TOFILE(QTEMP/(SOSDPF *CAT &DYS))
             OVRDBF     FILE(SOSEPF@) TOFILE(QTEMP/(SOSEPF *CAT &DYS))
             OVRDBF     FILE(SOSFPF@) TOFILE(QTEMP/(SOSFPF *CAT &DYS))
             OVRDBF     FILE(SOSGPF@) TOFILE(QTEMP/(SOSGPF *CAT &DYS))
             OVRDBF     FILE(SOSHPF@) TOFILE(QTEMP/(SOSHPF *CAT &DYS))
             OVRDBF     FILE(SOSIPF@) TOFILE(QTEMP/(SOSIPF *CAT &DYS))
             OVRDBF     FILE(SOSJPF@) TOFILE(QTEMP/(SOSJPF *CAT &DYS))
             OVRDBF     FILE(SOSKPF@) TOFILE(QTEMP/(SOSKPF *CAT &DYS))
             OVRDBF     FILE(SOSLPF@) TOFILE(QTEMP/(SOSLPF *CAT &DYS))
             OVRDBF     FILE(SOSNPF@) TOFILE(QTEMP/(SOSNPF *CAT &DYS))
             OVRDBF     FILE(SOSOPF@) TOFILE(QTEMP/(SOSOPF *CAT &DYS))

             CALL       DPA0421

             INZTAP     DEV(&DTDEV) NEWVOL(&DYS) NEWOWNID(RE +
                          *CAT &DYS) CHECK(*NO) DENSITY(10000)

             SAVOBJ     OBJ(*ALL) LIB(QTEMP) DEV(&DTDEV)

             CLRLIB     LIB(QTEMP)

             RGZPFM     FILE(ARACPF)
             RGZPFM     FILE(ARADPF)
             RGZPFM     FILE(ARAEPF)
             RGZPFM     FILE(ARAFPF)
             RGZPFM     FILE(ARAGPF)
             RGZPFM     FILE(ARAIPF)
             RGZPFM     FILE(ARAJPF)

             RGZPFM     FILE(IMIBPF)
             RGZPFM     FILE(IMICPF)
             RGZPFM     FILE(IMIDPF)
             RGZPFM     FILE(IMIEPF)
             RGZPFM     FILE(IMIFPF)
             RGZPFM     FILE(IMIGPF)
             RGZPFM     FILE(IMIHPF)
             RGZPFM     FILE(IMIIPF)
             RGZPFM     FILE(IMIJPF)
             RGZPFM     FILE(IMIKPF)
             RGZPFM     FILE(IMILPF)
             RGZPFM     FILE(IMIMPF)
             RGZPFM     FILE(IMINPF)
             RGZPFM     FILE(IMIUPF)

             RGZPFM     FILE(POPBPF)
             RGZPFM     FILE(POPCPF)
             RGZPFM     FILE(POPDPF)
             RGZPFM     FILE(POPEPF)
             RGZPFM     FILE(POPFPF)
             RGZPFM     FILE(POPGPF)
             RGZPFM     FILE(POPHPF)
             RGZPFM     FILE(POPIPF)

             RGZPFM     FILE(SOSCPF)
             RGZPFM     FILE(SOSDPF)
             RGZPFM     FILE(SOSEPF)
             RGZPFM     FILE(SOSFPF)
             RGZPFM     FILE(SOSGPF)
             RGZPFM     FILE(SOSHPF)
             RGZPFM     FILE(SOSIPF)
             RGZPFM     FILE(SOSJPF)
             RGZPFM     FILE(SOSKPF)
             RGZPFM     FILE(SOSLPF)
             RGZPFM     FILE(SOSNPF)
             RGZPFM     FILE(SOSOPF)

             ENDPGM
