     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : ANDY                                      */
     /*    CREATE DATE  : 81/07/13                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : DPA003C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :庫存系統                                 */
     /*    REMARK       :送貨單列印                               */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSI03S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSI03E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSI04S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI04E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSI05)  TYPE(*CHAR) LEN(5)
 /*          DCL        VAR(&WSI06)  TYPE(*CHAR) LEN(6)    */
             DCL        VAR(&WSI06)  TYPE(*CHAR) LEN(8)


             CHGVAR     VAR(&DSI03S) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSI03E) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DSI04S) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DSI04E) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DSI05)  VALUE(%SST(*LDA 609 5))
 /*          CHGVAR     VAR(&WSI06)  VALUE(%SST(*LDA 640 6))  */
             CHGVAR     VAR(&WSI06)  VALUE(%SST(*LDA 640 8))


             OVRPRTF    FILE(DPA003P) PAGESIZE(*N 157) CPI(12)
             OVRDBF     FILE(SOSIPF) SHARE(*YES)

             OPNQRYF    FILE((SOSIPF)) OPTION(*ALL) QRYSLT('(SI03 +
                          *EQ %RANGE("' *CAT &DSI03S *CAT '" "' +
                          *CAT &DSI03E *CAT '" )) & (SI04 *EQ +
                          %RANGE("' *CAT &DSI04S *CAT '" "' *CAT +
                          &DSI04E *CAT '")) & (SI05 *EQ "' *CAT +
                          &DSI05 *CAT '") & (SI06 *EQ ' *CAT &WSI06 +
                          *CAT ') & CSI02 *EQ "**" ') KEYFLD((SI01) +
                          (SI02)) MAPFLD((CSI02 '%SST(SI02 1 2)' +
                          *CHAR 2))

             CALL       DPA0031

             CLOF       OPNID(SOSIPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('DPA003P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
