     /**************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250  */
     /*                                                            */
     /*    PROGRAM ID   : DPB002C1                                 */
     /*    PROGRAM NAME : 採購檔年度整檔批次                     */
     /*    AUTHOR       : D910070 JUDY LEE                         */
     /*    CREATE DATE  : 1993.09.11                               */
     /*    UPDATE DATE  :                                          */
     /*    SYSTEM       : 進銷存收                               */
     /**************************************************************/
             PGM
             DCLF       FILE(*LIBL/DPB002D) RCDFMT(DSPD1)
             DCL        VAR(&DYMS)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DYME)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DTDEV)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&DVOL)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&DYS)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMY)    TYPE(*CHAR) LEN(4)

             RTVDTAARA  DTAARA(*LDA (601 6))  RTNVAR(&DYMS)
             RTVDTAARA  DTAARA(*LDA (607 6))  RTNVAR(&DYME)
             RTVDTAARA  DTAARA(*LDA (613 10)) RTNVAR(&DTDEV)
             RTVDTAARA  DTAARA(*LDA (623 6))  RTNVAR(&DVOL)
             RTVDTAARA  DTAARA(*LDA (626 2))  RTNVAR(&DYS)
             RTVDTAARA  DTAARA(*LDA (631 4))  RTNVAR(&DMY)
             CHGVAR     VAR(&DMYS) VALUE(&DMY)
             RTVDTAARA  DTAARA(*LDA (635 4))  RTNVAR(&DMY)
             CHGVAR     VAR(&DMYE) VALUE(&DMY)

             CHGVAR     VAR(&IN28) VALUE('1')
             CHGVAR     VAR(&DFILE) VALUE('ALCOBJ    ')
             SNDF       DEV(*FILE) RCDFMT(DSPD1)

             ALCOBJ     OBJ((POPAPF *FILE *EXCL *FIRST) +
                            (POPBPF *FILE *EXCL *FIRST) +
                            (POPCPF *FILE *EXCL *FIRST) +
                            (POPDPF *FILE *EXCL *FIRST) +
                            (POPEPF *FILE *EXCL *FIRST) +
                            (POPFPF *FILE *EXCL *FIRST) +
                            (POPGPF *FILE *EXCL *FIRST) +
                            (POPHPF *FILE *EXCL *FIRST) +
                            (POPIPF *FILE *EXCL *FIRST) +
                            (POPJPF *FILE *EXCL *FIRST) +
                            (POPNPF *FILE *EXCL *FIRST) )

             MONMSG     MSGID(CPF1002 CPF1040 CPF1085) EXEC(DO)
                        SNDUSRMSG MSG('ＯＢＪ使用中，無法整檔')      +
                        TOMSGQ(*EXT)
             GOTO       CMDLBL(ENDPGM)
             ENDDO

             CHGVAR     VAR(&DFILE) VALUE('CRTDUPOBJ ')
             SNDF       DEV(*FILE) RCDFMT(DSPD1)
             CRTDUPOBJ  OBJ(POPAPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPAPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPBPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPBPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPCPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPCPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPDPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPEPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPEPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPFPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPFPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPGPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPGPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPHPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPHPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPIPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPIPF *CAT &DYS)


             CRTDUPOBJ  OBJ(POPJPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPJPF *CAT &DYS)

             CRTDUPOBJ  OBJ(POPNPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(POPNPF *CAT &DYS)

             CHGVAR     VAR(&DFILE) VALUE('OVRDBF    ')
             SNDF       DEV(*FILE) RCDFMT(DSPD1)

             OVRDBF     FILE(POPAPF@) TOFILE(QTEMP/(POPAPF *CAT &DYS))
             OVRDBF     FILE(POPBPF@) TOFILE(QTEMP/(POPBPF *CAT &DYS))
             OVRDBF     FILE(POPCPF@) TOFILE(QTEMP/(POPCPF *CAT &DYS))
             OVRDBF     FILE(POPDPF@) TOFILE(QTEMP/(POPDPF *CAT &DYS))
             OVRDBF     FILE(POPEPF@) TOFILE(QTEMP/(POPEPF *CAT &DYS))
             OVRDBF     FILE(POPFPF@) TOFILE(QTEMP/(POPFPF *CAT &DYS))
             OVRDBF     FILE(POPGPF@) TOFILE(QTEMP/(POPGPF *CAT &DYS))
             OVRDBF     FILE(POPHPF@) TOFILE(QTEMP/(POPHPF *CAT &DYS))
             OVRDBF     FILE(POPIPF@) TOFILE(QTEMP/(POPIPF *CAT &DYS))
             OVRDBF     FILE(POPJPF@) TOFILE(QTEMP/(POPJPF *CAT &DYS))
             OVRDBF     FILE(POPNPF@) TOFILE(QTEMP/(POPNPF *CAT &DYS))

             CALL       DPB0021

             CHGVAR     VAR(&DFILE) VALUE('SAVOBJ    ')
             SNDF       DEV(*FILE) RCDFMT(DSPD1)
             SAVOBJ     OBJ(*ALL) LIB(QTEMP) DEV(&DTDEV) VOL(&DVOL)

             CHGVAR     VAR(&DFILE) VALUE('CLR QTEMP ')
             SNDF       DEV(*FILE) RCDFMT(DSPD1)
             CLRLIB     LIB(QTEMP)

             CHGVAR     VAR(&DFILE) VALUE('RGZPFM    ')
             SNDF       DEV(*FILE) RCDFMT(DSPD1)

             RGZPFM     FILE(POPAPF)
             RGZPFM     FILE(POPBPF)
             RGZPFM     FILE(POPCPF)
             RGZPFM     FILE(POPDPF)
             RGZPFM     FILE(POPEPF)
             RGZPFM     FILE(POPFPF)
             RGZPFM     FILE(POPGPF)
             RGZPFM     FILE(POPHPF)
             RGZPFM     FILE(POPIPF)
             RGZPFM     FILE(POPJPF)
             RGZPFM     FILE(POPNPF)

             CHGVAR     VAR(&DFILE) VALUE('DLCOBJ    ')
             SNDF       DEV(*FILE) RCDFMT(DSPD1)

             DLCOBJ     OBJ((REFLIB/POPAPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPBPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPCPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPDPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPEPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPFPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPGPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPHPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPIPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPJPF *FILE *EXCL *FIRST) +
                            (REFLIB/POPNPF *FILE *EXCL *FIRST) )
 ENDPGM:     ENDPGM
