     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : ANDY                                      */
     /*    CREATE DATE  : 81/02/13                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : DWPC03C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :主檔                                     */
     /*    REMARK       :客戶簡明表                               */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DME01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DME01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DME07S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME08S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME08E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME15S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DME15E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CMD) TYPE(*CHAR) LEN(7) VALUE('RTOPCB ')
             DCL        VAR(&PCCMD) TYPE(*CHAR) LEN(20)

             CHGVAR     VAR(&DME01S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DME01E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&DME07S) VALUE(%SST(*LDA 611 2))
             CHGVAR     VAR(&DME07E) VALUE(%SST(*LDA 613 2))
             CHGVAR     VAR(&DME15S) VALUE(%SST(*LDA 631 6))
             CHGVAR     VAR(&DME15E) VALUE(%SST(*LDA 641 6))
             CHGVAR     VAR(&DME08S) VALUE(%SST(*LDA 623 2))
             CHGVAR     VAR(&DME08E) VALUE(%SST(*LDA 625 2))
             CHGVAR     VAR(&DSEL) VALUE(%SST(*LDA 651 1))

             OVRDBF     FILE(MTMEPF) SHARE(*YES)

             IF         COND(&DSEL *EQ 'N') THEN(DO)
             OPNQRYF    FILE((MTMEPF)) QRYSLT(' ME01 *EQ %RANGE("' +
                          *CAT &DME01S *CAT '" "' *CAT &DME01E *CAT +
                          '") &  ME07  *EQ %RANGE("' *CAT &DME07S +
                          *CAT '" "' *CAT &DME07E *CAT '") & ME15 +
                          *EQ %RANGE("' *CAT &DME15S *CAT '" "' +
                          *CAT &DME15E *CAT '") & ME20 *NE "I" & +
                          ME08 *EQ %RANGE("' *CAT &DME08S *CAT '" +
                          "' *CAT &DME08E *CAT '") ') KEYFLD((ME01) +
                          (ME02))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((MTMEPF)) QRYSLT(' ME01 *EQ %RANGE("' +
                          *CAT &DME01S *CAT '" "' *CAT &DME01E *CAT +
                          '") &  ME07  *EQ %RANGE("' *CAT &DME07S +
                          *CAT '" "' *CAT &DME07E *CAT '") & ME15 +
                          *EQ %RANGE("' *CAT &DME15S *CAT '" "' +
                          *CAT &DME15E *CAT '") & ME08 *EQ +
                          %RANGE("' *CAT &DME08S *CAT '" "' *CAT +
                          &DME08E *CAT '") ') KEYFLD((ME01) (ME02))
             ENDDO

             CALL       DWPC031

             CLOF       OPNID(MTMEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('DWPC03P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)

             CHGVAR     VAR(&PCCMD) VALUE(&CMD *CAT &P6601I )

             STRPCCMD   PCCMD('CD\AS400') PAUSE(*NO)
             STRPCCMD   PCCMD(&PCCMD) PAUSE(*NO)

             ENDPGM
