             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/DWPCMNUD) RCDFMT(DSPC1)
             OVRMSGF MSGF(QCPFMSG) TOMSGF(PTFLIB/PTMF)
    /*                                                    */
             CALL       PGM(P63)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             SETATNPGM  PGM(*LIBL/ATN01)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')

             IF         COND(&DOPID *EQ '01') THEN(DO)
             CHGVAR VAR(&S0102I) VALUE('DWPC01C')
             ENDDO
             IF         COND(&DOPID *EQ '02') THEN(DO)
             CHGVAR VAR(&S0102I) VALUE('DWPC02C')
             ENDDO
             IF         COND(&DOPID *EQ '03') THEN(DO)
             CHGVAR VAR(&S0102I) VALUE('DWPC03C')
             ENDDO
             IF         COND(&DOPID *EQ '04') THEN(DO)
             CHGVAR VAR(&S0102I) VALUE('DWPC04C')
             ENDDO
             IF         COND(&DOPID *EQ '99') THEN(DO)
             STRPCCMD   PCCMD(DIR)
             GOTO CMDLBL(START)
             ENDDO
             IF         COND(&DOPID *EQ '90') THEN(SIGNOFF)
             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             CALL PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO CMDLBL(START)
   ENDPGM:   ENDPGM
