             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(1)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(1 0)

             DCL        VAR(&DAI01S)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DAI01E)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DYYS)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&DYYE)     TYPE(*CHAR) LEN(2)
             DCL        VAR(&NO)       TYPE(*CHAR) LEN(6)
             DCL        VAR(&MBR)      TYPE(*CHAR) LEN(10)

             RTVJOBA    NBR(&NO)

             CHGVAR     VAR(&MBR)      VALUE('GL' *TCAT &NO)
             CHGVAR     VAR(&DAI01S)   VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DAI01E)   VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&DYYS)     VALUE(%SST(*LDA 509 2))
             CHGVAR     VAR(&DYYE)     VALUE(%SST(*LDA 511 2))

             ADDPFM     FILE(GLWF03)   MBR(&MBR)
             MONMSG     MSGID(CPF7306) EXEC(CLRPFM FILE(GLWF03) +
                          MBR(&MBR))
             ADDPFM     FILE(GLWF04)   MBR(&MBR)
             MONMSG     MSGID(CPF7306) EXEC(CLRPFM FILE(GLWF04) +
                          MBR(&MBR))

             OVRDBF     FILE(GLWF03) MBR(&MBR)
             OVRDBF     FILE(GLWF04) MBR(&MBR)

             OVRDBF     FILE(GLWF09) TOFILE(GLAILF01) SHARE(*YES)
             OPNQRYF    FILE((GLAILF01)) FORMAT(GLWF09) +
                          QRYSLT(' AI01  *EQ %RANGE("' *CAT &DAI01S +
                          *CAT '" "' *CAT &DAI01E *CAT '") & AI02C +
                          *EQ %RANGE("' *CAT &DYYS *CAT '" "' *CAT +
                          &DYYE *CAT '") & ((AI03  *LE "39999999") +
                          *OR (AI03  *GE "90000000")) ') +
                          KEYFLD((AI03) (AI02)) MAPFLD((AI02C AI02 +
                          *CHAR 2))

             OVRPRTF    FILE(GLR280P) TOFILE(GLR280P) PAGESIZE(*N +
                          198) CPI(15)
             CALL       GLR283
             CLOF       OPNID(GLAILF01)
             DLTOVR     FILE(GLWF03)
             DLTOVR     FILE(GLWF04)
             DLTOVR     FILE(GLWF09)
             RMVM       FILE(GLWF03) MBR(&MBR)
             RMVM       FILE(GLWF04) MBR(&MBR)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (128 1)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('GLR280P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
