             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&JOB)   TYPE(*CHAR) LEN(10)

             DCL        VAR(&MSGDTA)   TYPE(*CHAR) LEN(120)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             CHGVAR     VAR(%SST(*LDA 162   1)) VALUE('2')
             CHGVAR     VAR(%SST(*LDA 125   3)) VALUE('001')
             CHGVAR     VAR(%SST(*LDA 598   2)) VALUE('00')
             RTVJOBA    JOB(&JOB)

 START:      CALL       PGM(IMA009) PARM(&IN03 &IN14 &IN97 &IN98)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             IF         COND(&$EVR *EQ '1') THEN(DO)
                        CALL       PGM(IMA009C1)
                        CHGVAR     VAR(&IN98)  VALUE('1')
             ENDDO
             ELSE       CMD(DO)
             SBMJOB     JOB(IMA009C1) RQSDTA('CALL IMA009C1')
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO

             ENDDO

 ERR:        GOTO       CMDLBL(START)
             ENDPGM
