             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&DATES) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEE) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 613 6))
             CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 619 6))

             OVRPRTF    FILE(IMR064P) PAGESIZE(*N 158) CPI(12) +
                        USRDTA('¤º³°«OÀI')
             CPYF       FROMFILE(REWF56) TOFILE(QTEMP/REWF56) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF56))
             OVRDBF     FILE(REWF56) TOFILE(QTEMP/REWF56) SHARE(*YES)

             OVRDBF     FILE(SOSEPF) SHARE(*YES)

             OPNQRYF    FILE((SOSEPF)) QRYSLT('(MSE06 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & (SE36 *NE "T" ) & (SE30 *ne " " )') +
                          KEYFLD(*FILE) MAPFLD((MSE06 SE06 *CHAR 6))

             CALL       IMR0641
             CALL       IMR0642
             CHGVAR     VAR(&P6601I) VALUE('IMR064P')

             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
