             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DII02S) TYPE(*CHAR) LEN(12)
             DCL        VAR(&DII02E) TYPE(*CHAR) LEN(12)
             DCL        VAR(&DII03S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DII03E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DII04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DII04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DATES) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEE) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&DII02S) VALUE(%SST(*LDA 605 12))
             CHGVAR     VAR(&DII02E) VALUE(%SST(*LDA 617 12))
             CHGVAR     VAR(&DII03S) VALUE(%SST(*LDA 630 5))
             CHGVAR     VAR(&DII03E) VALUE(%SST(*LDA 635 5))
             CHGVAR     VAR(&DII04S) VALUE(%SST(*LDA 640 5))
             CHGVAR     VAR(&DII04E) VALUE(%SST(*LDA 645 5))
             CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 662 6 ))
             CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 668 6 ))

             OVRPRTF    FILE(IMR077P) OVRFLW(62) USRDTA('½Õ¼·³æ¡@')

             OVRDBF     FILE(IMIIPF) SHARE(*YES)

             OPNQRYF    FILE((IMIIPF)) QRYSLT(' II02 *EQ %RANGE("' +
                          *CAT &DII02S *CAT '" "' *CAT &DII02E *CAT +
                          '") & II03 *EQ %RANGE("' *CAT &DII03S +
                          *CAT '" "' *CAT &DII03E *CAT '") & II04 +
                          *EQ %RANGE("' *CAT &DII04S *CAT '" "' +
                          *CAT &DII04E *CAT '") & MII05 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '")') KEYFLD(*FILE) +
                          MAPFLD((MII05 II05 *CHAR 8))
/*M001D                   %RANGE("' *CAT &DATES *CAT '" "' *CAT +
                          &DATEE *CAT '")') KEYFLD(*FILE) +
                          MAPFLD((MII05 II05 *CHAR 6))          */

             CALL       IMR0771

             CLOF       OPNID(IMIIPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('IMR077P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
