             PGM

             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PSC11) TYPE(*CHAR) LEN(5)
             DCL        VAR(&WSC08) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)

             CHGVAR     VAR(&DSEL) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&PSC11) VALUE(%SST(*LDA 609 5))
             CHGVAR     VAR(&WSC08) VALUE(%SST(*LDA 640 6))
             OVRDBF     FILE(SOSCPF) SHARE(*YES)

             OPNQRYF    FILE((SOSCPF)) OPTION(*ALL) QRYSLT(' SC03 +
                          *NE "S2" & SC03 *NE "S3"  & SC03 *NE "S7" +
                          & SC11 *EQ "' *CAT &PSC11 *CAT '" & SC08 +
                          *EQ ' *CAT &WSC08 *CAT ' & SC29 *EQ " " & +
                          SC38 *EQ " "  & SC30 *EQ " "  & (SC13 *EQ +
                          "C" | SC13 *EQ " ")') KEYFLD((SC02))

             OVRDBF     FILE(SOSELF) SHARE(*YES)
             OPNQRYF    FILE((SOSELF)) OPTION(*ALL) QRYSLT(' (SE03 +
                          *EQ "D2" | SE03 *EQ "D3" | SE03 *EQ "D5" +
                          | SE03 *EQ "D6" | SE03 *EQ "D8" ) & SE07 +
                          *EQ "' *CAT &PSC11 *CAT '" & SE25 *EQ " " +
                          & SE36 *EQ " " & (SE09 *EQ "C" | SE09 *EQ +
                          " ")') KEYFLD((SE02))

                        CALL       PGM(IMR0612)

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSELF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOSELF)

             ENDPGM
