     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 04/16/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : IMR073C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :庫存系統                                 */
     /*    REMARK       :普銷送貨揀料彙總表                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSEL)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSE07S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSE07E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&YSE06)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSE39)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN20)   TYPE(*CHAR) LEN(1)


             CPYF       FROMFILE(REWF68) TOFILE(QTEMP/REWF68) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF68))
             OVRDBF     FILE(REWF68) TOFILE(QTEMP/REWF68) SHARE(*YES)
     /*-------------------------------------------------------------*/

             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSE07S) VALUE(%SST(*LDA 609 5))
             CHGVAR     VAR(&DSE07E) VALUE(%SST(*LDA 614 5))
             CHGVAR     VAR(&YSE06)  VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&YSE39)  VALUE(%SST(*LDA 633 6))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))

             OVRPRTF    FILE(IMR073P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('普銷撿料')
             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OVRDBF     FILE(SOSCPF) SHARE(*YES)

             IF         COND(&IN20 = '1') THEN(DO)

             OPNQRYF    FILE((SOSEPF)) QRYSLT(' SE07 *EQ %RANGE("' +
                          *CAT &DSE07S *CAT '" "' *CAT &DSE07E *CAT +
                          '")  &  SE06 *EQ ' *CAT &YSE06 *CAT ' & +
                          SE07 *NE SE26 & SE07A *EQ "V" ') +
                          KEYFLD(*FILE) MAPFLD((SE07A '%SST(SE07 1 +
                          1)' *CHAR 1))

             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC11 *EQ %RANGE("' +
                          *CAT &DSE07S *CAT '" "' *CAT &DSE07E *CAT +
                          '")  &  SC08 *EQ ' *CAT &YSE06 *CAT ' & +
                          SC13 *NE "V" & SC03 *EQ "S1" & SC11A *EQ +
                          "V" ') KEYFLD(*FILE) MAPFLD((SC11A +
                          '%SST(SC11 1 1)' *CHAR 1))
             ENDDO
             ELSE       CMD(DO)

             OPNQRYF    FILE((SOSEPF)) QRYSLT(' SE07 *EQ %RANGE("' +
                          *CAT &DSE07S *CAT '" "' *CAT &DSE07E *CAT +
                          '")  &  SE39 *EQ ' *CAT &YSE39 *CAT ' & +
                          SE07 *NE SE26 & SE07A *EQ "V" ') +
                          KEYFLD(*FILE) MAPFLD((SE07A '%SST(SE07 1 +
                          1)' *CHAR 1))

             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC11 *EQ %RANGE("' +
                          *CAT &DSE07S *CAT '" "' *CAT &DSE07E *CAT +
                          '")  &  SC07 *EQ ' *CAT &YSE39 *CAT ' & +
                          SC13 *NE "V" & SC03 *EQ "S1" & SC11A *EQ +
                          "V" ') KEYFLD(*FILE) MAPFLD((SC11A +
                          '%SST(SC11 1 1)' *CHAR 1))
             ENDDO

             CALL       IMR0731
             CALL       IMR0732

             CLOF       OPNID(SOSEPF)
             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('IMR073P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
