     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/25                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : IMR041C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :庫存系統                                 */
     /*    REMARK       :送貨揀料彙總表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSE27S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSE27E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSE28S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSE28E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTE01S) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DTE01E) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DSE07)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&YSE06)  TYPE(*CHAR) LEN(6)


     /***** ADD MEMBER --> REWF09                               *****/
     /*      DCL        VAR(&NO)     TYPE(*CHAR) LEN(6)             */
     /*      DCL        VAR(&MBR)    TYPE(*CHAR) LEN(10)            */
     /*      RTVJOBA    NBR(&NO)                                    */
     /*      CHGVAR     VAR(&MBR)    VALUE('IM' *TCAT &NO)          */

     /*      ADDPFM     FILE(REWF09) MBR(&MBR)                      */
     /*      MONMSG     MSGID(CPF7306) EXEC(CLRPFM FILE(REWF09) +   */
     /*                   MBR(&MBR))                                */

     /*      OVRDBF     FILE(REWF09) MBR(&MBR)                      */
     /*-------------------------------------------------------------*/

             CHGVAR     VAR(&DSE27S) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSE27E) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DSE28S) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DSE28E) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DSE07)  VALUE(%SST(*LDA 609 5))
             CHGVAR     VAR(&YSE06)  VALUE(%SST(*LDA 640 6))

   /*        CALL       SOA008C    */

             OVRPRTF    FILE(IMR041P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('送撿料總')
             OVRDBF     FILE(REWF09) TOFILE(SOSEPF) SHARE(*YES)


             OPNQRYF    FILE((SOSEPF) (SOSFPF)) FORMAT(REWF09) +
                          QRYSLT('(SE27 *EQ %RANGE("' *CAT &DSE27S +
                          *CAT '" "' *CAT &DSE27E *CAT '" )) & +
                          (SE28 *EQ %RANGE("' *CAT &DSE28S *CAT '" +
                          "' *CAT &DSE28E *CAT '" )) & (SE07 *EQ "' +
                          *CAT &DSE07 *CAT '") & (SE06 *EQ ' *CAT +
                          &YSE06 *CAT ') & (SE09 *EQ "C" | SE09 *EQ +
                          " ") & (SE22 *EQ " ") & (SE07 *NE SE26) & +
                          (SE25 *NE "V")') KEYFLD((SF031) (SF03) +
                          (SF02)) JFLD((SOSEPF/SE02 SOSFPF/SF02)) +
                          MAPFLD((SF031 '%SST(SF03 1 2)'))

             CALL       IMR0411

             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(REWF09)
             DLTOVR     FILE(IMR041P)

     /***** CLR MEMBER --> REWF09                               *****/
     /*      RMVM       FILE(REWF09) MBR(&MBR)                      */


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('IMR041P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
