     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/27                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : IMR046C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :庫存系統                                 */
     /*    REMARK       :客戶送貨明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSE27S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSE27E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSE28S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSE28E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSE07S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSE07E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSE04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSE04E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSE32S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSE32E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSE21S) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&YSE21E) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&PGMID)  TYPE(*CHAR) LEN(10)

             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 677 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 678 1))
             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DSE27S) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSE27E) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DSE28S) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DSE28E) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DSE07S) VALUE(%SST(*LDA 609 5))
             CHGVAR     VAR(&DSE07E) VALUE(%SST(*LDA 614 5))
             CHGVAR     VAR(&DSE04S) VALUE(%SST(*LDA 619 9))
             CHGVAR     VAR(&DSE04E) VALUE(%SST(*LDA 628 9))
             CHGVAR     VAR(&YSE21S) VALUE(%SST(*LDA 650 8)) /*M001M*/
             CHGVAR     VAR(&YSE21E) VALUE(%SST(*LDA 658 8)) /*M001M*/
             CHGVAR     VAR(&DSE32S) VALUE(%SST(*LDA 691 6))
             CHGVAR     VAR(&DSE32E) VALUE(%SST(*LDA 701 6))


             OVRDBF     FILE(SOSEPF)  SHARE(*YES)

             IF         COND(&DSEL = 'A')  THEN(DO)

             OVRPRTF    FILE(IMR046AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客送貨明')
             OPNQRYF    FILE((SOSEPF)) QRYSLT('(SE012 *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '")) & (SE27 *EQ %RANGE("' *CAT &DSE27S +
                          *CAT '" "' *CAT &DSE27E *CAT '")) & (SE28 +
                          *EQ %RANGE("' *CAT &DSE28S *CAT '" "' +
                          *CAT &DSE28E *CAT '")) & (SE07 *EQ +
                          %RANGE("' *CAT &DSE07S *CAT '" "' *CAT +
                          &DSE07E *CAT '")) & (SE32 *EQ %RANGE("' +
                          *CAT &DSE32S *CAT '" "' *CAT &DSE32E *CAT +
                          '")) & (SE21 *EQ %RANGE(' *CAT &YSE21S +
                          *CAT ' ' *CAT &YSE21E *CAT ')) & (SE041 +
                          *EQ %RANGE("' *CAT &DSE04S *CAT '" "' +
                          *CAT &DSE04E *CAT '")) & SE031 *EQ +
                          %RANGE("1" "9")') KEYFLD((SE21) (SE04) +
                          (SE05) (SE02)) MAPFLD((SE041 'SE04 || +
                          SE05') (SE031 '%SST(SE03 2 1)' *CHAR 1) +
                          (SE012 '%SST(SE01 2 1)' *CHAR 1))
             CALL       IMR0461
             CHGVAR     VAR(&PGMID) VALUE('IMR046AP')
             ENDDO

             IF         COND(&DSEL = 'B')  THEN(DO)

             OVRPRTF    FILE(IMR046BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客送貨明')

             OPNQRYF    FILE((SOSEPF)) QRYSLT('(SE012 *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '")) & (SE27 *EQ %RANGE("' *CAT &DSE27S +
                          *CAT '" "' *CAT &DSE27E *CAT '")) & (SE28 +
                          *EQ %RANGE("' *CAT &DSE28S *CAT '" "' +
                          *CAT &DSE28E *CAT '")) & (SE07 *EQ +
                          %RANGE("' *CAT &DSE07S *CAT '" "' *CAT +
                          &DSE07E *CAT '")) & (SE32 *EQ %RANGE("' +
                          *CAT &DSE32S *CAT '" "' *CAT &DSE32E *CAT +
                          '")) & (SE24 *EQ %RANGE(' *CAT &YSE21S +
                          *CAT ' ' *CAT &YSE21E *CAT ')) & (SE041 +
                          *EQ %RANGE("' *CAT &DSE04S *CAT '" "' +
                          *CAT &DSE04E *CAT '")) & SE031 *EQ +
                          %RANGE("1" "9")') KEYFLD((SE24) (SE04) +
                          (SE05) (SE02)) MAPFLD((SE041 'SE04 || +
                          SE05') (SE031 '%SST(SE03 2 1)' *CHAR 1) +
                          (SE012 '%SST(SE01 2 1)' *CHAR 1))
             CALL       IMR0462
             CHGVAR     VAR(&PGMID) VALUE('IMR046BP')
             ENDDO


             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE(&PGMID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
