             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DIN01)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DIN04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DIN04E) TYPE(*CHAR) LEN(9)
 /*M001M     DCL        VAR(&WIN02)  TYPE(*CHAR) LEN(4) */
 /*M001M     DCL        VAR(&WIN02S)  TYPE(*CHAR) LEN(6) */
 /*M001M     DCL        VAR(&WIN02E)  TYPE(*CHAR) LEN(6) */
 /*M001M*/   DCL        VAR(&WIN02)  TYPE(*CHAR) LEN(6)
 /*M001M*/   DCL        VAR(&WIN02S)  TYPE(*CHAR) LEN(8)
 /*M001M*/   DCL        VAR(&WIN02E)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&DOPT)   TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DIN01)  VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DIN04S) VALUE(%SST(*LDA 608 9))
             CHGVAR     VAR(&DIN04E) VALUE(%SST(*LDA 617 9))
 /*M001M     CHGVAR     VAR(&WIN02)  VALUE(%SST(*LDA 630 4)) */
 /*M001M     CHGVAR     VAR(&WIN02S) VALUE(%SST(*LDA 630 6)) */
 /*M001M     CHGVAR     VAR(&WIN02E) VALUE(%SST(*LDA 640 6)) */
 /*M001M*/   CHGVAR     VAR(&WIN02)  VALUE(%SST(*LDA 640 6))
 /*M001M*/   CHGVAR     VAR(&WIN02S) VALUE(%SST(*LDA 640 8))
 /*M001M*/   CHGVAR     VAR(&WIN02E) VALUE(%SST(*LDA 650 8))

             CPYF       FROMFILE(REWFB2) TOFILE(QTEMP/REWFB2) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFB2))
             OVRDBF     FILE(REWFB2) TOFILE(QTEMP/REWFB2) SHARE(*YES)

             OVRPRTF    FILE(IMR078P) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('²¾°Ê¦¨¥»')


             OVRDBF     FILE(IMIBPF) SHARE(*YES)
             OPNQRYF    FILE((IMIBPF)) QRYSLT('IB02L *EQ "' *CAT   +
                          &DIN01 *CAT '" &  IB01 *EQ %RANGE("' +
                          *CAT &DIN04S *CAT '" "' *CAT &DIN04E *CAT +
                          '") & IB04 *EQ %RANGE(' *CAT &WIN02S *CAT +
                          ' ' *CAT &WIN02E *CAT ') ') KEYFLD(*FILE) +
                          MAPFLD((IB02L '%SST(IB02 1 1)' *CHAR 1))

             OVRDBF     FILE(IMIUPF) SHARE(*YES)
             OPNQRYF    FILE((IMIUPF)) QRYSLT('IU01 *EQ "' *CAT +
                          &DIN01 *CAT '" & IU05 *EQ %RANGE("' *CAT +
                          &DIN04S *CAT '" "' *CAT &DIN04E *CAT '") +
                          & IU04 *EQ %RANGE(' *CAT &WIN02S *CAT ' ' +
                          *CAT &WIN02E *CAT ') ') KEYFLD(*FILE)

             OVRDBF     FILE(IMIEPF) SHARE(*YES)
             OPNQRYF    FILE((IMIEPF)) QRYSLT('IE01L *EQ "' *CAT +
                          &DIN01 *CAT '"                           +
                          & IE05 *EQ %RANGE(' *CAT &WIN02S *CAT ' ' +
                          *CAT &WIN02E *CAT ') ') KEYFLD(*FILE) +
                          MAPFLD((IE01L '%SST(IE01 1 1)' *CHAR 1))

             OVRDBF     FILE(POPDPF) SHARE(*YES)
             OPNQRYF    FILE((POPDPF)) QRYSLT('PD01L *EQ "' *CAT +
                          &DIN01 *CAT '"                           +
                          & PD04 *EQ %RANGE(' *CAT &WIN02S *CAT ' ' +
                          *CAT &WIN02E *CAT ') ') KEYFLD(*FILE) +
                          MAPFLD((PD01L '%SST(PD01 1 1)' *CHAR 1))

             OVRDBF     FILE(POPFPF) SHARE(*YES)
             OPNQRYF    FILE((POPFPF)) QRYSLT('PF01L *EQ "' *CAT +
                          &DIN01 *CAT '" & PF11 *EQ %RANGE(' *CAT +
                          &WIN02S *CAT ' ' *CAT &WIN02E *CAT ') ') +
                          KEYFLD(*FILE) MAPFLD((PF01L '%SST(PF01 1 +
                          1)' *CHAR 1))

             OVRDBF     FILE(POPHPF) SHARE(*YES)
             OPNQRYF    FILE((POPHPF)) QRYSLT('PH01L *EQ "' *CAT +
                          &DIN01 *CAT '"                           +
                          & PH04 *EQ %RANGE(' *CAT &WIN02S *CAT ' ' +
                          *CAT &WIN02E *CAT ') ') KEYFLD(*FILE) +
                          MAPFLD((PH01L '%SST(PH01 1 1)' *CHAR 1))

             OVRDBF     FILE(IMIGPF) SHARE(*YES)
             OPNQRYF    FILE((IMIGPF)) QRYSLT('IG01L *EQ "' *CAT +
                          &DIN01 *CAT '" & IG05 *EQ %RANGE(' *CAT +
                          &WIN02S *CAT ' ' *CAT &WIN02E *CAT ') ') +
                          KEYFLD(*FILE) MAPFLD((IG01L '%SST(IG01 1 +
                          1)' *CHAR 1))

             OVRDBF     FILE(IMIMPF) SHARE(*YES)
             OPNQRYF    FILE((IMIMPF)) QRYSLT('IM01L *EQ "' *CAT +
                          &DIN01 *CAT '" & IM08 *EQ %RANGE(' *CAT +
                          &WIN02S *CAT ' ' *CAT &WIN02E *CAT ') ') +
                          KEYFLD(*FILE) MAPFLD((IM01L '%SST(IM01 1 +
                          1)' *CHAR 1))

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC39 *EQ %RANGE(' +
                          *CAT &WIN02S *CAT ' ' *CAT &WIN02E *CAT +
                          ') & (SC03 *EQ "S1" *OR SC03 *EQ "S2" *OR +
                          SC03 *EQ "S3" *OR SC03 *EQ "SA" *OR SC03 +
                          *EQ "SB" *OR SC03 *EQ "SC" *OR SC03 *EQ +
                          "S4" *OR SC03 *EQ "SD")') KEYFLD(*FILE)

             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE24 *EQ %RANGE(' +
                          *CAT &WIN02S *CAT ' ' *CAT &WIN02E *CAT +
                          ') & (SE03 *EQ "D8" *OR SE03 *EQ "DH")') +
                          KEYFLD(*FILE)

             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG26 *EQ %RANGE(' +
                          *CAT &WIN02S *CAT ' ' *CAT &WIN02E *CAT +
                          ')') KEYFLD(*FILE)

             OVRDBF     FILE(SOSNPF) SHARE(*YES)
             OPNQRYF    FILE((SOSNPF)) QRYSLT('SN06 *EQ %RANGE(' +
                          *CAT &WIN02S *CAT ' ' *CAT &WIN02E *CAT +
                          ') *AND (SN02L *EQ "R3" *OR SN02L *EQ +
                          "RC")') KEYFLD(*FILE) MAPFLD((SN02L +
                          '%SST(SN02 3 2)' *CHAR 2))

             CALL       IMR0781
             OPNQRYF    FILE((REWFB2)) KEYFLD((WFB201) (WFB202) +
                          (WFB209) (WFB203))
             CALL       IMR0782

             CHGVAR     VAR(&P6601I) VALUE('IMR078P')

             CLOF       OPNID(IMIBPF)
             CLOF       OPNID(IMIUPF)
             CLOF       OPNID(POPDPF)
             CLOF       OPNID(POPFPF)
             CLOF       OPNID(POPHPF)
             CLOF       OPNID(IMIGPF)
             CLOF       OPNID(IMIMPF)
             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             CLOF       OPNID(SOSGPF)
             CLOF       OPNID(SOSNPF)
             CLOF       OPNID(IMIEPF)
             CLOF       OPNID(REWFB2)
             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
