     /***************************************************************/
     /*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1118  PHILIP                             */
     /*    CREATE DATE  : 81/04/27                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : IMR045C1                                  */
     /*    SYSTEM       :繷皑蹲狥                               */
     /*    SUBSYSTEM    :畐╰参                                 */
     /*    REMARK       :筿参祇布                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSI01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSEL)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSI05)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&WSI06)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&PNO) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&DSI02S)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSI02E)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&NBR) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DSI01)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DSI05)  VALUE(%SST(*LDA 609 5))
             CHGVAR     VAR(&WSI06)  VALUE(%SST(*LDA 638 8)) /*M001M*/
             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 637 1))
             CHGVAR     VAR(&PNO)    VALUE(%SST(*LDA 646 2)) /* M001M*/
             CHGVAR     VAR(&DSI02S)  VALUE(%SST(*LDA 627 10))
             CHGVAR     VAR(&DSI02E)  VALUE(%SST(*LDA 651 10))

             IF         COND(&DSEL = 'B') THEN(DO)
             RTVJOBA    JOB(&JOB) USER(&USR) NBR(&NBR)
             CHGSPLFA   FILE(IMR045P) JOB(&NBR/&USR/&JOB) +
                          SPLNBR(*LAST) PAGERANGE(&PNO *END)
             MONMSG     MSGID(CPF3309) EXEC(GOTO CMDLBL(ENDSR))
             RLSSPLF    FILE(IMR045P) JOB(&NBR/&USR/&JOB) SPLNBR(*LAST)
             GOTO ENDSR
             ENDDO

             OVRPRTF    FILE(IMR045P) PAGESIZE(42 198) LPI(6) +
                          CPI(15) OVRFLW(42)  +
                          USRDTA('参祇布')
             OVRDBF     FILE(SOSIPF) SHARE(*YES)


             IF         COND(&DSEL *EQ 'A') THEN(DO)

             OPNQRYF    FILE((SOSIPF)) OPTION(*ALL) QRYSLT('(SI01 +
                          *EQ ("' *CAT &DSI01 *CAT '")) & (SI05 *EQ +
                          "' *CAT &DSI05 *CAT '") & (SI06 *EQ ' +
                          *CAT &WSI06 *CAT ') & (SI33=0) & (PSI02 +
                          *NE "**") & (SI16 *EQ "N") & (PSI10 *GE +
                          "0" & PSI10 *LE "9" & PSI10 *NE "3") & +
                          SI18 *EQ " " & SI34 *NE "Y" ') +
                          KEYFLD((SI02)) MAPFLD((PSI02 '%SST(SI02 1 +
                          2)') (PSI10 '%SST(SI10 4 1)'))
             ENDDO

             IF         COND(&DSEL *EQ 'C') THEN(DO)

             OPNQRYF    FILE((SOSIPF)) OPTION(*ALL) QRYSLT('(SI01 +
                          *EQ "' *CAT &DSI01 *CAT '") & (SI05 *EQ +
                          "' *CAT &DSI05 *CAT '") & (SI06 *EQ (' +
                          *CAT &WSI06 *CAT ') & (SI02 *EQ +
                          %RANGE("' *CAT &DSI02S *CAT '" "' *CAT +
                          &DSI02E *CAT '")) & (PSI02 *NE "**") & +
                          (SI16 *EQ "N") & (PSI10 *GE "0" & PSI10 +
                          *LE "9" & PSI10 *NE "3") & SI18 *EQ " " & +
                          SI34 *NE "Y")') KEYFLD((SI02)) +
                          MAPFLD((PSI02 '%SST(SI02 1 2)') (PSI10 +
                          '%SST(SI10 4 1)'))
             ENDDO


             CALL       IMR0451

             CLOF       OPNID(SOSIPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('IMR045P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


ENDSR:       ENDPGM
