             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

             DCL        VAR(&DIN01)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DIN04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DIN04E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&WIN02)  TYPE(*CHAR) LEN(4)
             DCL        VAR(&WIN02S)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&WIN02E)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&DPFMT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DOPT)   TYPE(*CHAR) LEN(1)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&DIN01)  VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DIN04S) VALUE(%SST(*LDA 608 9))
             CHGVAR     VAR(&DIN04E) VALUE(%SST(*LDA 617 9))
             CHGVAR     VAR(&WIN02)  VALUE(%SST(*LDA 630 4))
             CHGVAR     VAR(&WIN02S) VALUE(%SST(*LDA 630 6))
             CHGVAR     VAR(&WIN02E) VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&DPFMT)  VALUE(%SST(*LDA 650 1))

             CPYF       FROMFILE(REWFD8) TOFILE(QTEMP/REWFD8) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFD8))
             OVRDBF     FILE(REWFD8) TOFILE(QTEMP/REWFD8) SHARE(*YES)

             OVRPRTF    FILE(IMR080AP) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('¦s²Ó±b¢Ï')
             OVRPRTF    FILE(IMR080BP) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('¦s²Ó±b¢Ð')

             OVRDBF     FILE(IMIBPF) SHARE(*YES)
             OPNQRYF    FILE((IMIBPF)) QRYSLT('IB02L *EQ "' *CAT   +
                          &DIN01 *CAT '" &  IB01 *EQ %RANGE("' +
                          *CAT &DIN04S *CAT '" "' *CAT &DIN04E *CAT +
                          '") & IB04 *EQ %RANGE(' *CAT &YMD8S  *CAT +
                          ' ' *CAT &YMD8E  *CAT ') ') KEYFLD(*FILE) +
                          MAPFLD((IB02L '%SST(IB02 1 1)' *CHAR 1))
/*M001D                   '") & IB04 *EQ %RANGE(' *CAT &WIN02S *CAT +
                        ' ' *CAT &WIN02E *CAT ') ') KEYFLD(*FILE) +  */

             OVRDBF     FILE(IMIUPF) SHARE(*YES)
             OPNQRYF    FILE((IMIUPF)) QRYSLT('IU01 *EQ "' *CAT +
                          &DIN01 *CAT '" & IU05 *EQ %RANGE("' *CAT +
                          &DIN04S *CAT '" "' *CAT &DIN04E *CAT '") +
                          & IU04 *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' +
                          *CAT &YMD8E  *CAT ') ') KEYFLD(*FILE)
/*M001D                   & IU04 *EQ %RANGE(' *CAT &WIN02S *CAT ' ' +
                          *CAT &WIN02E *CAT ') ') KEYFLD(*FILE)  */

             OVRDBF     FILE(IMIEPF) SHARE(*YES)
             OPNQRYF    FILE((IMIEPF)) QRYSLT('IE01L *EQ "' *CAT +
                          &DIN01 *CAT '"                           +
                          & IE05 *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' +
                          *CAT &YMD8E  *CAT ') ') KEYFLD(*FILE) +
                          MAPFLD((IE01L '%SST(IE01 1 1)' *CHAR 1))
/*M001D                   & IE05 *EQ %RANGE(' *CAT &WIN02S *CAT ' ' +
                          *CAT &WIN02E *CAT ') ') KEYFLD(*FILE) +  */

             OVRDBF     FILE(POPDPF) SHARE(*YES)
             OPNQRYF    FILE((POPDPF)) QRYSLT('PD01L *EQ "' *CAT +
                          &DIN01 *CAT '"                           +
                          & PD04 *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' +
                          *CAT &YMD8E  *CAT ') ') KEYFLD(*FILE) +
                          MAPFLD((PD01L '%SST(PD01 1 1)' *CHAR 1))
/*M001D                   & PD04 *EQ %RANGE(' *CAT &WIN02S *CAT ' ' +
                          *CAT &WIN02E *CAT ') ') KEYFLD(*FILE) +  */

             OVRDBF     FILE(POPFPF) SHARE(*YES)
             OPNQRYF    FILE((POPFPF)) QRYSLT('PF01L *EQ "' *CAT +
                          &DIN01 *CAT '" & PF11 *EQ %RANGE(' *CAT +
                          &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT ') ') +
                          KEYFLD(*FILE) MAPFLD((PF01L '%SST(PF01 1 +
                          1)' *CHAR 1))
/*M001D                   &WIN02S *CAT ' ' *CAT &WIN02E *CAT ') ') + */

             OVRDBF     FILE(POPHPF) SHARE(*YES)
             OPNQRYF    FILE((POPHPF)) QRYSLT('PH01L *EQ "' *CAT +
                          &DIN01 *CAT '"                           +
                          & PH04 *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' +
                          *CAT &YMD8E  *CAT ') ') KEYFLD(*FILE) +
                          MAPFLD((PH01L '%SST(PH01 1 1)' *CHAR 1))
/*M001D                   & PH04 *EQ %RANGE(' *CAT &WIN02S *CAT ' ' +
                          *CAT &WIN02E *CAT ') ') KEYFLD(*FILE) +  */

             OVRDBF     FILE(IMIGPF) SHARE(*YES)
             OPNQRYF    FILE((IMIGPF)) QRYSLT('IG01L *EQ "' *CAT +
                          &DIN01 *CAT '" & IG05 *EQ %RANGE(' *CAT +
                          &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT ') ') +
                          KEYFLD(*FILE) MAPFLD((IG01L '%SST(IG01 1 +
                          1)' *CHAR 1))
/*M001D                   &WIN02S *CAT ' ' *CAT &WIN02E *CAT ') ') + */

             OVRDBF     FILE(IMIMPF) SHARE(*YES)
             OPNQRYF    FILE((IMIMPF)) QRYSLT('IM01L *EQ "' *CAT +
                          &DIN01 *CAT '" & IM08 *EQ %RANGE(' *CAT +
                          &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT ') ') +
                          KEYFLD(*FILE) MAPFLD((IM01L '%SST(IM01 1 +
                          1)' *CHAR 1))
/*M001D                   &WIN02S *CAT ' ' *CAT &WIN02E *CAT ') ') + */

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC39 *EQ %RANGE(' +
                          *CAT &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT +
                          ') & (SC03 *EQ "S1" *OR SC03 *EQ "S2" *OR +
                          SC03 *EQ "S3" *OR SC03 *EQ "SA" *OR SC03 +
                          *EQ "SB" *OR SC03 *EQ "SC" *OR SC03 *EQ +
                          "S4" *OR SC03 *EQ "SD")') KEYFLD(*FILE)
/*M001D                   *CAT &WIN02S *CAT ' ' *CAT &WIN02E *CAT + */

             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE24 *EQ %RANGE(' +
                          *CAT &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT +
                          ') & (SE03 *EQ "D8" *OR SE03 *EQ "DH")') +
                          KEYFLD(*FILE)
/*M001D                   *CAT &WIN02S *CAT ' ' *CAT &WIN02E *CAT + */

             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG26 *EQ %RANGE(' +
                          *CAT &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT +
                          ')') KEYFLD(*FILE)
/*M001D                   *CAT &WIN02S *CAT ' ' *CAT &WIN02E *CAT + */

             OVRDBF     FILE(SOSNPF) SHARE(*YES)
             OPNQRYF    FILE((SOSNPF)) QRYSLT('SN06 *EQ %RANGE(' +
                          *CAT &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT +
                          ') *AND (SN02L *EQ "R3" *OR SN02L *EQ +
                          "RC")') KEYFLD(*FILE) MAPFLD((SN02L +
                          '%SST(SN02 3 2)' *CHAR 2))
/*M001D                   *CAT &WIN02S *CAT ' ' *CAT &WIN02E *CAT + */

             CALL       IMR0801
             OPNQRYF    FILE((REWFD8)) KEYFLD((WFB201) (WFB202) +
                          (WFB209) (WFB203))
             IF         COND(&DPFMT *EQ 'A') THEN(DO)
                        CALL   IMR0802
                        CHGVAR  VAR(&P6601I) VALUE('IMR080AP')
                        ENDDO
             ELSE       DO
                        CALL   IMR0803
                        CHGVAR  VAR(&P6601I) VALUE('IMR080BP')
                        ENDDO

             CLOF       OPNID(IMIBPF)
             CLOF       OPNID(IMIUPF)
             CLOF       OPNID(POPDPF)
             CLOF       OPNID(POPFPF)
             CLOF       OPNID(POPHPF)
             CLOF       OPNID(IMIGPF)
             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             CLOF       OPNID(SOSGPF)
             CLOF       OPNID(SOSNPF)
             CLOF       OPNID(IMIEPF)
             CLOF       OPNID(IMIMPF)
             CLOF       OPNID(REWFD8)
             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
