/********************************************************************/
/*                                                                  */
/* 5763SS1 V3R1M0 940909     RTVCLSRC Output     08/07/95 10:54:53  */
/*                                                                  */
/* Program name . . . . . . . . . . . . . . :   INL01             PN*/
/* Library name . . . . . . . . . . . . . . :   REPLIB            PL*/
/* Original source file . . . . . . . . . . :   QTXTSRC           SN*/
/* Library name . . . . . . . . . . . . . . :   REPLIB            SL*/
/* Original source member . . . . . . . . . :   INL01             SM*/
/* Source file change                                               */
/*   date/time  . . . . . . . . . . . . . . :   01/29/92 11:12:22 SC*/
/* Patch option . . . . . . . . . . . . . . :   *NOPATCH          PO*/
/* User profile . . . . . . . . . . . . . . :   *USER             UP*/
/* Text . . . : INZ PGM  (MENU)                                   TX*/
/* Owner  . . . . . . . . . . . . . . . . . :   REPGMGRP          OW*/
/* Patch change ID  . . . . . . . . . . . . :                     PC*/
/* Patch APAR ID  . . . . . . . . . . . . . :                     PA*/
/* User mod flag  . . . . . . . . . . . . . :   *YES              UM*/
/*                                                                ED*/
/********************************************************************/
     PGM
     DCLF FILE(*LIBL/WDS000D)
     OVRMSGF MSGF(QCPFMSG) TOMSGF(PTFLIB/PTMF)
     CHGVAR VAR(&IN99) VALUE('1')
     SNDF RCDFMT(SCR001)
     CALL PGM(REM000C)
     ENDPGM
