             PGM
             DCLF       FILE(*LIBL/PTS000D)
             CHGVAR     VAR(&IN99) VALUE('1')
             SNDF       RCDFMT(DSPC1)
             CALL       S#M010
             SIGNOFF
             ENDPGM
