     /**************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250  */
     /*                                                            */
     /*    PROGRAM ID   : JLB031                                   */
     /*    PROGRAM NAME : 收款沖帳傳票批次                       */
     /*    AUTHOR       : D910121 CHARLES                          */
     /*    CREATE DATE  : 1993.05.22                               */
     /*    UPDATE DATE  :                                          */
     /*    SYSTEM       : 進銷存收TO總帳                       */
     /**************************************************************/
             PGM

             DCL        VAR(&D01)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&D02)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&D03)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&D04)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&F01)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&F02)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             CHGVAR     VAR(&D01)   VALUE(%SST(*LDA 629 1))
             CHGVAR     VAR(&D02)   VALUE(%SST(*LDA 630 1))
             CHGVAR     VAR(&D03)   VALUE(%SST(*LDA 631 1))
             CHGVAR     VAR(&D04)   VALUE(%SST(*LDA 632 1))
             CHGVAR     VAR(&F01)   VALUE(%SST(*LDA 601 8))
             CHGVAR     VAR(&F02)   VALUE(%SST(*LDA 609 8))
     /**** WF#GPF   ****/
             CPYF       FROMFILE(WF#GPF) TOFILE(QTEMP/WF#GPF) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/WF#GPF))
             OVRDBF     FILE(WF#GPF) TOFILE(QTEMP/WF#GPF) SHARE(*YES)

     /**** WF#GPF01 ****/
             CPYF       FROMFILE(WF#GPF01) TOFILE(QTEMP/WF#GPF01) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM +
                          FILE(QTEMP/WF#GPF01))
             OVRDBF     FILE(WF#GPF01) TOFILE(QTEMP/WF#GPF01) +
                          SHARE(*YES)

     /**** WFADPF   ****/
             CPYF       FROMFILE(WFADPF) TOFILE(QTEMP/WFADPF) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/WFADPF))
             OVRDBF     FILE(WFADPF) TOFILE(QTEMP/WFADPF) SHARE(*YES)

     /**** WFJL10PF ****/
             CPYF       FROMFILE(WFJL10PF) TOFILE(QTEMP/WFJL10PF) +
                          CRTFILE(*YES)
             MONMSG   MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/WFJL10PF))
             OVRDBF   FILE(WFJL10PF) TOFILE(QTEMP/WFJL10PF) SHARE(*YES)

     /**** WFJL10LF ****/
             CRTDUPOBJ  OBJ(WFJL10LF) FROMLIB(REFLIB) OBJTYPE(*ALL) +
                          TOLIB(QTEMP)
             MONMSG     MSGID(CPD2104 CPF2130)
             OVRDBF   FILE(WFJL10LF) TOFILE(QTEMP/WFJL10LF) SHARE(*YES)
     /**** WFJL26PF ****/
             CPYF       FROMFILE(WFJL26PF) TOFILE(QTEMP/WFJL26PF) +
                          CRTFILE(*YES)
             MONMSG   MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/WFJL26PF))
             OVRDBF   FILE(WFJL26PF) TOFILE(QTEMP/WFJL26PF) SHARE(*YES)

             OVRDBF     FILE(ARACPF) SHARE(*YES)
             OVRDBF     FILE(ARADPF) SHARE(*YES)
             OVRDBF     FILE(ARAFPF) SHARE(*YES)
             OPNQRYF    FILE((ARACPF)) OPTION(*ALL) QRYSLT('AC01L +
                          *EQ %RANGE("' *CAT &D01 *CAT '" "' *CAT +
                          &D02 *CAT '") & AC01R *EQ %RANGE("' *CAT +
                          &D03 *CAT '" "' *CAT &D04 *CAT '") & AC04 +
                          *EQ %RANGE(' *CAT &F01 *CAT ' ' *CAT &F02 +
                          *CAT ') & AC13 *NE "V" ') KEYFLD(*FILE) +
                          MAPFLD((AC01L '%SST(AC01 1 1)' *CHAR 1) +
                          (AC01R '%SST(AC01 2 1)' *CHAR 1))

             OPNQRYF    FILE((ARADPF)) OPTION(*ALL) QRYSLT('AD01L +
                          *EQ %RANGE("' *CAT &D01 *CAT '" "' *CAT +
                          &D02 *CAT '") & AD01R *EQ %RANGE("' *CAT +
                          &D03 *CAT '" "' *CAT &D04 *CAT '") & AD12 +
                          *EQ %RANGE(' *CAT &F01 *CAT ' ' *CAT &F02 +
                          *CAT ') & AD09 *NE "V" ') KEYFLD(*FILE) +
                          MAPFLD((AD01L '%SST(AD01 1 1)' *CHAR 1) +
                          (AD01R '%SST(AD01 2 1)' *CHAR 1))

             OPNQRYF    FILE((ARAFPF)) QRYSLT('AF01L *EQ %RANGE("' +
                          *CAT &D01 *CAT '" "' *CAT &D02 *CAT '") & +
                          AF01R *EQ %RANGE("' *CAT &D03 *CAT '" "' +
                          *CAT &D04 *CAT '") & AF05 *EQ %RANGE(' +
                          *CAT &F01 *CAT ' ' *CAT &F02 *CAT ') ') +
                          KEYFLD(*FILE) MAPFLD((AF01L '%SST(AF01 1 +
                          1)' *CHAR 1) (AF01R '%SST(AF01 2 1)' +
                          *CHAR 1))

   /*產生暫存檔及傳票*/
             CALL       JLB0312


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CALL       LOG
             CHGVAR     VAR(&P6601I) VALUE('LOGP')
             CHGVAR     VAR(&P6602I) VALUE('2')
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE('00')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             CALL       LOG01
             CHGVAR     VAR(&P6601I) VALUE('LOG01P')
             CHGVAR     VAR(&P6602I) VALUE('2')
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE('00')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             OVRPRTF    FILE(LOG@PAD) PAGESIZE(*N 198) CPI(15)
             CALL       LOG@AD
             CHGVAR     VAR(&P6601I) VALUE('LOG@ADP')
             CHGVAR     VAR(&P6602I) VALUE('2')
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE('00')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             CLOF       OPNID(ARACPF)
             CLOF       OPNID(ARADPF)
             CLOF       OPNID(ARAFPF)
   /*沖帳作帳明細表*/
             OVRPRTF    FILE(JLB0313P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('收款傳票')
             CALL       JLB0313
             CHGVAR     VAR(&P6601I) VALUE('JLB0313P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             DLTOVR     FILE(*ALL)

             ENDPGM
