             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DSC04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&YMD) TYPE(*CHAR) LEN(8)

 START:      CALL       PGM(KIB003) PARM(&IN03 &IN14 &IN98 )
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DSC04S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DSC04E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&YMD) VALUE(%SST(*LDA 640 8))


             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC04 *EQ %RANGE("' +
                          *CAT &DSC04S *CAT '"  "' *CAT &DSC04E +
                          *CAT '") & SC39 *EQ ' *CAT &YMD *CAT ' & +
                          SC03 *EQ "S2" ') KEYFLD(*FILE)

             CALL       PGM(KIB0031)
                        CHGVAR     VAR(&IN98)  VALUE('1')

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
