             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DSC04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&YMD) TYPE(*CHAR) LEN(6)

 START:      CALL       PGM(KIP013) PARM(&IN03 &IN14 &IN98 )
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DSC04S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DSC04E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&YMD) VALUE(%SST(*LDA 640 6))


             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC04 *EQ %RANGE("' +
                          *CAT &DSC04S *CAT '"  "' *CAT &DSC04E    +
                          *CAT '") & SC39XX *EQ "' *CAT &YMD *CAT '" +
                          & (SC03 *EQ "S2" | SC03 *EQ "S4" )') KEYFLD(*FILE) +
                          MAPFLD((SC39X SC39 *CHAR 8)(SC39XX        +
                          '%SST(SC39X 1 6)' *CHAR 6))

             CALL       PGM(KIP0131)
                        CHGVAR     VAR(&IN98)  VALUE('1')

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
