             PGM        PARM(&DOPT)

     /* DOPT = "1" 為可新增修改，DOPT = "2" 只能查詢 */

             DCL        VAR(&DOPT) TYPE(*CHAR) LEN(1)
             DCL        VAR(&$WRHUS) TYPE(*CHAR) LEN(5)
             RTVDTAARA  DTAARA(*LDA (501 5)) RTNVAR(&$WRHUS)

             IF         COND(&DOPT = '1') THEN(DO)

             IF         COND(&$WRHUS *NE '*ALL' *AND &$WRHUS *NE ' +
                          ') THEN(DO)

             OVRDBF     FILE(W1AFLF04) SHARE(*YES)
             OPNQRYF    FILE((W1AFLF04)) OPTION(*ALL) QRYSLT('      +
                         (AF03  = "' || &$WRHUS || '"               +
                        | AF04  = "' || &$WRHUS || '") & AF05 = " " +
                                           ') KEYFLD(*FILE)

             ENDDO
             ELSE       (DO)

             OVRDBF     FILE(W1AFLF04) SHARE(*YES)
             OPNQRYF    FILE((W1AFLF04)) OPTION(*ALL) QRYSLT('      +
                        AF05 = " "                                  +
                                           ') KEYFLD(*FILE)

             ENDDO
             ENDDO

             IF         COND(&DOPT = '2') THEN(DO)

             IF         COND(&$WRHUS *NE '*ALL' *AND &$WRHUS *NE ' +
                          ') THEN(DO)

             OVRDBF     FILE(W1AFLF04) SHARE(*YES)
             OPNQRYF    FILE((W1AFLF04)) OPTION(*ALL) QRYSLT('      +
                         (AF03  = "' || &$WRHUS || '"               +
                        | AF04  = "' || &$WRHUS || '") & AF05 = "P" +
                                           ') KEYFLD(*FILE)

             ENDDO
             ELSE       (DO)

             OVRDBF     FILE(W1AFLF04) SHARE(*YES)
             OPNQRYF    FILE((W1AFLF04)) OPTION(*ALL) QRYSLT('      +
                        AF05 = "P" +
                                           ') KEYFLD(*FILE)


             ENDDO
             ENDDO

             CALL       PGM(KIP008) PARM(&DOPT)

             CLOF       OPNID(W1AFLF04)
             DLTOVR     FILE(*ALL)

             ENDPGM
