             PGM        PARM(&IPCHK &USER)

             DCL        VAR(&USER)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&RCVDTA) TYPE(*CHAR) LEN(892)
             DCL        VAR(&I)       TYPE(*CHAR) LEN(10)
             DCL        VAR(&IPCHK)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IP) TYPE(*CHAR) LEN(15)
             DCL        VAR(&RCVLEN) TYPE(*CHAR) LEN(4)
             DCL        VAR(&FMTNAME) TYPE(*CHAR) LEN(8)
             DCL        VAR(&ERR) TYPE(*CHAR) LEN(4)
             CHGVAR     VAR(&IP) VALUE(' ')
             RTVJOBA    JOB(&I)
             CHGVAR     VAR(%BIN(&RCVLEN)) VALUE(892)
             CHGVAR     VAR(&FMTNAME) VALUE('DEVD0600')
             CHGVAR     VAR(&ERR) VALUE(X'00000000')
             CALL       PGM(QDCRDEVD) PARM(&RCVDTA &RCVLEN &FMTNAME +
                          &I &ERR)
             CHGVAR     VAR(&IP) VALUE(%SST(&RCVDTA 878 15))

             CALL       PGM(KIP011) PARM(&IP &IPCHK &USER)

             ENDPGM
