             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DIB03S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DIB03E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&WIB04S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WIB04E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YMD) TYPE(*CHAR) LEN(6)

 START:      CALL       PGM(KIP014) PARM(&IN03 &IN14 &IN98 )
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DIB03S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DIB03E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&WIB04S) VALUE(%SST(*LDA 611 8))
             CHGVAR     VAR(&WIB04E) VALUE(%SST(*LDA 619 8))
             CHGVAR     VAR(&YMD) VALUE(%SST(*LDA 640 6))


             OVRDBF     FILE(IMIBPF) SHARE(*YES)
             OPNQRYF    FILE((IMIBPF)) OPTION(*ALL) QRYSLT(' IB03L +
                          *EQ "B"      & IB04 = %RANGE(' || &WIB04S +
                          || ' ' || &WIB04E || ')') KEYFLD(*FILE) +
                          MAPFLD((IB03L '%SST(IB03 1 1)' *CHAR 1))


             OVRDBF     FILE(IMIGPF) SHARE(*YES)
             OPNQRYF    FILE((IMIGPF)) OPTION(*ALL) QRYSLT('  LIG01 +
                          = "R"                           & IG03 = +
                          %RANGE("' || &DIB03S || '"   "' || +
                          &DIB03E || '")  & IG05 = %RANGE(' || +
                          &WIB04S || '    ' || &WIB04E || ')   ') +
                          KEYFLD(*FILE) MAPFLD((LIG01 '%SST(IG01 1 +
                          1)' *CHAR 1))

             CALL       PGM(KIP0141)
                        CHGVAR     VAR(&IN98)  VALUE('1')

             CLOF       OPNID(IMIBPF)
             CLOF       OPNID(IMIGPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
