     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 81/04/22                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : KIR046C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :盤點系統                                 */
     /*    REMARK       :年終成本數量列印　　　　                 */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DIX11)   TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&DIX01S)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DIX01E)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DATA)  TYPE(*CHAR) LEN(1)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))
             CHGVAR     VAR(&DIX11)   VALUE(%SST(*LDA 601 4))
             CHGVAR     VAR(&DIX01S)  VALUE(%SST(*LDA 615 9))
             CHGVAR     VAR(&DIX01E)  VALUE(%SST(*LDA 624 9))
             CHGVAR     VAR(&DATA)  VALUE(%SST(*LDA 650 1))

             OVRDBF     FILE(IMI1LF02) SHARE(*YES)
             OPNQRYF    FILE((IMI1LF02)) QRYSLT('IX11 *EQ ' *CAT +
                          &YMD8S *CAT ' & IX01 *EQ %RANGE("' *CAT +
                          &DIX01S *CAT '" "' *CAT &DIX01E *CAT '")  +
                          ') KEYFLD(*FILE)
/*M001D                   &DIX11 *CAT ' & IX01 *EQ %RANGE("' *CAT + */

             IF         COND(&DATA *EQ 'A') THEN(DO)
             OVRPRTF    FILE(KIR046AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('年成數量')
             CALL       KIR0461
             CHGVAR     VAR(&P6601I) VALUE('KIR046AP')
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(KIR046BP) PAGESIZE(*N 120) CPI(15) +
                        USRDTA('年成數量')
             CALL       KIR0462
             CHGVAR     VAR(&P6601I) VALUE('KIR046BP')
             ENDDO

 /*M001M     CLOF       OPNID(IMIXLF02)  */
 /*M001M*/   CLOF       OPNID(IMI1LF02)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
 ENDSR:      ENDPGM
