             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/KIS000D3) RCDFMT(DSPC1)
             OVRMSGF MSGF(QCPFMSG) TOMSGF(PTFLIB/PTMF)
             CALL       PGM(P63)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             SETATNPGM  PGM(*LIBL/ATN01)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')

             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))
             IF         COND(&DOPID *EQ '01') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR058C')
             ENDDO
             IF         COND(&DOPID *EQ '02') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR056C')
             ENDDO
             IF         COND(&DOPID *EQ '03') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SOR085C')
             ENDDO
             IF         COND(&DOPID *EQ '04') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIS006')
             ENDDO
             IF         COND(&DOPID *EQ '05') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIS007')
             ENDDO
             IF         COND(&DOPID *EQ '06') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIS012')
             ENDDO
             IF         COND(&DOPID *EQ '07') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIS015')
             ENDDO
             IF         COND(&DOPID *EQ '08') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIS016')
             ENDDO
             IF         COND(&DOPID *EQ '09') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIS0170C')
             ENDDO
             IF         COND(&DOPID *EQ '10') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIS0180C')
             ENDDO
             IF         COND(&DOPID *EQ '11') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIS0200C')
             ENDDO
             IF         COND(&DOPID *EQ '12') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('KIS0210C')
             ENDDO
             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

   ENDPGM:   ENDPGM
