             PGM

             DCL        VAR(&DIA02S)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DIA02E)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&DIA03S)   TYPE(*CHAR) LEN(9)
             DCL        VAR(&DIA03E)   TYPE(*CHAR) LEN(9)
             DCL        VAR(&WIY15)    TYPE(*CHAR) LEN(6)

             DCL        VAR(&$PENV)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)     TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTCD)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6401I)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6403I)   TYPE(*DEC)  LEN(3 0)

             CHGVAR     VAR(&DIA02S)   VALUE(%SST(*LDA 501 5))
             CHGVAR     VAR(&DIA02E)   VALUE(%SST(*LDA 506 5))
             CHGVAR     VAR(&DIA03S)   VALUE(%SST(*LDA 511 9))
             CHGVAR     VAR(&DIA03E)   VALUE(%SST(*LDA 520 9))
             CHGVAR     VAR(&WIY15)    VALUE(%SST(*LDA 540 6))

             OVRDBF     FILE(IMIYPF) SHARE(*YES)
             OPNQRYF    FILE((IMIYPF)) OPTION(*ALL) QRYSLT('      +
                         (IY02 = "B0000" | IY02 = "B0011" |         +
                          IY02 = "B0013" | IY02 = "B0014" |         +
                          IY02 = "B0015" | IY02 = "B0019" |         +
                          IY02 = "B0022" | IY02 = "B0026" |         +
                          IY02 = "B0030" | IY02 = "B0031" |         +
                          IY02 = "B0032" | IY02 = "B0033" |         +
                          IY02 = "B0099" | IY02 = "B1001" |         +
                          IY02 = "B0007" | IY02 = "B0006" |         +
                          IY02 = "B0017" | IY02 = "B0018" |         +
                          IY02 = "W9999" | IY02 = "B0003" )         +
                        & IY02 = %RANGE("' || &DIA02S || '"         +
                                        "' || &DIA02E || '")        +
                        & IY03 = %RANGE("' || &DIA03S || '"         +
                                        "' || &DIA03E || '")        +
                        & IY15C = "' || &WIY15 || '"                 +
                        ') KEYFLD((*FILE)) MAPFLD((IY15C IY15 *CHAR 6))

             OVRPRTF    FILE(KIS018P) PAGESIZE(*N 198) +
                          USRDTA('¦~²×®w¦s')
             CLRPFM     REW504
             CALL       KIS0182
             CALL       KIS0183
             CLOF       OPNID(IMIYPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (219 1)) RTNVAR(&$PENV)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (217 2)) RTNVAR(&$PRTCD)
             CHGVAR     VAR(&P6401I) VALUE('KIS018P')
             CHGVAR     VAR(&P6403I) VALUE(&$CPY)
             CALL       PGM(P64) PARM(&P6401I &$PENV &P6403I &$PRTCD)

             ENDPGM
