             PGM


             DCL        VAR(&WPH04S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WPH04E) TYPE(*CHAR) LEN(8)
             RTVDTAARA  DTAARA(*LDA (511 8)) RTNVAR(&WPH04S)
             RTVDTAARA  DTAARA(*LDA (521 8)) RTNVAR(&WPH04E)

             OVRDBF     FILE(POPHPF) SHARE(*YES)
             OPNQRYF    FILE((POPHPF)) OPTION(*ALL) QRYSLT('       +
                        SPH04 = %RANGE("' || &WPH04S || '"         +
                                       "' || &WPH04E || '")        +
                        ') KEYFLD(*FILE) MAPFLD((SPH04 PH04 *CHAR 8))

             CLRPFM     FILE(W2CEPF)

             CALL       PGM(KIS0161)
             CLOF       OPNID(POPHPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
