             PGM

  /* 20070517 EASON +++++ */

             DCLF       FILE(PYWWPF)

             DCL        VAR(&CMDTXT)   TYPE(*CHAR) LEN(160)
             DCL        VAR(&CMDLEN)   TYPE(*DEC)  LEN(15 5)

             OVRDBF     FILE(W2CCPF)
             OPNQRYF    FILE((W2CCPF)) KEYFLD((CC01) (CC03) (CC05) +
                          (CC07))
  /* 20070517 EASON +++++ */


    READF:
             RCVF
             IF         COND(&WW01  *NE 'S4' ) THEN(GOTO CMDLBL(READF))

             CHGVAR     VAR(&CMDTXT) VALUE('STRPCCMD PCCMD('||+
             &WW02)
             CHGVAR     VAR(&CMDLEN) VALUE(160)
   /*©I¥sPCµ{¦¡*/
             STRPCO
             MONMSG     MSGID(IWS4010)
             CALL       PGM(QCMDEXC) PARM(&CMDTXT &CMDLEN)

             CLOF       OPNID(W2CCPF)

             ENDPGM
