             PGM


             DCL        VAR(&WBC01) TYPE(*CHAR) LEN(8)
             DCL        VAR(&WBC01E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&SBD03) TYPE(*CHAR) LEN(5)
             DCL        VAR(&EBD03) TYPE(*CHAR) LEN(5)

             CHGVAR     VAR(&WBC01) VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&WBC01E) VALUE(%SST(*LDA 531 8))
             CHGVAR     VAR(&SBD03) VALUE(%SST(*LDA 511 5))
             CHGVAR     VAR(&EBD03) VALUE(%SST(*LDA 516 5))

             OVRDBF     FILE(W2BCPF) SHARE(*YES)
             OPNQRYF    FILE((W2BCPF)) OPTION(*ALL) QRYSLT('            +
                        SBC01 = %RANGE("' || &WBC01 || '"               +
                        "' || &WBC01E || '")  & BC04 = "O"  ')       +
                        KEYFLD(*FILE) MAPFLD((SBC01 BC01 *CHAR 8))

           /*           "' || WBC01E || '" )   &BC04 = "O" | BC04 = "P"  + */

             OVRDBF     FILE(W2BDPF) SHARE(*YES)
             OPNQRYF    FILE((W2BDPF)) OPTION(*ALL) QRYSLT('       +
                        BD06 = "O"                                 +
                        & BD03 = %RANGE("'|| &SBD03 ||'"          +
                        "'|| &EBD03 ||'")                         +
                        ') KEYFLD(*FILE)

        /*              BD06 = "O" | BD06 = "P"                    +   */

             CLRPFM     FILE(W2CBPF)
             CLRPFM     FILE(W2CCPF)

             CALL       PGM(KIS0071)
             CLOF       OPNID(W2BCPF)
             CLOF       OPNID(W2BDPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
