     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1491   EASON                             */
     /*    CREATE DATE  : 98/06/11                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : KIS014                                    */
     /*    SYSTEM       :                                         */
     /*    SUBSYSTEM    :採購資料子系統                           */
     /*    REMARK       :採購資料批次結案- FOR 專櫃             */
     /***************************************************************/
             PGM

             DCL        VAR(&WAF01S) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&W8S)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&WAF01E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&W8E)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(KIS022) PARM(&IN03 &IN14 &IN97)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&WAF01S) VALUE(%SST(*LDA 601 6))
/*M001A*/    CHGVAR     VAR(&W8S)    VALUE(%SST(*LDA 610 8))
             CHGVAR     VAR(&WAF01E) VALUE(%SST(*LDA 621 6))
/*M001A*/    CHGVAR     VAR(&W8E)    VALUE(%SST(*LDA 630 8))
             OVRDBF     FILE(W1AFPF) SHARE(*YES)

             OPNQRYF    FILE((W1AFPF)) OPTION(*ALL) QRYSLT(' AF01  +
                      = %RANGE(' || &W8S || '  ' || &W8E || ')     +
                        & AF05  *EQ " " ') KEYFLD(*FILE)

             OVRDBF     FILE(W1AGPF) SHARE(*YES)

             OPNQRYF    FILE((W1AGPF)) OPTION(*ALL) QRYSLT('       +
                          AG05 = " " ') KEYFLD(*FILE)


                        CALL       PGM(KIS0221)

                        CHGVAR     VAR(&IN97)  VALUE('1')
             CLOF       OPNID(W1AFPF)
             CLOF       OPNID(W1AGPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
