     /***************************************************************/
     /*   人頭馬堅匯東洋酒份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 05/23/94                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MSOR045C1                                 */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :月客戶銷售統計表                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(6)

             DCL        VAR(&CD06S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&CD06E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&CD01E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&CD01S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CD09S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&CD09E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&CD13S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CD13E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CD14S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&CD14E) TYPE(*CHAR) LEN(2)
       /*    DCL        VAR(&CD11S) TYPE(*CHAR) LEN(2)        */
       /*    DCL        VAR(&CD11E) TYPE(*CHAR) LEN(2)        */
             DCL        VAR(&CD04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&CD04E) TYPE(*CHAR) LEN(9)

             CPYF       FROMFILE(REFLIB/REWF15) TOFILE(QTEMP/REWF15) +
                          CRTFILE(*YES)

             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF15))
             OVRDBF     FILE(REWF15) TOFILE(QTEMP/REWF15) SHARE(*YES)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 6))
             CHGVAR     VAR(&CD06S) VALUE(%SST(*LDA 671 9))
             CHGVAR     VAR(&CD06E) VALUE(%SST(*LDA 681 9))
             CHGVAR     VAR(&CD01E) VALUE(%SST(*LDA 615 4))
             CHGVAR     VAR(&CD01S) VALUE(%SST(*LDA 619 4))
             CHGVAR     VAR(&DSEL)  VALUE(%SST(*LDA 623 1))
             CHGVAR     VAR(&DSEL1) VALUE(%SST(*LDA 705 1))
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 751 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 752 1))
             CHGVAR     VAR(&CD13S) VALUE(%SST(*LDA 625 1))
             CHGVAR     VAR(&CD13E) VALUE(%SST(*LDA 626 1))
             CHGVAR     VAR(&CD14S) VALUE(%SST(*LDA 627 2))
             CHGVAR     VAR(&CD14E) VALUE(%SST(*LDA 629 2))
      /*     CHGVAR     VAR(&CD11S) VALUE(%SST(*LDA 631 2))   */
      /*     CHGVAR     VAR(&CD11E) VALUE(%SST(*LDA 633 2))   */
             CHGVAR     VAR(&CD09S) VALUE(%SST(*LDA 710 6))
             CHGVAR     VAR(&CD09E) VALUE(%SST(*LDA 716 6))
             CHGVAR     VAR(&CD04S) VALUE(%SST(*LDA 651 9))
             CHGVAR     VAR(&CD04E) VALUE(%SST(*LDA 660 9))

             OVRPRTF    FILE(MSOR045P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('月客銷年')
             OVRDBF     FILE(SOCDPF) SHARE(*YES)

             IF         COND(&DSEL = 'A') THEN(DO)

             OPNQRYF    FILE((SOCDPF)) QRYSLT('CD67 *EQ %RANGE("' +
                          *CAT &CD06S *CAT '" "' *CAT &CD06E *CAT +
/*M001A*/                 '") & CD01 *EQ %RANGE(' *CAT &YMD8S *CAT +
/*M001A*/                 ' ' *CAT &YMD8E *CAT ') & CD13 *EQ +
                          %RANGE("' *CAT &CD13S *CAT '" "' *CAT +
                          &CD13E *CAT '") & CD14 *EQ %RANGE("' *CAT +
                          &CD14S *CAT '" "' *CAT &CD14E *CAT '")  & +
                          CD05 *NE "Y" & CD02 *EQ %RANGE("' *CAT +
                          &COMPS *CAT '" "' *CAT &COMPE *CAT '") & +
                          CD09 *EQ %RANGE("' *CAT &CD09S *CAT '" "' +
                          *CAT &CD09E *CAT '") & CD15 *NE "T" & +
                          CD04 *EQ %RANGE("' *CAT &CD04S *CAT '" "' +
                          *CAT &CD04E *CAT '") & CD03A *NE "K" ') +
                          KEYFLD((CD06) (CD07) (CD04) (CD01)) +
                          MAPFLD((CD67 'cd06||cd07' *CHAR 9) (CD03A +
                          '%SST(CD03 1 1)' *CHAR 1))
/*M001D                   '") & CD01 *EQ %RANGE(' *CAT &CD01S *CAT +
                          ' ' *CAT &CD01E *CAT ') & CD13 *EQ +   */
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOCDPF)) QRYSLT('CD67 *EQ %RANGE("' +
                          *CAT &CD06S *CAT '" "' *CAT &CD06E *CAT +
/*M001A*/                 '") & CD01 *EQ %RANGE(' *CAT &YMD8S *CAT +
/*M001A*/                 ' ' *CAT &YMD8E *CAT ') & CD13 *EQ +
                          %RANGE("' *CAT &CD13S *CAT '" "' *CAT +
                          &CD13E *CAT '") & CD14 *EQ %RANGE("' *CAT +
                          &CD14S *CAT '" "' *CAT &CD14E *CAT '") & +
                          CD27 *NE "Y" & CD02 *EQ %RANGE("' *CAT +
                          &COMPS *CAT '" "' *CAT &COMPE *CAT '") & +
                          CD09 *EQ %RANGE("' *CAT &CD09S *CAT '" "' +
                          *CAT &CD09E *CAT '") & CD04 *EQ %RANGE("' +
                          *CAT &CD04S *CAT '" "' *CAT &CD04E *CAT +
                          '") & CD15 *NE "T" & CD03A *NE "K" ') +
                          KEYFLD((CD06) (CD07) (CD04) (CD01)) +
                          MAPFLD((CD67 'cd06||cd07' *CHAR 9) (CD03A +
                          '%SST(CD03 1 1)' *CHAR 1))
/*M001D                   '") & CD01 *EQ %RANGE(' *CAT &CD01S *CAT +
                          ' ' *CAT &CD01E *CAT ') & CD13 *EQ +  */
             ENDDO

             CALL       MSOR0451
             CALL       MSOR0452

             CLOF       OPNID(SOCDPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MSOR045P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
