     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : TINA                                      */
     /*    CREATE DATE  : 84/04/03                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MSOR048C1                                 */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :訂單系統                                 */
     /*    REMARK       :通路產品平均銷售單價表                 */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCD13S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCD13E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCD14S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCD14E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCD11S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCD11E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCD10S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DCD10E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DCD09S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DCD09E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DCD04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCD04E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCD06S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCD06E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&YCD01S)  TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&YCD01E)  TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSEL)   TYPE(*CHAR) LEN(1)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 6))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DCD13S) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DCD13E) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DCD14S) VALUE(%SST(*LDA 695 2))
             CHGVAR     VAR(&DCD14E) VALUE(%SST(*LDA 697 2))
             CHGVAR     VAR(&DCD11S) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DCD11E) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DCD10S) VALUE(%SST(*LDA 609 4))
             CHGVAR     VAR(&DCD10E) VALUE(%SST(*LDA 613 4))
             CHGVAR     VAR(&DCD09S) VALUE(%SST(*LDA 617 6))
             CHGVAR     VAR(&DCD09E) VALUE(%SST(*LDA 623 6))
             CHGVAR     VAR(&DCD04S) VALUE(%SST(*LDA 630 9))
             CHGVAR     VAR(&DCD04E) VALUE(%SST(*LDA 640 9))
             CHGVAR     VAR(&DCD06S) VALUE(%SST(*LDA 675 9))
             CHGVAR     VAR(&DCD06E) VALUE(%SST(*LDA 684 9))
             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 665 1))
             CHGVAR     VAR(&YCD01S)  VALUE(%SST(*LDA 658 4))
             CHGVAR     VAR(&YCD01E)  VALUE(%SST(*LDA 670 4))

             OVRPRTF    FILE(MSOR048P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('通產平均')
             OVRDBF     FILE(SOCDPF) SHARE(*YES)

             IF         COND(&DSEL = 'A') THEN(DO)
             OPNQRYF    FILE((SOCDPF)) QRYSLT('CD02 *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & CD13 *EQ %RANGE("' *CAT &DCD13S +
                          *CAT '" "' *CAT &DCD13E *CAT '") &  +
                          CD14 *EQ %RANGE("' *CAT &DCD14S +
                          *CAT '" "' *CAT &DCD14E *CAT '") & CD11 +
                          *EQ %RANGE("' *CAT &DCD11S *CAT '" "' +
                          *CAT &DCD11E *CAT '") & CD10 *EQ +
                          %RANGE("' *CAT &DCD10S *CAT '" "' *CAT +
                          &DCD10E *CAT '") & CD09 *EQ %RANGE("' +
                          *CAT &DCD09S *CAT '" "' *CAT &DCD09E *CAT +
                          '") & CD04 *EQ %RANGE("' *CAT &DCD04S +
                          *CAT '" "' *CAT &DCD04E *CAT '") & CD67 +
                          *EQ %RANGE("' *CAT &DCD06S *CAT '" "' +
                          *CAT &DCD06E *CAT '") & CD01 *EQ %RANGE(' +
/*M001A*/                 *CAT &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT +
                          ') & CD05 *EQ " " & CD15 *NE "T"  +
                           & CD03A *NE "K" ') +
                          KEYFLD((CD04) (CD13)) +
                          MAPFLD((CD67 'cd06 *cat cd07' *CHAR 9) +
                          (CD03A '%SST(CD03 1 1)' *CHAR 1))
/*M001D                   *CAT &YCD01S *CAT ' ' *CAT &YCD01E *CAT + */

             ENDDO
             ELSE       CMD(DO)

             OPNQRYF    FILE((SOCDPF)) QRYSLT('CD02 *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & CD13 *EQ %RANGE("' *CAT &DCD13S +
                          *CAT '" "' *CAT &DCD13E *CAT '") &  +
                          CD14 *EQ %RANGE("' *CAT &DCD14S +
                          *CAT '" "' *CAT &DCD14E *CAT '") & CD11 +
                          *EQ %RANGE("' *CAT &DCD11S *CAT '" "' +
                          *CAT &DCD11E *CAT '") & CD10 *EQ +
                          %RANGE("' *CAT &DCD10S *CAT '" "' *CAT +
                          &DCD10E *CAT '") & CD09 *EQ %RANGE("' +
                          *CAT &DCD09S *CAT '" "' *CAT &DCD09E *CAT +
                          '") & CD04 *EQ %RANGE("' *CAT &DCD04S +
                          *CAT '" "' *CAT &DCD04E *CAT '") &  CD67 +
                          *EQ %RANGE("' *CAT &DCD06S *CAT '" "' +
                          *CAT &DCD06E *CAT '") & CD01 *EQ %RANGE(' +
/*M001A*/                 *CAT &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT +
                          ') & CD15 *NE "T" & CD27 *NE "Y"  +
                           & CD03A *NE "K" ') +
                          KEYFLD((CD04) (CD13)) +
                          MAPFLD((CD67 'cd06 *cat cd07' *CHAR 9) +
                          (CD03A '%SST(CD03 1 1)' *CHAR 1))
/*M001D                   *CAT &YCD01S *CAT ' ' *CAT &YCD01E *CAT + */
             ENDDO
             CALL       MSOR0481

             CLOF       OPNID(SOCDPF)
             DLTOVR     FILE(MSOR048P)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MSOR048P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
