     /***************************************************************/
     /*   人頭馬堅匯東洋酒份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : TINA                                      */
     /*    CREATE DATE  : 03/10/95                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MSOR047C1                                 */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :月存貨週轉統計年報                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&CD04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&CD04E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DATES) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DATEE) TYPE(*CHAR) LEN(4)
  /*M001A*/  DCL        VAR(&YM6S) TYPE(*CHAR) LEN(6)
  /*M001A*/  DCL        VAR(&YM6E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DMA11S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMA11E) TYPE(*CHAR) LEN(1)

             CPYF       FROMFILE(REFLIB/REWFB6) TOFILE(QTEMP/REWFB6) +
                          CRTFILE(*YES)

             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFB6))
             OVRDBF     FILE(REWFB6) TOFILE(QTEMP/REWFB6) SHARE(*YES)

             CHGVAR     VAR(&CD04S) VALUE(%SST(*LDA 600 9))
             CHGVAR     VAR(&CD04E) VALUE(%SST(*LDA 610 9))
             CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 628 4))
             CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 624 4))
/*M001A*/    CHGVAR     VAR(&YM6S) VALUE(%SST(*LDA 850 6))
/*M001A*/    CHGVAR     VAR(&YM6E) VALUE(%SST(*LDA 856 6))
             CHGVAR     VAR(&DMA11S) VALUE(%SST(*LDA 798 1))
             CHGVAR     VAR(&DMA11E) VALUE(%SST(*LDA 799 1))

             OVRPRTF    FILE(MSOR047P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('月週轉年')
             OVRDBF     FILE(REWFB7) TOFILE(SOCDPF) SHARE(*YES)
             OVRDBF     FILE(IMIXPF) SHARE(*YES)
             OVRDBF     FILE(POPEPF) SHARE(*YES)

             OPNQRYF    FILE((SOCDPF) (MTMAPF)) FORMAT(REWFB7) +
                          QRYSLT(' CD04 *EQ %RANGE("' *CAT &CD04S +
                          *CAT '" "' *CAT &CD04E *CAT '") & CD01M +
                          *EQ %RANGE("' *CAT &YM6S *CAT '" "' *CAT +
                          &YM6E *CAT '") &  CD15 *NE "T" &  MA11A +
                          *EQ %RANGE("' *CAT &DMA11S *CAT '"  "' +
                          *CAT &DMA11E *CAT '") & CD05 *NE "Y"  +
                           & CD03A *NE "K" ') +
                          KEYFLD((CD04) (CD01)) JFLD((1/CD04 2/MA01 +
                          *EQ)) MAPFLD((CD01Z CD01 *ZONED 6) (CD01M +
                          CD01Z *CHAR 6) (MA11A '%SST(MA11 1 1)') +
                          (CD03A '%SST(CD03 1 1)' *CHAR 1))
             OPNQRYF    FILE((IMIXPF)) QRYSLT(' ix01 *EQ %RANGE("' +
                          *CAT &CD04S *CAT '" "' *CAT &CD04E *CAT +
                          '") & IX11M *EQ %RANGE("' *CAT &YM6S +
                          *CAT '" "' *CAT &YM6E *CAT '")') +
                          KEYFLD((IX01) (IX11)) MAPFLD((IX11M IX11 +
                          *CHAR 6))
             OPNQRYF    FILE((POPEPF)) QRYSLT(' PE04 *EQ %RANGE("' +
                          *CAT &CD04S *CAT '" "' *CAT &CD04E *CAT +
                          '") & PE05M *EQ %RANGE("' *CAT &YM6S +
                          *CAT '" "' *CAT &YM6E *CAT '") ') +
                          KEYFLD((PE04)) MAPFLD((PE05A PE05 +
                          *CHAR 8) (PE05M '%SST(PE05A 1 6)' *CHAR 6))

             CALL       MSOR0471
             CALL       MSOR0472

             CLOF       OPNID(SOCDPF)
             CLOF       OPNID(IMIXPF)
             CLOF       OPNID(POPEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MSOR047P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
