     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266     */
     /*                                                             */
     /*    AUTHOR       : MERCURY                                   */
     /*    CREATE DATE  : 83/06/08                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MSOR046C1                                 */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :月產品銷售（退）統計表                   */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&CD02S)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&CD02E)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&CD06S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&CD06E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCD13S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCD13E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCD14S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCD14E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCD10S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DCD10E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DCD04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCD04E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&CD01E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&CD01S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSEL)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN20)  TYPE(*CHAR) LEN(1)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(6)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 6))

             CHGVAR     VAR(&CD02S)  VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&CD02E)  VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&CD06S) VALUE(%SST(*LDA 670 9))
             CHGVAR     VAR(&CD06E) VALUE(%SST(*LDA 679 9))
             CHGVAR     VAR(&DCD13S) VALUE(%SST(*LDA 645 1))
             CHGVAR     VAR(&DCD13E) VALUE(%SST(*LDA 646 1))
             CHGVAR     VAR(&DCD14S) VALUE(%SST(*LDA 651 2))
             CHGVAR     VAR(&DCD14E) VALUE(%SST(*LDA 653 2))
             CHGVAR     VAR(&DCD10S) VALUE(%SST(*LDA 661 4))
             CHGVAR     VAR(&DCD10E) VALUE(%SST(*LDA 665 8))
             CHGVAR     VAR(&DCD04S) VALUE(%SST(*LDA 624 9))
             CHGVAR     VAR(&DCD04E) VALUE(%SST(*LDA 633 9))
             CHGVAR     VAR(&CD01E) VALUE(%SST(*LDA 615 4))
             CHGVAR     VAR(&CD01S) VALUE(%SST(*LDA 619 4))
             CHGVAR     VAR(&DSEL) VALUE(%SST(*LDA 623 1))
             CHGVAR     VAR(&DSEL2) VALUE(%SST(*LDA 706 1))
             CHGVAR     VAR(&IN20) VALUE(%SST(*LDA 750 1))

             CPYF       FROMFILE(REWF17) TOFILE(QTEMP/REWF17) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF17))
             OVRDBF     FILE(REWF17) TOFILE(QTEMP/REWF17) SHARE(*YES)
     /*  禮盒拆單瓶 */
             CPYF       FROMFILE(RES18WF) TOFILE(QTEMP/RES18WF) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/RES18WF))
             OVRDBF     FILE(RES18WF) TOFILE(QTEMP/RES18WF) SHARE(*YES)


             OVRPRTF    FILE(MSOR046P) PAGESIZE(*N 198) CPI(15)  +
                        USRDTA('月產銷年')
             OVRDBF     FILE(SOCDPF) SHARE(*YES)

             IF         COND(&DSEL2 = '1') THEN(DO)
             IF         COND(&DSEL = 'A') THEN(DO)
             OPNQRYF    FILE((SOCDPF)) QRYSLT(' CD06 *EQ %RANGE("' +
                          *CAT &CD06S *CAT '" "' *CAT &CD06E *CAT +
/*M001A*/                 '") & CD01 *EQ %RANGE(' *CAT &YMD8S *CAT +
/*M001A*/                 ' ' *CAT &YMD8E *CAT ') & CD02 *EQ +
                          %RANGE("' *CAT &CD02S *CAT '" "' *CAT +
                          &CD02E *CAT '") &CD13 *EQ %RANGE("' *CAT +
                          &DCD13S *CAT '" "' *CAT &DCD13E *CAT '") +
                          &CD14 *EQ %RANGE("' *CAT &DCD14S *CAT '" +
                          "' *CAT &DCD14E *CAT '") &CD10 *EQ +
                          %RANGE("' *CAT &DCD10S *CAT '" "' *CAT +
                          &DCD10E *CAT '") & CD04 *EQ %RANGE("' +
                          *CAT &DCD04S *CAT '" "' *CAT &DCD04E *CAT +
                          '") & CD15 *NE "T" & CD05 *NE "Y"  & +
                          CD03A *NE "K" ') KEYFLD((CD04) (CD13) +
                          (CD01)) MAPFLD((CD03A '%sst(cd03 1 1)'))
/*M001D                   '") & CD01 *EQ %RANGE(' *CAT &CD01S *CAT +
                          ' ' *CAT &CD01E *CAT ') & CD02 *EQ +  */

             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOCDPF)) QRYSLT(' CD06 *EQ %RANGE("' +
                          *CAT &CD06S *CAT '" "' *CAT &CD06E *CAT +
/*M001A*/                 '") & CD01 *EQ %RANGE(' *CAT &YMD8S *CAT +
/*M001A*/                 ' ' *CAT &YMD8E *CAT ') & CD02 *EQ +
                          %RANGE("' *CAT &CD02S *CAT '" "' *CAT +
                          &CD02E *CAT '") & CD13 *EQ %RANGE("' *CAT +
                          &DCD13S *CAT '" "' *CAT &DCD13E *CAT '") +
                          & CD14 *EQ %RANGE("' *CAT &DCD14S *CAT '" +
                          "' *CAT &DCD14E *CAT '") & CD10 *EQ +
                          %RANGE("' *CAT &DCD10S *CAT '" "' *CAT +
                          &DCD10E *CAT '") & CD04 *EQ %RANGE("' +
                          *CAT &DCD04S *CAT '" "' *CAT &DCD04E *CAT +
                          '") & CD15 *NE "T" & CD27 *NE "Y" & +
                          CD03A *NE "K" ') +
                          KEYFLD((CD04) (CD13) (CD01)) +
                          MAPFLD((CD03A '%sst(cd03 1 1)'))

/*M001D                   '") & CD01 *EQ %RANGE(' *CAT &CD01S *CAT +
                          ' ' *CAT &CD01E *CAT ') & CD02 *EQ +  */
             ENDDO
             CALL       MSOR0461
             CALL       MSOR0462
             ENDDO
             ELSE       CMD(DO)
             IF         COND(&DSEL = 'A') THEN(DO)
             OPNQRYF    FILE((SOCDPF)) QRYSLT(' CD06 *EQ %RANGE("' +
                          *CAT &CD06S *CAT '" "' *CAT &CD06E *CAT +
/*M001A*/                 '") & CD01 *EQ %RANGE(' *CAT &YMD8S *CAT +
/*M001A*/                 ' ' *CAT &YMD8E *CAT ') & CD02 *EQ +
                          %RANGE("' *CAT &CD02S *CAT '" "' *CAT +
                          &CD02E *CAT '") &CD13 *EQ %RANGE("' *CAT +
                          &DCD13S *CAT '" "' *CAT &DCD13E *CAT '") +
                          &CD14 *EQ %RANGE("' *CAT &DCD14S *CAT '" +
                          "' *CAT &DCD14E *CAT '") &CD10 *EQ +
                          %RANGE("' *CAT &DCD10S *CAT '" "' *CAT +
                          &DCD10E *CAT '") & CD04 *EQ %RANGE("' +
                          *CAT &DCD04S *CAT '" "' *CAT &DCD04E *CAT +
                          '") & CD15 *NE "T" & CD05 *NE "Y"  +
                          & CD03A *NE "K" ') +
                          KEYFLD((CD04)(CD01))                  +
                          MAPFLD((CD03A '%sst(cd03 1 1)'))
/*M001D                   '") & CD01 *EQ %RANGE(' *CAT &CD01S *CAT +
                          ' ' *CAT &CD01E *CAT ') & CD02 *EQ +   */

             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOCDPF)) QRYSLT(' CD06 *EQ %RANGE("' +
                          *CAT &CD06S *CAT '" "' *CAT &CD06E *CAT +
/*M001A*/                 '") & CD01 *EQ %RANGE(' *CAT &YMD8S *CAT +
/*M001A*/                 ' ' *CAT &YMD8E *CAT ') & CD02 *EQ +
                          %RANGE("' *CAT &CD02S *CAT '" "' *CAT +
                          &CD02E *CAT '") & CD13 *EQ %RANGE("' *CAT +
                          &DCD13S *CAT '" "' *CAT &DCD13E *CAT '") +
                          & CD14 *EQ %RANGE("' *CAT &DCD14S *CAT '" +
                          "' *CAT &DCD14E *CAT '") & CD10 *EQ +
                          %RANGE("' *CAT &DCD10S *CAT '" "' *CAT +
                          &DCD10E *CAT '") & CD04 *EQ %RANGE("' +
                          *CAT &DCD04S *CAT '" "' *CAT &DCD04E *CAT +
                          '") & CD15 *NE "T" & CD27 *NE "Y"  +
                          & CD03A *NE "K" ') +
                          KEYFLD((CD04)(CD01))         +
                          MAPFLD((CD03A '%sst(cd03 1 1)'))
/*M001D                   '") & CD01 *EQ %RANGE(' *CAT &CD01S *CAT +
                          ' ' *CAT &CD01E *CAT ') & CD02 *EQ +   */

             ENDDO
             CALL       MSOR0463
             CALL       MSOR0464
             ENDDO

             CLOF       OPNID(SOCDPF)
             DLTOVR     FILE(*ALL)



             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MSOR046P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
