     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : JANET                                     */
     /*    CREATE DATE  : 97/10/24                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MTA003C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :基本資料子系統                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)  VALUE('2')
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)  VALUE('001')
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)  VALUE('01')
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10) VALUE('MTA003P')
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)
             CALL       MTA003
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
