             PGM

             DCL        VAR(&DMD01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DMD01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(MTB001) PARM(&IN03 &IN14 &IN97 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DMD01S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DMD01E) VALUE(%SST(*LDA 606 5))

             OVRDBF     FILE(SOSILF07) SHARE(*YES)
             OVRDBF     FILE(MTMDPF) SHARE(*NO) SEQONLY(*NO)
             OPNQRYF    FILE((SOSILF07)) QRYSLT('SI12 *EQ %RANGE("' +
                          *CAT &DMD01S *CAT '" "' *CAT &DMD01E *CAT +
                          '")  & SI35 *NE 0 ') KEYFLD((SI12))

             OPNQRYF    FILE((MTMDPF)) QRYSLT('MD01 *EQ %RANGE("' +
                          *CAT &DMD01S *CAT '" "' *CAT &DMD01E *CAT +
                          '") ') KEYFLD((MD01))

             CALL       PGM(MTB0011) PARM(&IN96)
             IF         COND(&IN96 = '0') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO

             CLOF       OPNID(SOSILF07)
             CLOF       OPNID(MTMDPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
