             PGM

             DCL        VAR(&DMD01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DMD01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(MTB002) PARM(&IN03 &IN14 &IN97 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DMD01S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DMD01E) VALUE(%SST(*LDA 606 5))

             OVRDBF     FILE(ARACLF03) SHARE(*YES)
             OPNQRYF    FILE((ARACLF03)) QRYSLT(' AC02 *EQ %RANGE("' +
                          *CAT &DMD01S *CAT '" "' *CAT &DMD01E *CAT +
                          '")  & ac05 *eq "10" & ac11 *eq 0 ') +
                          KEYFLD((AC02))

             CALL       PGM(MTB0021) PARM(&IN96)
             IF         COND(&IN96 = '0') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO

             CLOF       OPNID(ARACLF03)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
