     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266     */
     /*                                                             */
     /*    AUTHOR       : MERCUTY                                   */
     /*    CREATE DATE  : 82/10/29                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MTR055C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :主檔                                     */
     /*    REMARK       :客戶搭贈清冊                             */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DME01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DME01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DME07S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME15S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DME15E) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DME01S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DME01E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&DME07S) VALUE(%SST(*LDA 611 2))
             CHGVAR     VAR(&DME07E) VALUE(%SST(*LDA 613 2))
             CHGVAR     VAR(&DME15S) VALUE(%SST(*LDA 631 6))
             CHGVAR     VAR(&DME15E) VALUE(%SST(*LDA 641 6))

             OVRPRTF    FILE(MTR055P) PAGESIZE(*N 198) CPI(15)      +
                        USRDTA('客搭贈冊')
             OVRDBF     FILE(MTMEPF) SHARE(*YES)

             OPNQRYF    FILE((MTMEPF)) QRYSLT(' ME01 *EQ %RANGE("' +
                          *CAT &DME01S *CAT '" "' *CAT &DME01E *CAT +
                          '") &  ME07  *EQ %RANGE("' *CAT &DME07S +
                          *CAT '" "' *CAT &DME07E *CAT '") & ME15 +
                          *EQ %RANGE("' *CAT &DME15S *CAT '" "' +
                          *CAT &DME15E *CAT '") & ME02 *EQ "    " +
                          & ME20 *NE "I" ') KEYFLD((ME01) (ME02))

             CALL       MTR0551

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MTR055P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             CLOF       OPNID(MTMEPF)
             DLTOVR     FILE(MTMEPF)
             DLTOVR     FILE(MTR055P)

             ENDPGM
