     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : 0070 JUDY                                 */
     /*    CREATE DATE  : 81/09/19                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MTR051C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :基本資料子系統                           */
     /*    REMARK       :產品簡明表                               */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DMA01S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DMA01E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DMA07S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMA07E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMA58)  TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DMA01S) VALUE(%SST(*LDA 601 9))
             CHGVAR     VAR(&DMA01E) VALUE(%SST(*LDA 610 9))
             CHGVAR     VAR(&DMA07S) VALUE(%SST(*LDA 619 1))
             CHGVAR     VAR(&DMA07E) VALUE(%SST(*LDA 620 1))
             CHGVAR     VAR(&DMA58)  VALUE(%SST(*LDA 621 1))

             OVRDBF     FILE(MTMAPF) SHARE(*YES)
             OVRPRTF    FILE(MTR051P) PAGESIZE(*N 157) CPI(12) +
                        USRDTA('產品簡明')

             IF         COND(&DMA58 = ' ') THEN(DO)
             OPNQRYF    FILE((MTMAPF)) QRYSLT('MA07 *EQ %RANGE("' +
                          *CAT &DMA07S *CAT '" "' *CAT &DMA07E *CAT +
                          '") & MA01  *EQ %RANGE("' *CAT &DMA01S +
                          *CAT '" "' *CAT &DMA01E *CAT '") ') +
                          KEYFLD((MA07) (MA08) (MA10) (MA01))

             ENDDO
             ELSE       CMD(DO)
             IF         COND(&DMA58 = 'I') THEN(DO)
             OPNQRYF    FILE((MTMAPF)) QRYSLT('MA07 *EQ %RANGE("' +
                          *CAT &DMA07S *CAT '" "' *CAT &DMA07E *CAT +
                          '") & MA01  *EQ %RANGE("' *CAT &DMA01S +
                          *CAT '" "' *CAT &DMA01E *CAT '") & MA58 +
                          *EQ "I"  ') KEYFLD((MA07) (MA08) (MA10) +
                          (MA01))

             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((MTMAPF)) QRYSLT('MA07 *EQ %RANGE("' +
                          *CAT &DMA07S *CAT '" "' *CAT &DMA07E *CAT +
                          '") & MA01  *EQ %RANGE("' *CAT &DMA01S +
                          *CAT '" "' *CAT &DMA01E *CAT '") & MA58 +
                          *EQ "A" ') KEYFLD((MA07) (MA08) (MA10) +
                          (MA01))
             ENDDO
             ENDDO

             CALL       MTR0511

             CLOF       OPNID(MTMAPF)
             DLTOVR     FILE(MTMAPF)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MTR051P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
