     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/13                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MTR043C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :主檔                                     */
     /*    REMARK       :客戶清冊                                 */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DME01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DME01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DME07S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME15S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DME15E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DCH)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD07S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD07E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD08S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMD08E) TYPE(*CHAR) LEN(2)

             CHGVAR     VAR(&DME01S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DME01E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&DME07S) VALUE(%SST(*LDA 611 2))
             CHGVAR     VAR(&DME07E) VALUE(%SST(*LDA 613 2))
             CHGVAR     VAR(&DME15S) VALUE(%SST(*LDA 631 6))
             CHGVAR     VAR(&DME15E) VALUE(%SST(*LDA 641 6))
             CHGVAR     VAR(&DCH)    VALUE(%SST(*LDA 615 1))
             CHGVAR     VAR(&DSEL) VALUE(%SST(*LDA 616 1))
             CHGVAR     VAR(&DMD07S) VALUE(%SST(*LDA 621 1))
             CHGVAR     VAR(&DMD07E) VALUE(%SST(*LDA 622 1))
             CHGVAR     VAR(&DMD08S) VALUE(%SST(*LDA 617 2))
             CHGVAR     VAR(&DMD08E) VALUE(%SST(*LDA 619 2))

             OVRPRTF    FILE(MTR043AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客戶清冊')
             OVRPRTF    FILE(MTR043BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客戶清冊')

             OVRDBF     FILE(REWF33) TOFILE(MTMEPF) SHARE(*YES)


             IF         COND(&DCH *EQ 'A') THEN(DO)

             IF         COND(&DSEL *EQ 'N') THEN(DO)
             OPNQRYF    FILE((MTMEPF) (MTMDPF)) FORMAT(*LIBL/REWF33 +
                          *ONLY) QRYSLT(' MD07 *EQ %RANGE("' *CAT +
                          &DMD07S *CAT '" "' *CAT &DMD07E *CAT '") +
                          & MD08 *EQ %RANGE("' *CAT &DMD08S *CAT '" +
                          "' *CAT &DMD08E *CAT '") & ME01 *EQ +
                          %RANGE("' *CAT &DME01S *CAT '" "' *CAT +
                          &DME01E *CAT '") &  ME07  *EQ %RANGE("' +
                          *CAT &DME07S *CAT '" "' *CAT &DME07E *CAT +
                          '") & ME15 *EQ %RANGE("' *CAT &DME15S +
                          *CAT '" "' *CAT &DME15E *CAT '") & ME20 +
                          *NE "I" ') KEYFLD((ME01) (ME02)) +
                          JFLD((1/ME01 2/MD01 *EQ))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((MTMEPF) (MTMDPF)) FORMAT(*LIBL/REWF33 +
                          *ONLY) QRYSLT(' MD07 *EQ %RANGE("' *CAT +
                          &DMD07S *CAT '" "' *CAT &DMD07E *CAT '") +
                          & MD08 *EQ %RANGE("' *CAT &DMD08S *CAT '" +
                          "' *CAT &DMD08E *CAT '") & ME01 *EQ +
                          %RANGE("' *CAT &DME01S *CAT '" "' *CAT +
                          &DME01E *CAT '") &  ME07  *EQ %RANGE("' +
                          *CAT &DME07S *CAT '" "' *CAT &DME07E *CAT +
                          '") & ME15 *EQ %RANGE("' *CAT &DME15S +
                          *CAT '" "' *CAT &DME15E *CAT '") ') +
                          KEYFLD((ME01) (ME02)) JFLD((1/ME01 2/MD01 +
                          *EQ))
             ENDDO

             CALL       MTR0431

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MTR043AP')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDDO


             ELSE       CMD(DO)

             IF         COND(&DSEL *EQ 'N') THEN(DO)
             OPNQRYF    FILE((MTMEPF) (MTMDPF)) FORMAT(*LIBL/REWF33 +
                          *ONLY) QRYSLT(' MD07 *EQ %RANGE("' *CAT +
                          &DMD07S *CAT '" "' *CAT &DMD07E *CAT '") +
                          & MD08 *EQ %RANGE("' *CAT &DMD08S *CAT '" +
                          "' *CAT &DMD08E *CAT '") & ME01 *EQ +
                          %RANGE("' *CAT &DME01S *CAT '" "' *CAT +
                          &DME01E *CAT '") & ME07  *EQ %RANGE("' +
                          *CAT &DME07S *CAT '" "' *CAT &DME07E *CAT +
                          '") & ME15 *EQ %RANGE("' *CAT &DME15S +
                          *CAT '" "' *CAT &DME15E *CAT '") & ME20 +
                          *NE "I" ') KEYFLD((ME07) (ME08) (ME01) +
                          (ME02)) JFLD((1/ME01 2/MD01 *EQ))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((MTMEPF) (MTMDPF)) FORMAT(*LIBL/REWF33 +
                          *ONLY) QRYSLT(' MD07 *EQ %RANGE("' *CAT +
                          &DMD07S *CAT '" "' *CAT &DMD07E *CAT '") +
                          & MD08 *EQ %RANGE("' *CAT &DMD08S *CAT '" +
                          "' *CAT &DMD08E *CAT '") & ME01 *EQ +
                          %RANGE("' *CAT &DME01S *CAT '" "' *CAT +
                          &DME01E *CAT '") & ME07  *EQ %RANGE("' +
                          *CAT &DME07S *CAT '" "' *CAT &DME07E *CAT +
                          '") & ME15 *EQ %RANGE("' *CAT &DME15S +
                          *CAT '" "' *CAT &DME15E *CAT '")') +
                          KEYFLD((ME07) (ME08) (ME01) (ME02)) +
                          JFLD((1/ME01 2/MD01 *EQ))
             ENDDO

             CALL       MTR0432

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MTR043BP')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDDO

             CLOF       OPNID(MTMEPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
