     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : MERCURY                                   */
     /*    CREATE DATE  : 82/10/21                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MTR054C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :基本資料子系統                           */
     /*    REMARK       :產品搭贈清冊列印                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DMA01S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DMA01E) TYPE(*CHAR) LEN(9)
   /*        DCL        VAR(&DMA46S) TYPE(*CHAR)  LEN(5)    */
             DCL        VAR(&DMA46S) TYPE(*CHAR)  LEN(7)
             DCL        VAR(&DMA46E) TYPE(*CHAR)  LEN(7)
   /*        DCL        VAR(&DMA46E) TYPE(*CHAR)  LEN(5)    */
             DCL        VAR(&EGYMD)  TYPE(*CHAR)  LEN(6)
   /*M001A*/ DCL        VAR(&YMD8 )  TYPE(*CHAR)  LEN(8)

             CHGVAR     VAR(&DMA01S) VALUE(%SST(*LDA 601 9))
             CHGVAR     VAR(&DMA01E) VALUE(%SST(*LDA 610 9))
   /*        CHGVAR     VAR(&DMA46S) VALUE(%SST(*LDA 619 5)) */
             CHGVAR     VAR(&DMA46S) VALUE(%SST(*LDA 619 7))
             CHGVAR     VAR(&DMA46E) VALUE(%SST(*LDA 626 7))
   /*        CHGVAR     VAR(&DMA46E) VALUE(%SST(*LDA 624 5)) */
  /*M001M    CHGVAR     VAR(&EGYMD)  VALUE(%SST(*LDA 187 6)) */
  /*M001M*/  CHGVAR     VAR(&YMD8 )  VALUE(%SST(*LDA 201 8))

             OVRPRTF    FILE(MTR054P) PAGESIZE(*N 198) CPI(15)      +
                        USRDTA('產搭贈冊')
             OVRDBF     FILE(MTMAPF) SHARE(*YES)

             OVRPRTF    FILE(MTR054P) PAGESIZE(*N 198) CPI(15)   +
                        USRDTA('產搭贈冊')

             OPNQRYF    FILE((MTMAPF)) QRYSLT(' MA39 *GT ' *CAT +
               /*M001M*/  &YMD8  *CAT ' & MA41 *EQ %RANGE(' *CAT +
                          &DMA46S *CAT ' ' *CAT &DMA46E *CAT ') & +
                          MA01 *EQ %RANGE("' *CAT &DMA01S *CAT '" +
                          "' *CAT &DMA01E *CAT '") *OR MA39 *LE ' +
             /*M001M*/    *CAT &YMD8  *CAT ' & MA46 *EQ %RANGE(' +
                          *CAT &DMA46S *CAT ' ' *CAT &DMA46E *CAT +
                          ') & MA01 *EQ %RANGE("' *CAT &DMA01S *CAT +
                          '" "' *CAT &DMA01E *CAT '") ') KEYFLD((MA01))

             CALL       MTR0541

             CLOF       OPNID(MTMAPF)
             DLTOVR     FILE(MTMAPF)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MTR054P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
