/********************************************************************/
/*                                                                  */
/* Program name . . . . . . . . . . . . . . :   MTR010C           PN*/
/* Library name . . . . . . . . . . . . . . :   REPLIB            PL*/
/* Original source file . . . . . . . . . . :   QCLSRC            SN*/
/* Library name . . . . . . . . . . . . . . :   REPLIB            SL*/
/* Original source member . . . . . . . . . :   MTR010C           SM*/
/* Source file change                                               */
/*   date/time  . . . . . . . . . . . . . . :   91/08/19          SC*/
/* Patch option . . . . . . . . . . . . . . :   *NOPATCH          PO*/
/* User profile . . . . . . . . . . . . . . :   *USER             UP*/
/* Text . . . : 產品最低售價列印                           A1005TX*/
/* Owner  . . . . . . . . . . . . . . . . . :                     OW*/
/* Patch change ID  . . . . . . . . . . . . :                     PC*/
/* Patch APAR ID  . . . . . . . . . . . . . :                     PA*/
/* User mod flag  . . . . . . . . . . . . . :   *YES              UM*/
/*                                                                ED*/
/********************************************************************/
     PGM
     DCL VAR(&$EVR) TYPE(*CHAR) LEN(1)
     DCL VAR(&IN03) TYPE(*LGL) LEN(1)
     DCL VAR(&IN98) TYPE(*LGL) LEN(1)
     DCL VAR(&IN97) TYPE(*LGL) LEN(1)
     CHGVAR VAR(%SST(*LDA 162 1)) VALUE('2')
     CHGVAR VAR(%SST(*LDA 125 3)) VALUE('001')
     CHGVAR VAR(%SST(*LDA 598 2)) VALUE('00')
START: +
     CALL PGM(MTR010) PARM(&IN03 &IN98 &IN97)
     IF COND(&IN03) THEN(DO)
     CHGVAR VAR(%SST(*LDA 601 100)) VALUE(' ')
     RETURN
     ENDDO
     RTVDTAARA DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
     IF COND(&$EVR *EQ '1') THEN(DO)
     CALL PGM(MTR010C1)
     CHGVAR VAR(&IN98) VALUE('1')
     ENDDO
     ELSE CMD(DO)
     SBMJOB JOB(MTR010C1) RQSDTA('CALL MTR010C1')
     CHGVAR VAR(&IN97) VALUE('1')
     ENDDO
     GOTO CMDLBL(START)
     ENDPGM
