     /***************************************************************/
     /*   人頭馬堅匯東洋酒份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 09/07/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MTR053C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :主檔資料系統                             */
     /*    REMARK       :新增客戶一覽表                           */
     /*-------------------------------------------------------------*/
     /*    M001         : FOR Y2K MODIFY 98.11.05                   */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DMD07S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD07E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD08S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMD08E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMD01S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD01E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DME07S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME08S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME08E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME15S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DME15E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YME19S) TYPE(*CHAR) LEN(8) /*M001M */
             DCL        VAR(&YME19E) TYPE(*CHAR) LEN(8)  /* M001M */
             DCL        VAR(&DOPT) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DMD07S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DMD07E) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DMD08S) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DMD08E) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DMD01S) VALUE(%SST(*LDA 607 1))
             CHGVAR     VAR(&DMD01E) VALUE(%SST(*LDA 612 1))
             CHGVAR     VAR(&DME07S) VALUE(%SST(*LDA 621 2))
             CHGVAR     VAR(&DME07E) VALUE(%SST(*LDA 623 2))
             CHGVAR     VAR(&DME08S) VALUE(%SST(*LDA 625 2))
             CHGVAR     VAR(&DME08E) VALUE(%SST(*LDA 627 2))
             CHGVAR     VAR(&DME15S) VALUE(%SST(*LDA 629 6))
             CHGVAR     VAR(&DME15E) VALUE(%SST(*LDA 635 6))
             CHGVAR     VAR(&YME19S) VALUE(%SST(*LDA 662 8))
             CHGVAR     VAR(&YME19E) VALUE(%SST(*LDA 670 8))
             CHGVAR     VAR(&DOPT) VALUE(%SST(*LDA 641 1))

             OVRDBF     FILE(REWF33) TOFILE(MTMEPF) SHARE(*YES)

             OVRPRTF    FILE(MTR053P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('新客戶覽')

             OPNQRYF    FILE((MTMEPF) (MTMDPF)) FORMAT(REWF33) +
                          QRYSLT('MD07 *EQ %RANGE("' *CAT &DMD07S +
                          *CAT '" "' *CAT &DMD07E *CAT '") & MD08 +
                          *EQ %RANGE("' *CAT &DMD08S *CAT '" "' +
                          *CAT &DMD08E *CAT '") & ME07 *EQ +
                          %RANGE("' *CAT &DME07S *CAT '" "' *CAT +
                          &DME07E *CAT '") *AND ME08 *EQ %RANGE("' +
                          *CAT &DME08S *CAT '" "' *CAT &DME08E *CAT +
                          '") & ME15 *EQ %RANGE("' *CAT &DME15S +
                          *CAT '" "' *CAT &DME15E *CAT '") & ME20 +
                          *NE "I" & MD01 *EQ %RANGE("' *CAT &DMD01S +
                          *CAT '" "' *CAT &DMD01E *CAT '" ) & ME19A +
                          *EQ %RANGE("' *CAT &YME19S *CAT '" "' +
                          *CAT &YME19E *CAT '" ) ') KEYFLD((ME01) +
                          (MD07) (MD08)) JFLD((1/ME01 2/MD01 *EQ)) +
                          MAPFLD((ME19A ME19 *CHAR 8))

             CALL       MTR0531
             CHGVAR     VAR(&P6601I) VALUE('MTR053P')

             CLOF       OPNID(MTMEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
