     /*=============================================================*/
     /*    MODI CODE | AUTHOR |  DATE  | DESCRIPTION                */
     /*-------------------------------------------------------------*/
     /*    M001      |MICHELLE|01.02.01|增加大區域選項            */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

 /* M001A */ DCL        VAR(&D#L01S) TYPE(*CHAR) LEN(2)
 /* M001A */ DCL        VAR(&D#L01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMD07S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD07E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD08S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMD08E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME08S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME08E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME15S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DME15E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DOPT) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DMD07S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DMD07E) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DMD08S) VALUE(%SST(*LDA 611 2))
             CHGVAR     VAR(&DMD08E) VALUE(%SST(*LDA 613 2))
             CHGVAR     VAR(&DME07S) VALUE(%SST(*LDA 621 2))
             CHGVAR     VAR(&DME07E) VALUE(%SST(*LDA 623 2))
             CHGVAR     VAR(&DME08S) VALUE(%SST(*LDA 625 2))
             CHGVAR     VAR(&DME08E) VALUE(%SST(*LDA 627 2))
             CHGVAR     VAR(&DME15S) VALUE(%SST(*LDA 629 6))
             CHGVAR     VAR(&DME15E) VALUE(%SST(*LDA 635 6))
             CHGVAR     VAR(&DOPT) VALUE(%SST(*LDA 641 1))
 /* M001A */ CHGVAR     VAR(&D#L01S) VALUE(%SST(*LDA 700 2))
 /* M001A */ CHGVAR     VAR(&D#L01E) VALUE(%SST(*LDA 710 2))

             OVRDBF     FILE(REWF33) TOFILE(MTMEPF) SHARE(*YES)

             IF         COND(&DOPT = 'A') THEN(DO)

             OVRPRTF    FILE(MTR047AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('業務輪調')
             OPNQRYF    FILE((MTMEPF) (MTMDPF)) FORMAT(REWF33) +
                          QRYSLT('MD07 *EQ %RANGE("' *CAT &DMD07S +
                          *CAT '" "' *CAT &DMD07E *CAT '") *AND +
                          MD08 *EQ %RANGE("' *CAT &DMD08S *CAT '" +
                          "' *CAT &DMD08E *CAT '") *AND ME07 *EQ +
                          %RANGE("' *CAT &DME07S *CAT '" "' *CAT +
                          &DME07E *CAT '") *AND ME08 *EQ %RANGE("' +
                          *CAT &DME08S *CAT '" "' *CAT &DME08E *CAT +
                          '") *AND ME15 *EQ %RANGE("' *CAT &DME15S +
                          *CAT '" "' *CAT &DME15E *CAT '") *AND +
                          ME20 *NE "I" ') KEYFLD((ME15) (MD07) +
                          (MD08) (ME07) (ME08) (ME01) (ME02)) +
                          JFLD((1/ME01 2/MD01 *EQ))

             CALL       MTR0471
             CHGVAR     VAR(&P6601I) VALUE('MTR047AP')
             ENDDO

             IF         COND(&DOPT = 'B') THEN(DO)

             OVRPRTF    FILE(MTR047BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('業務輪調')
             OPNQRYF    FILE((MTMEPF) (MTMDPF)) FORMAT(REWF33) +
                          QRYSLT('MD07 *EQ %RANGE("' *CAT &DMD07S +
                          *CAT '" "' *CAT &DMD07E *CAT '") *AND +
                          MD08 *EQ %RANGE("' *CAT &DMD08S *CAT '" +
                          "' *CAT &DMD08E *CAT '") *AND ME07 *EQ +
                          %RANGE("' *CAT &DME07S *CAT '" "' *CAT +
                          &DME07E *CAT '") *AND ME08 *EQ %RANGE("' +
                          *CAT &DME08S *CAT '" "' *CAT &DME08E *CAT +
                          '") *AND ME15 *EQ %RANGE("' *CAT &DME15S +
                          *CAT '" "' *CAT &DME15E *CAT '") *AND +
                          ME20 *NE "I" ') KEYFLD((MD07) (MD08) +
                          (ME07) (ME08) (ME15) (ME01) (ME02)) +
                          JFLD((1/ME01 2/MD01 *EQ))

             CALL       MTR0472
             CHGVAR     VAR(&P6601I) VALUE('MTR047BP')
             ENDDO

             IF         COND(&DOPT = 'C') THEN(DO)

             OVRPRTF    FILE(MTR047CP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('業務輪調')
             OPNQRYF    FILE((MTMEPF) (MTMDPF)) FORMAT(REWF33) +
                          QRYSLT('MD07 *EQ %RANGE("' *CAT &DMD07S +
                          *CAT '" "' *CAT &DMD07E *CAT '") *AND +
                          MD08 *EQ %RANGE("' *CAT &DMD08S *CAT '" +
                          "' *CAT &DMD08E *CAT '") *AND ME07 *EQ +
                          %RANGE("' *CAT &DME07S *CAT '" "' *CAT +
                          &DME07E *CAT '") *AND ME08 *EQ %RANGE("' +
                          *CAT &DME08S *CAT '" "' *CAT &DME08E *CAT +
                          '") *AND ME15 *EQ %RANGE("' *CAT &DME15S +
                          *CAT '" "' *CAT &DME15E *CAT '") *AND +
                          ME20 *NE "I" ') KEYFLD((ME07) (ME08) +
                          (MD07) (MD08) (ME15) (ME01) (ME02)) +
                          JFLD((1/ME01 2/MD01 *EQ))

             CALL       MTR0473
             CHGVAR     VAR(&P6601I) VALUE('MTR047CP')
             ENDDO

             CLOF       OPNID(MTMEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
