     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/01/25                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : MTR046C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :主檔                                     */
     /*    REMARK       :禮盒結構資料清冊                         */
     /***************************************************************/
             PGM
             DCL        VAR(&DMF01S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DMF01E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)


             CHGVAR     VAR(&DMF01S) VALUE(%SST(*LDA 601 9))
             CHGVAR     VAR(&DMF01E) VALUE(%SST(*LDA 610 9))

             OVRPRTF    FILE(MTR046P) PAGESIZE(*N 157) CPI(12) +
                        USRDTA('禮盒結構')
             OVRDBF     FILE(MTMFPF)  SHARE(*YES)


             OPNQRYF    FILE((MTMFPF)) QRYSLT(' MF01 *EQ %RANGE("' +
                          *CAT &DMF01S *CAT '" "' *CAT &DMF01E *CAT +
                          '")') KEYFLD((MF01) (MF02))

             CALL       MTR0461

             CLOF       OPNID(MTMFPF)
             DLTOVR     FILE(MTMFPF)
             DLTOVR     FILE(MTR046P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('MTR046P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
