
/* M003 MICHELLE 00.12.19新增銷售大區域 */
/* M004 MICHELLE 01.03.15新增地理區 */
/* M005 MICHELLE 01.05.29新增新產品種類代碼維護*/

             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/PAM000D) RCDFMT(DSPC1)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')
             IF         COND(&IN03 *EQ '1') THEN(RETURN)

             IF         COND(&DOPID *EQ '01') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA001')
             ENDDO
             IF         COND(&DOPID *EQ '02') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('CENTER')
             ENDDO
             IF         COND(&DOPID *EQ '03') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('STORAGE')
             ENDDO
             IF         COND(&DOPID *EQ '11') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('ID')
             ENDDO
             IF         COND(&DOPID *EQ '12') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('GROUP')
             ENDDO
             IF         COND(&DOPID *EQ '13') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('BRAND')
             ENDDO
             IF         COND(&DOPID *EQ '14') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('SIZE')
             ENDDO
             IF         COND(&DOPID *EQ '15') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA007')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('STANDARD')
      /*                  CHGVAR VAR(&S0102I) VALUE('PAA006')        */
             ENDDO
             IF         COND(&DOPID *EQ '16') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
             CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('SHOPDEPT')
             ENDDO
             IF         COND(&DOPID *EQ '17') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA013')
             CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('DEPTCOST')
             ENDDO
             IF         COND(&DOPID *EQ '04') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA010')
             CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('DEPTBRAN')
             ENDDO
             IF         COND(&DOPID *EQ '21') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('CURRENCY')
             ENDDO
             IF         COND(&DOPID *EQ '22') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('PAYMENT')
             ENDDO
             IF         COND(&DOPID *EQ '23') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('PRICE')
             ENDDO
             IF         COND(&DOPID *EQ '24') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('DELIVERY')
             ENDDO
             IF         COND(&DOPID *EQ '31') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('DISTRUBT')
             ENDDO
             IF         COND(&DOPID *EQ '32') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA003')
             ENDDO
             IF         COND(&DOPID *EQ '33') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA004')
             ENDDO
             IF         COND(&DOPID *EQ '34') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA005')
             ENDDO
             IF         COND(&DOPID *EQ '35') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('CUSTGRP')
             ENDDO
             IF         COND(&DOPID *EQ '40') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('STOCK')
             ENDDO
             IF         COND(&DOPID *EQ '41') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA012')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('STOCKA&P')
             ENDDO
             IF         COND(&DOPID *EQ '42') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('RETURN')
             ENDDO
             IF         COND(&DOPID *EQ '43') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('ADJUST')
             ENDDO
             IF         COND(&DOPID *EQ '44') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('PAYDIS')
             ENDDO
             IF         COND(&DOPID *EQ '45') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA011')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('EMPLDEPT')
             ENDDO
             IF         COND(&DOPID *EQ '46') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA019')
             ENDDO
             IF         COND(&DOPID *EQ '47') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA020')
             ENDDO
             IF         COND(&DOPID *EQ '51') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('COLLECT')
             ENDDO
             IF         COND(&DOPID *EQ '52') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('INTERCOM')
             ENDDO
             IF         COND(&DOPID *EQ '53') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('NOACCT')
             ENDDO
             IF         COND(&DOPID *EQ '54') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA002')
                          CHGDTAARA  DTAARA(*LDA (514 8)) VALUE('MANVOID')
             ENDDO
/* M003A */  IF         COND(&DOPID *EQ '36') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA014')
             ENDDO
/* M003A */  IF         COND(&DOPID *EQ '37') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA015')
             ENDDO
/* M004A */  IF         COND(&DOPID *EQ '38') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA016')
             ENDDO
/* M004A */  IF         COND(&DOPID *EQ '39') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA017')
             ENDDO
/* M005A */  IF         COND(&DOPID *EQ '18') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PAA018')
             ENDDO
             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

             ENDPGM
