     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1005   ROGER CHIEN                       */
     /*    CREATE DATE  : 80/11/20                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : PAR0011                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :基本資料子系統                           */
     /*    REMARK       :公司別資料列印                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&D#B01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&D#B01E) TYPE(*CHAR) LEN(2)

             CHGVAR     VAR(&D#B01S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&D#B01E) VALUE(%SST(*LDA 603 2))

             OVRPRTF    FILE(PAR001P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('公司資料')
             OVRDBF     FILE(PA#BPF) SHARE(*YES)

             OPNQRYF    FILE((PA#BPF)) QRYSLT('#B01  *EQ %RANGE("' +
                          *CAT &D#B01S *CAT '" "' *CAT &D#B01E *CAT +
                          '") ') KEYFLD((#B01))

             CALL       PAR0011

             CLOF       OPNID(PA#BPF)
             DLTOVR     FILE(PA#BPF)
             DLTOVR     FILE(PAR001P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('PAR001P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
