     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1005   ROGER CHIEN                       */
     /*    CREATE DATE  : 80/11/20                                  */
     /*    UPDATE DATE  : 81/01/14 BY STEPHANIE                     */
     /*    PROGRAM NAME : PAR0031                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :基本資料子系統                           */
     /*    REMARK       :銷售通路型態碼資料列印                  */
     /***************************************************************/
             PGM
             DCL        VAR(&D#C01S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&D#C01E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             CHGVAR     VAR(&D#C01S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&D#C01E) VALUE(%SST(*LDA 602 1))

      /*     OVRPRTF    FILE(PAR003P) PAGESIZE(*N 198) CPI(15)   */
             OVRPRTF    FILE(PAR003P) USRDTA('通路資料')
             OVRDBF     FILE(PA#CPF) SHARE(*YES)

             OPNQRYF    FILE((PA#CPF)) QRYSLT('#C01  *EQ %RANGE("' +
                          *CAT &D#C01S *CAT '" "' *CAT &D#C01E *CAT +
                          '") ') KEYFLD((#C01) (#C02))

             CALL       PAR0031

             CLOF       OPNID(PA#CPF)
             DLTOVR     FILE(PA#CPF)
             DLTOVR     FILE(PAR003P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('PAR003P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
