     /***************************************************************/
     /*                                                             */
     /*    AUTHOR       : MICHELLE                                  */
     /*    CREATE DATE  : 91/08/21                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : PAR020C1                                  */
     /*    SYSTEM       :人頭馬寰盛                               */
     /*    SUBSYSTEM    :基本資料子系統                           */
     /*    REMARK       :試飲ＡＭＰ對照資料列印                   */
     /***************************************************************/
             PGM
             DCL        VAR(&D#P01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&D#P01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             CHGVAR     VAR(&D#P01S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&D#P01E) VALUE(%SST(*LDA 603 2))

             OVRPRTF    FILE(PAR020P) USRDTA('試飲ＡＰ')
             OVRDBF     FILE(PA#PPF) SHARE(*YES)

             OPNQRYF    FILE((PA#PPF)) QRYSLT('#P01  *EQ %RANGE("' +
                          *CAT &D#P01S *CAT '" "' *CAT &D#P01E *CAT +
                          '") ') KEYFLD((#P01) )

             CALL       PAR0201

             CLOF       OPNID(PA#PPF)
             DLTOVR     FILE(PA#PPF)
             DLTOVR     FILE(PAR020P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('PAR020P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
