     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : 910070 JUDY LEE                           */
     /*    CREATE DATE  : 06/09/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : PAR0071                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :基本資料子系統                           */
     /*    REMARK       :代碼資料列印－數字                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&$#101)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&D#H02S) TYPE(*CHAR) LEN(10)
             DCL        VAR(&D#H02E) TYPE(*CHAR) LEN(10)

             CHGVAR     VAR(&$#101)  VALUE(%SST(*LDA 514 8))
             CHGVAR     VAR(&D#H02S) VALUE(%SST(*LDA 601 10))
             CHGVAR     VAR(&D#H02E) VALUE(%SST(*LDA 611 10))

             OVRPRTF    FILE(PAR007P) PAGESIZE(*N 132) CPI(10)  +
                        USRDTA('代碼資料')
             OVRDBF     FILE(PA#HPF) SHARE(*YES)

             OPNQRYF    FILE((PA#HPF)) QRYSLT(' #H01 *EQ ("' *CAT +
                          &$#101 *CAT '") & #H02  *EQ %RANGE("' +
                          *CAT &D#H02S *CAT '" "' *CAT &D#H02E *CAT +
                          '") ') KEYFLD(*FILE)

             CALL       PAR0071

             CLOF       OPNID(PA#HPF)
             DLTOVR     FILE(PA#HPF)
             DLTOVR     FILE(PAR007P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('PAR007P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
