             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DIU03S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DIU03E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DATES) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATEE) TYPE(*CHAR) LEN(8)

 START:      CALL       PGM(PIB004) PARM(&IN03 &IN14 &IN98 )
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DIU03S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DIU03E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 611 8))
             CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 619 8))

             OVRDBF     FILE(IMIUPF) SHARE(*YES)
             OPNQRYF    FILE((IMIUPF)) OPTION(*ALL) QRYSLT(' IU03 +
                          *EQ %RANGE("' *CAT &DIU03S *CAT '"  "' +
                          *CAT &DIU03E *CAT '") & MIU04 *EQ +
                          %RANGE("' *CAT &DATES *CAT '" "' *CAT +
                          &DATEE *CAT '")') KEYFLD(*FILE) +
                          MAPFLD((MIU04 IU04 *CHAR 8))

             CALL       PGM(PIB0041)
                        CHGVAR     VAR(&IN98)  VALUE('1')

             CLOF       OPNID(IMIUPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
