             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DPH05S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DPH05E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DATES) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATEE) TYPE(*CHAR) LEN(8)

 START:      CALL       PGM(PIB006) PARM(&IN03 &IN14 &IN98 )
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DPH05S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DPH05E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 611 8))
             CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 619 8))

             OVRDBF     FILE(POPHPF) SHARE(*YES)
             OPNQRYF    FILE((POPHPF)) QRYSLT(' PH05 *EQ %RANGE("' +
                          *CAT &DPH05S *CAT '"  "' *CAT &DPH05E +
                          *CAT '") & PH04 *EQ %RANGE(' *CAT &DATES +
                          *CAT ' ' *CAT &DATEE *CAT ') & PH06 *NE +
                          "LR000" ')

             CALL       PGM(PIB0061)
                        CHGVAR     VAR(&IN98)  VALUE('1')

             CLOF       OPNID(POPHPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
