     /* M001 : NO USE  990810  */

             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/PIM000D) RCDFMT(DSPC1)
             CALL       PGM(P63)
             SETATNPGM  PGM(REPLIB/ATN01)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDPGM))

             IF         COND(&DOPID *EQ '01') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIA001')
             ENDDO
             IF         COND(&DOPID *EQ '02') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIA002')
             ENDDO
             IF         COND(&DOPID *EQ '03') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIA003')
             ENDDO
             IF         COND(&DOPID *EQ '04') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIA004C')
             ENDDO
             IF         COND(&DOPID *EQ '05') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIA005')
             ENDDO
             IF         COND(&DOPID *EQ '06') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIB001')
             ENDDO
 /*M001D     IF         COND(&DOPID *EQ '07') THEN(DO)  +
                          CHGVAR VAR(&S0102I) VALUE('PIB002C') +
             ENDDO                                         +
             IF         COND(&DOPID *EQ '08') THEN(DO)     +
                          CHGVAR VAR(&S0102I) VALUE('PIB003C') +
             ENDDO                                            +
             IF         COND(&DOPID *EQ '09') THEN(DO)      +
                          CHGVAR VAR(&S0102I) VALUE('PIB004C') +
             ENDDO                                            +
             IF         COND(&DOPID *EQ '10') THEN(DO)     +
                          CHGVAR VAR(&S0102I) VALUE('PIB006C')+
             ENDDO                                        */
             IF         COND(&DOPID *EQ '21') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PII021')
             ENDDO
             IF         COND(&DOPID *EQ '22') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PII022')
             ENDDO
             IF         COND(&DOPID *EQ '23') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PII023')
             ENDDO
             IF         COND(&DOPID *EQ '41') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIR041C')
             ENDDO
             IF         COND(&DOPID *EQ '42') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIR042C')
             ENDDO
             IF         COND(&DOPID *EQ '43') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIR043C')
             ENDDO
             IF         COND(&DOPID *EQ '44') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIR044C')
             ENDDO
             IF         COND(&DOPID *EQ '45') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIR045C')
             ENDDO
             IF         COND(&DOPID *EQ '46') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIR046C')
             ENDDO
             IF         COND(&DOPID *EQ '47') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('IMR078C')
             ENDDO
             IF         COND(&DOPID *EQ '48') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('IMR080C')
             ENDDO
             IF         COND(&DOPID *EQ '49') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIR047C')
             ENDDO
             IF         COND(&DOPID *EQ '50') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PIR048C')
             ENDDO
             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             IF         COND(&DOPID *EQ '90') THEN(DO)
                        SIGNOFF
             ENDDO
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

  ENDPGM:    ENDPGM
