     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : TEDDY                                     */
     /*    CREATE DATE  : 85/02/05                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : PIR0481                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :盤點資料子系統                           */
     /*    REMARK       :年終庫存物流彙總表                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&IY15E)  TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&XIY15)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&DIY03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DIY03E) TYPE(*CHAR) LEN(9)

             CHGVAR     VAR(&IY15E)  VALUE(%SST(*LDA 605 4))
/*M001A*/    CHGVAR     VAR(&XIY15)  VALUE(%SST(*LDA 660 6))
             CHGVAR     VAR(&DIY03S) VALUE(%SST(*LDA 621 9))
             CHGVAR     VAR(&DIY03E) VALUE(%SST(*LDA 631 9))

             CPYF       FROMFILE(REFLIB/REWFC3) TOFILE(QTEMP/REWFC3) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFC3))
             OVRDBF     FILE(REWFC3) TOFILE(QTEMP/REWFC3) SHARE(*YES)

             OVRPRTF    FILE(PIR048P) USRDTA('庫存彙總')
             OVRDBF     FILE(IMIYPF) SHARE(*YES)

             OPNQRYF    FILE((IMIYPF)) QRYSLT(' IY03 *EQ %RANGE("' +
                          *CAT &DIY03S *CAT '" "' *CAT &DIY03E *CAT +
              /*M001M*/   '") & IY15 *EQ ' *CAT &XIY15 *CAT ' ') +
                          KEYFLD(*FILE)

             CALL       PIR0481
             CALL       PIR0482

             CLOF       OPNID(IMIYPF)
             DLTOVR     FILE(IMIYPF)
             DLTOVR     FILE(PIR048P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('PIR048P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
