     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1118   PHILIP TSAI                       */
     /*    CREATE DATE  : 81/01/14                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : POA061 POA0611                            */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :採購資料子系統                           */
     /*    REMARK       :採購資料轉歷史檔案                       */
     /***************************************************************/
             PGM

             DCL        VAR(&WPBXX) TYPE(*CHAR) LEN(6)
/*M001M*/    DCL        VAR(&W8   ) TYPE(*CHAR) LEN(8)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(POA061) PARM(&IN03 &IN14 &IN97)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&WPBXX) VALUE(%SST(*LDA 601 6))
/*M001A*/    CHGVAR     VAR(&W8   ) VALUE(%SST(*LDA 610 8))
             OVRDBF     FILE(POPBPF) SHARE(*YES)

             OPNQRYF    FILE((POPBPF)) OPTION(*ALL) QRYSLT(' PBXX +
                          *LE (' *CAT &W8    *CAT ') & PB19 *EQ +
                          ("V") ') KEYFLD((*FILE))

                        CALL       PGM(POA0611)

                        CHGVAR     VAR(&IN97)  VALUE('1')
             CLOF       OPNID(POPBPF)
             DLTOVR     FILE(POPBPF)

             ENDDO

             GOTO       START
             ENDPGM
