             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/POM001D) RCDFMT(DSPC1)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')
             IF         COND(&IN03 *EQ '1') THEN(RETURN)

             IF         COND(&DOPID *EQ '41') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR041C')
             ENDDO
             IF         COND(&DOPID *EQ '42') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR042C')
             ENDDO
             IF         COND(&DOPID *EQ '43') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR043C')
             ENDDO
             IF         COND(&DOPID *EQ '44') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR044C')
             ENDDO
             IF         COND(&DOPID *EQ '45') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR045C')
             ENDDO
             IF         COND(&DOPID *EQ '46') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR047C')
             ENDDO
             IF         COND(&DOPID *EQ '47') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR048C')
             ENDDO
             IF         COND(&DOPID *EQ '48') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR049C')
             ENDDO
             IF         COND(&DOPID *EQ '49') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR050C')
             ENDDO
             IF         COND(&DOPID *EQ '50') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR051C')
             ENDDO
             IF         COND(&DOPID *EQ '51') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR052C')
             ENDDO
             IF         COND(&DOPID *EQ '52') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR053C')
             ENDDO
             IF         COND(&DOPID *EQ '53') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR054C')
             ENDDO
             IF         COND(&DOPID *EQ '54') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR055C')
             ENDDO
             IF         COND(&DOPID *EQ '55') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR056C')
             ENDDO
             IF         COND(&DOPID *EQ '56') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR057C')
             ENDDO
             IF         COND(&DOPID *EQ '57') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR058C')
             ENDDO
             IF         COND(&DOPID *EQ '58') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR059C')
             ENDDO
             IF         COND(&DOPID *EQ '59') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR060C')
             ENDDO
             IF         COND(&DOPID *EQ '60') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR061C')
             ENDDO
             IF         COND(&DOPID *EQ '61') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR062C')
             ENDDO
             IF         COND(&DOPID *EQ '62') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('POR065C')
             ENDDO
             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

             ENDPGM
