     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : ANDY                                      */
     /*    CREATE DATE  : 81/07/08                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : POR050C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :採購系統                                 */
     /*    REMARK       :驗收單明細表                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DPI01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DDOC)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMA01S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DMA01E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DATA)   TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DMA01S) VALUE(%SST(*LDA 601 9))
             CHGVAR     VAR(&DMA01E) VALUE(%SST(*LDA 611 9))
             CHGVAR     VAR(&DATA)   VALUE(%SST(*LDA 621 1))

             OVRDBF     FILE(MTMAPF) SHARE(*YES)
             OVRPRTF    FILE(MTMAPF) USRDTA('低安全量')

             IF         COND(&DATA *EQ 'A') THEN(DO)
             OPNQRYF    FILE((MTMAPF)) QRYSLT(' +
                          (MA01 *EQ %RANGE("' *CAT &DMA01S +
                          *CAT '" "' *CAT &DMA01E *CAT '")) +
                          ') KEYFLD((MA01))
                        ENDDO
             ELSE
             IF         COND(&DATA *EQ 'B') THEN(DO)
             OPNQRYF    FILE((MTMAPF)) QRYSLT(' +
                          (MA01 *EQ %RANGE("' *CAT &DMA01S +
                          *CAT '" "' *CAT &DMA01E *CAT '")) +
                          & MA290 *LT (' *CAT MA378 *CAT ')') +
                          KEYFLD((MA01)) MAPFLD((MA290 'MA29+MA30' +
                          *DEC 6 0) (MA378 'MA37+MA38' *DEC 6 0))
                        ENDDO

             CALL       PGM(POR0511)

             CLOF       OPNID(MTMAPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE('POR051P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
