     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1005   ROGER CHIEN                       */
     /*    CREATE DATE  : 80/11/20                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : POR0491                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :基本資料子系統                           */
     /*    REMARK       :公司別資料列印                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DBGN1) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DEND1) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPB05S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DPB05E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DDATES) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&DDATEE) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&DPB19) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DBGN1) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DEND1) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DPB05S) VALUE(%SST(*LDA 655 5))
             CHGVAR     VAR(&DPB05E) VALUE(%SST(*LDA 660 5))
             CHGVAR     VAR(&DDATES) VALUE(%SST(*LDA 631 8)) /*M001M*/
             CHGVAR     VAR(&DDATEE) VALUE(%SST(*LDA 639 8)) /*M001M*/
             CHGVAR     VAR(&DPB19) VALUE(%SST(*LDA 699 1))

             OVRPRTF    FILE(POR049P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('外採ETD')
             OVRDBF     FILE(POPBPF) SHARE(*YES)

             IF         COND(&DPB19 = "Y") THEN(DO)
             OPNQRYF    FILE((POPBPF)) QRYSLT('(PB03 *EQ "P1") *AND +
                          (PB01 *EQ %RANGE("' *CAT &DBGN1 *CAT '" +
                          "' *CAT &DEND1 *CAT '")) & ( PB05 *EQ +
                          %RANGE("' *CAT &DPB05S *CAT '" "' *CAT +
                          &DPB05E *CAT '")) *AND (MPB14 *EQ +
                          %RANGE("' *CAT &DDATES *CAT '" "' *CAT +
                          &DDATEE *CAT '"))') KEYFLD((PB01) (PB02)) +
                          MAPFLD((MPB14 PB14 *CHAR 8)) /*M001M*/
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((POPBPF)) QRYSLT('(PB19 *NE "V") & +
                          (PB03 *EQ "P1") *AND (PB01 *EQ %RANGE("' +
                          *CAT &DBGN1 *CAT '" "' *CAT &DEND1 *CAT +
                          '")) & (PB05 *EQ %RANGE("' *CAT &DPB05S +
                          *CAT '" "' *CAT &DPB05E *CAT '")) *AND +
                          (MPB14 *EQ %RANGE("' *CAT &DDATES *CAT '" +
                          "' *CAT &DDATEE *CAT '"))') KEYFLD((PB01) +
                          (PB02)) MAPFLD((MPB14 PB14 *CHAR 8)) /*M001*/
             ENDDO
             CALL       POR0491

             CLOF       OPNID(POPBPF)
             DLTOVR     FILE(POPBPF)
             DLTOVR     FILE(POR049P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('POR049P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
