     /***************************************************************/
     /*   人頭馬堅匯東洋酒份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 09/08/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : POR065C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :庫存資料系統                             */
     /*    REMARK       :建議產品採購表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DMA01S)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DMA01E)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DYM)     TYPE(*CHAR) LEN(4)
             DCL        VAR(&EYM)     TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DMA01S)  VALUE(%SST(*LDA 601 9))
             CHGVAR     VAR(&DMA01E)  VALUE(%SST(*LDA 611 9))
/*END YM*/   CHGVAR     VAR(&DYM)     VALUE(%SST(*LDA 623 4))
/*START YM*/ CHGVAR     VAR(&EYM)     VALUE(%SST(*LDA 627 4))
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 6))

             CPYF       FROMFILE(REWFC7) TOFILE(QTEMP/REWFC7) +
                          CRTFILE(*YES)

             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFC7))
             OVRDBF     FILE(REWFC7) TOFILE(QTEMP/REWFC7) SHARE(*YES)

             OVRPRTF    FILE(POR065P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('建議採購')
             OVRDBF     FILE(MTMAPF) SHARE(*YES)
             OVRDBF     FILE(SOCDPF) SHARE(*YES)
             OVRDBF     FILE(POPCPF) SHARE(*YES)

             OPNQRYF    FILE((MTMAPF)) QRYSLT(' MA01 *EQ %RANGE("' +
                          *CAT &DMA01S *CAT '" "' *CAT &DMA01E *CAT +
                          '") ') KEYFLD(*FILE)

             OPNQRYF    FILE((SOCDPF)) QRYSLT(' CD03a *EQ "R" & CD01 +
                        *EQ %RANGE(' *CAT &YMD8S *CAT ' ' *CAT &YMD8E +
                          *CAT ') & CD04 *EQ %RANGE("' *CAT &DMA01S +
                          *CAT '" "' *CAT &DMA01E *CAT '")  +
                          ') KEYFLD(*FILE) MAPFLD((CD03A +
                          '%sst(cd03 1 1)' *CHAR 1))
/*M001D               *EQ %RANGE(' *CAT &EYM *CAT ' ' *CAT &DYM +  */

             OPNQRYF    FILE((POPCPF)) QRYSLT(' PC01A *EQ "R" & PC03 +
                          *EQ %RANGE("' *CAT &DMA01S *CAT '" "' +
                          *CAT &DMA01E *CAT '") & PC12 *EQ " " ') +
                          KEYFLD((PC03)) MAPFLD((PC01A '%SST(pc01 1 +
                          1)' *CHAR 1))


             CALL       POR0651
             CALL       POR0652


             CLOF       OPNID(MTMAPF)
             CLOF       OPNID(SOCDPF)
             CLOF       OPNID(POPCPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('POR065P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
