     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : TINA                                      */
     /*    CREATE DATE  : 82/12/05                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : POR059C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :採購分析系統                             */
     /*    REMARK       :國外到貨統計年報                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DPD01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPD01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPD07S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DPD07E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DPE04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DPE04E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&YYMMS) TYPE(*CHAR) LEN(4)
             DCL        VAR(&YYMME) TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(6)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 6))
             CHGVAR     VAR(&DPD01S) VALUE(%SST(*LDA 600 2))
             CHGVAR     VAR(&DPD01E) VALUE(%SST(*LDA 602 2))
             CHGVAR     VAR(&DPD07S) VALUE(%SST(*LDA 610 5))
             CHGVAR     VAR(&DPD07E) VALUE(%SST(*LDA 615 5))
             CHGVAR     VAR(&DPE04S) VALUE(%SST(*LDA 620 9))
             CHGVAR     VAR(&DPE04E) VALUE(%SST(*LDA 630 9))
             CHGVAR     VAR(&YYMMS) VALUE(%SST(*LDA 650 4))
             CHGVAR     VAR(&YYMME) VALUE(%SST(*LDA 654 4))

             CPYF       FROMFILE(REWF02) TOFILE(QTEMP/REWF02) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF02))
             OVRDBF     FILE(REWF02) TOFILE(QTEMP/REWF02) SHARE(*YES)

             OVRPRTF    FILE(POR059P) PAGESIZE(*N 198) CPI(15)  +
                        USRDTA('到貨年統')
             OVRDBF     FILE(POPDPF) SHARE(*YES)

             OPNQRYF    FILE((POPDPF)) QRYSLT(' PD01 *EQ %RANGE("' +
                          *CAT &DPD01S *CAT '" "' *CAT &DPD01E *CAT +
/*M001A*/                 '") & MPD04 *EQ %RANGE("' *CAT &YMD8S +
/*M001A*/                 *CAT '" "' *CAT &YMD8E *CAT '") & PD07 +
                          *EQ %RANGE("' *CAT &DPD07S *CAT '" "' +
                          *CAT &DPD07E *CAT '")') KEYFLD((PD01) +
/*M001A*/                 (PD07)) MAPFLD((CPD04 PD04 *CHAR 8) +
/*M001A*/                 (MPD04 '%SST(Cpd04 1 6)' *CHAR 6))
/*M001D                   '") & MPD04 *EQ %RANGE("' *CAT &YYMMS +
                          *CAT '" "' *CAT &YYMME *CAT '") & PD07 +  */
/*M001D                   (PD07)) MAPFLD((CPD04 PD04 *CHAR 6) +
                          (MPD04 '%SST(Cpd04 1 4)' *CHAR 4))   */

             CALL       POR0591
             CALL       POR0592

             CLOF       OPNID(POPDPF)
             DLTOVR     FILE(*ALL)



             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('POR059P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
