     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : TINA                                      */
     /*    CREATE DATE  : 82/05/11                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : POR0541                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :採購子系統                               */
     /*    REMARK       :供應商採購完稅彙總表                     */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&DMA12S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DMA12E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DATE1) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATE2) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DPG03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DPG03E) TYPE(*CHAR) LEN(9)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CPYF       FROMFILE(REFLIB/REWF72) TOFILE(QTEMP/REWF72) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF72))
             OVRDBF     FILE(REWF72) TOFILE(QTEMP/REWF72) SHARE(*YES)

             CHGVAR     VAR(&DMA12S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DMA12E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&DPG03S) VALUE(%SST(*LDA 627 9))
             CHGVAR     VAR(&DPG03E) VALUE(%SST(*LDA 636 9))
             CHGVAR     VAR(&DATE1) VALUE(%SST(*LDA 648 6))
             CHGVAR     VAR(&DATE2) VALUE(%SST(*LDA 654 6))

             OVRPRTF    FILE(POR054P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('完稅彙總')
             OVRDBF     FILE(POPGPF) SHARE(*YES)

             OPNQRYF    FILE((POPGPF)) QRYSLT('(PG04 *EQ %RANGE(' +
                          *CAT &YMD8S *CAT ' ' *CAT &YMD8E *CAT ')) +
                          *AND (PG03 *EQ %RANGE("' *CAT &DPG03S +
                          *CAT '" "' *CAT &DPG03E *CAT '"))')
/*M001D               *CAT &DATE1 *CAT ' ' *CAT &DATE2 *CAT ')) +  */


             CALL       POR0541
             CALL       POR0542

             CLOF       OPNID(POPGPF)
             DLTOVR     FILE(POPGPF)
             DLTOVR     FILE(POR054P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('POR054P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
