     /***************************************************************/
     /*   人頭馬堅匯東洋酒份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 10/26/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : POR058C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :採購資料系統                             */
     /*    REMARK       :國內供應商進貨明細表                     */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DPH06S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DPH06E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&YPH04S) TYPE(*CHAR) LEN(6) /*M001M*/
             DCL        VAR(&YPH04E) TYPE(*CHAR) LEN(6) /*M001M*/
             DCL        VAR(&DPH05S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DPH05E) TYPE(*CHAR) LEN(5)

             CPYF       FROMFILE(REFLIB/REWF91) TOFILE(QTEMP/REWF91) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF91))
             OVRDBF     FILE(REWF91) TOFILE(QTEMP/REWF91) SHARE(*YES)

             CHGVAR     VAR(&DPH06S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DPH06E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&DPH05S) VALUE(%SST(*LDA 630 5))
             CHGVAR     VAR(&DPH05E) VALUE(%SST(*LDA 635 5))
             CHGVAR     VAR(&YPH04S) VALUE(%SST(*LDA 660 6)) /*M001M*/
             CHGVAR     VAR(&YPH04E) VALUE(%SST(*LDA 666 6)) /*M001M*/

             OVRPRTF    FILE(POR058P) USRDTA('供進貨明')
             OVRDBF     FILE(POPHPF) SHARE(*YES)

             OPNQRYF    FILE((POPHPF)) QRYSLT(' PH04A *EQ %RANGE("' +
                          *CAT &YPH04S *CAT '" "' *CAT &YPH04E *CAT +
                          '") & PH05 *EQ %RANGE("' *CAT &DPH05S +
                          *CAT '" "' *CAT &DPH05E *CAT '") & PH06 +
                          *EQ %RANGE("' *CAT &DPH06S *CAT '" "' +
                          *CAT &DPH06E *CAT '") ') MAPFLD((PH041 +
                          PH04 *CHAR 8) (PH04A '%SST(PH041 1 6)' +
                          *CHAR 6)) /*M001M*/


             CALL       POR0581
             CALL       POR0582

             CLOF       OPNID(POPHPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('POR058P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
