     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/01/21                                  */
     /*    UPDATE DATE  : 81/01/22                                  */
     /*    PROGRAM NAME : POR042C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :採購系統                                 */
     /*    REMARK       :供應商報價明細表列印                     */
     /***************************************************************/
             PGM
             DCL        VAR(&DPA03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DPA03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)


             CHGVAR     VAR(&DPA03S) VALUE(%SST(*LDA 601 9))
             CHGVAR     VAR(&DPA03E) VALUE(%SST(*LDA 610 9))

             OVRPRTF    FILE(POR044P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('供報價逾')
             OVRDBF     FILE(POPAPF) SHARE(*YES)


             OPNQRYF    FILE((POPAPF)) QRYSLT(' PA03 *EQ %RANGE("' +
                          *CAT &DPA03S *CAT '" "' *CAT &DPA03E *CAT +
                          '") ') KEYFLD((PA03) (PA01) (PA06))

             CALL       POR0441

             CLOF       OPNID(POPAPF)
             DLTOVR     FILE(POPAPF)
             DLTOVR     FILE(POR044P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('POR044P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
