             PGM        PARM(&POI02I)

             DCL        VAR(&S1) TYPE(*CHAR) LEN(6)
             DCL        VAR(&S2) TYPE(*CHAR) LEN(6)
             DCL        VAR(&POI02I) TYPE(*CHAR) LEN(5)
             RTVDTAARA  DTAARA(*LDA (510 6)) RTNVAR(&S1)
             RTVDTAARA  DTAARA(*LDA (520 6)) RTNVAR(&S2)

             OVRDBF     FILE(W2BAPF) SHARE(*YES)
             OPNQRYF    FILE((W2BAPF)) OPTION(*ALL) QRYSLT('       +
                        DBA01 = %RANGE("' || &S1 || '"             +
                                       "' || &S2 || '")            +
                        & BA05 = "P" & BA06 = "A1"                 +
                        ') KEYFLD(*FILE)                           +
                        MAPFLD((SBA01 BA01 *CHAR 8)    +
                        (DBA01 '%SST(SBA01 1 6)' *CHAR 6))

             OVRDBF     FILE(W2BBPF) SHARE(*YES)
             OPNQRYF    FILE((W2BBPF)) OPTION(*ALL) QRYSLT('       +
                        BB09 = "P"                                 +
                        ') KEYFLD(*FILE)

             CLRPFM     FILE(POR997WF)

             CALL       PGM(POR9971) PARM(&POI02I)

             CLOF       OPNID(W2BAPF)
             CLOF       OPNID(W2BBPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
