             PGM        PARM(&PGMNAM &PGMTXT)
             DCL        VAR(&PGMNAM) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGMTXT) TYPE(*CHAR) LEN(50)
 /*   */
             RTVOBJD    OBJ(&PGMNAM) OBJTYPE(*PGM) TEXT(&PGMTXT)
             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(END))
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) +
                          MSGDTA('此OBJ: ' *CAT &PGMNAM *CAT +
                          '正在處理') TOPGMQ(*EXT) +
                          MSGTYPE(*STATUS)

 END:        RETURN
