     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : ANDY                                      */
     /*    CREATE DATE  : 81/06/29                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : S#CP01C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :                                           */
     /*    REMARK       :                                           */
     /***************************************************************/
             PGM        PARM(&DBGN1 &DBGN2)
             DCL        VAR(&DBGN1)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&DBGN2)   TYPE(*CHAR) LEN(10)

             OVRDBF     FILE(S#SDPF) SHARE(*YES)

             OPNQRYF    FILE((S#SDPF)) OPTION(*ALL) QRYSLT('(SD02 +
                          *EQ "' *CAT &DBGN2 *CAT '" )') +
                          KEYFLD((SD01) (SD02))
             CALL       S#CP021  PARM(&DBGN1 &DBGN2)

             CLOF       OPNID(S#SDPF)
             DLTOVR     FILE(S#SDPF)

             ENDPGM
