             PGM
             DCLF       FILE(*LIBL/PTS000D)
             OVRMSGF    MSGF(QCPFMSG) TOMSGF(PTFLIB/PTMF)
     /*      CALL       PGM(R@S004) PARM('PT')      */
             SETATNPGM  PGM(*LIBL/ATN01)
             CHGVAR     VAR(&IN99) VALUE('1')
             SNDF       RCDFMT(DSPC1)
             SNDF       RCDFMT(DSPC2)
             CALL       S#M011
             CHGDTAARA  DTAARA(*LDA (135 30)) VALUE(' ')
     /*      SIGNOFF    */
             ENDPGM
