             PGM
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             CALL       PGM(P63)
             RTVDTAARA  DTAARA(S#DA01) RTNVAR(&$USER)
             CHGDTAARA  DTAARA(*LDA (101 10)) VALUE(&$USER)
             CALL       PGM(S#S01) PARM(&$USER  &S0102I &S0101O)
             ENDPGM
