     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1062   JEANNY                            */
     /*    CREATE DATE  : 79/07/14                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : S#R430C                                   */
     /*    SYSTEM       :程式安全管制系統                         */
     /*    PURPOSE      :授權清冊                                 */
     /***************************************************************/
             PGM
     /* DEFINE VARIABLES */
             DCL        VAR(&DSU031)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSU032)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&USER)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&CENTER)  TYPE(*CHAR) LEN(10)
             CHGVAR     VAR(&DSU031)  VALUE(%SST(*LDA 501 10))
             CHGVAR     VAR(&DSU032)  VALUE(%SST(*LDA 511 10))
             CHGVAR     VAR(&USER)    VALUE(%SST(*LDA 101 10))
             RTVDTAARA  DTAARA(S#DA01 (1 10)) RTNVAR(&CENTER)
     /* OPNQRY */
             OVRDBF     FILE(S#SULF) SHARE(*YES)
             IF         COND(&USER *EQ &CENTER) THEN(DO)
             OPNQRYF    FILE(S#SULF) +
                          QRYSLT(' +
                          SU03 *EQ %RANGE("' *CAT &DSU031 *CAT '" +
                          "' *CAT &DSU032 *CAT '")') +
                          KEYFLD((SU03) (SU01))
             ENDDO
             ELSE (DO)
             OPNQRYF    FILE(S#SULF) +
                          QRYSLT(' +
                          SU03 *EQ %RANGE("' *CAT &DSU031 *CAT '" +
                          "' *CAT &DSU032 *CAT '") +
                          & SU03 *EQ "' *CAT &USER *CAT '" ') +
                          KEYFLD((SU03) (SU01))
             ENDDO
     /* CALL PRINT DATA */
             CALL       S#R433
             CLOF       OPNID(S#SULF)
             DLTOVR     FILE(S#SULF)
             ENDPGM
