  /*=================================================================*/
  /* MODI CODE |  AUTHOR  |   DATE   | DESCRIPTION                   */
  /*=================================================================*/
  /* M002      | MICHELLE | 00.07.10 |增加RUNQRY選項             */
  /*-----------------------------------------------------------------*/

             PGM
             DCL        VAR(&IN98) TYPE(*LGL) VALUE('0')
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCLF       FILE(*LIBL/SAM001D) RCDFMT(DSPC1)
  /*         OVRMSGF    MSGF(QCPFMSG) TOMSGF(PTFLIB/PTMF)   */
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')
             IF         COND(&IN03 *EQ '1') THEN(RETURN)

             IF         COND(&DOPID *EQ '41') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR061C')
             ENDDO
             IF         COND(&DOPID *EQ '42') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR062C')
             ENDDO
             IF         COND(&DOPID *EQ '43') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR063C')
             ENDDO
             IF         COND(&DOPID *EQ '44') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR064C')
             ENDDO
             IF         COND(&DOPID *EQ '45') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR065C')
             ENDDO
             IF         COND(&DOPID *EQ '46') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SOR073C')
             ENDDO
             IF         COND(&DOPID *EQ '47') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR066C')
             ENDDO
             IF         COND(&DOPID *EQ '48') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR073C')
             ENDDO
             IF         COND(&DOPID *EQ '49') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR072C')
             ENDDO
             IF         COND(&DOPID *EQ '50') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR078C')
             ENDDO
  /*M001A*/  IF         COND(&DOPID *EQ '51') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('SAR079C')
             ENDDO
  /*M003A    IF         COND(&DOPID *EQ '54') THEN(DO)     +
                          CHGVAR VAR(&S0102I) VALUE('SAR084C')  +
             ENDDO   */
  /*M002A*/  IF         COND(&DOPID *EQ '52') THEN(DO)
                          WRKQRY
                        CHGVAR     VAR(&IN97)  VALUE('1')  /*M002A*/
             GOTO       START  /*M002A*/
             ENDDO  /*M002A*/
  /*M002A*/  IF         COND(&DOPID *EQ '53') THEN(DO)
             RUNQRY     QRY(REPLIB/CHKCD) QRYFILE((REFLIB/SOCDPF)) +
                          OUTTYPE(*OUTFILE) OUTFORM(*SUMMARY) +
                          RCDSLT(*YES) PRTDFN(*NO) +
                          OUTFILE(REFLIB/CHKCDPF *FIRST *RPLFILE) +
                          AUT(*ALL) /*M002A*/
             RUNQRY     QRY(REPLIB/CHKCD01) QRYFILE((REFLIB/SOCDPF)) +
                          OUTTYPE(*OUTFILE) OUTFORM(*SUMMARY) +
                          RCDSLT(*YES) PRTDFN(*NO) +
                          OUTFILE(REFLIB/CHKCDPF01 *FIRST *RPLFILE) +
                          AUT(*ALL) /*M002A*/
             RUNQRY     QRY(REPLIB/CHKCD02)  /*M002A*/
             RUNQRY     QRY(REPLIB/CHKCD03)  /*M002A*/
             CPYF       FROMFILE(REFLIB/CHKCDPF02) +
                          TOFILE(REFLIB/CHKCDPF04) MBROPT(*REPLACE) +
                          /*M002A*/
             CPYF       FROMFILE(REFLIB/CHKCDPF03) +
                          TOFILE(REFLIB/CHKCDPF04) MBROPT(*ADD) +
                          /*M002A*/
             RUNQRY     QRY(REPLIB/CHKCD04)  /*M002A*/
             RUNQRY     QRY(REPLIB/CHKCE) QRYFILE((REFLIB/SOCDPF)) +
                          OUTTYPE(*OUTFILE) OUTFORM(*SUMMARY) +
                          RCDSLT(*YES) PRTDFN(*NO) +
                          OUTFILE(REFLIB/CHKCEPF *FIRST *RPLFILE) +
                          AUT(*ALL) /*M002A*/
             RUNQRY     QRY(REPLIB/CHKCE01) QRYFILE((REFLIB/SOCDPF)) +
                          OUTTYPE(*OUTFILE) OUTFORM(*SUMMARY) +
                          RCDSLT(*YES) PRTDFN(*NO) +
                          OUTFILE(REFLIB/CHKCEPF01 *FIRST *RPLFILE) +
                          AUT(*ALL) /*M002A*/
             RUNQRY     QRY(REPLIB/CHKCE02)  /*M002A*/
             RUNQRY     QRY(REPLIB/CHKCE03)  /*M002A*/
             CPYF       FROMFILE(REFLIB/CHKCEPF02) +
                          TOFILE(REFLIB/CHKCEPF04) MBROPT(*REPLACE) +
                          /*M002A*/
             CPYF       FROMFILE(REFLIB/CHKCEPF03) +
                          TOFILE(REFLIB/CHKCEPF04) MBROPT(*ADD) +
                          /*M002A*/
             RUNQRY     QRY(REPLIB/CHKCE04)  /*M002A*/
                        CHGVAR     VAR(&IN97)  VALUE('1')  /*M002A*/
             GOTO       START  /*M002A*/
             ENDDO  /*M002A*/
             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START

             ENDPGM
