     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1084  CHARLES                            */
     /*    CREATE DATE  : 81/05/04                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR084C1                                  */
     /*    SYSTEM       :寰盛洋酒                                 */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :產品銷售毛利報表                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&YMDS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMDE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DCOMP) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL1) TYPE(*CHAR) LEN(1)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

             CPYF       FROMFILE(REWF48) TOFILE(QTEMP/REWF48) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF48))

             CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 619 6))
             CHGVAR     VAR(&YMDE) VALUE(%SST(*LDA 625 6))
             CHGVAR     VAR(&DCOMP) VALUE(%SST(*LDA 650 1))
             CHGVAR     VAR(&DSEL1) VALUE(%SST(*LDA 651 1))
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
/* M003A */  CHGVAR     VAR(&DSEL1)  VALUE('C')

             OVRDBF     FILE(REWF48) TOFILE(QTEMP/REWF48) SHARE(*YES)
             OVRPRTF    FILE(SAR084AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('產毛報表')

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OVRDBF     FILE(SAR084F) SHARE(*YES)

     /* 1 */
             IF         COND(&DSEL1 *EQ 'A') THEN(DO)
             IF         COND(&DCOMP *EQ ' ') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' MSC39 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SC33 *NE "B" & SC13 +
                          *EQ "V" & SC35 *NE "T"  & SC03 *NE "S4" & +
                          SC01A *NE "K" ') KEYFLD(*FILE) +
                          MAPFLD((MSC39 SC39 *CHAR 8) (SC01A +
                          '%SST(SC01 1 1)'))

             OPNQRYF    FILE((SOSGPF)) QRYSLT(' MSG26 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SG04A *NE "B" & SG01A *NE "K" & SG17 +
                          *EQ "            "  ') KEYFLD(*FILE) +
                          MAPFLD((MSG26 SG26 *CHAR 8) (SG01A +
                          '%SST(SG01 1 1)') (SG04A '%SST(SG04 1 1)'))
 /* M001A */
             OPNQRYF    FILE((SAR084F)) QRYSLT(' MSRXX *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          ') KEYFLD(*FILE) +
                          MAPFLD((MSRXX SR84XX *CHAR 8))

                          ENDDO
                          ENDDO
   /* 2 */
             IF         COND(&DSEL1 *EQ 'A') THEN(DO)
             IF         COND(&DCOMP *NE ' ') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' MSC39 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SC33 *NE "B"  & SC13 *EQ "V" & SC35 *NE +
                          "T"  & SC03 *NE "S4" & SC01A *NE "K"  &  +
                          ( SC01B *EQ "' *CAT &DCOMP *CAT '") ') +
                          KEYFLD(*FILE) MAPFLD((MSC39 SC39 *CHAR 8) +
                          (SC01A '%SST(SC01 1 1)' *CHAR) (SC01B +
                          '%SST(SC01 2 1)' *CHAR))

             OPNQRYF    FILE((SOSGPF)) QRYSLT(' MSG26 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SG01B *EQ "' *CAT &DCOMP *CAT '" & +
                          SG04A *NE "B" & SG01A *NE "K" & SG17 *EQ +
                          "            "  ') KEYFLD(*FILE) +
                          MAPFLD((MSG26 SG26 *CHAR 8) (SG01A +
                          '%SST(SG01 1 1)') (SG04A '%SST(SG04 1 +
                          1)') (SG01B '%SST(SG01 2 1)'))
 /* M001A */
             OPNQRYF    FILE((SAR084F)) QRYSLT(' MSRXX *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SR01B *EQ "' *CAT &DCOMP *CAT '" +
                          ') KEYFLD(*FILE) +
                          MAPFLD((MSRXX SR84XX *CHAR 8)  +
                          (SR01B '%SST(SR8401 2 1)'))

                          ENDDO
                          ENDDO
   /* 3 */
             IF         COND(&DSEL1 *EQ 'B') THEN(DO)
             IF         COND(&DCOMP *EQ ' ') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' MSC39 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SC33 *EQ "B" & SC13                    +
                          *EQ "V" & SC35 *NE "T"  & SC03 *NE "S4" & +
                          SC01A *NE "K" ') KEYFLD(*FILE) +
                          MAPFLD((MSC39 SC39 *CHAR 8) (SC01A +
                          '%SST(SC01 1 1)'))

             OPNQRYF    FILE((SOSGPF)) QRYSLT(' MSG26 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SG04A *EQ "B" & SG01A *NE "K" & SG17 +
                          *EQ "            "  ') KEYFLD(*FILE) +
                          MAPFLD((MSG26 SG26 *CHAR 8) (SG01A +
                          '%SST(SG01 1 1)') (SG04A '%SST(SG04 1 1)'))
                          ENDDO
                          ENDDO
   /* 4 */
             IF         COND(&DSEL1 *EQ 'B') THEN(DO)
             IF         COND(&DCOMP *NE ' ') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' MSC39 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SC33 *EQ "B" & SC01B *EQ "' *CAT &DCOMP +
                          *CAT '" & SC13 *EQ "V" & SC35 *NE "T"  & +
                          SC03 *NE "S4" & SC01A *NE "K" ') +
                          KEYFLD(*FILE) MAPFLD((MSC39 SC39 *CHAR 8) +
                          (SC01A '%SST(SC01 1 1)') (SC01B +
                          '%SST(SC01 2 1)' *CHAR 1))

             OPNQRYF    FILE((SOSGPF)) QRYSLT(' MSG26 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SG01B *EQ "' *CAT &DCOMP *CAT '" & +
                          SG04A *EQ "B" & SG01A *NE "K" & SG17 *EQ +
                          "            "  ') KEYFLD(*FILE) +
                          MAPFLD((MSG26 SG26 *CHAR 8) (SG01A +
                          '%SST(SG01 1 1)') (SG04A '%SST(SG04 1 +
                          1)') (SG01B '%SST(SG01 2 1)'))
                          ENDDO
                          ENDDO
   /* 5 */
             IF         COND(&DSEL1 *EQ 'C') THEN(DO)
             IF         COND(&DCOMP *EQ ' ') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' MSC39 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          &  SC13                    +
                          *EQ "V" & SC35 *NE "T"  & SC03 *NE "S4" & +
                          SC01A *NE "K" ') KEYFLD(*FILE) +
                          MAPFLD((MSC39 SC39 *CHAR 8) (SC01A +
                          '%SST(SC01 1 1)'))

             OPNQRYF    FILE((SOSGPF)) QRYSLT(' MSG26 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SG01A *NE "K" & SG17 +
                          *EQ "            "  ') KEYFLD(*FILE) +
                          MAPFLD((MSG26 SG26 *CHAR 8) (SG01A +
                          '%SST(SG01 1 1)') (SG04A '%SST(SG04 1 1)'))
 /* M001A */
             OPNQRYF    FILE((SAR084F)) QRYSLT(' MSRXX *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          ') KEYFLD(*FILE) +
                          MAPFLD((MSRXX SR84XX *CHAR 8))

                          ENDDO
                          ENDDO
   /* 6 */
             IF         COND(&DSEL1 *EQ 'C') THEN(DO)
             IF         COND(&DCOMP *NE ' ') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' MSC39 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SC01B *EQ "' *CAT &DCOMP +
                          *CAT '" & SC13 *EQ "V" & SC35 *NE "T"  & +
                          SC03 *NE "S4" & SC01A *NE "K" ') +
                          KEYFLD(*FILE) MAPFLD((MSC39 SC39 *CHAR 8) +
                          (SC01A '%SST(SC01 1 1)') (SC01B +
                          '%SST(SC01 2 1)' *CHAR 1))

             OPNQRYF    FILE((SOSGPF)) QRYSLT(' MSG26 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SG01B *EQ "' *CAT &DCOMP *CAT '" & +
                          SG01A *NE "K" & SG17 *EQ +
                          "            "  ') KEYFLD(*FILE) +
                          MAPFLD((MSG26 SG26 *CHAR 8) (SG01A +
                          '%SST(SG01 1 1)') (SG04A '%SST(SG04 1 +
                          1)') (SG01B '%SST(SG01 2 1)'))
 /* M001A */
             OPNQRYF    FILE((SAR084F)) QRYSLT(' MSRXX *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          & SR01B *EQ "' *CAT &DCOMP *CAT '" +
                          ') KEYFLD(*FILE) +
                          MAPFLD((MSRXX SR84XX *CHAR 8)  +
                          (SR01B '%SST(SR8401 2 1)'))

                          ENDDO
                          ENDDO

             CALL       SAR0841
             CALL       SAR0842

             CHGVAR     VAR(&P6601I) VALUE('SAR084AP')

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSGPF)
             IF (&DSEL1 *NE 'B') THEN(CLOF OPNID(SAR084F))
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
