     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : ANDY                                      */
     /*    CREATE DATE  : 81/05/19                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR057C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款作業                             */
     /*    REMARK       :久未交易客戶報表                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DMD07S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD07E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD08S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMD08E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07E) TYPE(*CHAR) LEN(2)

             CHGVAR     VAR(&DMD07S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DMD07E) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DMD08S) VALUE(%SST(*LDA 611 2))
             CHGVAR     VAR(&DMD08E) VALUE(%SST(*LDA 613 2))
             CHGVAR     VAR(&DME07S) VALUE(%SST(*LDA 621 2))
             CHGVAR     VAR(&DME07E) VALUE(%SST(*LDA 623 2))

             OVRDBF     FILE(REWF18) TOFILE(MTMEPF) SHARE(*YES)
             OVRPRTF    FILE(SAR057P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('未交易客')

             OPNQRYF    FILE((MTMEPF) (MTMDPF)) FORMAT(REWF18) +
                          QRYSLT('MD07 *EQ %RANGE("' *CAT &DMD07S +
                          *CAT '" "' *CAT &DMD07E *CAT '") *AND +
                          MD08 *EQ %RANGE("' *CAT &DMD08S *CAT '" +
                          "' *CAT &DMD08E *CAT '") *AND ME07 *EQ +
                          %RANGE("' *CAT &DME07S *CAT '" "' *CAT +
                          &DME07E *CAT '")') +
                          KEYFLD((ME01) (ME02)) +
                          JFLD((1/ME01 2/MD01 *EQ))

             CALL       SAR0571

             CLOF       OPNID(MTMEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE('SAR057P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
