     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266     */
     /*                                                             */
     /*    AUTHOR       : MERCURY                                   */
     /*    CREATE DATE  : 83/05/13                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR072C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :品牌／客戶達成率同期比較表　             */
     /***************************************************************/
             PGM
      /* =========================================================== */
      /*             SYSTEM USE                                      */
      /* =========================================================== */
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

      /* =========================================================== */
      /*             PASS DATA USE  *LDA                             */
      /* =========================================================== */
             DCL        VAR(&DMA01) TYPE(*CHAR) LEN(6)
             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMA10) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSEL2) TYPE(*CHAR) LEN(1)
     /*M001M DCL        VAR(&YMDS) TYPE(*CHAR) LEN(6) +
             DCL        VAR(&YMDE) TYPE(*CHAR) LEN(6) +
             DCL        VAR(&LYMDS) TYPE(*CHAR) LEN(6) +
             DCL        VAR(&LYMDE) TYPE(*CHAR) LEN(6) +
             DCL        VAR(&YEARS) TYPE(*CHAR) LEN(6) +
             DCL        VAR(&YEARE) TYPE(*CHAR) LEN(6) +
             DCL        VAR(&LYEARS) TYPE(*CHAR) LEN(6) +
             DCL        VAR(&LYEARE) TYPE(*CHAR) LEN(6) */
  /*M001M*/  DCL        VAR(&YMDS) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YMDE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&LYMDS) TYPE(*CHAR) LEN(8)
             DCL        VAR(&LYMDE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YEARS) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YEARE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&LYEARS) TYPE(*CHAR) LEN(8)
             DCL        VAR(&LYEARE) TYPE(*CHAR) LEN(8)

      /* =========================================================== */
      /*             PASS DATA TO QUERY USE                          */
      /* =========================================================== */
             DCL        VAR(&PART1) TYPE(*CHAR) LEN(4)
             DCL        VAR(&PART2) TYPE(*CHAR) LEN(8)
  /*M001M    DCL        VAR(&PART3) TYPE(*CHAR) LEN(6)  +
             DCL        VAR(&PART4) TYPE(*CHAR) LEN(6) */
  /*M001M*/  DCL        VAR(&PART3) TYPE(*CHAR) LEN(8)
  /*M001M*/  DCL        VAR(&PART4) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PART5) TYPE(*CHAR) LEN(3)
             DCL        VAR(&PART6) TYPE(*CHAR) LEN(3)

      /* =========================================================== */
      /*             PREPARE EMPTY WORK FILE IN QTEMP                */
      /* =========================================================== */
             CPYF       FROMFILE(REW103 ) TOFILE(QTEMP/REW103 ) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REW103))
     /*  禮盒拆單瓶 */
             CPYF       FROMFILE(RES18WF) TOFILE(QTEMP/RES18WF) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/RES18WF))
             OVRDBF     FILE(RES18WF) TOFILE(QTEMP/RES18WF) SHARE(*YES)
             OVRDBF     FILE(REW103 ) TOFILE(QTEMP/REW103 ) SHARE(*YES)

      /* =========================================================== */
      /*             GET DATA FROM *LDA                              */
      /* =========================================================== */

             CHGVAR     VAR(&DMA10) VALUE(%SST(*LDA 602 2))
             CHGVAR     VAR(&DSEL2) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 751 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 752 1))
             CHGVAR     VAR(&DMA01) VALUE(%SST(*LDA 605 6))
 /*M001M     CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 631 6))  +
             CHGVAR     VAR(&YMDE) VALUE(%SST(*LDA 641 6))  +
             CHGVAR     VAR(&YEARS) VALUE(%SST(*LDA 651 6)) +
             CHGVAR     VAR(&YEARE) VALUE(%SST(*LDA 661 6)) +
             CHGVAR     VAR(&LYMDS) VALUE(%SST(*LDA 671 6)) +
             CHGVAR     VAR(&LYMDE) VALUE(%SST(*LDA 681 6)) +
             CHGVAR     VAR(&LYEARS) VALUE(%SST(*LDA 691 6)) +
             CHGVAR     VAR(&LYEARE) VALUE(%SST(*LDA 701 6)) */
 /*M001M*/   CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 631 8))
             CHGVAR     VAR(&YMDE) VALUE(%SST(*LDA 641 8))
             CHGVAR     VAR(&YEARS) VALUE(%SST(*LDA 651 8))
             CHGVAR     VAR(&YEARE) VALUE(%SST(*LDA 661 8))
             CHGVAR     VAR(&LYMDS) VALUE(%SST(*LDA 671 8))
             CHGVAR     VAR(&LYMDE) VALUE(%SST(*LDA 681 8))
             CHGVAR     VAR(&LYEARS) VALUE(%SST(*LDA 691 8))
             CHGVAR     VAR(&LYEARE) VALUE(%SST(*LDA 701 8))

             CHGVAR     VAR(&PART1) VALUE('''' *CAT &DMA10 *CAT '''')
             CHGVAR     VAR(&PART2) VALUE('''' *CAT &DMA01 *CAT '''')
             CHGVAR     VAR(&PART5) VALUE('''' *CAT &COMPS *CAT '''')
             CHGVAR     VAR(&PART6) VALUE('''' *CAT &COMPE *CAT '''')

             OVRPRTF    FILE(SAR074P) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('品牌同期')

      /* =========================================================== */
      /*             ADD DATA TO WORK FILE REW103                    */
      /* =========================================================== */

             CALL       SAR074A

      /* =========================================================== */
      /*             LAST  YEAR  PERIOD   UPDATE REW103              */
      /* =========================================================== */
             CHGVAR     VAR(&PART3) VALUE(&LYMDS)
             CHGVAR     VAR(&PART4) VALUE(&LYMDE)

             STRQMQRY   QMQRY(REPLIB/SAR074Q1) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSC) SETVAR((PART1 &PART1) +
                          (PART3 &PART3) (PART4 &PART4) (PART5 +
                          &PART5) (PART6 &PART6))

             STRQMQRY   QMQRY(REPLIB/SAR074Q2) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSN) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             STRQMQRY   QMQRY(REPLIB/SAR074Q3) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSG) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             CALL       PGM(SAR0741) PARM('1')

      /* =========================================================== */
      /*             CURRENT     PERIOD   UPDATE REW103              */
      /* =========================================================== */
             CHGVAR     VAR(&PART3) VALUE(&YMDS)
             CHGVAR     VAR(&PART4) VALUE(&YMDE)

             STRQMQRY   QMQRY(REPLIB/SAR074Q1) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSC) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             STRQMQRY   QMQRY(REPLIB/SAR074Q2) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSN) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             STRQMQRY   QMQRY(REPLIB/SAR074Q3) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSG) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             CALL       PGM(SAR0741) PARM('2')

      /* =========================================================== */
      /*             LAST YEARLY PERIOD   UPDATE REW103              */
      /* =========================================================== */
             CHGVAR     VAR(&PART3) VALUE(&LYEARS)
             CHGVAR     VAR(&PART4) VALUE(&LYEARE)

             STRQMQRY   QMQRY(REPLIB/SAR074Q1) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSC) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             STRQMQRY   QMQRY(REPLIB/SAR074Q2) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSN) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             STRQMQRY   QMQRY(REPLIB/SAR074Q3) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSG) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             CALL       PGM(SAR0741) PARM('3')

      /* =========================================================== */
      /*        CURRENT   YEARLY PERIOD   UPDATE REW103              */
      /* =========================================================== */
             CHGVAR     VAR(&PART3) VALUE(&YEARS)
             CHGVAR     VAR(&PART4) VALUE(&YEARE)

             STRQMQRY   QMQRY(REPLIB/SAR074Q1) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSC) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             STRQMQRY   QMQRY(REPLIB/SAR074Q2) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSN) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             STRQMQRY   QMQRY(REPLIB/SAR074Q3) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOSG) SETVAR((PART1 +
                          &PART1) (PART3 &PART3) +
                          (PART4 &PART4) (PART5 &PART5) (PART6 &PART6))

             CALL       PGM(SAR0741) PARM('4')

      /* =========================================================== */
      /*             PRINT REPORT                                    */
      /* =========================================================== */
             CALL       SAR0742

             DLTOVR     FILE(*ALL)

      /* =========================================================== */
      /*             CHANGE REPORT TO PRINT??                        */
      /* =========================================================== */
             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SAR074P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
