     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /* PROGRAM NAME : SAR065                                       */
     /* AUTHER       : TINA WHANG                                   */
     /* CREATE DATE  : 82/03/15                                     */
     /* UPDATE DATE  :                                              */
     /* SYSTEM       :人頭馬匯東                                  */
     /* SUBSYSTEM    :銷售分析系統                                */
     /* REMARK       :試飲原因統計表　　　　　　                  */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC10S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC10E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&YMDS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMDE) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))

             CPYF       FROMFILE(REWF64) TOFILE(QTEMP/REWF64) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF64))
             OVRDBF     FILE(REWF64) TOFILE(QTEMP/REWF64) SHARE(*YES)

             OVRPRTF    FILE(SAR065P) PAGESIZE(*N 158) CPI(12) +
                        USRDTA('試原因統')
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DSC10S) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DSC10E) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 610 6))
             CHGVAR     VAR(&YMDE) VALUE(%SST(*LDA 616 6))

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC10 +
                          *EQ %RANGE("' *CAT &DSC10S *CAT '" "' +
                          *CAT &DSC10E *CAT '" ) & MSC39 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") & (SC13 *EQ "V") & (SC35 +
                          *NE "T") & (SC03 *EQ "S4") & SC01B *NE +
                          "K" ') MAPFLD((MSC39 SC39 *CHAR 8) (SC01B +
                          '%SST(SC01 1 1 )' *CHAR 1) (SC01A +
                          '%SST(SC01 2 1)' *CHAR 1))
/*M001D                   %RANGE("' *CAT &YMDS *CAT '" "' *CAT +
                          &YMDE *CAT '") & (SC13 *EQ "V") & (SC35 +
                        "K" ') MAPFLD((MSC39 SC39 *CHAR 6) (SC01B + */

             CALL       SAR0651
             CALL       SAR0652

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SAR065P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
