     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1084  CHARLES                            */
     /*    CREATE DATE  : 81/05/04                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR051C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :專櫃達成率分析表                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSC04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&SSELYM) TYPE(*CHAR) LEN(4)
             DCL        VAR(&ESELYM) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)


             CHGVAR     VAR(&DSC04S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DSC04E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&SSELYM) VALUE(%SST(*LDA 619 4))
             CHGVAR     VAR(&ESELYM) VALUE(%SST(*LDA 623 4))
             CHGVAR     VAR(&DSEL) VALUE(%SST(*LDA 627 1))

             OVRPRTF    FILE(SAR051P) PAGESIZE(*N 158) CPI(12) +
                        USRDTA('專櫃達成')
             CPYF       FROMFILE(REWF22) TOFILE(QTEMP/REWF22) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF22))
             OVRDBF     FILE(REWF22) TOFILE(QTEMP/REWF22) SHARE(*YES)
     /*  禮盒拆單瓶 */
             CPYF       FROMFILE(RES18WF) TOFILE(QTEMP/RES18WF) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/RES18WF))
             OVRDBF     FILE(RES18WF) TOFILE(QTEMP/RES18WF) SHARE(*YES)


             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC04 *EQ %RANGE("' +
                          *CAT &DSC04S *CAT '" "' *CAT &DSC04E *CAT +
                          '") & MSC39 *EQ %RANGE("' *CAT &SSELYM +
                          *CAT '" "' *CAT &ESELYM *CAT '") & SC03 +
                          *EQ "S2" & SC13 *NE "*" ') +
                          KEYFLD((SC04) (SC02)) MAPFLD((CSC39 SC39 +
                          *CHAR 6) (MSC39 '%SST(CSC39 1 4)' *CHAR 4))

             CALL       SAR0511
             CALL       SAR0512

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SAR051P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
