     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266     */
     /*                                                             */
     /*    AUTHOR       : MICHELLE                                  */
     /*    CREATE DATE  : 00/01/06                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR082C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :產品銷售分析週報－國外　　　             */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DMA07) TYPE(*CHAR) LEN(1)
/*           DCL        VAR(&DMA11S) TYPE(*CHAR) LEN(1)  */
 /*          DCL        VAR(&DMA11E) TYPE(*CHAR) LEN(1)  */
             DCL        VAR(&DSEL1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&YMDS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMDE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&F01S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&F01E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&F02S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&F02E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&F03S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&F03E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&F04S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&F04E) TYPE(*CHAR) LEN(4)
   /*        DCL        VAR(&DMA01S) TYPE(*CHAR) LEN(9)  */
   /*        DCL        VAR(&DMA01E) TYPE(*CHAR) LEN(9)  */
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YF01S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YF01E)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YF02S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YF02E)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YF03S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YF03E)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YF04S)  TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YF04E)  TYPE(*CHAR) LEN(6)
     /***************************************************************/

             CPYF       FROMFILE(REWFC6) TOFILE(QTEMP/REWFC6) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFC6))
     /*  禮盒拆單瓶 */
             CPYF       FROMFILE(RES18WF) TOFILE(QTEMP/RES18WF) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/RES18WF))
             OVRDBF     FILE(RES18WF) TOFILE(QTEMP/RES18WF) SHARE(*YES)


             OVRDBF     FILE(REWFC6) TOFILE(QTEMP/REWFC6) SHARE(*YES)
             OVRDBF     FILE(SOSCLF5) SHARE(*YES)
             OVRDBF     FILE(SOSGLF3) SHARE(*YES)

             CHGVAR     VAR(&DMA07) VALUE(%SST(*LDA 601 1))
 /*          CHGVAR     VAR(&DMA11S) VALUE(%SST(*LDA 602 1)) */
 /*          CHGVAR     VAR(&DMA11E) VALUE(%SST(*LDA 606 1)) */
             CHGVAR     VAR(&DSEL1) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSEL2) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 631 6))
             CHGVAR     VAR(&YMDE) VALUE(%SST(*LDA 641 6))
             CHGVAR     VAR(&F01S) VALUE(%SST(*LDA 651 6))
             CHGVAR     VAR(&F01E) VALUE(%SST(*LDA 661 6))
             CHGVAR     VAR(&F02S) VALUE(%SST(*LDA 671 6))
             CHGVAR     VAR(&F02E) VALUE(%SST(*LDA 681 6))
             CHGVAR     VAR(&F03S) VALUE(%SST(*LDA 691 6))
             CHGVAR     VAR(&F03E) VALUE(%SST(*LDA 701 6))
             CHGVAR     VAR(&F04S) VALUE(%SST(*LDA 707 4))
             CHGVAR     VAR(&F04E) VALUE(%SST(*LDA 711 4))
 /*          CHGVAR     VAR(&DMA01S) VALUE(%SST(*LDA 721 9)) */
 /*          CHGVAR     VAR(&DMA01E) VALUE(%SST(*LDA 731 9)) */
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
/*M001A*/    CHGVAR     VAR(&YF01S)  VALUE(%SST(*LDA 866 8))
/*M001A*/    CHGVAR     VAR(&YF01E)  VALUE(%SST(*LDA 874 8))
/*M001A*/    CHGVAR     VAR(&YF02S)  VALUE(%SST(*LDA 882 8))
/*M001A*/    CHGVAR     VAR(&YF02E)  VALUE(%SST(*LDA 890 8))
/*M001A*/    CHGVAR     VAR(&YF03S)  VALUE(%SST(*LDA 898 8))
/*M001A*/    CHGVAR     VAR(&YF03E)  VALUE(%SST(*LDA 906 8))
/*M001A*/    CHGVAR     VAR(&YF04S)  VALUE(%SST(*LDA 940 6))
/*M001A*/    CHGVAR     VAR(&YF04E)  VALUE(%SST(*LDA 950 6))
             OVRPRTF    FILE(SAR082P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('產銷週報')
             /*含試飲時*/
             IF         COND(&DSEL1 *EQ 'Y') THEN(DO)
             OPNQRYF    FILE((SOSCLF5)) QRYSLT('((MSC39 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '")) *OR ( MSC39 *EQ %RANGE("' +
                          *CAT &YF01S *CAT '" "' *CAT &YF01E *CAT +
                          '")) *OR (MSC39 *EQ %RANGE("' *CAT &YF02S +
                          *CAT '" "' *CAT &YF02E *CAT '"))  +
                          *OR (MSC39 *EQ %RANGE("' *CAT &YF03S +
                          *CAT '" "' *CAT &YF03E *CAT '")))  +
                          & MA07 *EQ "' *CAT +
                          &DMA07 *CAT '" +
                           ') +
                          KEYFLD((SD03)) MAPFLD((MSC39 +
                          SC39 *CHAR 8) (MSC01 '%SST(SC01 2 1)' +
                          *CHAR))

  /*                      *CAT '" "' *CAT &YF03E *CAT '"))) & SD03 +
                          *EQ %RANGE("' *CAT &DMA01S *CAT '" "' +
                          *CAT &DMA01E *CAT '")& MA07 *EQ "' *CAT +
                          &DMA07 *CAT '" & (MMA11 *EQ %RANGE("'  +
                          *CAT &DMA11S *CAT '" "' *CAT &DMA11E *CAT +
                          '")) ') + */

             OVRDBF     FILE(SOSNLF2) SHARE(*YES)
             OPNQRYF    FILE((SOSNLF2)) QRYSLT(' ((MSN06 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '")) *OR  (MSN06 *EQ %RANGE("' +
                          *CAT &YF01S *CAT '" "' *CAT &YF01E *CAT +
                          '")) *OR (MSN06 *EQ %RANGE("' *CAT &YF02S +
                          *CAT '" "' *CAT &YF02E *CAT '")) +
                          *OR (MSN06 *EQ %RANGE("' *CAT &YF03S +
                          *CAT '" "' *CAT &YF03E *CAT '"))) &  SN02L +
                          *EQ "R3" &  +
                          MA07 *EQ "' *CAT &DMA07 *CAT '" +
                           ') +
                          KEYFLD((SO03)) MAPFLD((MSN06 SN06 *CHAR +
                          8) (SN02L '%SST(SN02 3 2)' *CHAR 2) +
                          (MSN01 '%SST(SN01 2 1)'))
                          ENDDO

  /*                      *EQ "R3" & SO03 *EQ %RANGE("' *CAT +
                          &DMA01S *CAT '" "' *CAT &DMA01E *CAT '") +
                          & MA07 *EQ "' *CAT &DMA07 *CAT '" +
                          & (MMA11 *EQ %RANGE("'  +
                          *CAT &DMA11S *CAT '" "' *CAT &DMA11E *CAT +
                          '")) ') +   */

             ELSE       CMD(DO)
             /*不含試飲時*/
             OPNQRYF    FILE((SOSCLF5)) QRYSLT('((MSC39 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '")) *OR (MSC39 *EQ %RANGE("' +
                          *CAT &YF01S *CAT '" "' *CAT &YF01E *CAT +
                          '")) *OR (MSC39 *EQ %RANGE("' *CAT &YF02S +
                          *CAT '" "' *CAT &YF02E *CAT '")) +
                          *OR (MSC39 *EQ %RANGE("' *CAT &YF03S +
                          *CAT '" "' *CAT &YF03E *CAT '"))) & SC03 +
                          *NE "S4"  +
                          & MA07 *EQ "' *CAT &DMA07 *CAT '"  +
                           ') +
                          KEYFLD((SD03)) MAPFLD((MSC39 SC39 *CHAR +
                          8) (MSC01 '%SST(SC01 2 1)') (MMA11 +
                          '%SST(ma11 1 1)' *CHAR))
                          ENDDO

  /*                      *NE "S4" &  SD03 *EQ %RANGE("' *CAT +
                          &DMA01S *CAT '" "' *CAT &DMA01E *CAT '")  +
                          & MA07 *EQ "' *CAT &DMA07 *CAT '"  +
                          & (MMA11 *EQ %RANGE("'  +
                          *CAT &DMA11S *CAT '" "' *CAT &DMA11E *CAT +
                          '")) ') +  */


             OPNQRYF    FILE((SOSGLF3)) QRYSLT('(MSG26 *EQ %RANGE("' +
                          *CAT &YMD8S *CAT '" "' *CAT &YMD8E *CAT '") +
                          *OR MSG26 *EQ %RANGE("' *CAT &YF01S *CAT +
                          '" "' *CAT &YF01E *CAT '") *OR MSG26 *EQ +
                          %RANGE("' *CAT &YF02S *CAT '" "' *CAT +
                          &YF02E *CAT '") +
                          *OR MSG26 *EQ +
                          %RANGE("' *CAT &YF03S *CAT '" "' *CAT +
                          &YF03E *CAT '")) &  +
                          MA07 *EQ "' *CAT &DMA07 *CAT '"  +
                           ') +
                          KEYFLD((SH03)) MAPFLD((MSG26 SG26 *CHAR +
                          8) (MSG01 '%SST(SG01 2 1)'))

   /*                     &YF03E *CAT '")) & SH03 *EQ %RANGE("' *CAT +
                          &DMA01S *CAT '" "' *CAT &DMA01E *CAT '") +
                          & MA07 *EQ "' *CAT &DMA07 *CAT '"  +
                          & (MMA11 *EQ %RANGE("'  +
                          *CAT &DMA11S *CAT '" "' *CAT &DMA11E *CAT +
                          '")) ') +   */


             CALL       SAR0821
             CALL       SAR0822

             CLOF       OPNID(SOSCLF5)
             CLOF       OPNID(SOSGLF3)
             IF         COND(&DSEL1 *EQ 'Y') THEN(DO)
             CLOF       OPNID(SOSNLF2)
             ENDDO
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SAR082P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
