     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : CHARLES                                   */
     /*    CREATE DATE  : 06/10/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR066C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款子系統                           */
     /*    REMARK       :通路型態銷售貢獻度分析表                 */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC34S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC34E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&YSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC39E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S ) TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E ) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DSC04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&IN20)   TYPE(*CHAR) LEN(1)

             CPYF       FROMFILE(REFLIB/REWF75) TOFILE(QTEMP/REWF75) +
                          CRTFILE(*YES)

             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF75))
             OVRDBF     FILE(REWF75) TOFILE(QTEMP/REWF75) SHARE(*YES)

             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&YSC39S) VALUE(%SST(*LDA 621 6))
             CHGVAR     VAR(&YSC39E) VALUE(%SST(*LDA 627 6))
/*M001A*/    CHGVAR     VAR(&YMD8S ) VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E ) VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&DSC34S) VALUE(%SST(*LDA 651 2))
             CHGVAR     VAR(&DSC34E) VALUE(%SST(*LDA 653 2))
             CHGVAR     VAR(&DSC04S) VALUE(%SST(*LDA 713 5))
             CHGVAR     VAR(&DSC04E) VALUE(%SST(*LDA 718 5))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 672 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 673 1))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))

             OVRPRTF    FILE(SAR066P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('通路頁獻')
             OVRDBF     FILE(ARACPF) SHARE(*YES)
             OVRDBF     FILE(ARAFPF) SHARE(*YES)
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OPNQRYF    FILE((ARACPF)) QRYSLT('AC02 *EQ %RANGE("' +
                          *CAT &DSC04S *CAT '" "' *CAT &DSC04E *CAT +
                          '") & AC05 *EQ "45" & AC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") &  AC04 *EQ %RANGE(' *CAT &YMD8S  +
                          *CAT ' ' *CAT &YMD8E  *CAT ') & AC02 *NE +
                          "A0002" & AC01B *NE "K" ') KEYFLD(*FILE) +
                          MAPFLD((AC01A '%SST(AC01 2 1)' *CHAR 1) +
                          (AC01B '%SST(AC01 1 1)' *CHAR 1))
             OPNQRYF    FILE((ARAFPF)) QRYSLT('AF01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & AF03 *EQ %RANGE("' *CAT &DSC04S +
                          *CAT '" "' *CAT &DSC04E *CAT '") & AF05 +
                          *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & AF03 *NE "A0002" & +
                          AF01B *NE "K" ') KEYFLD(*FILE) +
                          MAPFLD((AF01A '%SST(AF01 2 1)' *CHAR 1) +
                          (AF01B '%SST(AF01 1 1)' *CHAR 1))

             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC04 *EQ %RANGE("' *CAT &DSC04S +
                          *CAT '" "' *CAT &DSC04E *CAT '") & SC34 +
                          *EQ %RANGE("' *CAT &DSC34S *CAT '"  "' +
                          *CAT &DSC34E *CAT '") & SC33 *EQ +
                          %RANGE("' *CAT &DSC33S *CAT '" "' *CAT +
                          &DSC33E *CAT '" ) & SC08 *EQ %RANGE(' +
                          *CAT &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT +
                          ') & SC13 *NE "*" & SC35 *NE "T" & SC03 +
                          *NE "S4" & SC01B *NE "K" ') KEYFLD(*FILE) +
                          MAPFLD((SC01A '%SST(SC01 2 1)' *CHAR 1) +
                          (SC01B '%SST(SC01  1 1)' *CHAR 1))

             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") &  SG04 *EQ %RANGE("' *CAT &DSC04S +
                          *CAT '" "' *CAT &DSC04E *CAT '") & SG06 +
                          *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & SG17 *EQ " " & SG01B +
                          *NE "K" ') KEYFLD(*FILE) MAPFLD((SG01A +
                          '%SST(SG01 2 1)' *CHAR 1) (SG01B +
                          '%SST(SG01 1 1)' *CHAR 1))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC04 *EQ %RANGE("' *CAT &DSC04S +
                          *CAT '" "' *CAT &DSC04E *CAT '") & SC34 +
                          *EQ %RANGE("' *CAT &DSC34S *CAT '" "' +
                          *CAT &DSC34E *CAT '") & SC33 *EQ +
                          %RANGE("' *CAT &DSC33S *CAT '" "' *CAT +
                          &DSC33E *CAT '") & SC39 *EQ %RANGE(' *CAT +
                          &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT ') & +
                          SC13 *EQ "V" & SC35 *NE "T" & SC03 *NE +
                          "S4" & SC01B *NE "K" ') KEYFLD(*FILE) +
                          MAPFLD((SC01A '%SST(SC01 2 1)' *CHAR 1) +
                          (SC01B '%SST(SC01 1 1)' *CHAR 1))

             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SG04 *EQ %RANGE("' *CAT &DSC04S +
                          *CAT '" "' *CAT &DSC04E *CAT '") & SG26 +
                          *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & SG17 *EQ " " & SG01B +
                          *NE "K" ') KEYFLD(*FILE) MAPFLD((SG01A +
                          '%SST(SG01 2 1)' *CHAR 1) (SG01B +
                          '%SST(SG01 1 1)' *CHAR 1))
             ENDDO

             CALL       SAR0661
             CALL       SAR0662

             CLOF       OPNID(ARACPF)
             CLOF       OPNID(ARAFPF)
             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSGPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE('SAR066P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
