     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 81/12/17                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR064C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售訂單系統                             */
     /*    REMARK       :客戶往來產品表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC34S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC34E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC45S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC45E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC27S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC27E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSD03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSD03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&YSC08S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC08E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))

             CPYF       FROMFILE(REWF57) TOFILE(QTEMP/REWF57) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF57))

             OVRDBF     FILE(REWF57) TOFILE(QTEMP/REWF57) SHARE(*YES)

             OVRPRTF    FILE(SAR064P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客往來產')
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 611 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 612 1))
             CHGVAR     VAR(&DSC34S) VALUE(%SST(*LDA 613 2))
             CHGVAR     VAR(&DSC34E) VALUE(%SST(*LDA 615 2))
             CHGVAR     VAR(&DSC27S) VALUE(%SST(*LDA 700 6))
             CHGVAR     VAR(&DSC27E) VALUE(%SST(*LDA 706 6))
             CHGVAR     VAR(&DSC45S) VALUE(%SST(*LDA 621 9))
             CHGVAR     VAR(&DSC45E) VALUE(%SST(*LDA 631 9))
             CHGVAR     VAR(&DSD03S) VALUE(%SST(*LDA 641 9))
             CHGVAR     VAR(&DSD03E) VALUE(%SST(*LDA 651 9))
             CHGVAR     VAR(&YSC08S) VALUE(%SST(*LDA 681 6))
             CHGVAR     VAR(&YSC08E) VALUE(%SST(*LDA 691 6))

             OVRPRTF    FILE(SAR064P) PAGESIZE(*N 198) CPI(15)
             OVRDBF     FILE(SOSCPF) SHARE(*YES)

             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC012 *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC27 *EQ %RANGE("' *CAT &DSC27S +
                          *CAT '" "' *CAT &DSC27E *CAT '") & SC33 +
                          *EQ %RANGE("' *CAT &DSC33S *CAT '" "' +
                          *CAT &DSC33E *CAT '") & SC34 *EQ +
                          %RANGE("' *CAT &DSC34S *CAT '" "' *CAT +
                          &DSC34E *CAT '") & SC45 *EQ %RANGE("' +
                          *CAT &DSC45S *CAT '" "' *CAT &DSC45E *CAT +
                          '") & SC08 *EQ %RANGE(' *CAT &YMD8S  *CAT +
                          ' ' *CAT &YMD8E  *CAT ') & SC13 *EQ "V" & +
                          SC35 *NE "T" & SC03 *NE "S4" & SC01B *NE +
                          "K" ') KEYFLD((SC04) (SC05) (SC08 +
                          *DESCEND)) MAPFLD((SC012 '%SST(SC01 2 1)' +
                          *CHAR 1) (SC01B '%SST(SC01 1 1)' *CHAR 1) +
                          (SC45 'SC04 || SC05' *CHAR 9))

/*M001D                   '") & SC08 *EQ %RANGE(' *CAT &YSC08S *CAT +
                       ' ' *CAT &YSC08E *CAT ') & SC13 *EQ "V" & +  */

             CALL       SAR0641
             CALL       SAR0642

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE('SAR064P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
