     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : ANDY                                      */
     /*    CREATE DATE  : 81/05/18                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR049C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款作業                             */
     /*    REMARK       :業務員業績日報表                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DATES) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC07S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC07E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC39E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DMA10S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMA10E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC27S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC27E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCS01S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCS01E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSD03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSD03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DMA11S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMA11E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL1)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRTFID)   TYPE(*CHAR) LEN(10)


 /*M001M     CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 713 6)) */
 /*M001M     CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 719 6)) */
 /*M001M*/   CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 713 8))
 /*M001M*/   CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 721 8))
             CHGVAR     VAR(&DSC07S) VALUE(%SST(*LDA 605 6))
             CHGVAR     VAR(&DSC07E) VALUE(%SST(*LDA 611 6))
             CHGVAR     VAR(&DSC39S) VALUE(%SST(*LDA 701 6))
             CHGVAR     VAR(&DSC39E) VALUE(%SST(*LDA 706 6))
             CHGVAR     VAR(&DMA10S) VALUE(%SST(*LDA 621 2))
             CHGVAR     VAR(&DMA10E) VALUE(%SST(*LDA 623 2))
             CHGVAR     VAR(&DSC27S) VALUE(%SST(*LDA 631 6))
             CHGVAR     VAR(&DSC27E) VALUE(%SST(*LDA 637 6))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 651 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 653 1))
             CHGVAR     VAR(&DCS01S) VALUE(%SST(*LDA 661 9))
             CHGVAR     VAR(&DCS01E) VALUE(%SST(*LDA 671 9))
             CHGVAR     VAR(&DSC01S) VALUE(%SST(*LDA 681 2))
             CHGVAR     VAR(&DSC01E) VALUE(%SST(*LDA 683 2))
             CHGVAR     VAR(&DSD03S) VALUE(%SST(*LDA 751 9))
             CHGVAR     VAR(&DSD03E) VALUE(%SST(*LDA 760 9))
             CHGVAR     VAR(&DMA11S) VALUE(%SST(*LDA 798 1))
             CHGVAR     VAR(&DMA11E) VALUE(%SST(*LDA 799 1))
             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 620 1))
             CHGVAR     VAR(&DSEL1)   VALUE(%SST(*LDA 730 1))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))

             OVRDBF     FILE(REWF19) TOFILE(SOSDPF) SHARE(*YES)

             IF         COND(&DSEL = 'A') THEN(DO)

             IF         COND(&DSEL1 = 'B') THEN(DO)
             CPYF       FROMFILE(REWF93) TOFILE(QTEMP/REWF93) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF93))
             OVRDBF     FILE(REWF93) TOFILE(QTEMP/REWF93) SHARE(*YES)
             ENDDO
     /*  禮盒拆單瓶 */
             CPYF       FROMFILE(RES18WF) TOFILE(QTEMP/RES18WF) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/RES18WF))
             OVRDBF     FILE(RES18WF) TOFILE(QTEMP/RES18WF) SHARE(*YES)


             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC08 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & SD03 *EQ %RANGE("' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '") & (MA10 +
                          *EQ %RANGE("' *CAT &DMA10S *CAT '" "' +
                          *CAT &DMA10E *CAT '")) & MA11A *EQ +
                          %RANGE("' *CAT &DMA11S *CAT '" "' *CAT +
                          &DMA11E *CAT '") *AND  SC03 *EQ "S4" +
                          *AND  SC13 *NE "*" ') KEYFLD((MA07) +
                          (MA10) (SC10) (SD03) (SC04) (SC05) +
                          (SD02)) JFLD((1/SD02 2/SC02 *EQ) (1/SD03 +
             /*M001M*/    3/MA01)) MAPFLD((CSC08 SC08 *CHAR 8) +
                          (MA11A '%SST(MA11 1 1)' *CHAR 1))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC39 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & SD03 *EQ %RANGE( "' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '") & (MA10 +
                          *EQ %RANGE("' *CAT &DMA10S *CAT '" "' +
                          *CAT &DMA10E *CAT '")) & MA11A *EQ +
                          %RANGE("' *CAT &DMA11S *CAT '" "' *CAT +
                          &DMA11E *CAT '") *AND  SC03 *EQ "S4" +
                          *AND  SC13 *EQ "V" ') KEYFLD((MA07) +
                          (MA10) (SC10) (SD03) (SC04) (SC05) +
                          (SD02)) JFLD((1/SD02 2/SC02 *EQ) (1/SD03 +
            /*M001M*/     3/MA01)) MAPFLD((CSC39 SC39 *CHAR 8) +
                          (MA11A '%SST(ma11 1 1)' *CHAR 1))

             ENDDO
             /*禮盒碼*/
             IF         COND(&DSEL1= 'A') THEN(DO)

             OVRPRTF    FILE(SAR049AP) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ａ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049AP')
             CALL       SAR0491
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SAR049AA) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ａ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049AA')
             CALL       SAR04911
             CALL       SAR04912
             ENDDO
             ENDDO

             IF         COND(&DSEL = 'B') THEN(DO)

             IF         COND(&DSEL1 = 'B') THEN(DO)
             CPYF       FROMFILE(REWF94) TOFILE(QTEMP/REWF94) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF94))
             OVRDBF     FILE(REWF94) TOFILE(QTEMP/REWF94) SHARE(*YES)
             ENDDO
             IF         COND(&IN20 = '0') THEN(DO)

             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC08 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & SD03 *EQ %RANGE("' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '") & (SC27 +
                          *EQ %RANGE("' *CAT &DSC27S *CAT '" "' +
                          *CAT &DSC27E *CAT '")) & MA11A *EQ +
                          %RANGE("' *CAT &DMA11S *CAT '" "' *CAT +
                          &DMA11E *CAT '") *AND  SC03 *EQ "S4" +
                          *AND  SC13 *NE "*" ') KEYFLD((SC27) +
                          (SC10) (MA10) (SC04) (SC05) (SD03) +
                          (SD02)) JFLD((1/SD02 2/SC02 *EQ) (1/SD03 +
             /*M001M*/    3/MA01)) MAPFLD((CSC08 SC08 *CHAR 8) +
                          (MA11A '%SST(ma11 1 1)' *CHAR 1))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC39 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & SD03 *EQ %RANGE("' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '") &  (SC27 +
                          *EQ %RANGE("' *CAT &DSC27S *CAT '" "' +
                          *CAT &DSC27E *CAT '")) & MA11A *EQ +
                          %RANGE("' *CAT &DMA11S *CAT '" "' *CAT +
                          &DMA11E *CAT '") *AND  SC03 *EQ "S4" +
                          *AND  SC13 *EQ "V" ') KEYFLD((SC27) +
                          (SC10) (MA10) (SC04) (SC05) (SD03) +
                          (SD02)) JFLD((1/SD02 2/SC02 *EQ) (1/SD03 +
            /*M001M*/     3/MA01)) MAPFLD((CSC39 SC39 *CHAR 8) +
                          (MA11A '%SST(ma11 1 1)' *CHAR 1))
             ENDDO
             /*禮盒碼*/
             IF         COND(&DSEL1= 'A') THEN(DO)

             OVRPRTF    FILE(SAR049BP) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ｂ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049BP')
             CALL       SAR0492
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SAR049BA) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ｂ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049BA')
             CALL       SAR04921
             CALL       SAR04922
             ENDDO

             ENDDO

             IF         COND(&DSEL = 'C') THEN(DO)

             IF         COND(&DSEL1 = 'B') THEN(DO)
             CPYF       FROMFILE(REWF95) TOFILE(QTEMP/REWF95) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF95))
             OVRDBF     FILE(REWF95) TOFILE(QTEMP/REWF95) SHARE(*YES)
             ENDDO

             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC08 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & SD03 *EQ %RANGE("' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '") & (SC33 +
                          *EQ %RANGE("' *CAT &DSC33S *CAT '" "' +
                          *CAT &DSC33E *CAT '")) & MA11A *EQ +
                          %RANGE("' *CAT &DMA11S *CAT '" "' *CAT +
                          &DMA11E *CAT '") *AND  SC03 *EQ "S4" +
                          *AND  SC13 *NE "*" ') KEYFLD((SC33) +
                          (MA10) (SD03) (SD02)) JFLD((1/SD02 2/SC02 +
                          *EQ) (1/SD03 3/MA01)) MAPFLD((CSC08 SC08 +
            /*M001M*/     *CHAR 8) +
                          (MA11A '%SST(ma11 1 1)' *CHAR 1))

             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC39 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & SD03 *EQ %RANGE("' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '") & (SC33 +
                          *EQ %RANGE("' *CAT &DSC33S *CAT '" "' +
                          *CAT &DSC33E *CAT '")) & MA11A *EQ +
                          %RANGE("' *CAT &DMA11S *CAT '" "' *CAT +
                          &DMA11E *CAT '") *AND  SC03 *EQ "S4" +
                          *AND  SC13 *EQ "V" ') KEYFLD((SC33) +
                          (MA10) (SD03) (SD02)) JFLD((1/SD02 2/SC02 +
                          *EQ) (1/SD03 3/MA01)) MAPFLD((CSC39 SC39 +
            /*M001M*/     *CHAR 8) +
                          (MA11A '%SST(ma11 1 1)' *CHAR 1))

             ENDDO
             /*禮盒碼*/
             IF         COND(&DSEL1= 'A') THEN(DO)

             OVRPRTF    FILE(SAR049CP) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ｃ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049CP')
             CALL       SAR0493
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SAR049CA) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ｃ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049CA')
             CALL       SAR04931
             CALL       SAR04932
             ENDDO
             ENDDO

             IF         COND(&DSEL = 'D') THEN(DO)
             IF         COND(&DSEL1 = 'B') THEN(DO)
             CPYF       FROMFILE(REWF96) TOFILE(QTEMP/REWF96) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF96))
             OVRDBF     FILE(REWF96) TOFILE(QTEMP/REWF96) SHARE(*YES)
             ENDDO

             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC08 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & SD03 *EQ %RANGE("' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '") &  (CS01 +
                          *EQ %RANGE("' *CAT &DCS01S *CAT '" "' +
                          *CAT &DCS01E *CAT '")) & MA11A *EQ +
                          %RANGE("' *CAT &DMA11S *CAT '" "' *CAT +
                          &DMA11E *CAT '") *AND  SC03 *EQ "S4" +
                          *AND  SC13 *NE "*" ') KEYFLD((SC04) +
                          (SC05) (SC10) (SD03) (SD02)) JFLD((1/SD02 +
                          2/SC02) (1/SD03 3/MA01)) MAPFLD((CSC08 +
           /*M001M*/      SC08 *CHAR 8) (CS01 'SC04 *CAT SC05' +
                          *CHAR 9) +
                          (MA11A '%SST(ma11 1 1)' *CHAR 1))
             ENDDO
             ELSE       CMD(DO)

             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC39 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & SD03 *EQ %RANGE("' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '") & (CS01 +
                          *EQ %RANGE("' *CAT &DCS01S *CAT '" "' +
                          *CAT &DCS01E *CAT '")) & MA11A *EQ +
                          %RANGE("' *CAT &DMA11S *CAT '" "' *CAT +
                          &DMA11E *CAT '")  *AND  SC03 *EQ "S4" +
                          *AND  SC13 *EQ "V" ') KEYFLD((SC04) +
                          (SC05) (SC10) (SD03) (SD02)) JFLD((1/SD02 +
                          2/SC02) (1/SD03 3/MA01)) MAPFLD((CSC39 +
              /*M001M*/   SC39 *CHAR 8) (CS01 'SC04 *CAT SC05' +
                          *CHAR 9) +
                          (MA11A '%SST(ma11 1 1)' *CHAR 1))
             ENDDO
             /*禮盒碼*/
             IF         COND(&DSEL1= 'A') THEN(DO)

             OVRPRTF    FILE(SAR049DP) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ｄ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049DP')
             CALL       SAR0494
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SAR049DA) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ｄ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049DA')
             CALL       SAR04941
             CALL       SAR04942
             ENDDO
             ENDDO

             IF         COND(&DSEL = 'E') THEN(DO)
             IF         COND(&DSEL1 = 'B') THEN(DO)
             CPYF       FROMFILE(REWF97) TOFILE(QTEMP/REWF97) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF97))
             OVRDBF     FILE(REWF97) TOFILE(QTEMP/REWF97) SHARE(*YES)
             ENDDO

             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC08 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & (SD03 *EQ %RANGE("' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '")) & MA11A +
                          *EQ %RANGE("' *CAT &DMA11S *CAT '" "' +
                          *CAT &DMA11E *CAT '") *AND  SC03 *EQ "S4" +
                          *AND  SC13 *NE "*" ') KEYFLD((SD03) +
                          (SC10) (SC04) (SC05) (SD02)) JFLD((1/SD02 +
                          2/SC02 *EQ) (1/SD03 3/MA01)) +
               /*M001M*/  MAPFLD((CSC08 SC08 *CHAR 8) +
                          (MA11A '%SST(ma11 1 1)' *CHAR 1))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF19) QRYSLT(' (SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '")) & (CSC39 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '")) & (SD03 *EQ %RANGE("' *CAT &DSD03S +
                          *CAT '" "' *CAT &DSD03E *CAT '")) & MA11A +
                          *EQ %RANGE("' *CAT &DMA11S *CAT '" "' +
                          *CAT &DMA11E *CAT '") *AND  SC03 *EQ "S4" +
                          *AND  SC13 *EQ "V" ') KEYFLD((SD03) +
                          (SC10) (SC04) (SC05) (SD02)) JFLD((1/SD02 +
                          2/SC02 *EQ) (1/SD03 3/MA01)) +
             /*M001M*/    MAPFLD((CSC39 SC39 *CHAR 8)  +
                          (MA11A '%SST(ma11 1 1)' *CHAR 1))

             ENDDO
             /*禮盒碼*/
             IF         COND(&DSEL1= 'A') THEN(DO)

             OVRPRTF    FILE(SAR049EP) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ｅ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049EP')
             CALL       SAR0495
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SAR049EA) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('試飲析Ｅ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR049EA')
             CALL       SAR04951
             CALL       SAR04952
             ENDDO
             ENDDO

             CLOF       OPNID(SOSDPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE(&PRTFID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
