     /***************************************************************/
     /*   人頭馬堅匯東洋酒份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 09/01/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR067C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款作業                             */
     /*    REMARK       :試飲分析彙總報表                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DATES) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC07S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC07E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC39E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSD03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSD03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSEL)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN20)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRTFID) TYPE(*CHAR) LEN(10)
/*M001A*/    DCL        VAR(&YMD8S) TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E) TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))

             CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 713 6))
             CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 719 6))
             CHGVAR     VAR(&DSC07S) VALUE(%SST(*LDA 605 6))
             CHGVAR     VAR(&DSC07E) VALUE(%SST(*LDA 611 6))
             CHGVAR     VAR(&DSC39S) VALUE(%SST(*LDA 701 6))
             CHGVAR     VAR(&DSC39E) VALUE(%SST(*LDA 706 6))
             CHGVAR     VAR(&DSC01S) VALUE(%SST(*LDA 681 2))
             CHGVAR     VAR(&DSC01E) VALUE(%SST(*LDA 683 2))
             CHGVAR     VAR(&DSD03S) VALUE(%SST(*LDA 731 9))
             CHGVAR     VAR(&DSD03E) VALUE(%SST(*LDA 741 9))
             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 620 1))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))

             CPYF       FROMFILE(REFLIB/REWF84) TOFILE(QTEMP/REWF84) +
                          CRTFILE(*YES)

             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF84))
             OVRDBF     FILE(REWF84) TOFILE(QTEMP/REWF84) SHARE(*YES)

             OVRPRTF    FILE(SAR067P) PAGESIZE(*N 158) CPI(12) +
                        USRDTA('試分析總')
             CHGVAR     VAR(&PRTFID) VALUE('SAR067P')

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRDBF     FILE(SOSNPF) SHARE(*YES)

             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' (SC01 *EQ %RANGE("' +
                          *CAT &DSC01S *CAT '" "' *CAT &DSC01E *CAT +
                          '")) & (CSC08 *EQ %RANGE("' *CAT &YMD8S +
                          *CAT '" "' *CAT &YMD8E *CAT '")) & SC03 +
                          *EQ "S4" ') KEYFLD((SC10) (SC04) (SC05)) +
                          MAPFLD((CSC08 SC08 *CHAR 8))

/*M001D                   '")) & (CSC08 *EQ %RANGE("' *CAT &DATES +
                          *CAT '" "' *CAT &DATEE *CAT '")) & SC03 +
                          MAPFLD((CSC08 SC08 *CHAR 6))  */
             OPNQRYF    FILE((SOSNPF)) QRYSLT(' (SN01 *EQ %RANGE("' +
                          *CAT &DSC01S *CAT '" "' *CAT &DSC01E *CAT +
                          '")) & (CSN06 *EQ %RANGE("' *CAT &YMD8S +
                          *CAT '" "' *CAT &YMD8E *CAT '")) & SN02A +
                          *EQ "R3" ') KEYFLD((SN04) (SN11)) +
                          MAPFLD((CSN06 SN06 *CHAR 8) (SN02A +
                          '%SST(SN02 3 2)' *CHAR 2))

/*M001D                   '")) & (CSN06 *EQ %RANGE("' *CAT &DATES +
                          *CAT '" "' *CAT &DATEE *CAT '")) & SN02A +
                          MAPFLD((CSN06 SN06 *CHAR 6) (SN02A +   */
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' (SC01 *EQ %RANGE("' +
                          *CAT &DSC01S *CAT '" "' *CAT &DSC01E *CAT +
                          '")) & (CSC39 *EQ %RANGE("' *CAT &YMD8S +
                          *CAT '" "' *CAT &YMD8E *CAT '")) & SC03 +
                          *EQ "S4" ') KEYFLD((SC10) (SC04) (SC05)) +
                          MAPFLD((CSC39 SC39 *CHAR 8))
/*M001D                   '")) & (CSC39 *EQ %RANGE("' *CAT &DATES +
                          *CAT '" "' *CAT &DATEE *CAT '")) & SC03 +
                          MAPFLD((CSC39 SC39 *CHAR 6))    */
             OPNQRYF    FILE((SOSNPF)) QRYSLT(' (SN01 *EQ %RANGE("' +
                          *CAT &DSC01S *CAT '" "' *CAT &DSC01E *CAT +
                          '")) & (CSN06 *EQ %RANGE("' *CAT &YMD8S +
                          *CAT '" "' *CAT &YMD8E *CAT '")) & SN02A +
                          *EQ "R3" ') KEYFLD((SN04) (SN11)) +
                          MAPFLD((CSN06 SN06 *CHAR 8) (SN02A +
                          '%SST(SN02 3 2)' *CHAR 2))
/*M001D                   '")) & (CSN06 *EQ %RANGE("' *CAT &DATES +
                         *CAT '" "' *CAT &DATEE *CAT '")) & SN02A +
                          MAPFLD((CSN06 SN06 *CHAR 6) (SN02A */

             ENDDO

             CALL       SAR0671
             CALL       SAR0672

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSNPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE(&PRTFID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
