     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       :                                           */
     /*    CREATE DATE  : 81/05/05                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR041C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款作業                             */
     /*    REMARK       :客戶退貨明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSG12S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSG12E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSG11S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG11E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSG04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSG06S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG06E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG26S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG26E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATES) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG03)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN20)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DATA1)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&CPT1) TYPE(*CHAR) LEN(2)
             DCL        VAR(&CPT2) TYPE(*CHAR) LEN(2)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))

             CHGVAR     VAR(&DSG12S) VALUE(%SST(*LDA 601 4))
             CHGVAR     VAR(&DSG12E) VALUE(%SST(*LDA 605 4))
             CHGVAR     VAR(&DSG11S) VALUE(%SST(*LDA 611 6))
             CHGVAR     VAR(&DSG11E) VALUE(%SST(*LDA 617 6))
             CHGVAR     VAR(&DSG04S) VALUE(%SST(*LDA 631 5))
             CHGVAR     VAR(&DSG04E) VALUE(%SST(*LDA 636 5))
             CHGVAR     VAR(&DSG03)  VALUE(%SST(*LDA 661 1))
             CHGVAR     VAR(&IN20)  VALUE(%SST(*LDA 662 1))
             CHGVAR     VAR(&DATA1)  VALUE(%SST(*LDA 663 1))
             CHGVAR     VAR(&DSG06S) VALUE(%SST(*LDA 641 6))
             CHGVAR     VAR(&DSG06E) VALUE(%SST(*LDA 647 6))
             CHGVAR     VAR(&DSG26S) VALUE(%SST(*LDA 673 6))
             CHGVAR     VAR(&DSG26E) VALUE(%SST(*LDA 679 6))
             CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 685 6))
             CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 691 6))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 672 1))

     /*******銷貨退回*/
             IF         COND(&DSG03 *EQ 'A') THEN(DO)
             OVRPRTF    FILE(SAR041AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客退貨明')
             OVRDBF     FILE(SOSGPF) SHARE(*YES)

             IF         COND(&IN20 *EQ '0') THEN(DO)
             OPNQRYF    FILE((SOSGPF)) QRYSLT(' (SG12 *EQ %RANGE("' +
                          *CAT &DSG12S *CAT '" "' *CAT &DSG12E *CAT +
                          '")) & SG02B *NE "K"     &              +
                          (SG11 *EQ %RANGE("' *CAT &DSG11S +
                          *CAT '" "' *CAT &DSG11E *CAT '")) & (SG04 +
                          *EQ %RANGE("' *CAT &DSG04S *CAT '" "' +
                          *CAT &DSG04E *CAT '")) & (MSG06 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '")) & (SG03 *EQ "R1" ) & +
                          (SG01A *EQ %RANGE("' *CAT &COMPS *CAT '" +
                          "' *CAT &COMPE *CAT '")) ') KEYFLD((SG11) +
                          (SG04) (SG05) (SG02)) MAPFLD((SG01A +
                          '%SST(SG01 2 1)' *CHAR 1) (MSG06 SG06 +
                          *CHAR 8) (SG02B '%SST(SG02 3 1)'))
/*M001D                   %RANGE("' *CAT &DATES *CAT '" "' *CAT +
                          &DATEE *CAT '")) & (SG03 *EQ "R1" ) & +
                          *CHAR 6) (SG02B '%SST(SG02 3 1)'))  */
             ENDDO
             ELSE       CMD(DO)
/*確認日期需為全部折讓或轉帳單據SG14<>" " AND SG14<>"*"        */
             OPNQRYF    FILE((SOSGPF)) QRYSLT(' SG12 *EQ %RANGE("' +
                          *CAT &DSG12S *CAT '" "' *CAT &DSG12E *CAT +
                          '") & SG02B *NE "K"   &                +
                          SG11 *EQ %RANGE("' *CAT &DSG11S +
                          *CAT '" "' *CAT &DSG11E *CAT '") & SG04 +
                          *EQ %RANGE("' *CAT &DSG04S *CAT '" "' +
                          *CAT &DSG04E *CAT '") & MSG26 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") & SG03 *EQ "R1"   & SG01A +
                          *EQ %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") *AND SG14 *NE " " *AND +
                          SG14 *NE "*" ') KEYFLD((SG11) (SG04) +
                          (SG05) (SG02)) MAPFLD((SG01A '%SST(SG01 2 +
                          1)' *CHAR 1) (MSG26 SG26 *CHAR 8) (SG02B +
                          '%SST(SG02 3 1)'))
/*M001D                   %RANGE("' *CAT &DATES *CAT '" "' *CAT +
                          &DATEE *CAT '") & SG03 *EQ "R1"   & SG01A +
                          1)' *CHAR 1) (MSG26 SG26 *CHAR 6) (SG02B + */
             ENDDO

             CALL       SAR0411

             CLOF       OPNID(SOSGPF)
             DLTOVR     FILE(SAR041AP)
             DLTOVR     FILE(SOSGPF)
             ENDDO

             ELSE       CMD(DO)
     /*******產品收回*/
             OVRPRTF    FILE(SAR041BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客退貨明')
             OVRDBF     FILE(SOSNPF) SHARE(*YES)

     /*含試飲退回－打單日期*/
             IF         COND(&IN20 *EQ '0') THEN(DO)
             IF         COND(&DATA1 *EQ '1') THEN(DO)
             OPNQRYF    FILE((SOSNPF)) QRYSLT(' (SN08 *EQ %RANGE("' +
                          *CAT &DSG12S *CAT '" "' *CAT &DSG12E *CAT +
                          '")) & (SN07 *EQ %RANGE("' *CAT &DSG11S +
                          *CAT '" "' *CAT &DSG11E *CAT '")) & (SN03 +
                          *EQ %RANGE("' *CAT &DSG04S *CAT '" "' +
                          *CAT &DSG04E *CAT '")) & (MSN05 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '")) *AND  (SN10 *NE "T" ) & +
                          (SN01A *EQ %RANGE("' *CAT &COMPS *CAT '" +
                          "' *CAT &COMPE *CAT '")) ') KEYFLD((SN07) +
                          (SN03) (SN11) (SN02)) MAPFLD((SN021 +
                          '%SST(SN02 3 2)' *CHAR 2) (SN01A +
                          '%SST(SN01 2 1)' *CHAR 1) (MSN05 SN05 +
                          *CHAR 8))
             ENDDO
     /*不含試飲退回－打單日期*/
             IF         COND(&DATA1 *EQ '2') THEN(DO)
             OPNQRYF    FILE((SOSNPF)) QRYSLT(' (SN08 *EQ %RANGE("' +
                          *CAT &DSG12S *CAT '" "' *CAT &DSG12E *CAT +
                          '")) & (SN07 *EQ %RANGE("' *CAT &DSG11S +
                          *CAT '" "' *CAT &DSG11E *CAT '")) & (SN03 +
                          *EQ %RANGE("' *CAT &DSG04S *CAT '" "' +
                          *CAT &DSG04E *CAT '")) & (MSN05 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '")) *AND  (SN021 *NE "R3" ) +
                          & (SN01A *EQ %RANGE("' *CAT &COMPS *CAT +
                          '" "' *CAT &COMPE *CAT '")) & (SN10 *NE +
                          "T")') KEYFLD((SN07) (SN03) (SN11) +
                          (SN02)) MAPFLD((SN021 '%SST(SN02 3 2)' +
                          *CHAR 2) (SN01A '%SST(SN01 2 1)' *CHAR 1) +
                          (MSN05 SN05 *CHAR 8))
             ENDDO
     /*僅含試飲退回－打單日期*/
             IF         COND(&DATA1 *EQ '3') THEN(DO)
             OPNQRYF    FILE((SOSNPF)) QRYSLT(' SN08 *EQ %RANGE("' +
                          *CAT &DSG12S *CAT '" "' *CAT &DSG12E *CAT +
                          '") & SN07 *EQ %RANGE("' *CAT &DSG11S +
                          *CAT '" "' *CAT &DSG11E *CAT '") & SN03 +
                          *EQ %RANGE("' *CAT &DSG04S *CAT '" "' +
                          *CAT &DSG04E *CAT '") & MSN05 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") *AND  SN021 *EQ "R3"  & +
                          SN01A *EQ %RANGE("' *CAT &COMPS *CAT '" +
                          "' *CAT &COMPE *CAT '") & SN10 *NE "T" ') +
                          KEYFLD((SN07) (SN03) (SN11) (SN02)) +
                          MAPFLD((SN021 '%SST(SN02 3 2)' *CHAR 2) +
                          (SN01A '%SST(SN01 2 1)' *CHAR 1) (MSN05 +
                          SN05 *CHAR 8))
             ENDDO
             ENDDO
             ELSE       CMD(DO)
     /*含試飲退回－確認日期*/
             IF         COND(&DATA1 *EQ '1') THEN(DO)
             OPNQRYF    FILE((SOSNPF)) QRYSLT(' (SN08 *EQ %RANGE("' +
                          *CAT &DSG12S *CAT '" "' *CAT &DSG12E *CAT +
                          '")) & (SN07 *EQ %RANGE("' *CAT &DSG11S +
                          *CAT '" "' *CAT &DSG11E *CAT '")) & (SN03 +
                          *EQ %RANGE("' *CAT &DSG04S *CAT '" "' +
                          *CAT &DSG04E *CAT '")) & (MSN06 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '"))  +
                          & (SN01A *EQ %RANGE("' *CAT &COMPS *CAT +
                          '" "' *CAT &COMPE *CAT '")) & (SN10 *NE +
                          "T")') KEYFLD((SN07) (SN03) (SN11) +
                          (SN02)) MAPFLD((SN021 '%SST(SN02 3 2)' +
                          *CHAR 2) (SN01A '%SST(SN01 2 1)' *CHAR 1) +
                          (MSN06 SN06 *CHAR 8))
             ENDDO
     /*不含試飲退回－確認日期*/
             IF         COND(&DATA1 *EQ '2') THEN(DO)
             OPNQRYF    FILE((SOSNPF)) QRYSLT(' (SN08 *EQ %RANGE("' +
                          *CAT &DSG12S *CAT '" "' *CAT &DSG12E *CAT +
                          '")) & (SN07 *EQ %RANGE("' *CAT &DSG11S +
                          *CAT '" "' *CAT &DSG11E *CAT '")) & (SN03 +
                          *EQ %RANGE("' *CAT &DSG04S *CAT '" "' +
                          *CAT &DSG04E *CAT '")) & (MSN06 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '")) *AND  (SN021 *NE "R3" ) +
                          & (SN01A *EQ %RANGE("' *CAT &COMPS *CAT +
                          '" "' *CAT &COMPE *CAT '")) & (SN10 *NE +
                          "T")') KEYFLD((SN07) (SN03) (SN11) +
                          (SN02)) MAPFLD((SN021 '%SST(SN02 3 2)' +
                          *CHAR 2) (SN01A '%SST(SN01 2 1)' *CHAR 1) +
                          (MSN06 SN06 *CHAR 8))
             ENDDO
     /*僅含試飲退回－確認日期*/
             IF         COND(&DATA1 *EQ '3') THEN(DO)
             OPNQRYF    FILE((SOSNPF)) QRYSLT(' (SN08 *EQ %RANGE("' +
                          *CAT &DSG12S *CAT '" "' *CAT &DSG12E *CAT +
                          '")) & (SN07 *EQ %RANGE("' *CAT &DSG11S +
                          *CAT '" "' *CAT &DSG11E *CAT '")) & (SN03 +
                          *EQ %RANGE("' *CAT &DSG04S *CAT '" "' +
                          *CAT &DSG04E *CAT '")) & (MSN06 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '")) *AND  (SN021 *EQ "R3" ) +
                          & (SN01A *EQ %RANGE("' *CAT &COMPS *CAT +
                          '" "' *CAT &COMPE *CAT '")) & (SN10 *NE +
                          "T")') KEYFLD((SN07) (SN03) (SN11) +
                          (SN02)) MAPFLD((SN021 '%SST(SN02 3 2)' +
                          *CHAR 2) (SN01A '%SST(SN01 2 1)' *CHAR 1) +
                          (MSN06 SN06 *CHAR 8))
             ENDDO
             ENDDO

             CALL       SAR0412

             CLOF       OPNID(SOSNPF)
             DLTOVR     FILE(SAR041BP)
             DLTOVR     FILE(SOSNPF)
             ENDDO


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             IF         COND(&DSG03 *EQ 'A') THEN(DO)
               CHGVAR     VAR(&P6601I) VALUE('SAR041AP')
                        ENDDO
             ELSE
             IF         COND(&DSG03 *EQ 'B') THEN(DO)
               CHGVAR     VAR(&P6601I) VALUE('SAR041BP')
                        ENDDO

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
