     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       :                                           */
     /*    CREATE DATE  : 81/05/05                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR077C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款作業                             */
     /*    REMARK       :客戶退貨明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSG18S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSG18E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DATES) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DATEE) TYPE(*CHAR) LEN(6)

             DCL        VAR(&CPT1) TYPE(*CHAR) LEN(2)
             DCL        VAR(&CPT2) TYPE(*CHAR) LEN(2)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&DSG18S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DSG18E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 685 6))
             CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 691 6))


             OVRPRTF    FILE(SAR077P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('康退折差')
             OVRDBF     FILE(SOSGPF) SHARE(*YES)

             OPNQRYF    FILE((SOSGPF)) QRYSLT(' (SG18a *EQ %RANGE("' +
                          *CAT &DSG18S *CAT '" "' *CAT &DSG18E *CAT +
                          '")) & (MSG26 *EQ %RANGE("' *CAT &YMD8S +
                          *CAT '" "' *CAT &YMD8E *CAT '")) & (SG04 +
                          *EQ "B0000" ) & ((SG14 *EQ "N") *OR (SG14 +
                          *EQ "A")) & (SG02A *EQ "K") ') +
                          KEYFLD(*FILE) MAPFLD((SG18A '%SST(SG18 1 +
                          5)' *CHAR 5) (MSG26 SG26 *CHAR 8) (SG02A +
                          '%sst(sg02 3 1)' *CHAR 1))
/*M001D                   '")) & (MSG26 *EQ %RANGE("' *CAT &DATES +
                          *CAT '" "' *CAT &DATEE *CAT '")) & (SG04 +
                        5)' *CHAR 5) (MSG26 SG26 *CHAR 6) (SG02A +  */

             CALL       SAR0771

             CLOF       OPNID(SOSGPF)
             DLTOVR     FILE(SAR077P)
             DLTOVR     FILE(SOSGPF)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

               CHGVAR     VAR(&P6601I) VALUE('SAR077P')

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
