     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1084  CHARLES                            */
     /*    CREATE DATE  : 81/05/04                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR055C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :客戶毛利金額排行榜                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSC01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&WSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WSC39E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC34S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC34E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&NO)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&MBR)    TYPE(*CHAR) LEN(10)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&DSC01S) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DSC01E) VALUE(%SST(*LDA 603 5))
             CHGVAR     VAR(&DSC04S) VALUE(%SST(*LDA 605 5))
             CHGVAR     VAR(&DSC04E) VALUE(%SST(*LDA 610 5))
             CHGVAR     VAR(&WSC39S) VALUE(%SST(*LDA 627 6))
             CHGVAR     VAR(&WSC39E) VALUE(%SST(*LDA 633 6))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 641 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 642 1))
             CHGVAR     VAR(&DSC34S) VALUE(%SST(*LDA 643 2))
             CHGVAR     VAR(&DSC34E) VALUE(%SST(*LDA 645 2))
             CHGVAR     VAR(&DSC31S) VALUE(%SST(*LDA 647 2))
             CHGVAR     VAR(&DSC31E) VALUE(%SST(*LDA 649 2))
             CHGVAR     VAR(&IN20) VALUE(%SST(*LDA 750 1))

             RTVJOBA    NBR(&NO)
             CHGVAR     VAR(&MBR)    VALUE('SA' *TCAT &NO)
             ADDPFM     FILE(REWF26) MBR(&MBR)
             MONMSG     MSGID(CPF7306) EXEC(CLRPFM FILE(REWF26) +
                          MBR(&MBR))
             OVRDBF     FILE(REWF26) MBR(&MBR)

             ADDLFM     FILE(REWF26L1) MBR(&MBR) +
                          DTAMBRS((REFLIB/REWF26 (&MBR)))
             MONMSG     MSGID(CPF7306)
             OVRDBF     FILE(REWF26L1) MBR(&MBR)

             ADDLFM     FILE(REWF26L2) MBR(&MBR) +
                          DTAMBRS((REFLIB/REWF26 (&MBR)))
             MONMSG     MSGID(CPF7306)
             OVRDBF     FILE(REWF26L2) MBR(&MBR)

             OVRPRTF    FILE(SAR055P) USRDTA('客毛利排')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             IF         COND(&IN20 = '1') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01 *EQ %RANGE("' +
                          *CAT &DSC01S *CAT '" "' *CAT &DSC01E *CAT +
                          '") & SC04 *EQ %RANGE("' *CAT &DSC04S +
                          *CAT '" "' *CAT &DSC04E *CAT '") & MSC39 +
                          *EQ %RANGE("' *CAT &YMD8S *CAT '" "' +
                          *CAT &YMD8E *CAT '") & SC33 *EQ %RANGE("' +
                          *CAT &DSC33S *CAT '" "' *CAT &DSC33E *CAT +
                          '") & SC34 *EQ %RANGE("' *CAT &DSC34S +
                          *CAT '" "' *CAT &DSC34E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC13 *EQ "V" & +
                          SC35 *NE "T" ') KEYFLD((SC02)) +
                          MAPFLD((MSC39 SC39 *CHAR 8))
/*M001D                   *EQ %RANGE("' *CAT &WSC39S *CAT '" "' +
                          *CAT &WSC39E *CAT '") & SC33 *EQ %RANGE("' +
                          MAPFLD((MSC39 SC39 *CHAR 6))    */
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01 *EQ %RANGE("' +
                          *CAT &DSC01S *CAT '" "' *CAT &DSC01E *CAT +
                          '") & SC04 *EQ %RANGE("' *CAT &DSC04S +
                          *CAT '" "' *CAT &DSC04E *CAT '") & MSC08 +
                          *EQ %RANGE("' *CAT &YMD8S *CAT '" "' +
                          *CAT &YMD8E *CAT '") & SC33 *EQ %RANGE("' +
                          *CAT &DSC33S *CAT '" "' *CAT &DSC33E *CAT +
                          '") & SC34 *EQ %RANGE("' *CAT &DSC34S +
                          *CAT '" "' *CAT &DSC34E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC13 *NE "*" & +
                          SC35 *NE "T" ') KEYFLD((SC02)) +
                          MAPFLD((MSC08 SC08 *CHAR 8))
/*M001D                   *EQ %RANGE("' *CAT &WSC39S *CAT '" "' +
                          *CAT &WSC39E *CAT '") & SC33 *EQ %RANGE("' +
                          MAPFLD((MSC08 SC08 *CHAR 6))    */
             ENDDO

             CALL       SAR0551
             CALL       SAR0552
             CLOF       OPNID(SOSCPF)
     /***** CLR MEMBER --> REWF26                               *****/
             RMVM       FILE(REWF26L1) MBR(&MBR)
             RMVM       FILE(REWF26L2) MBR(&MBR)
             RMVM       FILE(REWF26) MBR(&MBR)

             DLTOVR     FILE(*ALL)



             CHGVAR     VAR(&P6601I) VALUE('SAR055P')
             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
