     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : ANDY                                      */
     /*    CREATE DATE  : 81/05/19                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SAR050C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款作業                             */
     /*    REMARK       :搭贈分析表                               */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

  /*M001M    DCL        VAR(&DATES) TYPE(*CHAR) LEN(6) */
 /*M001M     DCL        VAR(&DATEE) TYPE(*CHAR) LEN(6) */
  /*M001M*/  DCL        VAR(&DATES) TYPE(*CHAR) LEN(8)
 /*M001M*/   DCL        VAR(&DATEE) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC39E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC07S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC07E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DCS01S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCS01E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSD03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSD03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMA11S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMA11E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&PRTFID) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CPT1)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)


             CHGVAR     VAR(&DSC07S) VALUE(%SST(*LDA 605 +
                          2) || %SST(*LDA 601 4))
             CHGVAR     VAR(&DSC07E) VALUE(%SST(*LDA 611 +
                          2) || %SST(*LDA 607 4))
 /*M001M     CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 713 6)) */
 /*M001M     CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 719 6)) */
 /*M001M*/   CHGVAR     VAR(&DATES) VALUE(%SST(*LDA 713 8))
 /*M001M*/   CHGVAR     VAR(&DATEE) VALUE(%SST(*LDA 721 8))
             CHGVAR     VAR(&DSC39S) VALUE(%SST(*LDA 701 6))
             CHGVAR     VAR(&DSC39E) VALUE(%SST(*LDA 706 6))
             CHGVAR     VAR(&DCS01S) VALUE(%SST(*LDA 621 9))
             CHGVAR     VAR(&DCS01E) VALUE(%SST(*LDA 631 9))
             CHGVAR     VAR(&DSD03S) VALUE(%SST(*LDA 641 9))
             CHGVAR     VAR(&DSD03E) VALUE(%SST(*LDA 651 9))
             CHGVAR     VAR(&DSC01S) VALUE(%SST(*LDA 661 2))
             CHGVAR     VAR(&DSC01E) VALUE(%SST(*LDA 663 2))
             CHGVAR     VAR(&DMA11S) VALUE(%SST(*LDA 798 1))
             CHGVAR     VAR(&DMA11E) VALUE(%SST(*LDA 799 1))
             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 620 1))
             CHGVAR     VAR(&CPT1)  VALUE('00000')
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))

             OVRDBF     FILE(REWF20) TOFILE(SOSDPF) SHARE(*YES)

             IF         COND(&DSEL = 'A') THEN(DO)

             OVRPRTF    FILE(SAR050AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('搭贈析Ａ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR050AP')

             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF20) QRYSLT('SC01 *EQ %RANGE("' +
                          *CAT &DSC01S *CAT '" "' *CAT &DSC01E *CAT +
                          '") & CSC08 *EQ %RANGE("' *CAT &DATES +
                          *CAT '" "' *CAT &DATEE *CAT '") & MA11A  +
                          *EQ %RANGE("' *CAT &DMA11S *CAT '" "' +
                          *CAT &DMA11E *CAT '")  & SD03 *EQ +
                          %RANGE("' *CAT &DSD03S *CAT '" "' *CAT +
                          &DSD03E *CAT '") & CS01 *EQ %RANGE("' +
                          *CAT &DCS01S *CAT '" "' *CAT &DCS01E *CAT +
                          '") *AND SD05 *NE ' *CAT &CPT1 *CAT ' +
                          *AND  SC13 *NE "*" *AND  SC35 *NE "T" ') +
                          KEYFLD((SC04) (SC05) (SD03) (SD02)) +
                          JFLD((1/SD02 2/SC02 *EQ) (1/SD03 3/MA01)) +
                          MAPFLD((CSC08 SC08 *CHAR 8) (CS01 'SC04 +
                          *CAT SC05' *CHAR 9) (MA11A '%sst(ma11 1 +
                          1)' *CHAR 1))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF20) QRYSLT('SC01 *EQ %RANGE("' +
                          *CAT &DSC01S *CAT '" "' *CAT &DSC01E *CAT +
                          '") & CSC39 *EQ %RANGE("' *CAT &DATES +
                          *CAT '" "' *CAT &DATEE *CAT '") & MA11A +
                          *EQ %RANGE("' *CAT &DMA11S *CAT '" "' +
                          *CAT &DMA11E *CAT '") & SD03 *EQ +
                          %RANGE("' *CAT &DSD03S *CAT '" "' *CAT +
                          &DSD03E *CAT '") &  CS01 *EQ %RANGE("' +
                          *CAT &DCS01S *CAT '" "' *CAT &DCS01E *CAT +
                          '") *AND SD05 *NE ' *CAT &CPT1 *CAT ' +
                          *AND  SC13 *EQ "V" *AND  SC35 *NE "T" ') +
                          KEYFLD((SC04) (SC05) (SD03) (SD02)) +
                          JFLD((1/SD02 2/SC02 *EQ) (1/SD03 3/MA01)) +
                          MAPFLD((CSC39 SC39 *CHAR 8) (CS01 'SC04 +
                          *CAT SC05' *CHAR 9) (MA11A '%SST(ma11 1 +
                          1)' *CHAR 1))
             ENDDO

             CALL       SAR0501
             ENDDO

             IF         COND(&DSEL = 'B') THEN(DO)

             OVRPRTF    FILE(SAR050BP) PAGESIZE(*N 198) CPI(15)  +
                        USRDTA('搭贈析Ｂ')
             CHGVAR     VAR(&PRTFID) VALUE('SAR050BP')

             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF20) QRYSLT(' SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '") & CSC08 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '") & MA11A *EQ %RANGE("' *CAT &DMA11S +
                          *CAT '" "' *CAT &DMA11E *CAT '") & SD03 +
                          *EQ %RANGE("' *CAT &DSD03S *CAT '" "' +
                          *CAT &DSD03E *CAT '") *AND SD05 *NE ' +
                          *CAT &CPT1 *CAT ' *AND  SC13 *NE "*" +
                          *AND  SC35 *NE "T" ') KEYFLD((SD16) +
                          (SD03) (SC04) (SC05) (SD02)) JFLD((1/SD02 +
                          2/SC02 *EQ) (1/SD03 3/MA01)) +
                          MAPFLD((CSC08 SC08 *CHAR 8) (MA11A +
                          '%SST(ma11 1 1)' *CHAR 1))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSDPF) (SOSCPF) (MTMAPF)) +
                          FORMAT(REWF20) QRYSLT(' SC01 *EQ +
                          %RANGE("' *CAT &DSC01S *CAT '" "' *CAT +
                          &DSC01E *CAT '") & CSC39 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '") & MA11A *EQ %RANGE("' *CAT &DMA11S +
                          *CAT '" "' *CAT &DMA11E *CAT '") & SD03 +
                          *EQ %RANGE("' *CAT &DSD03S *CAT '" "' +
                          *CAT &DSD03E *CAT '") *AND SD05 *NE ' +
                          *CAT &CPT1 *CAT ' *AND  SC13 *EQ "V" +
                          *AND  SC35 *NE "T" ') KEYFLD((SD16) +
                          (SD03) (SC04) (SC05) (SD02)) JFLD((1/SD02 +
                          2/SC02 *EQ) (1/SD03 3/MA01)) +
                          MAPFLD((CSC39 SC39 *CHAR 8) (MA11A +
                          '%SST(ma11 1 1)' *CHAR 1))
             ENDDO

             CALL       SAR0502
             ENDDO

             CLOF       OPNID(SOSDPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE(&PRTFID)
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
