     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1034   STEPHANIE                         */
     /*    CREATE DATE  : 81/06/03                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOA020 SOA0201                            */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售訂單系統                             */
     /*    REMARK       :訂單批次處理                             */
     /***************************************************************/
             PGM

             DCL        VAR(&DSC01) TYPE(*CHAR) LEN(2)
             DCL        VAR(&WSC07S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WSC07E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC11S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC11E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(SOA020) PARM(&IN03 &IN14 &IN97 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DSC01) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&WSC07S) VALUE(%SST(*LDA 603 6))
             CHGVAR     VAR(&WSC07E) VALUE(%SST(*LDA 609 6))
             CHGVAR     VAR(&DSC04S) VALUE(%SST(*LDA 621 5))
             CHGVAR     VAR(&DSC04E) VALUE(%SST(*LDA 631 5))
             CHGVAR     VAR(&DSC11S) VALUE(%SST(*LDA 701 5))
             CHGVAR     VAR(&DSC11E) VALUE(%SST(*LDA 706 5))

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRPRTF    FILE(SOA020P) USRDTA('普銷批次')
             OVRPRTF    FILE(SOA020BP) USRDTA('普銷批次')
  /*產生送貨單  */
             OPNQRYF    FILE((SOSCPF)) OPTION(*ALL) QRYSLT(' +
                          SC01  *EQ       ("' *CAT &DSC01 *CAT '") +
                        & SC07  *EQ %RANGE('  *CAT &WSC07S *CAT ' +
                                           '  *CAT &WSC07E *CAT ') +
                        & SC04  *EQ %RANGE("' *CAT &DSC04S *CAT '" +
                                           "' *CAT &DSC04E *CAT '") +
                        & SC11  *EQ %RANGE("' *CAT &DSC11S *CAT '" +
                                           "' *CAT &DSC11E *CAT '") +
                        & (SC03 *EQ "S3" *OR SC03 *EQ "S1") +
                        & SC30 *EQ " " +
                        & (SC13 *EQ "C" | SC13 *EQ " ") +
                        & SC38 *EQ " " ') +
                          KEYFLD((SC02))

                        CALL       PGM(SOA0201) PARM(&IN96)

             IF         COND(&IN96 = '0') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO
             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)
             OVRDBF     FILE(SOSELF) SHARE(*YES)
             OPNQRYF    FILE((SOSELF)) OPTION(*ALL) QRYSLT(' +
                          SE01  *EQ       ("' *CAT &DSC01 *CAT '") +
                        & SE39  *EQ %RANGE('  *CAT &WSC07S *CAT ' +
                                           '  *CAT &WSC07E *CAT ') +
                        & SE04  *EQ %RANGE("' *CAT &DSC04S *CAT '" +
                                           "' *CAT &DSC04E *CAT '") +
                        & SE07  *EQ %RANGE("' *CAT &DSC11S *CAT '" +
                                           "' *CAT &DSC11E *CAT '") +
                        & SE25 *NE "V" +
                        & (SE09 *EQ "C" | SE09 *EQ " ") +
                        & SE40 *EQ " " ') +
                          KEYFLD((SE02))

                        CALL       PGM(SOA0202) PARM(&IN96)

             CLOF       OPNID(SOSELF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
