     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    DSPF NAME    : SOA025C                                   */
     /*    AUTHOR       : MERCURY                                   */
     /*    CREATE DATE  : 82/11/10                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOA025                                    */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售訂單系統                             */
     /*    REMARK       :通路新增報價拷貝批次作業                 */
     /***************************************************************/
             PGM

             DCL        VAR(&DSA021) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSA022) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSA04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&YSA05) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YSA13) TYPE(*CHAR) LEN(8)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN04)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(SOA025) PARM(&IN03 &IN04 &IN14 &IN97 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 300)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DSA021) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DSA022) VALUE(%SST(*LDA 602 2))
             CHGVAR     VAR(&DSA04) VALUE(%SST(*LDA 606 1))
             CHGVAR     VAR(&YSA05) VALUE(%SST(*LDA 607 8))
             CHGVAR     VAR(&YSA13) VALUE(%SST(*LDA 615 8))

             OVRDBF     FILE(SOSALF) SHARE(*YES)
             OPNQRYF    FILE((SOSALF)) QRYSLT(' SA02 *EQ ("' *CAT +
                          &DSA021 *CAT '") & SA05  *EQ (' *CAT +
                          &YSA05 *CAT ' ) & SA13  *EQ (' *CAT +
                          &YSA13 *CAT ' ) & SA04 *EQ ("' *CAT +
                          &DSA04 *CAT '") & SA03 *EQ ("' *CAT +
                          &DSA022 *CAT '")')
                        CALL       PGM(SOA0251) PARM(&IN96)

             IF         COND(&IN96 = '0') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO
             CLOF       OPNID(SOSALF)
             DLTOVR     FILE(SOSALF)

             ENDDO

             GOTO       START
             ENDPGM
