             PGM

             DCL        VAR(&YSC39S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YSC39E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(SOA014) PARM(&IN03 &IN14 &IN97 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&YSC39S) VALUE(%SST(*LDA 617 8))
             CHGVAR     VAR(&YSC39E) VALUE(%SST(*LDA 625 8))

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OVRDBF     FILE(SOSNPF) SHARE(*YES)
             OVRPRTF    FILE(SOA014P) USRDTA('¾P°â¤ëµ²')
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC39 *EQ %RANGE(' +
                          *CAT &YSC39S *CAT ' ' *CAT &YSC39E *CAT +
                          ') ') KEYFLD(*FILE)

             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG26 *EQ %RANGE(' +
                          *CAT &YSC39S *CAT ' ' *CAT &YSC39E *CAT +
                          ') ') KEYFLD(*FILE)

             OPNQRYF    FILE((SOSNPF)) QRYSLT('SN06 *EQ %RANGE(' +
                          *CAT &YSC39S *CAT ' ' *CAT &YSC39E *CAT +
                          ') ') KEYFLD(*FILE)

             CALL       PGM(SOA0141) PARM(&IN96)
             IF         COND(&IN96 = '0') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSGPF)
             CLOF       OPNID(SOSNPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
