             PGM

             DCL        VAR(&WSU02)    TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&WSU02)    VALUE(%SST(*LDA 501 6))


             OVRDBF     FILE(SOSULF02) SHARE(*YES)
             OPNQRYF    FILE((SOSULF02)) OPTION(*ALL) QRYSLT(' +
                            SU02 *EQ  '|| &WSU02 ||'  ') +
                          KEYFLD((*FILE))

             CALL       SOA0341
             CLOF       OPNID(SOSULF02)
             DLTOVR     FILE(*ALL)

             ENDPGM
