             PGM

             DCL        VAR(&DST01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DST01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&YST02) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(SOA023) PARM(&IN03 &IN14 &IN97 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DST01S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DST01E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&YST02) VALUE(%SST(*LDA 611 6))

             CPYF       FROMFILE(REWFA4) TOFILE(QTEMP/REWFA4) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFA4))
             OVRDBF     FILE(REWFA4) TOFILE(QTEMP/REWFA4) SHARE(*YES)

             OVRPRTF    FILE(SOA023P) PAGESIZE(*N 198) CPI(15)

             OVRDBF     FILE(SOSTLF3) SHARE(*YES)
             OPNQRYF    FILE((SOSTLF3)) OPTION(*ALL) QRYSLT('ST01 +
                          *EQ %RANGE("' *CAT &DST01S *CAT '" "' +
                          *CAT &DST01E *CAT '") & ST02 *EQ ' *CAT +
                          &YST02 *CAT ' & ST13 *NE "V" ') KEYFLD(*FILE)

             CALL       PGM(SOA0234) PARM(&IN96)
             IF         COND(&IN96 = '0') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO
             CALL       PGM(SOA0233)

             CLOF       OPNID(SOSTLF3)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
