     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : JUDY LEE                                  */
     /*    CREATE DATE  : 1993.10.12                                */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOA024                                    */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售訂單系統                             */
     /*    REMARK       :客戶新增報價拷貝批次作業                 */
     /***************************************************************/
             PGM

             DCL        VAR(&DSB01) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSB04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&YSB05) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YSB13) TYPE(*CHAR) LEN(8)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN04)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(SOA024) PARM(&IN03 &IN04 &IN14 &IN97 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 300)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DSB01) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DSB04) VALUE(%SST(*LDA 606 1))
             CHGVAR     VAR(&YSB05) VALUE(%SST(*LDA 607 8))
             CHGVAR     VAR(&YSB13) VALUE(%SST(*LDA 615 8))

             OVRDBF     FILE(SOSBLF) SHARE(*YES)
             OPNQRYF    FILE((SOSBLF)) QRYSLT(' SB01 *EQ ("' *CAT +
                          &DSB01 *CAT '") & MSB05  *EQ ("' *CAT +
                          &YSB05 *CAT '" ) & MSB13  *EQ ("' *CAT +
                          &YSB13 *CAT '" ) & SB04 *EQ ("' *CAT +
                          &DSB04 *CAT '")') MAPFLD((MSB05 SB05 +
                          *CHAR 8) (MSB13 SB13 *CHAR 8))

                        CALL       PGM(SOA0241) PARM(&IN96)

             IF         COND(&IN96 = '0') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO
             CLOF       OPNID(SOSBLF)
             DLTOVR     FILE(SOSBLF)

             ENDDO

             GOTO       START
             ENDPGM
