             PGM

             DCL        VAR(&DATE) TYPE(*CHAR) LEN(4)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(SOA014X) PARM(&IN03 &IN14 &IN97 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DATE) VALUE(%SST(*LDA 601 4))

             OVRDBF     FILE(SOCDPF) SHARE(*YES)
             OPNQRYF    FILE((SOCDPF)) OPTION(*ALL) QRYSLT('CD01 *GE +
                          ' *CAT &DATE *CAT ' ') KEYFLD(*FILE)

             OVRDBF     FILE(PA#IPF) SHARE(*YES)
             OPNQRYF    FILE((PA#IPF)) OPTION(*ALL) QRYSLT('#I02 *GE +
                          ' *CAT &DATE *CAT ' ') KEYFLD(*FILE)

             CALL       PGM(SOA0141X) PARM(&IN96)
             IF         COND(&IN96 = '0') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO

             CLOF       OPNID(SOCDPF)
             CLOF       OPNID(PA#IPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
