     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1118   PHILIP TSAI                       */
     /*    CREATE DATE  : 81/03/10                                  */
     /*    UPDATE DATE  : 81/04/13 ERROR REPORT                     */
     /* UPDATE DATE  : 81/04/17 結帳註記 ADD FIELD                */
     /*    PROGRAM NAME : SOA0081                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售訂單系統                             */
     /*    REMARK       :訂單批次處理                             */
     /***************************************************************/
             PGM

             OVRDBF     FILE(SOSEPF) SHARE(*YES)

             OPNQRYF    FILE((SOSEPF)) OPTION(*ALL) QRYSLT('SE03 *EQ +
                          "D1" & SE04 *EQ "B0000" & SE09 *EQ "V" & +
                          SE36 *EQ " " &SE24 *NE 0 & SE26 *EQ " " +
                          ') KEYFLD((SE02))

             CALL       PGM(SOA028)

             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
