     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1118   PHILIP TSAI                       */
     /*    CREATE DATE  : 81/03/10                                  */
     /*    UPDATE DATE  : 81/04/13 ERROR REPORT                     */
     /* UPDATE DATE  : 81/04/17 結帳註記 ADD FIELD                */
     /*    PROGRAM NAME : SOA0081                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售訂單系統                             */
     /*    REMARK       :訂單批次處理                             */
     /***************************************************************/
             PGM

             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&PSC11) TYPE(*CHAR) LEN(5)
             DCL        VAR(&WSC08) TYPE(*CHAR) LEN(8)  /* M001 */
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)

             CHGVAR     VAR(&DSEL) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&PSC11) VALUE(%SST(*LDA 609 5))
/*M001M*/    CHGVAR     VAR(&WSC08) VALUE(%SST(*LDA 640 8))
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRPRTF    FILE(SOA008P) USRDTA('訂單批次')
             OVRPRTF    FILE(SOA008BP) USRDTA('訂單批次')

             IF         COND(&DSEL = '1') THEN(DO)
/*SC33通路 SC34型態 SC03單別 SC07訂單日期 SC29送貨單號*/
             OPNQRYF    FILE((SOSCPF)) OPTION(*ALL) QRYSLT('SC01 *NE +
                          "C1" & SC01 *NE "C2" & SC01 *NE "C3" &  +
                          SC03 *NE "S2" & SC03 *NE "S3"  & SC03 *NE +
                          "S7" & SC33 *NE "E" & SC11 *EQ "' *CAT +
                          &PSC11 *CAT '" & SC08 *EQ ' *CAT &WSC08 +
                          *CAT ' & SC29 *EQ " " & SC38 *EQ " "  & +
                          SC30 *EQ " "  & (SC13 *EQ "C" | SC13 *EQ +
                          " ")') KEYFLD((SC02))

             OVRDBF     FILE(SOSELF) SHARE(*YES)
             OPNQRYF    FILE((SOSELF)) OPTION(*ALL) QRYSLT('SE01 *NE +
                          "C1" & SE01 *NE "C2" & SE01 *NE "C3" & +
                          SE27 *NE "E" & (SE03 *EQ "D2" | SE03 *EQ +
                          "D3" | SE03 *EQ "D5" | SE03 *EQ "D6" | +
                          SE03 *EQ "D8" ) & SE07 *EQ "' *CAT &PSC11 +
                          *CAT '" & SE25 *EQ " " & SE36 *EQ " " & +
                          SE06 *EQ ' *CAT &WSC08 *CAT ' & (SE09 *EQ +
                          "C" | SE09 *EQ " ")') KEYFLD((SE02))
             ENDDO
             IF         COND(&DSEL = '2') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) OPTION(*ALL) QRYSLT('SC01 *NE +
                          "C1" & SC01 *NE "C2" & SC01 *NE "C3" & +
                          SC03 *NE "S2" & SC03 *NE "S3"  & SC03 *NE +
                          "S7" & SC33 *EQ "E" & SC11 *EQ "' *CAT +
                          &PSC11 *CAT '" & SC08 *EQ ' *CAT &WSC08 +
                          *CAT ' & SC29 *EQ " " & SC38 *EQ " "  & +
                          SC30 *EQ " "  & (SC13 *EQ "C" | SC13 *EQ +
                          " ")') KEYFLD((SC02))

             OVRDBF     FILE(SOSELF) SHARE(*YES)
             OPNQRYF    FILE((SOSELF)) OPTION(*ALL) QRYSLT('SE01 *NE +
                          "C1" & SE01 *NE "C2" & SE01 *NE "C3" & +
                          SE27 *EQ "E" & (SE03 *EQ "D2" | SE03 *EQ +
                          "D3" | SE03 *EQ "D5" | SE03 *EQ "D6" | +
                          SE03 *EQ "D8" ) & SE07 *EQ "' *CAT &PSC11 +
                          *CAT '" & SE25 *EQ " " & SE36 *EQ " " & +
                          SE06 *EQ ' *CAT &WSC08 *CAT ' & (SE09 *EQ +
                          "C" | SE09 *EQ " ")') KEYFLD((SE02))
             ENDDO
             IF         COND(&DSEL = '3') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) OPTION(*ALL) QRYSLT('SC01 *NE +
                          "C1" & SC01 *NE "C2" & SC01 *NE "C3" & +
                          SC03 *NE "S2" & SC03 *NE "S3"  & SC03 *NE +
                          "S7" & SC11 *EQ "' *CAT &PSC11 *CAT '" & +
                          SC08 *EQ ' *CAT &WSC08 *CAT ' & SC29 *EQ +
                          " " & SC38 *EQ " "  & SC30 *EQ " "  & +
                          (SC13 *EQ "C" | SC13 *EQ " ")') +
                          KEYFLD((SC02))

             OVRDBF     FILE(SOSELF) SHARE(*YES)
             OPNQRYF    FILE((SOSELF)) OPTION(*ALL) QRYSLT('SE01 *NE +
                          "C1" & SE01 *NE "C2" & SE01 *NE "C3" & +
                          (SE03 *EQ "D2" | SE03 *EQ "D3" | SE03 *EQ +
                          "D5" | SE03 *EQ "D6" | SE03 *EQ "D8" ) & +
                          SE07 *EQ "' *CAT &PSC11 *CAT '" & SE25 +
                          *EQ " " & SE36 *EQ " " & SE06 *EQ ' *CAT +
                          &WSC08 *CAT ' & (SE09 *EQ "C" | SE09 *EQ +
                          " ")') KEYFLD((SE02))
             ENDDO

                        CALL       PGM(SOA0081)

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSELF)
             DLTOVR     FILE(*ALL)

             ENDPGM
