     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1034   STEPHANIE                         */
     /*    CREATE DATE  : 81/04/20                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOA009 SOA0091                            */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售訂單系統                             */
     /*    REMARK       :訂單批次處理                             */
     /***************************************************************/
             PGM

             DCL        VAR(&DSC01) TYPE(*CHAR) LEN(2)
             DCL        VAR(&WSC08S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WSC08E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC11S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC11E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC02S) TYPE(*CHAR) LEN(12)
             DCL        VAR(&DSC02E) TYPE(*CHAR) LEN(12)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(SOA009) PARM(&IN03 &IN14 &IN97 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&DSC01) VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&WSC08S) VALUE(%SST(*LDA 603 6))
             CHGVAR     VAR(&WSC08E) VALUE(%SST(*LDA 609 6))
             CHGVAR     VAR(&DSC11S) VALUE(%SST(*LDA 621 5))
             CHGVAR     VAR(&DSC11E) VALUE(%SST(*LDA 631 5))
             CHGVAR     VAR(&DSC02S) VALUE(%SST(*LDA 641 12))
             CHGVAR     VAR(&DSC02E) VALUE(%SST(*LDA 661 12))

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRPRTF    FILE(SOA009P) USRDTA('經銷批次')
             OVRPRTF    FILE(SOA009BP) USRDTA('經銷批次')
             OPNQRYF    FILE((SOSCPF)) OPTION(*ALL) QRYSLT(' +
                          SC01  *EQ       ("' *CAT &DSC01 *CAT '") +
                        & SC08  *EQ %RANGE('  *CAT &WSC08S *CAT ' +
                                           '  *CAT &WSC08E *CAT ') +
                        & SC02  *EQ %RANGE("' *CAT &DSC02S *CAT '" +
                                           "' *CAT &DSC02E *CAT '") +
                        & SC11  *EQ %RANGE("' *CAT &DSC11S *CAT '" +
                                           "' *CAT &DSC11E *CAT '") +
                        & SC03 *EQ "S7" +
                        & SC29 *EQ " " +
                        & (SC13 *EQ "C" | SC13 *EQ " ") +
                        & SC38 *EQ " " ') +
                          KEYFLD((SC02))

                        CALL       PGM(SOA0091) PARM(&IN96)

             IF         COND(&IN96 = '0') THEN(DO)
                        CHGVAR     VAR(&IN97)  VALUE('1')
             ENDDO
             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
