     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1084  CHARLES                            */
     /*    CREATE DATE  : 81/05/04                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR054C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :產品銷售分佈明細表                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC34S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC34E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YMDS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMDE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

             CPYF       FROMFILE(REWF29) TOFILE(QTEMP/REWF29) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF29))

             OVRDBF     FILE(REWF29) TOFILE(QTEMP/REWF29) SHARE(*YES)

             OVRPRTF    FILE(SOR054P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('產銷分佈')
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DSC34S) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DSC34E) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DSC31S) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DSC31E) VALUE(%SST(*LDA 609 2))
             CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 611 6))
             CHGVAR     VAR(&YMDE) VALUE(%SST(*LDA 617 6))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 672 1))

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC33 *EQ %RANGE("' +
                          *CAT &DSC33S *CAT '" "' *CAT &DSC33E *CAT +
                          '") & SC01B *NE "K" & SC04 *NE "B0000" & +
                          SC34 *EQ %RANGE("' *CAT &DSC34S +
                          *CAT '" "' *CAT &DSC34E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & MSC08 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") & SC13 *NE "*" & SC35 *NE +
                          "T" & SC01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") ') +
                          KEYFLD((SC33) (SC34) (SC31) (SC02)) +
                          GRPFLD(*NONE) MAPFLD((MSC08 SC08 *CHAR 8) +
                          (SC01A '%SST(SC01 2 1)' *CHAR 1) (SC01B +
                          '%SST(SC01 1 1)'))
/*M001D                   %RANGE("' *CAT &YMDS *CAT '" "' *CAT +
                          &YMDE *CAT '") & SC13 *NE "*" & SC35 *NE +
                        GRPFLD(*NONE) MAPFLD((MSC08 SC08 *CHAR 6) + */
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC33 *EQ %RANGE("' +
                          *CAT &DSC33S *CAT '" "' *CAT &DSC33E *CAT +
                          '") & SC01B *NE "K" & SC04 *NE "B0000" & +
                          SC34 *EQ %RANGE("' *CAT &DSC34S +
                          *CAT '" "' *CAT &DSC34E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & MSC39 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") & SC13 *EQ "V" & SC35 *NE +
                          "T" & SC01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") ') +
                          KEYFLD((SC33) (SC34) (SC31) (SC02)) +
                          MAPFLD((MSC39 SC39 *CHAR 8) (SC01A +
                          '%SST(SC01 2 1)' *CHAR 1) (SC01B +
                          '%SST(SC01 1 1)'))
/*M001D                   %RANGE("' *CAT &YMDS *CAT '" "' *CAT +
                          &YMDE *CAT '") & SC13 *EQ "V" & SC35 *NE +
                          MAPFLD((MSC39 SC39 *CHAR 6) (SC01A +   */
             ENDDO

             CALL       SOR0541
             CALL       SOR0542

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR054P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
