     /***************************************************************/
     /*   人頭馬堅匯東洋酒份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : TINA                                      */
     /*    CREATE DATE  : 02/17/95                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR082C1                                 */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :專櫃銷售統計年報                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&ST01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&ST01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&ST02E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&ST02S) TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(6)

             CPYF       FROMFILE(REFLIB/REWFB5) TOFILE(QTEMP/REWFB5) +
                          CRTFILE(*YES)

             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFB5))
             OVRDBF     FILE(REWFB5) TOFILE(QTEMP/REWFB5) SHARE(*YES)
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 6))

             CHGVAR     VAR(&ST01S) VALUE(%SST(*LDA 600 5))
             CHGVAR     VAR(&ST01E) VALUE(%SST(*LDA 605 5))
             CHGVAR     VAR(&ST02E) VALUE(%SST(*LDA 615 4))
             CHGVAR     VAR(&ST02S) VALUE(%SST(*LDA 619 4))

             OVRPRTF    FILE(SOR082P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('專部銷年')
             OVRDBF     FILE(SOSTPF) SHARE(*YES)

             OPNQRYF    FILE((SOSTPF)) QRYSLT('ST01 *EQ %RANGE("' +
                          *CAT &ST01S *CAT '" "' *CAT &ST01E *CAT +
                          '") & ST02 *EQ %RANGE(' *CAT &YMD8S *CAT +
                          ' ' *CAT &YMD8E *CAT ')                  +
                          ') KEYFLD((ST01) (ST14) (ST02))
/*M001D                   '") & ST02 *EQ %RANGE(' *CAT &ST02S *CAT +
                          ' ' *CAT &ST02E *CAT ')    +  */

             CALL       SOR0821
             CALL       SOR0822

             CLOF       OPNID(SOSTPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR082P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
