     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       : AN MING HSIA                              */
     /*    CREATE DATE  : 04/19/93                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR072C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :應收帳款子系統                           */
     /*    REMARK       :普銷統一發票列印                         */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSI02S) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSI02E) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DSI05S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSI05E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSI01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&WSI21S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&WSI21E) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DSI01)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DSI05S) VALUE(%SST(*LDA 615 5))
             CHGVAR     VAR(&DSI05E) VALUE(%SST(*LDA 655 5))
             CHGVAR     VAR(&DSI02S) VALUE(%SST(*LDA 621 10))
             CHGVAR     VAR(&DSI02E) VALUE(%SST(*LDA 631 10))
             CHGVAR     VAR(&WSI21S) VALUE(%SST(*LDA 641 6))
             CHGVAR     VAR(&WSI21E) VALUE(%SST(*LDA 647 6))


             OVRPRTF    FILE(SOR072P) PAGESIZE(42 198) LPI(6) +
                        CPI(15) OVRFLW(42) USRDTA('普銷發票')
             OVRDBF     FILE(SOSIPF) SHARE(*YES)


             OPNQRYF    FILE((SOSIPF)) OPTION(*ALL) QRYSLT('(SI21 +
                          *EQ %RANGE(' *CAT &WSI21S *CAT ' ' *CAT +
                          &WSI21E *CAT ')) & (SI02 *EQ %RANGE("' +
                          *CAT &DSI02S *CAT '" "' *CAT &DSI02E *CAT +
                          '")) & (SI05 *EQ %RANGE("' *CAT &DSI05S +
                          *CAT '" "' *CAT &DSI05E *CAT '")) & (SI01 +
                          *EQ "' *CAT &DSI01 *CAT '") & (PSI02 *NE +
                          "**") & (SI16 *EQ "N") & (SI05A *EQ "V") +
                          ') KEYFLD((SI01) (SI02)) MAPFLD((PSI02 +
                          '%SST(SI02 1 2)') (SI05A '%SST(SI05 1 1)' +
                          *CHAR 1))

             CALL       SOR0721

             CLOF       OPNID(SOSIPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR072P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
