             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSE07) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSE03S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSE03E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSE04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSE04E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&YMDS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMDE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
/*M001A*/    DCL        VAR(&Y01S) TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&Y01E) TYPE(*CHAR) LEN(8)

             CPYF       FROMFILE(REWF39) TOFILE(QTEMP/REWF39) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF39))

             OVRDBF     FILE(REWF39) TOFILE(QTEMP/REWF39) SHARE(*YES)

             OVRPRTF    FILE(SOR063P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('²£°e³f·J')
             CHGVAR     VAR(&DSE07) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DSE03S) VALUE(%SST(*LDA 624 2))
             CHGVAR     VAR(&DSE03E) VALUE(%SST(*LDA 626 2))
             CHGVAR     VAR(&DSE04S) VALUE(%SST(*LDA 675 9))
             CHGVAR     VAR(&DSE04E) VALUE(%SST(*LDA 684 9))
             CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&YMDE) VALUE(%SST(*LDA 646 6))
             CHGVAR     VAR(&IN20) VALUE(%SST(*LDA 750 1))
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 751 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 752 1))
/*M001A*/    CHGVAR     VAR(&Y01S) VALUE(%SST(*LDA 851 8))
/*M001A*/    CHGVAR     VAR(&Y01E) VALUE(%SST(*LDA 861 8))

             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '"  "' *CAT &COMPE *CAT +
                          '") & SE07 *EQ "' *CAT &DSE07 *CAT '" & +
                          SE03 *EQ %RANGE("' *CAT &DSE03S *CAT '" +
                          "' *CAT &DSE03E *CAT '") & (SE06 *EQ +
                          %RANGE(' *CAT &Y01S *CAT ' ' *CAT &Y01E +
                          *CAT ') | (SE06 *LT ' *CAT &Y01S *CAT ' & +
                          (SE24 *EQ 0 | SE24 *GT ' *CAT &Y01E *CAT +
                          '))) &( SE45 *EQ %RANGE("' *CAT &DSE04S +
                          *CAT '" "' *CAT &DSE04E *CAT '")) & SE09 +
                          *NE "*" & SE36 *NE "T" & SE01B *NE "K" ') +
                          KEYFLD(*FILE) MAPFLD((SE01A '%SST(SE01 2 +
                          1)' *CHAR 1) (SE01B '%SST(SE01 1 1)' +
                          *CHAR 1) (SE45 'SE04 || se05' *CHAR 9))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '"  "' *CAT &COMPE *CAT +
                          '") & SE07 *EQ "' *CAT &DSE07 *CAT '" & +
                          SE03 *EQ %RANGE("' *CAT &DSE03S *CAT '" +
                          "' *CAT &DSE03E *CAT '") & SE24 *EQ +
                          %RANGE(' *CAT &Y01S *CAT ' ' *CAT &Y01E +
                          *CAT ') & SE45 *EQ %RANGE( "' *CAT +
                          &DSE04S *CAT '" "' *CAT &DSE04E *CAT '") +
                          & SE09 *EQ "V" & SE36 *NE "T" & SE01B *NE +
                          "K" ') KEYFLD(*FILE) MAPFLD((SE01A +
                          '%SST(SE01 2 1)' *CHAR 1) (SE45 'se04 || +
                          se05' *CHAR 9) (SE01B '%SST(SE01 1 1)' +
                          *CHAR 1))
             ENDDO

             CALL       SOR0631
             CALL       SOR0632

             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR063P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
