     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/15                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR048C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :訂單系統                                 */
     /*    REMARK       :預定送貨明細表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&NO)     TYPE(*CHAR) LEN(6)
             DCL        VAR(&MBR)    TYPE(*CHAR) LEN(10)

             DCL        VAR(&DSC28S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSC28E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSC27S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC27E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC08S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC08E) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S ) TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E ) TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&DSC28S) VALUE(%SST(*LDA 601 4))
             CHGVAR     VAR(&DSC28E) VALUE(%SST(*LDA 605 4))
             CHGVAR     VAR(&DSC27S) VALUE(%SST(*LDA 609 6))
             CHGVAR     VAR(&DSC27E) VALUE(%SST(*LDA 615 6))
             CHGVAR     VAR(&YSC08S) VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&YSC08E) VALUE(%SST(*LDA 646 6))
/*M001A*/    CHGVAR     VAR(&YMD8S ) VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E ) VALUE(%SST(*LDA 858 8))

             CPYF       FROMFILE(REWF31) TOFILE(QTEMP/REWF31) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF31))

             OVRDBF     FILE(REWF31) TOFILE(QTEMP/REWF31) SHARE(*YES)

             OVRPRTF    FILE(SOR048P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('預定送貨')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRDBF     FILE(SOSEPF) SHARE(*YES)

             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC28 *EQ %RANGE("' +
                          *CAT &DSC28S *CAT '" "' *CAT &DSC28E *CAT +
                          '") & SC27 *EQ %RANGE("' *CAT &DSC27S +
                          *CAT '" "' *CAT &DSC27E *CAT '") & MSC08 +
                          *EQ %RANGE("' *CAT &YMD8S  *CAT '" "' +
                          *CAT &YMD8E  *CAT '") & (SC13 *EQ "C" | +
                          SC13 *EQ " ") & (SC03 *EQ "S1" | SC03 *EQ +
                          "S4" | SC03 *EQ "S7" | SC03 *EQ "S9")') +
                          KEYFLD(*FILE) MAPFLD((MSC08 SC08 *CHAR 8))


             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE32 *EQ %RANGE("' +
                          *CAT &DSC28S *CAT '" "' *CAT &DSC28E *CAT +
                          '") & SE33 *EQ %RANGE("' *CAT &DSC27S +
                          *CAT '" "' *CAT &DSC27E *CAT '") & MSE39 +
                          *EQ %RANGE("' *CAT &YMD8S  *CAT '" "' +
                          *CAT &YMD8E  *CAT '") & (SE09 *EQ "C" | +
                          SE09 *EQ " ") & (SE03 *EQ "D2" | SE03 *EQ +
                          "D3" | SE03 *EQ "D5" | SE03 *EQ "D6" | +
                          SE03 *EQ "D8")') KEYFLD(*FILE) +
                          MAPFLD((MSE39 SE39 *CHAR 8))


             CALL       SOR0481
             CALL       SOR0482

             CLOF       OPNID(SOSCPF)
             MONMSG CPF0000
             CLOF       OPNID(SOSEPF)
             MONMSG CPF0000
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR048P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
