     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/21                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR051C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :訂單系統                                 */
     /*    REMARK       :通路產品銷售彙總表                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC34S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC34E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC45S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC45E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&YSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC39E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSD03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSD03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC28S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSC28E) TYPE(*CHAR) LEN(4)

             CPYF       FROMFILE(REWF08) TOFILE(QTEMP/REWF08) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF08))

             OVRDBF     FILE(REWF08) TOFILE(QTEMP/REWF08) SHARE(*YES)

             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DSC34S) VALUE(%SST(*LDA 680 2))
             CHGVAR     VAR(&DSC34E) VALUE(%SST(*LDA 682 2))
             CHGVAR     VAR(&DSC31S) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DSC31E) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DSC45S) VALUE(%SST(*LDA 713 9))
             CHGVAR     VAR(&DSC45E) VALUE(%SST(*LDA 722 9))
             CHGVAR     VAR(&YSC39S) VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&YSC39E) VALUE(%SST(*LDA 646 6))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))
             CHGVAR     VAR(&DSD03S) VALUE(%SST(*LDA 660 9))
             CHGVAR     VAR(&DSD03E) VALUE(%SST(*LDA 669 9))
             CHGVAR     VAR(&DSC28S) VALUE(%SST(*LDA 684 4))
             CHGVAR     VAR(&DSC28E) VALUE(%SST(*LDA 688 4))

             OVRPRTF    FILE(SOR051P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('通路銷總')
             OVRDBF     FILE(REWF08) TOFILE(SOSCPF) SHARE(*YES)


             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSCPF) (SOSDPF)) FORMAT(REWF08) +
                          QRYSLT('SC01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SC33 +
                          *EQ %RANGE("' *CAT &DSC33S *CAT '" "' +
                          *CAT &DSC33E *CAT '") & SC45 *EQ +
                          %RANGE("' *CAT &DSC45S *CAT '" "' *CAT +
                          &DSC45E *CAT '") & SC34 *EQ %RANGE("' +
                          *CAT &DSC34S *CAT '" "' *CAT &DSC34E *CAT +
                          '") & SC31 *EQ %RANGE("' *CAT &DSC31S +
                          *CAT '" "' *CAT &DSC31E *CAT '") & SC28 +
                          *EQ %RANGE("' *CAT &DSC28S *CAT '" "' +
                          *CAT &DSC28E *CAT '") &  SC08 *EQ +
                          %RANGE(' *CAT &YSC39S *CAT ' ' *CAT +
                          &YSC39E *CAT ') & SC13 *NE "*" & SD03 *EQ +
                          %RANGE("' *CAT &DSD03S *CAT '" "' *CAT +
                          &DSD03E *CAT '") & SC35 *NE "T" & SC29 +
                          *NE " " ') KEYFLD((SC01) (SC33) (SD031) +
                          (SD03)) JFLD((SOSCPF/SC02 SOSDPF/SD02)) +
                          MAPFLD((SD031 '%SST(SD03 1 2)' *CHAR 2) +
                          (SC01A '%SST(SC01 2 1)' *CHAR 1) (SC45 +
                          '(sc04 || sc05)' *CHAR 9))
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSCPF) (SOSDPF)) FORMAT(REWF08) +
                          QRYSLT('SC01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SC33 +
                          *EQ %RANGE("' *CAT &DSC33S *CAT '" "' +
                          *CAT &DSC33E *CAT '" ) & SC45 *EQ +
                          %RANGE("' *CAT &DSC45S *CAT '" "' *CAT +
                          &DSC45E *CAT '") & SC34 *EQ %RANGE("' +
                          *CAT &DSC34S *CAT '" "' *CAT &DSC34E *CAT +
                          '") & SC31 *EQ %RANGE("' *CAT &DSC31S +
                          *CAT '" "' *CAT &DSC31E *CAT '")& SC28 +
                          *EQ %RANGE("' *CAT &DSC28S *CAT '" "' +
                          *CAT &DSC28E *CAT '")  & SC39 *EQ +
                          %RANGE(' *CAT &YSC39S *CAT ' ' *CAT +
                          &YSC39E *CAT ') & SD03 *EQ %RANGE("' *CAT +
                          &DSD03S *CAT '" "' *CAT &DSD03E *CAT '") +
                          & SC13 *EQ "V" & SC35 *NE "T" ') +
                          KEYFLD((SC01) (SC33) (SD031) (SD03)) +
                          JFLD((SOSCPF/SC02 SOSDPF/SD02)) +
                          MAPFLD((SD031 '%SST(SD03 1 2)' *CHAR 2) +
                          (SC01A '%SST(SC01 2 1)' *CHAR 1) (SC45 +
                          '(SC04 || SC05)' *CHAR 9))
             ENDDO

             CALL       SOR0511

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(REWF08)
             DLTOVR     FILE(SOR051P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR051P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
