     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:3459696   */
     /*                                                             */
     /* PROGRAM NAME : IMR082C1                                     */
     /* AUTHER       : SAM                                          */
     /* CREATE DATE  : 07/26/96                                     */
     /* UPDATE DATE  :                                              */
     /* SYSTEM       :人頭馬匯東                                  */
     /***************************************************************/
             PGM
      /* =========================================================== */
      /*             SYSTEM USE  - FIELD DECLEAR                     */
      /* =========================================================== */
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSG01S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSG01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSG26S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG26E) TYPE(*CHAR) LEN(6)


             CHGVAR     VAR(&DSG01S) VALUE(%SST(*LDA 600 2))
             CHGVAR     VAR(&DSG01E) VALUE(%SST(*LDA 602 2))
             CHGVAR     VAR(&DSG26S) VALUE(%SST(*LDA 604 6))
             CHGVAR     VAR(&DSG26E) VALUE(%SST(*LDA 610 6))

             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OVRPRTF    FILE(SOR087P) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('銷退餘數')

             CALL       SOR0871

             DLTOVR     FILE(*ALL)
      /* =========================================================== */
      /*             CHANGE REPORT TO PRINT??                        */
      /* =========================================================== */

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR087P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
