             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSN03S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSN03E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&YSN06S) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&YSN06E) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&DSO03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSO03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)

             CPYF       FROMFILE(REWFA9) TOFILE(QTEMP/REWFA9) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFA9))

             OVRDBF     FILE(REWFA9) TOFILE(QTEMP/REWFA9) SHARE(*YES)

             CHGVAR     VAR(&YSN06S) VALUE(%SST(*LDA 621 8)) /*M001M*/
             CHGVAR     VAR(&YSN06E) VALUE(%SST(*LDA 631 8)) /*M001M*/
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 672 1))
             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 673 1))
             CHGVAR     VAR(&DSN03S) VALUE(%SST(*LDA 713 5))
             CHGVAR     VAR(&DSN03E) VALUE(%SST(*LDA 718 5))
             CHGVAR     VAR(&DSO03S) VALUE(%SST(*LDA 731 9))
             CHGVAR     VAR(&DSO03E) VALUE(%SST(*LDA 741 9))

             OVRDBF     FILE(REWFA9) TOFILE(SOSNPF) SHARE(*YES)
             IF         COND(&DSEL = 'N') THEN(DO)
             IF         COND(&IN20 = '0') THEN(DO)
             OVRPRTF    FILE(SOR062AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('收回明細')
             OPNQRYF    FILE((SOSNPF) (SOSOPF)) FORMAT(REWFA9) +
                          QRYSLT('SN02L *EQ "R2" & SN01A *EQ +
                          %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & SN05 *EQ %RANGE(' *CAT +
                          &YSN06S *CAT ' ' *CAT &YSN06E *CAT ') & +
                          SN03 *EQ %RANGE("' *CAT &DSN03S *CAT '" +
                          "' *CAT &DSN03E *CAT '") & SO03 *EQ +
                          %RANGE("' *CAT &DSO03S *CAT '" "' *CAT +
                          &DSO03E *CAT '") & SN10 *NE "T" ') +
                          KEYFLD((SN01) (SN05) (SN02)) +
                          JFLD((SOSNPF/SN02 SOSOPF/SO02)) +
                          MAPFLD((SN01A '%SST(SN01 2 1)' *CHAR 1) +
                          (SN02L '%SST(SN02 3 2)' *CHAR 2))

             CALL       SOR0621
             CHGVAR     VAR(&P6601I) VALUE('SOR062AP')
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SOR062BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('收回明細')
             OPNQRYF    FILE((SOSNPF) (SOSOPF)) FORMAT(REWFA9) +
                          QRYSLT('SN02L *EQ "R2" & SN01A *EQ +
                          %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & SN06 *EQ %RANGE(' *CAT +
                          &YSN06S *CAT ' ' *CAT &YSN06E *CAT ') & +
                          SN03 *EQ %RANGE("' *CAT &DSN03S *CAT '" +
                          "' *CAT &DSN03E *CAT '") & SO03 *EQ +
                          %RANGE("' *CAT &DSO03S *CAT '" "' *CAT +
                          &DSO03E *CAT '") & SN10 *NE "T" ') +
                          KEYFLD((SN01) (SN06) (SN02)) +
                          JFLD((SOSNPF/SN02 SOSOPF/SO02)) +
                          MAPFLD((SN01A '%SST(SN01 2 1)' *CHAR 1) +
                          (SN02L '%SST(SN02 3 2)' *CHAR 2))

             CALL       SOR0622
             CHGVAR     VAR(&P6601I) VALUE('SOR062BP')
             ENDDO
             ENDDO
             ELSE       CMD(DO)
             IF         COND(&IN20 = '0') THEN(DO)
             OVRPRTF    FILE(SOR062AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('收回明細')
             OPNQRYF    FILE((SOSNPF) (SOSOPF)) FORMAT(REWFA9) +
                          QRYSLT('SN02L *EQ "RB" & SN01A *EQ +
                          %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & SN05 *EQ %RANGE(' *CAT +
                          &YSN06S *CAT ' ' *CAT &YSN06E *CAT ') & +
                          SN03 *EQ %RANGE("' *CAT &DSN03S *CAT '" +
                          "' *CAT &DSN03E *CAT '") & SO03 *EQ +
                          %RANGE("' *CAT &DSO03S *CAT '" "' *CAT +
                          &DSO03E *CAT '") & SN10 *EQ "T" ') +
                          KEYFLD((SN01) (SN05) (SN02)) +
                          JFLD((SOSNPF/SN02 SOSOPF/SO02)) +
                          MAPFLD((SN01A '%SST(SN01 2 1)' *CHAR 1) +
                          (SN02L '%SST(SN02 3 2)' *CHAR 2))

             CALL       SOR0621
             CHGVAR     VAR(&P6601I) VALUE('SOR062AP')
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SOR062BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('收回明細')
             OPNQRYF    FILE((SOSNPF) (SOSOPF)) FORMAT(REWFA9) +
                          QRYSLT('SN02L *EQ "RB" & SN01A *EQ +
                          %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & SN06 *EQ %RANGE(' *CAT +
                          &YSN06S *CAT ' ' *CAT &YSN06E *CAT ') & +
                          SN03 *EQ %RANGE("' *CAT &DSN03S *CAT '" +
                          "' *CAT &DSN03E *CAT '") & SO03 *EQ +
                          %RANGE("' *CAT &DSO03S *CAT '" "' *CAT +
                          &DSO03E *CAT '") & SN10 *EQ "T" ') +
                          KEYFLD((SN01) (SN06) (SN02)) +
                          JFLD((SOSNPF/SN02 SOSOPF/SO02)) +
                          MAPFLD((SN01A '%SST(SN01 2 1)' *CHAR 1) +
                          (SN02L '%SST(SN02 3 2)' *CHAR 2))

             CALL       SOR0622
             CHGVAR     VAR(&P6601I) VALUE('SOR062BP')
             ENDDO
             ENDDO


             CLOF       OPNID(SOSNPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
