     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1087  JOYCE                              */
     /*    CREATE DATE  : 81/02/11                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR042C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售訂單系統                             */
     /*    REMARK       :產品客戶報價表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&$EGMDY) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DMA01S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DMA01SL) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DMA01E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DMD07S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD07E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DMD08S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DMD08E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DME07E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&CDATE) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&$EGMDY) VALUE(%SST(*LDA 123 +
                          2) || %SST(*LDA 119 4))
             CHGVAR     VAR(&DMA01S) VALUE(%SST(*LDA 601 9))
             CHGVAR     VAR(&DMA01SL) VALUE(%SST(*LDA 601 4))
             CHGVAR     VAR(&DMA01E) VALUE(%SST(*LDA 610 9))
             CHGVAR     VAR(&DMD07S) VALUE(%SST(*LDA 621 1))
             CHGVAR     VAR(&DMD07E) VALUE(%SST(*LDA 622 1))
             CHGVAR     VAR(&DMD08S) VALUE(%SST(*LDA 623 2))
             CHGVAR     VAR(&DMD08E) VALUE(%SST(*LDA 625 2))
             CHGVAR     VAR(&DME07S) VALUE(%SST(*LDA 627 2))
             CHGVAR     VAR(&DME07E) VALUE(%SST(*LDA 629 2))
             CHGVAR     VAR(&CDATE) VALUE(%SST(*LDA 633 6))
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))

             OVRPRTF    FILE(SOR042P) PAGESIZE(*N 158) CPI(12) +
                          USRDTA('產通報價')

             OVRDBF     FILE(SOSAPF) SHARE(*YES)
             OPNQRYF    FILE((SOSAPF)) OPTION(*ALL) QRYSLT('SA01 *EQ +
                          %RANGE("' *CAT &DMA01S *CAT '" "' *CAT +
                          &DMA01E *CAT '") & SA02 *EQ %RANGE("' +
                          *CAT &DMD07S *CAT '" "' *CAT &DMD07E *CAT +
                          '") & SA03 *EQ %RANGE("' *CAT &DMD08S +
                          *CAT '" "' *CAT &DMD08E *CAT '") & (SA05 +
                          *EQ (' *CAT &YMD8S *CAT ')) & (SA14 *NE " +
                          ")') KEYFLD((SA01) (SA02) (SA03) (SA04) +
                          (SA05 *DESCEND))



             CALL       SOR0422
             CLOF       OPNID(SOSAPF)
             DLTOVR     FILE(SOSAPF)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE('SOR042P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
