             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&YSC08S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC08E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC11S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC11E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&YSC08S) VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&YSC08E) VALUE(%SST(*LDA 646 6))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 672 1))
             CHGVAR     VAR(&DSC11S) VALUE(%SST(*LDA 652 5))
             CHGVAR     VAR(&DSC11E) VALUE(%SST(*LDA 657 5))

             CPYF       FROMFILE(REWF30) TOFILE(QTEMP/REWF30) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF30))

             OVRDBF     FILE(REWF30) TOFILE(QTEMP/REWF30) SHARE(*YES)

             OVRPRTF    FILE(SOR055P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('未結案單')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRDBF     FILE(SOSEPF) SHARE(*YES)


             OPNQRYF    FILE((SOSCPF)) QRYSLT(' MSC08 *EQ %RANGE("' +
                          *CAT &YMD8S  *CAT '" "' *CAT &YMD8E  *CAT +
                          '") & (SC13 *NE "V")  & (SC03 *EQ "S1" | +
                          SC03 *EQ "S4" | SC03 *EQ "S7" | SC03 *EQ +
                          "S9") & SC01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SC11 +
                          *EQ %RANGE("' *CAT &DSC11S *CAT '" "' +
                          *CAT &DSC11E *CAT '")') KEYFLD(*FILE) +
                          MAPFLD((MSC08 SC08 *CHAR 8) (SC01A +
                          '%SST(SC01 2 1)' *CHAR 1))
/*M001D                   *CAT &YSC08S *CAT '" "' *CAT &YSC08E *CAT +
                          MAPFLD((MSC08 SC08 *CHAR 6) (SC01A +   */



             OPNQRYF    FILE((SOSEPF)) QRYSLT(' MSE06 *EQ %RANGE("' +
                          *CAT &YMD8S  *CAT '" "' *CAT &YMD8E  *CAT +
                          '") & (SE09 *NE "V")  & (SE03 *EQ "D2" | +
                          SE03 *EQ "D3" | SE03 *EQ "D5" | SE03 *EQ +
                          "D6" | SE03 *EQ "D8") & SE01A *EQ +
                          %RANGE("' *CAT &COMPS *CAT '" "' *CAT +
                          &COMPE *CAT '") & SE07 *EQ %RANGE("' *CAT +
                          &DSC11S *CAT '" "' *CAT &DSC11E *CAT '") +
                          ') KEYFLD(*FILE) MAPFLD((MSE06 SE06 *CHAR +
                          8) (SE01A '%SST(SE01 2 1)' *CHAR 1))
/*M001D                   *CAT &YSC08S *CAT '" "' *CAT &YSC08E *CAT +
                          6) (SE01A '%SST(SE01 2 1)' *CHAR 1))  */

             CALL       SOR0551
             CALL       SOR0552

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR055P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
