     PGM
             DCL        VAR(&$EVR) TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY) TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC) LEN(2 0)
             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC34S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC34E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC04E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC27S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC27E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMDS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMDE) TYPE(*CHAR) LEN(6)
/*M001A*/    DCL        VAR(&YMD8S) TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E) TYPE(*CHAR) LEN(8)

             CPYF       FROMFILE(REFLIB/REWF55B) +
                          TOFILE(QTEMP/REWF55B) CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF55B))

             OVRDBF     FILE(REWF55B) TOFILE(QTEMP/REWF55B) SHARE(*YES)

             OVRPRTF    FILE(SOR090P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('«È¾P°â©ú')
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 605 1))
             CHGVAR     VAR(&DSC34S) VALUE(%SST(*LDA 606 2))
             CHGVAR     VAR(&DSC34E) VALUE(%SST(*LDA 608 2))
             CHGVAR     VAR(&DSC04S) VALUE(%SST(*LDA 610 5))
             CHGVAR     VAR(&DSC04E) VALUE(%SST(*LDA 620 5))
             CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 656 6))
             CHGVAR     VAR(&YMDE) VALUE(%SST(*LDA 650 6))
/*M001M*/    CHGVAR     VAR(&YMD8S) VALUE(%SST(*LDA 850 8))
/*M001M*/    CHGVAR     VAR(&YMD8E) VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&DSC27S) VALUE(%SST(*LDA 701 6))
             CHGVAR     VAR(&DSC27E) VALUE(%SST(*LDA 707 6))

             OVRDBF     FILE(SOSCPF) SHARE(*YES)

             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01B *NE "K" & MSC39 +
             /*M001M*/    *EQ %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") & SC13 *EQ "V" & SC35 *NE +
                          "T" ') KEYFLD((SC04) (SC05) (SC39)) +
                          MAPFLD((SC01B '%sst(SC01 1 1)' *CHAR 1) +
             /*M001M*/    (MSC39 SC39 *CHAR 8))

             CALL       PGM(SOR0901)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR090P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)

             CALL       PGM(SOR0902) PARM('1')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             CALL       PGM(SOR0902) PARM('2')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             CALL       PGM(SOR0902) PARM('3')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
