     /***************************************************************/
     /*    AUTHOR       : TINA                                      */
     /*    CREATE DATE  : 82/03/17                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR071C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :普銷銷售系統                             */
     /*    REMARK       :普銷訂單／送貨單明細表                   */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DDATES) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DDATEE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC11S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC11E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN20)  TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DDATES) VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&DDATEE) VALUE(%SST(*LDA 646 6))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 672 1))
             CHGVAR     VAR(&DSC11S) VALUE(%SST(*LDA 652 5))
             CHGVAR     VAR(&DSC11E) VALUE(%SST(*LDA 657 5))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 613 1))

             CPYF       FROMFILE(REWF67) TOFILE(QTEMP/REWF67) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF67))

             OVRDBF     FILE(REWF67) TOFILE(QTEMP/REWF67) SHARE(*YES)

             OVRPRTF    FILE(SOR071P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('普銷明細')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRDBF     FILE(SOSEPF) SHARE(*YES)

             IF         COND(&IN20 = '0') THEN(DO)

             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC11A *EQ "V" & SC35 +
                          *NE "T" & MSC08 *EQ %RANGE("' *CAT +
                          &DDATES *CAT '" "' *CAT &DDATEE *CAT '") +
                          &  SC01A *EQ %RANGE("' *CAT &COMPS *CAT +
                          '" "' *CAT &COMPE *CAT '") & SC11 *EQ +
                          %RANGE("' *CAT &DSC11S *CAT '" "' *CAT +
                          &DSC11E *CAT '")') KEYFLD(*FILE) +
                          MAPFLD((MSC08 SC08 *CHAR 6) (SC01A +
                          '%SST(SC01 2 1)' *CHAR 1) (SC11A +
                          '%sst(sc11 1 1)' *CHAR 1))


             OPNQRYF    FILE((SOSEPF)) QRYSLT(' SE29 *EQ " " & SE07A +
                          *EQ "V" & SE36 *NE "T" & MSE06 *EQ +
                          %RANGE("' *CAT &DDATES *CAT '" "' *CAT +
                          &DDATEE *CAT '") &  SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE07 *EQ %RANGE("' *CAT &DSC11S +
                          *CAT '" "' *CAT &DSC11E *CAT '") ') +
                          KEYFLD((*FILE)) MAPFLD((MSE06 SE06 *CHAR +
                          6) (SE01A '%SST(SE01 2 1)' *CHAR 1) +
                          (SE07A '%SST(SE07 1 1)' *CHAR 1))

             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC11A *EQ "V" & SC35 +
                          *NE "T" & MSC07 *EQ %RANGE("' *CAT +
                          &DDATES *CAT '" "' *CAT &DDATEE *CAT '") +
                          &  SC01A *EQ %RANGE("' *CAT &COMPS *CAT +
                          '" "' *CAT &COMPE *CAT '") & SC11 *EQ +
                          %RANGE("' *CAT &DSC11S *CAT '" "' *CAT +
                          &DSC11E *CAT '")') KEYFLD(*FILE) +
                          MAPFLD((MSC07 SC07 *CHAR 6) (SC01A +
                          '%SST(SC01 2 1)' *CHAR 1) (SC11A +
                          '%sst(sc11 1 1)' *CHAR 1))


             OPNQRYF    FILE((SOSEPF)) QRYSLT(' SE29 *EQ " " & SE07A +
                          *EQ "V" & SE36 *NE "T" & MSE39 *EQ +
                          %RANGE("' *CAT &DDATES *CAT '" "' *CAT +
                          &DDATEE *CAT '") &  SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE07 *EQ %RANGE("' *CAT &DSC11S +
                          *CAT '" "' *CAT &DSC11E *CAT '") ') +
                          KEYFLD((*FILE)) MAPFLD((MSE39 SE39 *CHAR +
                          6) (SE01A '%SST(SE01 2 1)' *CHAR 1) +
                          (SE07A '%SST(SE07 1 1)' *CHAR 1))

             ENDDO


             CALL       SOR0711
             CALL       SOR0712

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR071P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
