     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/25                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : IMR041C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :庫存系統                                 */
     /*    REMARK       :康齡退貨庫存量檢核                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSG06S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSG06E) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DSG06S) VALUE(%SST(*LDA 622 6))
             CHGVAR     VAR(&DSG06E) VALUE(%SST(*LDA 628 6))

             CPYF       FROMFILE(REW108) TOFILE(QTEMP/REW108) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REW108))

             OVRPRTF    FILE(SOR088P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('退貨檢核')
             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OVRDBF     FILE(REW108) TOFILE(QTEMP/REW108) SHARE(*YES)

             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG01 *EQ %RANGE("' +
                          *CAT R1 *CAT '" "' *CAT R3 *CAT '") & +
                          SG26 *EQ 0  &  SG04 *EQ "B0000" &  SG06 +
                          *EQ %RANGE(' *CAT &DSG06S *CAT ' ' *CAT +
                          &DSG06E *CAT ')') KEYFLD((SG18))

             CALL       SOR0881
             CALL       SOR0882

             CLOF       OPNID(SOSGPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR088P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
        CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
