     /***************************************************************/
     /*   ªx¤Ó¸ê°T¬ì§Þ¶}µoªÑ¥÷¦³­­¤½¥q¡Ðª©Åv©Ò¦³    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1087  JOYCE                              */
     /*    CREATE DATE  : 81/01/27                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : POR050C1                                  */
     /*    SYSTEM       :¤HÀY°¨¶×ªF                               */
     /*    SUBSYSTEM    :¾P°â­q³æ¨t²Î                             */
     /*    REMARK       :®Ö­ã­q³æ©ú²Óªí                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC31S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSCR01) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSCR02) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSCR03) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSCR04) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSCR05) TYPE(*CHAR) LEN(1)
             DCL        VAR(&YMDS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 672 1))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DSC31S) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DSC31E) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DSCR01) VALUE(%SST(*LDA 607 1))
             CHGVAR     VAR(&DSCR02) VALUE(%SST(*LDA 608 1))
             CHGVAR     VAR(&DSCR03) VALUE(%SST(*LDA 609 1))
             CHGVAR     VAR(&DSCR04) VALUE(%SST(*LDA 610 1))
             CHGVAR     VAR(&DSCR05) VALUE(%SST(*LDA 615 1))
             CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 627 6))
             CHGVAR     VAR(&DSEL) VALUE(%SST(*LDA 673 1))

     /* «D´¶¾P                                            */
             IF         COND(&DSEL *EQ '1') THEN(DO)

             IF         COND(&DSCR01 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC08 *LE ' *CAT +
                          &YMDS *CAT ' &  (SC23 *EQ "*" *OR SC24 +
                          *EQ "*" ) & (SC11A *NE "V" ) ') +
                          KEYFLD((SC04) (SC05) (SC08) (SC02)) +
                          MAPFLD((SC01A '%SST(SC01 2 1)' *CHAR 1) +
                          (SC11A '%SST(SC11 1 1)' *CHAR 1))
             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE27 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SE34 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SE06 *LE ' *CAT +
                          &YMDS *CAT ' & (SE16 *EQ "*" *OR SE17 *EQ +
                          "*" ) & (SE07A *NE "V" )') KEYFLD((SE04) +
                          (SE05) (SE06) (SE02)) MAPFLD((SE01A +
                          '%SST(SE01 2 1)' *CHAR 1) (SE07A +
                          '%SST(SE07 1 1)' *CHAR 1))
             CALL       SOR0461

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOSEPF)
             DLTOVR     FILE(SOR046AP)
                        ENDDO

             IF         COND(&DSCR02 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC08 *LE ' *CAT +
                          &YMDS *CAT ' & (SC26 *EQ "*") & (SC11A +
                          *NE "V" )') KEYFLD((SC04) (SC05) (SC08) +
                          (SC02)) MAPFLD((SC01A '%SST(SC01 2 1)' +
                          *CHAR 1) (SC11A '%SST(SC11 1 1)' *CHAR 1))
             CALL       SOR0462

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOR046BP)
                        ENDDO

             IF         COND(&DSCR05 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046EP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPE *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE27 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SE34 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SE06 *LE ' *CAT +
                          &YMDS *CAT ' & (SE19 *EQ "*") & (SE07A +
                          *NE "V")') KEYFLD((SE04) (SE05) (SE06) +
                          (SE02)) MAPFLD((SE01A '%SST(SE01 2 1)' +
                          *CHAR 1) (SE07A '%SST(SE07 1 1)' *CHAR 1))
             CALL       SOR0465

             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(SOSEPF)
             DLTOVR     FILE(SOR046EP)
                        ENDDO

             IF         COND(&DSCR03 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046CP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC08 *LE ' *CAT +
                          &YMDS *CAT ' & (SC22 *EQ "*") & (SC11A +
                          *NE "V")') KEYFLD((SC04) (SC05) (SC08) +
                          (SC02)) MAPFLD((SC01A '%SST(SC01 2 1)' +
                          *CHAR 1) (SC11A '%SST(SC11 1 1)' *CHAR 1))
             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE27 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SE34 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SE06 *LE ' *CAT +
                          &YMDS *CAT ' & (SE15 *EQ "*")  & (SE07A +
                          *NE "V") ') KEYFLD((SE04) (SE05) (SE06) +
                          (SE02)) MAPFLD((SE01A '%SST(SE01 2 1)' +
                          *CHAR 1) (SE07A '%SST(SE07 1 1)' *CHAR 1))

             CALL       SOR0463

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOSEPF)
             DLTOVR     FILE(SOR046CP)
                        ENDDO

             IF         COND(&DSCR04 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046DP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC08 *LE ' *CAT +
                          &YMDS *CAT ' & (SC25 *EQ "*") & (SC11A +
                          *NE "V" )') KEYFLD((SC04) (SC05) (SC08) +
                          (SC02)) MAPFLD((SC01A '%SST(SC01 2 1)' +
                          *CHAR 1) (SC11A '%SST(SC11 1 1)' *CHAR 1))
             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE27 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SE34 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SE06 *LE ' *CAT +
                          &YMDS *CAT ' & (SE18 *EQ "*") & (SE07A +
                          *NE "V") ') KEYFLD((SE04) (SE05) (SE06) +
                          (SE02)) MAPFLD((SE01A '%SST(SE01 2 1)' +
                          *CHAR 1) (SE07A '%SST(SE07 1 1)' *CHAR 1))
             CALL       SOR0464
             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOSEPF)
             DLTOVR     FILE(SOR046DP)
             ENDDO
             ENDDO

     /* ´¶¾P*/
             ELSE       CMD(DO)

             IF         COND(&DSCR01 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC08 *LE ' *CAT +
                          &YMDS *CAT ' &  (SC23 *EQ "*" *OR SC24 +
                          *EQ "*" ) & (SC11A *EQ "V")') +
                          KEYFLD((SC04) (SC05) (SC08) (SC02)) +
                          MAPFLD((SC01A '%SST(SC01 2 1)' *CHAR 1) +
                          (SC11A '%SST(SC11 1 1)' *CHAR 1))
             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE27 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SE34 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SE06 *LE ' *CAT +
                          &YMDS *CAT ' & (SE16 *EQ "*" *OR SE17 *EQ +
                          "*" ) & (SE07A *EQ "V")') KEYFLD((SE04) +
                          (SE05) (SE06) (SE02)) MAPFLD((SE01A +
                          '%SST(SE01 2 1)' *CHAR 1) (SE07A +
                          '%SST(SE07 1 1)' *CHAR 1))
             CALL       SOR0461

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOSEPF)
             DLTOVR     FILE(SOR046AP)
                        ENDDO

             IF         COND(&DSCR02 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC08 *LE ' *CAT +
                          &YMDS *CAT ' & (SC26 *EQ "*") & (SC11A +
                          *EQ "V")') KEYFLD((SC04) (SC05) (SC08) +
                          (SC02)) MAPFLD((SC01A '%SST(SC01 2 1)' +
                          *CHAR 1) (SC11A '%SST(SC11 1 1)' *CHAR 1))
             CALL       SOR0462

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOR046BP)
                        ENDDO

             IF         COND(&DSCR05 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046EP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPE *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE27 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SE34 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SE06 *LE ' *CAT +
                          &YMDS *CAT ' & (SE19 *EQ "*") & (SE07A *EQ +
                          "V")') KEYFLD((SE04) (SE05) (SE06) +
                          (SE02)) MAPFLD((SE01A '%SST(SE01 2 1)' +
                          *CHAR 1) (SE07A '%SST(SE07 1 1)' *CHAR 1))
             CALL       SOR0465

             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(SOSEPF)
             DLTOVR     FILE(SOR046EP)
                        ENDDO

             IF         COND(&DSCR03 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046CP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC08 *LE ' *CAT +
                          &YMDS *CAT ' & (SC22 *EQ "*") & (SC11A *EQ +
                          "V") ') KEYFLD((SC04) (SC05) (SC08) +
                          (SC02)) MAPFLD((SC01A '%SST(SC01 2 1)' +
                          *CHAR 1) (SC11A '%SST(SC11 1 1)' *CHAR 1))
             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE27 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SE34 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SE06 *LE ' *CAT +
                          &YMDS *CAT ' & (SE15 *EQ "*") & (SE07A +
                          *EQ "V")') KEYFLD((SE04) (SE05) (SE06) +
                          (SE02)) MAPFLD((SE01A '%SST(SE01 2 1)' +
                          *CHAR 1) (SE07A '%SST(SE07 1 1)' *CHAR 1))
             CALL       SOR0463

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOSEPF)
             DLTOVR     FILE(SOR046CP)
                        ENDDO

             IF         COND(&DSCR04 *EQ 'Y') THEN(DO)
             OVRPRTF    FILE(SOR046DP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('®Ö­ãÃ±³¹')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SC08 *LE ' *CAT +
                          &YMDS *CAT ' & (SC25 *EQ "*") & (SC11A +
                          *EQ "V")') KEYFLD((SC04) (SC05) (SC08) +
                          (SC02)) MAPFLD((SC01A '%SST(SC01 2 1)' +
                          *CHAR 1) (SC11A '%SST(SC11 1 1)' *CHAR 1))
             OVRDBF     FILE(SOSEPF) SHARE(*YES)
             OPNQRYF    FILE((SOSEPF)) QRYSLT('SE01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SE27 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SE34 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & SE06 *LE ' *CAT +
                          &YMDS *CAT ' & (SE18 *EQ "*") & (SE07A +
                          *EQ "V")') KEYFLD((SE04) (SE05) (SE06) +
                          (SE02)) MAPFLD((SE01A '%SST(SE01 2 1)' +
                          *CHAR 1) (SE07A '%SST(SE07 1 1)' *CHAR 1))
             CALL       SOR0464
             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOSEPF)
             DLTOVR     FILE(SOR046DP)
             ENDDO
             ENDDO


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)

             IF         COND(&DSCR01 *EQ 'Y') THEN(DO)
               CHGVAR     VAR(&P6601I) VALUE('SOR046AP')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
                        ENDDO

             IF         COND(&DSCR02 *EQ 'Y') THEN(DO)
               CHGVAR     VAR(&P6601I) VALUE('SOR046BP')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
                        ENDDO

             IF         COND(&DSCR05 *EQ 'Y') THEN(DO)
               CHGVAR     VAR(&P6601I) VALUE('SOR046EP')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
                        ENDDO

             IF         COND(&DSCR03 *EQ 'Y') THEN(DO)
               CHGVAR     VAR(&P6601I) VALUE('SOR046CP')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
                        ENDDO

             IF         COND(&DSCR04 *EQ 'Y') THEN(DO)
               CHGVAR     VAR(&P6601I) VALUE('SOR046DP')
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
                        ENDDO

             ENDPGM
