     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/18                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR052C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :訂單系統                                 */
     /*    REMARK       :客戶應收到期明細表                       */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSI32S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSI32E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSI31S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSI31E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&CSI23S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&CSI23E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&YDATE)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
             CHGVAR     VAR(&DSI32S) VALUE(%SST(*LDA 601 4))
             CHGVAR     VAR(&DSI32E) VALUE(%SST(*LDA 605 4))
             CHGVAR     VAR(&DSI31S) VALUE(%SST(*LDA 609 6))
             CHGVAR     VAR(&DSI31E) VALUE(%SST(*LDA 615 6))
             CHGVAR     VAR(&YDATE)  VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&CSI23S) VALUE(%SST(*LDA 653 9))
             CHGVAR     VAR(&CSI23E) VALUE(%SST(*LDA 662 9))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 672 1))
             CHGVAR     VAR(&DSEL)  VALUE(%SST(*LDA 678 1))


             OVRPRTF    FILE(SOR052P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客應收明')
             OVRDBF     FILE(SOSIPF) SHARE(*YES)

             IF         COND(&DSEL *EQ 'B') THEN(DO)
             OPNQRYF    FILE((SOSIPF)) QRYSLT('SI01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & CSI23 *EQ %RANGE("' *CAT &CSI23S +
                          *CAT '" "' *CAT &CSI23E *CAT '") &  SI32 +
                          *EQ %RANGE("' *CAT &DSI32S *CAT '" "' +
                          *CAT &DSI32E *CAT '" ) & SI31 *EQ +
                          %RANGE("' *CAT &DSI31S *CAT '" "' *CAT +
                          &DSI31E *CAT '") & (SI29 *LE ' *CAT +
                          &YMD8S *CAT ') & (SI16 *NE "Y")    & +
                          (PTOT *NE 0) & SI19 *NE "V" & SI18 *NE +
                          "D" ') KEYFLD((SI32) (SI31) (SI12) (SI13) +
                          (SI29) (SI02)) MAPFLD((PTOT +
                          '(SI25-SI26-SI27)') (CSI23 '(SI12 || +
                          SI13)' *CHAR 9) (SI01A '%SST(SI01 2 1)' +
                          *CHAR 1))
/*M001D                   &YDATE *CAT ') & (SI16 *NE "Y")    & +   */

             CALL       SOR0521
             ENDDO
             ELSE

             IF         COND(&DSEL *EQ 'A') THEN(DO)
             OVRDBF     FILE(REWFB4) TOFILE(SOSIPF) SHARE(*YES)
             OPNQRYF    FILE((SOSIPF) (MTMEPF)) FORMAT(REWFB4) +
                          QRYSLT('SI01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & CSI23 +
                          *EQ %RANGE("' *CAT &CSI23S *CAT '" "' +
                          *CAT &CSI23E *CAT '") &  SI32 *EQ +
                          %RANGE("' *CAT &DSI32S *CAT '" "' *CAT +
                          &DSI32E *CAT '" ) & me15 *EQ %RANGE("' +
                          *CAT &DSI31S *CAT '" "' *CAT &DSI31E *CAT +
                          '") & (SI29 *LE ' *CAT &YMD8S *CAT ') & +
                          (SI16 *NE "Y")    & (PTOT *NE 0) & SI19 +
                          *NE "V" & SI18 *NE "D" ') KEYFLD((ME15) +
                          (SI12) (SI13) (SI29) (SI02)) JFLD((SI12 +
                          ME01 *EQ) (SI13 ME02)) MAPFLD((PTOT +
                          '(SI25-SI26-SI27)') (CSI23 '(SI12 || +
                          SI13)' *CHAR 9) (SI01A '%SST(SI01 2 1)' +
                          *CHAR 1))
/*M001D                   '") & (SI29 *LE ' *CAT &YDATE *CAT ') & + */

             CALL       SOR0522
             ENDDO
             CLOF       OPNID(SOSIPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR052P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
