     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266   */
     /*                                                             */
     /*    AUTHOR       :                                           */
     /*    CREATE DATE  : 11/06/95                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR083C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售分析系統                             */
     /*    REMARK       :專櫃庫存數量週轉報表                     */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DST01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DESC) TYPE(*CHAR) LEN(18)
             DCL        VAR(&WST02) TYPE(*CHAR) LEN(4)
             DCL        VAR(&WST03) TYPE(*CHAR) LEN(4)
             DCL        VAR(&WST04) TYPE(*CHAR) LEN(4)
             DCL        VAR(&YMD8S2) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMD8S3) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMD8S4) TYPE(*CHAR) LEN(6)

             DCL        VAR(&PART1) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PART2) TYPE(*CHAR) LEN(7)
             DCL        VAR(&PART3) TYPE(*CHAR) LEN(6)
             DCL        VAR(&PART4) TYPE(*CHAR) LEN(18)
             DCL        VAR(&PART5) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DST01S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DESC) VALUE(%SST(*LDA 640 12))
             CHGVAR     VAR(&WST02) VALUE(%SST(*LDA 625 4))
             CHGVAR     VAR(&WST03) VALUE(%SST(*LDA 630 4))
             CHGVAR     VAR(&WST04) VALUE(%SST(*LDA 634 4))
             CHGVAR     VAR(&YMD8S2) VALUE(%SST(*LDA 850 6))
             CHGVAR     VAR(&YMD8S3) VALUE(%SST(*LDA 858 6))
             CHGVAR     VAR(&YMD8S4) VALUE(%SST(*LDA 866 6))

             CHGVAR     VAR(&PART1) VALUE(&YMD8S2)
             CHGVAR     VAR(&PART2) VALUE('''' *CAT &DST01S *CAT '''')
             CHGVAR     VAR(&PART3) VALUE(&YMD8S3)
             CHGVAR     VAR(&PART4) VALUE(&DESC)
             CHGVAR     VAR(&PART5) VALUE(&YMD8S4)

             OVRPRTF    FILE(QPQXPRTF) PAGESIZE(*N 80) +
                          USRDTA('專櫃週轉')
             STRQMQRY   QMQRY(SOR083Q1) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOR083F1) SETVAR((PART1 +
                          &PART1) (PART2 &PART2))
             STRQMQRY   QMQRY(SOR083Q2) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOR083F2) SETVAR((PART1 +
                          &PART1) (PART2 &PART2))

   /*M001M                OUTFILE(QTEMP/SOR083F2) SETVAR((PART5 +
                          &PART5) (PART2 &PART2))   */

             STRQMQRY   QMQRY(SOR083Q3) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/SOR083F5) SETVAR((PART1 +
                          &PART1) (PART2 &PART2) (PART3 &PART3))
   /*        RUNQRY     QRY(SOR083Q6) QRYFILE((*SAME)) +
                          OUTTYPE(*OUTFILE) OUTFORM(*SUMMARY) +
                          OUTFILE(QTEMP/SOR083F3 *FIRST *RPLFILE)  +
             RUNQRY     QRY(SOR083Q5) QRYFILE((*SAME)) +
                          OUTTYPE(*OUTFILE) OUTFORM(*DETAIL) +
                          OUTFILE(QTEMP/SOR083F4 *FIRST *RPLFILE) */
             STRQMQRY   QMQRY(SOR083Q4) OUTPUT(*PRINT) +
                          QMFORM(REPLIB/SOR083FRM)

             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR083FRM')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
