             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&YSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC39E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSD03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSD03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC03S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC03E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC04E) TYPE(*CHAR) LEN(9)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

             CPYF       FROMFILE(REWFA7) TOFILE(QTEMP/REWFA7) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFA7))

             OVRDBF     FILE(REWFA7) TOFILE(QTEMP/REWFA7) SHARE(*YES)

/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 672 1))
             CHGVAR     VAR(&YSC39S) VALUE(%SST(*LDA 621 6))
             CHGVAR     VAR(&YSC39E) VALUE(%SST(*LDA 627 6))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))
             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 673 1))
             CHGVAR     VAR(&DSEL1)   VALUE(%SST(*LDA 674 1))
             CHGVAR     VAR(&DSC03S) VALUE(%SST(*LDA 633 2))
             CHGVAR     VAR(&DSC03E) VALUE(%SST(*LDA 635 2))
             CHGVAR     VAR(&DSC04S) VALUE(%SST(*LDA 713 9))
             CHGVAR     VAR(&DSC04E) VALUE(%SST(*LDA 722 9))
             CHGVAR     VAR(&DSD03S) VALUE(%SST(*LDA 731 9))
             CHGVAR     VAR(&DSD03E) VALUE(%SST(*LDA 741 9))

             OVRDBF     FILE(REWFA7) TOFILE(SOSCPF) SHARE(*YES)
             IF         COND(&DSEL = 'N') THEN(DO)
             IF         COND(&IN20 = '0') THEN(DO)
             OVRPRTF    FILE(SOR058AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('訂單明細')

             OPNQRYF    FILE((SOSCPF) (SOSDPF)) FORMAT(REWFA7) +
                          QRYSLT(' SC01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SC08 +
                          *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & SC03 *EQ %RANGE("' *CAT +
                          &DSC03S *CAT '" "' *CAT &DSC03E *CAT '") +
                          & CSC04 *EQ %RANGE("' *CAT &DSC04S *CAT +
                          '" "' *CAT &DSC04E *CAT '") &  +
                          SC35 *NE "T"  & SD03 *EQ %RANGE("' +
                          *CAT &DSD03S *CAT '" "' *CAT &DSD03E *CAT +
                          '")') KEYFLD((SC01) (SC08) (SC02)) +
                          JFLD((SOSCPF/SC02 SOSDPF/SD02)) +
                          MAPFLD((SC01A '%SST(SC01 2 1)' *CHAR 1) +
                          (CSC04 '(SC04 *CAT SC05)' *CHAR 9))

/*M001D                   *EQ %RANGE(' *CAT &YSC39S *CAT ' ' *CAT +
                        &YSC39E *CAT ') & SC03 *EQ %RANGE("' *CAT +
                          '" "' *CAT &DSC04E *CAT '") & SC13 *NE +
                        "*" & SC35 *NE "T"  & SD03 *EQ %RANGE("' + */

             CALL       SOR0581
             CHGVAR     VAR(&P6601I) VALUE('SOR058AP')
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SOR058BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('訂單明細')
             OPNQRYF    FILE((SOSCPF) (SOSDPF)) FORMAT(REWFA7) +
                          QRYSLT('SC01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SC39 +
                          *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & SC03 *EQ %RANGE("' *CAT +
                          &DSC03S *CAT '" "' *CAT &DSC03E *CAT '") +
                          & CSC04 *EQ %RANGE("' *CAT &DSC04S *CAT +
                          '" "' *CAT &DSC04E *CAT '") & SC13 *EQ +
                          "V" & SC35 *NE "T"  & SD03 *EQ %RANGE("' +
                          *CAT &DSD03S *CAT '" "' *CAT &DSD03E *CAT +
                          '")') KEYFLD((SC01) (SC39) (SC02)) +
                          JFLD((SOSCPF/SC02 SOSDPF/SD02)) +
                          MAPFLD((SC01A '%SST(SC01 2 1)' *CHAR 1) +
                          (CSC04 '(SC04 *CAT SC05)' *CHAR 9))
/*M001D                   *EQ %RANGE(' *CAT &YSC39S *CAT ' ' *CAT +
                        &YSC39E *CAT ') & SC03 *EQ %RANGE("' *CAT + */
             CALL       SOR0582
             CHGVAR     VAR(&P6601I) VALUE('SOR058BP')
             ENDDO
             ENDDO
             ELSE       CMD(DO)
             IF         COND(&IN20 = '0') THEN(DO)
             OVRPRTF    FILE(SOR058AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('訂單明細')
             OPNQRYF    FILE((SOSCPF) (SOSDPF)) FORMAT(REWFA7) +
                          QRYSLT(' SC01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SC08 +
                          *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & SC03 *EQ %RANGE("' *CAT +
                          &DSC03S *CAT '" "' *CAT &DSC03E *CAT '") +
                          & CSC04 *EQ %RANGE("' *CAT &DSC04S *CAT +
                          '" "' *CAT &DSC04E *CAT '") &  +
                          SC35 *EQ "T"  & SD03 *EQ %RANGE("' +
                          *CAT &DSD03S *CAT '" "' *CAT &DSD03E *CAT +
                          '")') KEYFLD((SC01) (SC08) (SC02)) +
                          JFLD((SOSCPF/SC02 SOSDPF/SD02)) +
                          MAPFLD((SC01A '%SST(SC01 2 1)' *CHAR 1) +
                          (CSC04 '(SC04 *CAT SC05)' *CHAR 9))

 /* M001D                 '" "' *CAT &DSC04E *CAT '") & SC13 *NE +
                          "*" & SC35 *EQ "T"  & SD03 *EQ %RANGE("' + */

             CALL       SOR0581
             CHGVAR     VAR(&P6601I) VALUE('SOR058AP')
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SOR058BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('訂單明細')
             OPNQRYF    FILE((SOSCPF) (SOSDPF)) FORMAT(REWFA7) +
                          QRYSLT('SC01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SC39 +
                          *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & SC03 *EQ %RANGE("' *CAT +
                          &DSC03S *CAT '" "' *CAT &DSC03E *CAT '") +
                          & CSC04 *EQ %RANGE("' *CAT &DSC04S *CAT +
                          '" "' *CAT &DSC04E *CAT '") & SC13 *EQ +
                          "V" & SC35 *EQ "T"  & SD03 *EQ %RANGE("' +
                          *CAT &DSD03S *CAT '" "' *CAT &DSD03E *CAT +
                          '")') KEYFLD((SC01) (SC39) (SC02)) +
                          JFLD((SOSCPF/SC02 SOSDPF/SD02)) +
                          MAPFLD((SC01A '%SST(SC01 2 1)' *CHAR 1) +
                          (CSC04 '(SC04 *CAT SC05)' *CHAR 9))
             CALL       SOR0582
             CHGVAR     VAR(&P6601I) VALUE('SOR058BP')
             ENDDO
             ENDDO


             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
