             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&YSE24S) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&YSE24E) TYPE(*CHAR) LEN(8) /*M001M*/
             DCL        VAR(&DSE03S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSE03E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSF03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSF03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSE45S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSE45E) TYPE(*CHAR) LEN(9)

             CPYF       FROMFILE(REWFA5) TOFILE(QTEMP/REWFA5) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFA5))
             OVRDBF     FILE(REWFA5) TOFILE(QTEMP/REWFA5) SHARE(*YES)

             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 672 1))
   /*M001M   CHGVAR     VAR(&YSE24S) VALUE(%SST(*LDA 621 6))  +
             CHGVAR     VAR(&YSE24E) VALUE(%SST(*LDA 626 6))  */
   /*M001M*/ CHGVAR     VAR(&YSE24S) VALUE(%SST(*LDA 721 8))
   /*M001M*/ CHGVAR     VAR(&YSE24E) VALUE(%SST(*LDA 731 8))
             CHGVAR     VAR(&DSE03S) VALUE(%SST(*LDA 633 2))
             CHGVAR     VAR(&DSE03E) VALUE(%SST(*LDA 635 2))
             CHGVAR     VAR(&DSF03S) VALUE(%SST(*LDA 637 9))
             CHGVAR     VAR(&DSF03E) VALUE(%SST(*LDA 646 9))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))
             CHGVAR     VAR(&DSEL)   VALUE(%SST(*LDA 673 1))
             CHGVAR     VAR(&DSE45S)   VALUE(%SST(*LDA 674 9))
             CHGVAR     VAR(&DSE45E)   VALUE(%SST(*LDA 683 9))



             OVRDBF     FILE(REWFA5) TOFILE(SOSEPF) SHARE(*YES)
             IF         COND(&DSEL = 'N') THEN(DO)
             IF         COND(&IN20 = '0') THEN(DO)
             OVRPRTF    FILE(SOR060AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('°e³f©ú²Ó')
             OPNQRYF    FILE((SOSEPF) (SOSFPF)) FORMAT(REWFA5) +
                          QRYSLT(' SE01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SE06 +
                          *EQ %RANGE(' *CAT &YSE24S *CAT ' ' *CAT +
                          &YSE24E *CAT ') & SE03 *EQ %RANGE("' *CAT +
                          &DSE03S *CAT '" "' *CAT &DSE03E *CAT '") +
                          & SE45 *EQ %RANGE("' *CAT &DSE45S *CAT '" +
                          "' *CAT &DSE45E *CAT '") &SF03 *EQ +
                          %RANGE("' *CAT &DSF03S *CAT '" "' *CAT +
                          &DSF03E *CAT '") & SE09 *NE "*" & SE36 +
                          *NE "T" ') KEYFLD((SE01) (SE06) (SE02)) +
                          JFLD((SOSEPF/SE02 SOSFPF/SF02)) +
                          MAPFLD((SE01A '%SST(SE01 2 1)' *CHAR 1) +
                          (SE45 'SE04 *CAT SE05' *CHAR 9))
             CALL       SOR0601
             CHGVAR     VAR(&P6601I) VALUE('SOR060AP')
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SOR060BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('°e³f©ú²Ó')
             OPNQRYF    FILE((SOSEPF) (SOSFPF)) FORMAT(REWFA5) +
                          QRYSLT('SE01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SE24 +
                          *EQ %RANGE(' *CAT &YSE24S *CAT ' ' *CAT +
                          &YSE24E *CAT ') & SE03 *EQ %RANGE("' *CAT +
                          &DSE03S *CAT '" "' *CAT &DSE03E *CAT '") +
                          & SE45  *EQ %RANGE("' *CAT &DSE45S *CAT +
                          '" "' *CAT &DSE45E *CAT '") & SF03 *EQ +
                          %RANGE("' *CAT &DSF03S *CAT '" "' *CAT +
                          &DSF03E *CAT '") & SE09 *EQ "V" & SE36 +
                          *NE "T" ') KEYFLD((SE01) (SE24) (SE02)) +
                          JFLD((SOSEPF/SE02 SOSFPF/SF02)) +
                          MAPFLD((SE01A '%SST(SE01 2 1)' *CHAR 1) +
                          (SE45 'SE04 *CAT SE05' *CHAR 9))
             CALL       SOR0602
             CHGVAR     VAR(&P6601I) VALUE('SOR060BP')
             ENDDO
             ENDDO
             ELSE       CMD(DO)
             IF         COND(&IN20 = '0') THEN(DO)
             OVRPRTF    FILE(SOR060AP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('°e³f©ú²Ó')
             OPNQRYF    FILE((SOSEPF) (SOSFPF)) FORMAT(REWFA5) +
                          QRYSLT(' SE01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SE06 +
                          *EQ %RANGE(' *CAT &YSE24S *CAT ' ' *CAT +
                          &YSE24E *CAT ') & SE03 *EQ %RANGE("' *CAT +
                          &DSE03S *CAT '" "' *CAT &DSE03E *CAT '") +
                          & SE45 *EQ %RANGE("' *CAT &DSE45S *CAT '" +
                          "' *CAT &DSE45E *CAT '") &SF03 *EQ +
                          %RANGE("' *CAT &DSF03S *CAT '" "' *CAT +
                          &DSF03E *CAT '") & SE09 *NE "*" & SE36 +
                          *EQ "T" ') KEYFLD((SE01) (SE06) (SE02)) +
                          JFLD((SOSEPF/SE02 SOSFPF/SF02)) +
                          MAPFLD((SE01A '%SST(SE01 2 1)' *CHAR 1) +
                          (SE45 'SE04 *CAT SE05' *CHAR 9))
             CALL       SOR0601
             CHGVAR     VAR(&P6601I) VALUE('SOR060AP')
             ENDDO
             ELSE       CMD(DO)
             OVRPRTF    FILE(SOR060BP) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('°e³f©ú²Ó')
             OPNQRYF    FILE((SOSEPF) (SOSFPF)) FORMAT(REWFA5) +
                          QRYSLT('SE01A *EQ %RANGE("' *CAT &COMPS +
                          *CAT '" "' *CAT &COMPE *CAT '") & SE24 +
                          *EQ %RANGE(' *CAT &YSE24S *CAT ' ' *CAT +
                          &YSE24E *CAT ') & SE03 *EQ %RANGE("' *CAT +
                          &DSE03S *CAT '" "' *CAT &DSE03E *CAT '") +
                          & SE45  *EQ %RANGE("' *CAT &DSE45S *CAT +
                          '" "' *CAT &DSE45E *CAT '") &SF03 *EQ +
                          %RANGE("' *CAT &DSF03S *CAT '" "' *CAT +
                          &DSF03E *CAT '") & SE09 *EQ "V" & SE36 +
                          *EQ "T" ') KEYFLD((SE01) (SE24) (SE02)) +
                          JFLD((SOSEPF/SE02 SOSFPF/SF02)) +
                          MAPFLD((SE01A '%SST(SE01 2 1)' *CHAR 1) +
                          (SE45 'SE04 *CAT SE05' *CHAR 9))
             CALL       SOR0602
             CHGVAR     VAR(&P6601I) VALUE('SOR060BP')
             ENDDO
             ENDDO


             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
