     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1087  JOYCE                              */
     /*    CREATE DATE  : 81/02/19                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR049C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售訂單系統                             */
     /*    REMARK       :組別業務員銷售明細表                     */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC27S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC27E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC28S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSC28E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSC39E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC39E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)
/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))


             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 672 1))
             CHGVAR     VAR(&DSC27S) VALUE(%SST(*LDA 651 6))
             CHGVAR     VAR(&DSC27E) VALUE(%SST(*LDA 657 6))
             CHGVAR     VAR(&DSC28S) VALUE(%SST(*LDA 601 4))
             CHGVAR     VAR(&DSC28E) VALUE(%SST(*LDA 605 4))
             CHGVAR     VAR(&DSC39S) VALUE(%SST(*LDA 609 6))
             CHGVAR     VAR(&DSC39E) VALUE(%SST(*LDA 615 6))
             CHGVAR     VAR(&YSC39S) VALUE(%SST(*LDA 621 6))
             CHGVAR     VAR(&YSC39E) VALUE(%SST(*LDA 627 6))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))


             OVRPRTF    FILE(SOR049P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('業務銷明')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT(' SC28A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC27 *EQ %RANGE("' *CAT &DSC27S +
                          *CAT '"  "' *CAT &DSC27E *CAT '") & SC28 +
                          *EQ %RANGE("' *CAT &DSC28S *CAT '" "' +
                          *CAT &DSC28E *CAT '" ) & SC08 *EQ +
                          %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & SC13 *NE "*" & SC35 *NE +
                          "T" ') KEYFLD((SC28) (SC27) (SC04) (SC05) +
                          (SC08) (SC02)) MAPFLD((SC28A '%SST(SC28 4 +
                          1)' *CHAR 1))
/*M001D                   *CAT &DSC28E *CAT '" ) & SC08 *EQ +
                          %RANGE(' *CAT &YSC39S *CAT ' ' *CAT +   */
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC28A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC27 *EQ %RANGE("' *CAT &DSC27S +
                          *CAT '" "' *CAT &DSC27E *CAT '") & SC28 +
                          *EQ %RANGE("' *CAT &DSC28S *CAT '" "' +
                          *CAT &DSC28E *CAT '") & SC39 *EQ %RANGE(' +
                          *CAT &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT +
                          ') & SC13 *EQ "V" & SC35 *NE "T" ') +
                          KEYFLD((SC28) (SC27) (SC04) (SC05) (SC39) +
                          (SC02)) MAPFLD((SC28A '%SST(SC28 4 1)' +
                          *CHAR 1))
/*M001D                   *CAT &YSC39S *CAT ' ' *CAT &YSC39E *CAT + */
             ENDDO

             CALL       SOR0491

             CLOF       OPNID(SOSCPF)
             DLTOVR     FILE(SOSCPF)
             DLTOVR     FILE(SOR049P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE('SOR049P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
