     /***************************************************************/
     /*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266     */
     /*                                                             */
     /*    AUTHOR       : MERCURY                                   */
     /*    CREATE DATE  : 83/05/30                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR081C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :訂單系統                                 */
     /*    REMARK       :通路產品銷售（退）彙總表                 */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&COMPS)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC34S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC34E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC45S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC45E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&YSC39S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YSC39E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSD03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSD03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC28S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSC28E) TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(8)
/*M001A*/    DCL        VAR(&YMD8E)  TYPE(*CHAR) LEN(8)

             CPYF       FROMFILE(REWFA3) TOFILE(QTEMP/REWFA3) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFA3))

             OVRDBF     FILE(REWFA3) TOFILE(QTEMP/REWFA3) SHARE(*YES)


/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 8))
/*M001A*/    CHGVAR     VAR(&YMD8E)  VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&COMPS)  VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&COMPE)  VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 603 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 604 1))
             CHGVAR     VAR(&DSC34S) VALUE(%SST(*LDA 680 2))
             CHGVAR     VAR(&DSC34E) VALUE(%SST(*LDA 682 2))
             CHGVAR     VAR(&DSC31S) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DSC31E) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DSC45S) VALUE(%SST(*LDA 713 9))
             CHGVAR     VAR(&DSC45E) VALUE(%SST(*LDA 722 9))
             CHGVAR     VAR(&YSC39S) VALUE(%SST(*LDA 640 6))
             CHGVAR     VAR(&YSC39E) VALUE(%SST(*LDA 646 6))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))
             CHGVAR     VAR(&DSD03S) VALUE(%SST(*LDA 660 9))
             CHGVAR     VAR(&DSD03E) VALUE(%SST(*LDA 669 9))
             CHGVAR     VAR(&DSC28S) VALUE(%SST(*LDA 684 4))
             CHGVAR     VAR(&DSC28E) VALUE(%SST(*LDA 688 4))

             OVRPRTF    FILE(SOR081P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('通銷退總')
             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OVRDBF     FILE(SOSNPF) SHARE(*YES)


             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SC45 +
                          *EQ %RANGE("' *CAT &DSC45S *CAT '" "' +
                          *CAT &DSC45E *CAT '") & SC34 *EQ +
                          %RANGE("' *CAT &DSC34S *CAT '" "' *CAT +
                          &DSC34E *CAT '") & SC31 *EQ %RANGE("' +
                          *CAT &DSC31S *CAT '" "' *CAT &DSC31E *CAT +
                          '") & SC01B *NE "K" & SC04 *NE "B0000" & +
                          SC28 *EQ %RANGE("' *CAT &DSC28S +
                          *CAT '" "' *CAT &DSC28E *CAT '") &  SC08 +
                          *EQ %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & SC13 *NE "*" & SC35 *NE +
                          "T" & SC13 *NE "*" ') KEYFLD((SC01) +
                          (SC33)) MAPFLD((SC01A '%SST(SC01 2 1)' +
                          *CHAR 1) (SC45 '(sc04 || sc05)' *CHAR 9) +
                          (SC01B '%SST(SC01 1 1)'))
/*M001D                   *EQ %RANGE(' *CAT &YSC39S *CAT ' ' *CAT +
                        &YSC39E *CAT ') & SC13 *NE "*" & SC35 *NE + */

             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SG01B *NE "K" & SG04 *NE "B0000" & +
                          SG04A *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SG45 +
                          *EQ %RANGE("' *CAT &DSC45S *CAT '" "' +
                          *CAT &DSC45E *CAT '") &  SG15 *EQ +
                          %RANGE("' *CAT &DSC31S *CAT '" "' *CAT +
                          &DSC31E *CAT '") & SG12 *EQ %RANGE("' +
                          *CAT &DSC28S *CAT '" "' *CAT &DSC28E *CAT +
                          '") &  SG06 *EQ %RANGE(' *CAT &YMD8S  +
                          *CAT ' ' *CAT &YMD8E  *CAT ') & SG17 *EQ +
                          "  " ') MAPFLD((SG01A '%SST(SG01 2 1)' +
                          *CHAR 1) (SG45 '(SG04 || SG05)' *CHAR 9) +
                          (SG04A '%SST(SG04 1 1)' *CHAR 1) (SG01B +
                          '%SST(SG01 1 1)'))
/*M001D                   '") &  SG06 *EQ %RANGE(' *CAT &YSC39S +
                          *CAT ' ' *CAT &YSC39E *CAT ') & SG17 *EQ + */

             OPNQRYF    FILE((SOSNPF)) QRYSLT('SN01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SN01B *NE "K" &                  +
                          SN03A *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SN311 +
                          *EQ %RANGE("' *CAT &DSC45S *CAT '" "' +
                          *CAT &DSC45E *CAT '") & SN08 *EQ +
                          %RANGE("' *CAT &DSC28S *CAT '" "' *CAT +
                          &DSC28E *CAT '") &  SN05 *EQ %RANGE(' +
                          *CAT &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT +
                          ') & SN10 *NE "T" ') MAPFLD((SN01A +
                          '%SST(SN01 2 1)' *CHAR 1) (SN311 '(SN03 +
                          || SN11)' *CHAR 9) (SN03A '%SST(SN03 1 +
                          1)' *CHAR 1) (SN01B '%SST(SN01 1 1)'))
/*M001D                   *CAT &YSC39S *CAT ' ' *CAT &YSC39E *CAT + */
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SC01B *NE "K" & SC04 *NE "B0000" & +
                          SC33 *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '" ) & SC45 +
                          *EQ %RANGE("' *CAT &DSC45S *CAT '" "' +
                          *CAT &DSC45E *CAT '") & SC34 *EQ +
                          %RANGE("' *CAT &DSC34S *CAT '" "' *CAT +
                          &DSC34E *CAT '") & SC31 *EQ %RANGE("' +
                          *CAT &DSC31S *CAT '" "' *CAT &DSC31E *CAT +
                          '")& SC28 *EQ %RANGE("' *CAT &DSC28S *CAT +
                          '" "' *CAT &DSC28E *CAT '")  & SC39 *EQ +
                          %RANGE(' *CAT &YMD8S  *CAT ' ' *CAT +
                          &YMD8E  *CAT ') & SC13 *EQ "V" & SC35 *NE +
                          "T" ') MAPFLD((SC01A '%SST(SC01 2 1)' +
                          *CHAR 1) (SC45 '(SC04 || SC05)' *CHAR 9) +
                          (SC01B '%SST(SC01 1 1)'))
/*M001D                   %RANGE(' *CAT &YSC39S *CAT ' ' *CAT +
                        &YSC39E *CAT ') & SC13 *EQ "V" & SC35 *NE + */

             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SG01B *NE "K" & SG04 *NE "B0000" & +
                          SG04A *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SG45 +
                          *EQ %RANGE("' *CAT &DSC45S *CAT '" "' +
                          *CAT &DSC45E *CAT '") &  SG15 *EQ +
                          %RANGE("' *CAT &DSC31S *CAT '" "' *CAT +
                          &DSC31E *CAT '") & SG12 *EQ %RANGE("' +
                          *CAT &DSC28S *CAT '" "' *CAT &DSC28E *CAT +
                          '") &  SG26 *EQ %RANGE(' *CAT &YMD8S  +
                          *CAT ' ' *CAT &YMD8E  *CAT ') & SG14 *NE +
                          "*" & SG14 *NE " " & SG17 *EQ "  " ') +
                          MAPFLD((SG01A '%SST(SG01 2 1)' *CHAR 1) +
                          (SG45 '(SG04 || SG05)' *CHAR 9) (SG04A +
                          '%SST(SG04 1 1)' *CHAR 1) (SG01B +
                          '%SST(SG01 1 1)'))
/*M001D                   '") &  SG26 *EQ %RANGE(' *CAT &YSC39S +
                          *CAT ' ' *CAT &YSC39E *CAT ') & SG14 *NE + */

             OPNQRYF    FILE((SOSNPF)) QRYSLT('SN01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SN01B *NE " K" &                 +
                          SN03A *EQ %RANGE("' *CAT &DSC33S +
                          *CAT '" "' *CAT &DSC33E *CAT '") & SN311 +
                          *EQ %RANGE("' *CAT &DSC45S *CAT '" "' +
                          *CAT &DSC45E *CAT '") & SN08 *EQ +
                          %RANGE("' *CAT &DSC28S *CAT '" "' *CAT +
                          &DSC28E *CAT '") & SN06 *EQ %RANGE(' *CAT +
                          &YMD8S  *CAT ' ' *CAT &YMD8E  *CAT ') & +
                          SN10 *NE "T" ') MAPFLD((SN01A '%SST(SN01 +
                          2 1)' *CHAR 1) (SN311 '(SN03 || SN11)' +
                          *CHAR 9) (SN03A '%SST(SN03 1 1)' *CHAR 1) +
                          (SN01B '%SST(SN01 1 1)'))
/*M001D                   &YSC39S *CAT ' ' *CAT &YSC39E *CAT ') & + */
             ENDDO

             CALL       SOR0811
             OPNQRYF    FILE((REWFA3)) KEYFLD((WFA303) (WFA315) +
                          (WFA320) (WFA317))
             CALL       SOR0812
             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSGPF)
             CLOF       OPNID(SOSNPF)
             CLOF       OPNID(REWFA3)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR081P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
