             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN97)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&ERRCD)  TYPE(*CHAR) LEN(1)
             CHGVAR     VAR(%SST(*LDA 162   1)) VALUE('2')
             CHGVAR     VAR(%SST(*LDA 125   3)) VALUE('001')
             CHGVAR     VAR(%SST(*LDA 598   2)) VALUE('01')
             CALL       PGM(S#P63)
             CALL       PGM(SOR090) PARM(&IN03 &IN98 &IN97)

             IF         COND(&IN03) THEN(DO)
 /*M001M     CHGVAR     VAR(%SST(*LDA 601 200)) VALUE(' ') */
 /*M001M*/   CHGVAR     VAR(%SST(*LDA 601 300)) VALUE(' ')
             RETURN
             ENDDO

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             IF         COND(&$EVR *EQ '1') THEN(DO)
                        SBMJOB    JOB(SOR090C1) RQSDTA('CALL SOR090C1')
                        CHGVAR     VAR(&IN97)  VALUE('1')
                        ENDDO


             ENDPGM
