             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DST01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DST01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DDATE)  TYPE(*CHAR) LEN(4)
/*M001A*/    DCL        VAR(&YMD8S)  TYPE(*CHAR) LEN(6)


/*M001A*/    CHGVAR     VAR(&YMD8S)  VALUE(%SST(*LDA 850 6))
             CHGVAR     VAR(&DDATE)  VALUE(%SST(*LDA 605 4))
             CHGVAR     VAR(&DST01S) VALUE(%SST(*LDA 613 5))
             CHGVAR     VAR(&DST01E) VALUE(%SST(*LDA 618 5))

             OVRPRTF    FILE(SOR085P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('±MÂd³¡ªù')
             CPYF       FROMFILE(REWFC2) TOFILE(QTEMP/REWFC2) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFC2))
             OVRDBF     FILE(REWFC2) TOFILE(QTEMP/REWFC2) SHARE(*YES)


             OVRDBF     FILE(W2BAPF) SHARE(*YES)
             OPNQRYF    FILE((W2BAPF)) OPTION(*ALL) QRYSLT('BA02 *EQ +
                          %RANGE("' *CAT &DST01S *CAT '" "' *CAT +
                          &DST01E *CAT '") & BA01A *EQ "' *CAT +
                          &YMD8S *CAT '" ') MAPFLD((BA01S BA01 +
                          *CHAR 8) (BA01A '%SST(BA01S 1 6)' *CHAR 6))

             OVRDBF     FILE(W2BBPF) SHARE(*YES)
             OPNQRYF    FILE((W2BBPF)) OPTION(*ALL) +
                          QRYSLT('                     BB09 *EQ +
                          "P"                             ')    +
                        KEYFLD((*FILE))

             CALL       SOR0851
             CALL       SOR0852

             CLOF       OPNID(W2BAPF)
             CLOF       OPNID(W2BBPF)
             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR085P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
