             PGM        PARM(&IN99)

  /* 20070517 EASON +++++ */

             DCLF       FILE(PYWWPF)
             DCL        VAR(&IN99)     TYPE(*CHAR)  LEN(1)

             DCL        VAR(&CMDTXT)   TYPE(*CHAR) LEN(160)
             DCL        VAR(&CMDLEN)   TYPE(*DEC)  LEN(15 5)


  /* 20070517 EASON +++++ */


    READF:
             RCVF
      /*捕抓檔案中沒有符合資料的訊息，再搬值給IN99傳直回去*/
             MONMSG     MSGID(CPF0864) EXEC(CHGVAR VAR(&IN99) +
                          VALUE('1'))

             IF         COND(&IN99 *EQ '1') THEN(GOTO CMDLBL(END))

             IF         COND(&WW01  *NE 'FF' ) THEN(GOTO CMDLBL(READF))

             CHGVAR     VAR(&CMDTXT) VALUE('STRPCCMD PCCMD('||+
             &WW02)
             CHGVAR     VAR(&CMDLEN) VALUE(160)
   /*呼叫PC程式*/
             STRPCO
             MONMSG     MSGID(IWS4010)
             CALL       PGM(QCMDEXC) PARM(&CMDTXT &CMDLEN)
    END:
             ENDPGM
