             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DSC01S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC01E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPS) TYPE(*CHAR) LEN(1)
             DCL        VAR(&COMPE) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC28S) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSC28E) TYPE(*CHAR) LEN(4)
             DCL        VAR(&DSC33S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC33E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSC34S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC34E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC31E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSC45S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC45E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSC04S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DSC04E) TYPE(*CHAR) LEN(5)
 /* M003A */ DCL        VAR(&D#L01S) TYPE(*CHAR) LEN(2)
 /* M003A */ DCL        VAR(&D#L01E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YMDS) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMDE) TYPE(*CHAR) LEN(6)
 /* M001M */ DCL        VAR(&YMD8S) TYPE(*CHAR) LEN(8)
 /* M001M */ DCL        VAR(&YMD8E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&IN20) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSEL2) TYPE(*CHAR) LEN(1)


             CPYF       FROMFILE(REWF37) TOFILE(QTEMP/REWF37) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWF37))
             OVRDBF     FILE(REWF37) TOFILE(QTEMP/REWF37) SHARE(*YES)

     /*  Â§²°©î³æ²~ */
             CPYF       FROMFILE(RES18WF) TOFILE(QTEMP/RES18WF) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/RES18WF))
             OVRDBF     FILE(RES18WF) TOFILE(QTEMP/RES18WF) SHARE(*YES)
             CLRPFM     FILE(RWF371)


             OVRPRTF    FILE(SOR162P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('¤½¥q¾P°â')
             CHGVAR     VAR(&DSC01S) VALUE(%SST(*LDA 790 1))
             CHGVAR     VAR(&DSC01E) VALUE(%SST(*LDA 791 1))
             CHGVAR     VAR(&DSC28S) VALUE(%SST(*LDA 673 4))
             CHGVAR     VAR(&DSC28E) VALUE(%SST(*LDA 677 4))
             CHGVAR     VAR(&COMPS) VALUE(%SST(*LDA 671 1))
             CHGVAR     VAR(&COMPE) VALUE(%SST(*LDA 672 1))
             CHGVAR     VAR(&DSC33S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DSC33E) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DSC34S) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DSC34E) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DSC31S) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DSC31E) VALUE(%SST(*LDA 609 2))
             CHGVAR     VAR(&DSC45S) VALUE(%SST(*LDA 681 9))
             CHGVAR     VAR(&DSC45E) VALUE(%SST(*LDA 690 9))
             CHGVAR     VAR(&DSC04S) VALUE(%SST(*LDA 681 5))
             CHGVAR     VAR(&DSC04E) VALUE(%SST(*LDA 690 5))
 /* M003A */ CHGVAR     VAR(&D#L01S) VALUE(%SST(*LDA 730 2))
 /* M003A */ CHGVAR     VAR(&D#L01E) VALUE(%SST(*LDA 732 2))
             CHGVAR     VAR(&YMDS) VALUE(%SST(*LDA 611 6))
             CHGVAR     VAR(&YMDE) VALUE(%SST(*LDA 617 6))
 /* M001M */ CHGVAR     VAR(&YMD8S) VALUE(%SST(*LDA 850 8))
 /* M001M */ CHGVAR     VAR(&YMD8E) VALUE(%SST(*LDA 858 8))
             CHGVAR     VAR(&IN20)   VALUE(%SST(*LDA 750 1))
             CHGVAR     VAR(&DSEL2)   VALUE(%SST(*LDA 720 1))

             OVRDBF     FILE(SOSCPF) SHARE(*YES)
             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OVRDBF     FILE(SOSNPF) SHARE(*YES)
             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") &  SC01B *NE "K" & SC45 *EQ %RANGE("' +
                          *CAT &DSC45S *CAT '" "' *CAT &DSC45E *CAT +
                          '") & SC28 *EQ %RANGE("' *CAT &DSC28S +
                          *CAT '" "' *CAT &DSC28E *CAT '") & SC33 +
                          *EQ %RANGE("' *CAT &DSC33S *CAT '" "' +
                          *CAT &DSC33E *CAT '") & SC34 *EQ +
                          %RANGE("' *CAT &DSC34S *CAT '" "' *CAT +
                          &DSC34E *CAT '") & SC31 *EQ %RANGE("' +
                          *CAT &DSC31S *CAT '" "' *CAT &DSC31E *CAT +
                          '") & MSC08 *EQ %RANGE("' *CAT &YMD8S *CAT +
                          '" "' *CAT &YMD8E *CAT '") & SC13 *NE "*" +
                          & SC35 *NE "T" & SC29 *NE " " ') +
                          KEYFLD(*FILE) MAPFLD((MSC08 SC08 *CHAR 8) +
                          (SC01A '%SST(SC01 2 1)' *CHAR 1) (SC45 +
                          '(SC04 || SC05)' *CHAR 9) (SC01B +
                          '%SST(SC01 1 1)' *CHAR 1))
  /* M001M                KEYFLD(*FILE) MAPFLD((MSC08 SC08 *CHAR 6) */
/*M001D                   '") & MSC08 *EQ %RANGE("' *CAT &YMDS *CAT +
                        '" "' *CAT &YMDE *CAT '") & SC13 *NE "*" +  */
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSCPF)) QRYSLT('SC01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '")  & SC01B *NE "K" &                  +
                          SC45 *EQ %RANGE("' *CAT &DSC45S *CAT '" +
                          "' *CAT &DSC45E *CAT '") & SC28 *EQ +
                          %RANGE("' *CAT &DSC28S *CAT '" "' *CAT +
                          &DSC28E *CAT '") & SC33 *EQ %RANGE("' +
                          *CAT &DSC33S *CAT '" "' *CAT &DSC33E *CAT +
                          '") & SC34 *EQ %RANGE("' *CAT &DSC34S +
                          *CAT '" "' *CAT &DSC34E *CAT '") & SC31 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & MSC39 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") & SC13 *EQ "V" & SC35 *NE +
                          "T" ') KEYFLD(*FILE) MAPFLD((MSC39 SC39 +
                          *CHAR 8) (SC01A '%SST(SC01 2 1)' *CHAR 1) +
                          (SC45 '(SC04 || SC05)' *CHAR 9) (SC01B +
                          '%SST(SC01 1 1)' *CHAR 1))
 /* M001M                 *CHAR 6) (SC01A '%SST(SC01 2 1)' *CHAR 1) */
/*M001D                   %RANGE("' *CAT &YMDS *CAT '" "' *CAT +
                          &YMDE *CAT '") & SC13 *EQ "V" & SC35 *NE + */
             ENDDO


             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SG01B *NE "K" & SG45 *EQ %RANGE("' +
                          *CAT &DSC45S *CAT '" "' *CAT &DSC45E *CAT +
                          '") & SG12 *EQ %RANGE("' *CAT &DSC28S +
                          *CAT '" "' *CAT &DSC28E *CAT '") & SG15 +
                          *EQ %RANGE("' *CAT &DSC31S *CAT '" "' +
                          *CAT &DSC31E *CAT '") & MSG06 *EQ +
                          %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") &  SG17 *EQ "            " +
                          ') KEYFLD(*FILE) MAPFLD((MSG06 SG06 *CHAR +
                          8) (SG01A '%SST(SG01 2 1)' *CHAR 1) +
                          (SG01B '%SST(SG01 1 1)' *CHAR 1) (SG45 +
                          '(SG04 || SG05)' *CHAR 9))
 /* M001M                 6) (SG01A '%SST(SG01 2 1)' *CHAR 1) +   */
/*M001D                   %RANGE("' *CAT &YMDS *CAT '" "' *CAT +
                        &YMDE *CAT '") &  SG17 *EQ "            " + */
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSGPF)) QRYSLT('SG01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SG01B *NE "K"                    & +
                          SG45 *EQ %RANGE("' *CAT &DSC45S *CAT '" +
                          "' *CAT &DSC45E *CAT '") & SG12 *EQ +
                          %RANGE("' *CAT &DSC28S *CAT '" "' *CAT +
                          &DSC28E *CAT '") & SG15 *EQ %RANGE("' +
                          *CAT &DSC31S *CAT '" "' *CAT &DSC31E *CAT +
                          '") & MSG26 *EQ %RANGE("' *CAT &YMD8S *CAT +
                          '" "' *CAT &YMD8E *CAT '") &  SG17 *EQ +
                          "            " ') KEYFLD(*FILE) +
                         MAPFLD((MSG26 SG26 *CHAR 8) (SG01A +
                          '%SST(SG01 2 1)' *CHAR 1) (SG01B +
                          '%SST(SG01 1 1)' *CHAR 1) (SG45 '(SG04 || +
                          SG05)' *CHAR 9))
 /* M001M                MAPFLD((MSG26 SG26 *CHAR 6) (SG01A +  */
/*M001D                   '") & MSG26 *EQ %RANGE("' *CAT &YMDS *CAT +
                          '" "' *CAT &YMDE *CAT '") &  SG17 *EQ +  */
             ENDDO

             IF         COND(&IN20 = '0') THEN(DO)
             OPNQRYF    FILE((SOSNPF)) QRYSLT('SN01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SN01B *NE "K" & SN03 *EQ %RANGE("' +
                          *CAT &DSC04S *CAT '" "' *CAT &DSC04E *CAT +
                          '") & SN08 *EQ %RANGE("' *CAT &DSC28S +
                          *CAT '" "' *CAT &DSC28E *CAT '") &  MSN05 +
                          *EQ %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") &  SN10 *NE "T" & SN02L +
                          *EQ "R3" ') KEYFLD(*FILE) MAPFLD((MSN05 +
                          SN05 *CHAR 8) (SN01A '%SST(SN01 2 1)' +
                          *CHAR 1) (SN01B '%SST(SN01 1 1)' *CHAR 1) +
                          (SN02L '%SST(SN02 3 2)' *CHAR 2))
 /* M001M                 SN05 *CHAR 6) (SN01A '%SST(SN01 2 1)' +  */
/*M001D                   *EQ %RANGE("' *CAT &YMDS *CAT '" "' *CAT +
                          &YMDE *CAT '") &  SN10 *NE "T" & SN02L +  */
             ENDDO
             ELSE       CMD(DO)
             OPNQRYF    FILE((SOSNPF)) QRYSLT('SN01A *EQ %RANGE("' +
                          *CAT &COMPS *CAT '" "' *CAT &COMPE *CAT +
                          '") & SN01B *NE "K" & SN03 *EQ %RANGE("' +
                          *CAT &DSC04S *CAT '" "' *CAT &DSC04E *CAT +
                          '") & SN08 *EQ %RANGE("' *CAT &DSC28S +
                          *CAT '" "' *CAT &DSC28E *CAT '") &  MSN06 +
                          *EQ %RANGE("' *CAT &YMD8S *CAT '" "' *CAT +
                          &YMD8E *CAT '") &  SN10 *NE "T" & SN02L +
                          *EQ "R3" ') KEYFLD(*FILE) MAPFLD((MSN06 +
                          SN06 *CHAR 8) (SN01A '%SST(SN01 2 1)' +
                          *CHAR 1) (SN02L '%SST(SN02 3 2)' *CHAR 2) +
                          (SN01B '%SST(SN01 1 1)' *CHAR 1))
 /* M001M                 SN06 *CHAR 6) (SN01A '%SST(SN01 2 1)' + */
/*M001D                   *EQ %RANGE("' *CAT &YMDS *CAT '" "' *CAT +
                          &YMDE *CAT '") &  SN10 *NE "T" & SN02L +  */
             ENDDO

             CALL       SOR1621
             CALL       SOR1622

             CLOF       OPNID(SOSCPF)
             CLOF       OPNID(SOSGPF)
             CLOF       OPNID(SOSNPF)
             DLTOVR     FILE(*ALL)


             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR162P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)


             ENDPGM
