     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/10                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR42AC1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售系統                                 */
     /*    REMARK       :客戶報價到期表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&YDATE)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSA02S)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSA02E)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSA01S)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSA01E)  TYPE(*CHAR) LEN(9)

             CHGVAR     VAR(&YDATE)  VALUE(%SST(*LDA 611 6))
             CHGVAR     VAR(&DSA02S)  VALUE(%SST(*LDA 607 1))
             CHGVAR     VAR(&DSA02E)  VALUE(%SST(*LDA 608 1))
             CHGVAR     VAR(&DSA01S)  VALUE(%SST(*LDA 621 9))
             CHGVAR     VAR(&DSA01E)  VALUE(%SST(*LDA 631 9))

             OVRPRTF    FILE(SOR042AP) PAGESIZE(*N 157) CPI(12)
             OVRDBF     FILE(SOSAPF) SHARE(*YES)
             OVRDBF     FILE(MTMALF) SHARE(*YES)

             OPNQRYF    FILE((SOSAPF)) QRYSLT('(SA14 *NE "*") & +
                          (SA13A *EQ "' *CAT &YDATE *CAT '") & SA01 +
                          *EQ %RANGE("' *CAT &DSA01S *CAT '" "' +
                          *CAT &DSA01E *CAT '") & SA02 *EQ +
                          %RANGE("' *CAT &DSA02S *CAT '" "' *CAT +
                          &DSA02E *CAT '") ') KEYFLD((SA01) (SA02) +
                          (SA03)) MAPFLD((SA13A SA13 *CHAR 6))

             CALL       SOR042A1

             CLOF       OPNID(SOSAPF)
             DLTOVR     FILE(SOSAPF)
             DLTOVR     FILE(MTMALF)
             DLTOVR     FILE(SOR042AP)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR042AP')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
