     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/10                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : SOR42BC1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :銷售系統                                 */
     /*    REMARK       :客戶報價到期表                           */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&YDATE)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&DSB01S)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSB01E)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DSB02S)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DSB02E)  TYPE(*CHAR) LEN(9)

             CHGVAR     VAR(&YDATE)  VALUE(%SST(*LDA 611 6))
             CHGVAR     VAR(&DSB01S)  VALUE(%SST(*LDA 607 1))
             CHGVAR     VAR(&DSB01E)  VALUE(%SST(*LDA 641 1))
             CHGVAR     VAR(&DSB02S)  VALUE(%SST(*LDA 621 9))
             CHGVAR     VAR(&DSB02E)  VALUE(%SST(*LDA 631 9))

             OVRPRTF    FILE(SOR042BP) PAGESIZE(*N 157) CPI(12)
             OVRDBF     FILE(SOSBPF) SHARE(*YES)

             OPNQRYF    FILE((SOSBPF)) QRYSLT('(SB14 *NE "*") & +
                          (SB13A *EQ "' *CAT &YDATE *CAT '") & +
                          SB01A *EQ %RANGE("' *CAT &DSB01S *CAT '" +
                          "' *CAT &DSB01E *CAT '") & SB02 *EQ +
                          %RANGE("' *CAT &DSB02S *CAT '" "' *CAT +
                          &DSB02E *CAT '") ') KEYFLD((SB01) (SB02)) +
                          MAPFLD((SB13A SB13 *CHAR 6) (SB01A +
                          '%SST(SB01 1 1)' *CHAR 1))

             CALL       SOR042B1

             CLOF       OPNID(SOSBPF)
             DLTOVR     FILE(SOSBPF)
             DLTOVR     FILE(SOR042BP)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SOR042BP')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDPGM
