/********************************************************************/
/*                                                                  */
/* 5738SS1 V2R1M0 910524     RTVCLSRC Output     03/19/93 09:48:49  */
/*                                                                  */
/* Program name . . . . . . . . . . . . . . :   SSM000C           PN*/
/* Library name . . . . . . . . . . . . . . :   REPLIB            PL*/
/* Original source file . . . . . . . . . . :   QCLSRC            SN*/
/* Library name . . . . . . . . . . . . . . :   REPLIB            SL*/
/* Original source member . . . . . . . . . :   SOM000C           SM*/
/* Source file change                                               */
/*   date/time  . . . . . . . . . . . . . . :   01/06/93 08:44:44 SC*/
/* Patch option . . . . . . . . . . . . . . :   *NOPATCH          PO*/
/* User profile . . . . . . . . . . . . . . :   *USER             UP*/
/* Text . . . : 普銷系統主畫面                             A1034TX*/
/* Owner  . . . . . . . . . . . . . . . . . :   D910074           OW*/
/* Patch change ID  . . . . . . . . . . . . :                     PC*/
/* Patch APAR ID  . . . . . . . . . . . . . :                     PA*/
/* User mod flag  . . . . . . . . . . . . . :   *YES              UM*/
/*                                                                ED*/
/********************************************************************/
     PGM
     DCL VAR(&WDATE) TYPE(*CHAR) LEN(6)
     DCL VAR(&$USER) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0101I) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0102I) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0101O) TYPE(*CHAR) LEN(1)
     DCLF FILE(*LIBL/SSM000D) RCDFMT(DSPC1)
     RTVDTAARA DTAARA(*LDA (101 10)) RTNVAR(&$USER)
     RTVDTAARA DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
     CHGVAR VAR(&$EGMDY) VALUE(&WDATE)
     CHGVAR VAR(&S0101I) VALUE(&$USER)
START:
     SNDRCVF DEV(*FILE) RCDFMT(DSPC1)
     CHGVAR VAR(&IN98) VALUE('0')
     IF COND(&IN03 *EQ '1') THEN(RETURN)
     IF COND(&DOPID *EQ '01') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('MTA009')
     ENDDO
     IF COND(&DOPID *EQ '02') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOA022')
     ENDDO
     IF COND(&DOPID *EQ '03') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOA023C')
     ENDDO
     IF COND(&DOPID *EQ '04') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOA030')
     ENDDO
     IF COND(&DOPID *EQ '05') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('POA009') /*M001M*/
     ENDDO
     IF COND(&DOPID *EQ '06') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('POA002')
     ENDDO
     IF COND(&DOPID *EQ '07') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('POA005')
     ENDDO
     IF COND(&DOPID *EQ '21') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('POI021')
     ENDDO
     IF COND(&DOPID *EQ '22') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('POI022')
     ENDDO
     IF COND(&DOPID *EQ '23') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('POI023')
     ENDDO
     IF COND(&DOPID *EQ '24') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('IMI021')
     ENDDO
     IF COND(&DOPID *EQ '25') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('IMI022')
     ENDDO
     IF COND(&DOPID *EQ '31') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('KIM000C')
     ENDDO
     IF COND(&DOPID *EQ '41') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOR076C')
     ENDDO
     IF COND(&DOPID *EQ '42') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOR077C')
     ENDDO
     IF COND(&DOPID *EQ '43') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOR078C')
     ENDDO
     IF COND(&DOPID *EQ '44') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SAR052C')
     ENDDO
     IF COND(&DOPID *EQ '45') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SAR053C')
     ENDDO
     IF COND(&DOPID *EQ '46') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SAR054C')
     ENDDO
     IF COND(&DOPID *EQ '47') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOR080C')
     ENDDO
     IF COND(&DOPID *EQ '48') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('POR056C')
     ENDDO
     IF COND(&DOPID *EQ '49') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOR083C')
     ENDDO
     IF COND(&DOPID *EQ '50') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOR085C')
     ENDDO
     IF COND(&DOPID *EQ '51') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SOR082C')
     ENDDO
     IF COND(&DOPID *EQ '52') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('POR058C')
     ENDDO
     IF COND(&DOPID *EQ '53') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('IMR053C')
     ENDDO
     IF COND(&DOPID *EQ '54') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('POR063C')
     ENDDO
     IF COND(&DOPID *EQ '55') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('SAR081C')
     ENDDO
     IF COND(&DOPID *EQ '  ') THEN(GOTO CMDLBL(START))
     GOTO CMDLBL(CHKAUT)
CHKAUT: +
     CALL PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
     IF COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
     ELSE CMD(CHGVAR VAR(&IN98) VALUE('1'))
     GOTO CMDLBL(START)
     ENDPGM
