 /* 掛上正式環境*/
 /*                           */
    PGM
             DCL      VAR(&JOBTYPE) TYPE(*CHAR) LEN(1)

             RTVJOBA  TYPE(&JOBTYPE)
             IF       COND(&JOBTYPE = '0') THEN(GOTO BATCH)

  SBMJOB     CMD(CALL PGM(UPDAP)) JOB(UPDPGM) LOG(4 00 *MSG)
             SNDPGMMSG MSG('YOUR PROGRAM ALREADY BE SUBMITED....')
             GOTO     ENDPGM

  BATCH:
             RNMOBJ     OBJ(RVRFPF) OBJTYPE(*FILE) +
                          NEWOBJ(RVRFPF@)
             MONMSG CPF0000
             DLTF       FILE(RVRFLF*)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(APFLIB/QDDSSRC) FROMMBR(RVRFPF)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(APPLIB/QDDSSRC) FROMMBR(APA009D)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(APPLIB/QDDSSRC) FROMMBR(APA009)
             CRTPF      FILE(RVRFPF       ) SRCFILE(APFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTLF      FILE(RVRFLF01) SRCFILE(APFLIB/QDDSSRC)
             CRTLF      FILE(RVRFLF02) SRCFILE(APFLIB/QDDSSRC)
             CRTLF      FILE(RVRFLF03) SRCFILE(APFLIB/QDDSSRC)
             CRTLF      FILE(RVRFLF04) SRCFILE(APFLIB/QDDSSRC)
             CRTLF      FILE(RVRFLF05) SRCFILE(APFLIB/QDDSSRC)
             CRTLF      FILE(RVRFLF06) SRCFILE(APFLIB/QDDSSRC)
             CRTLF      FILE(RVRFLF07) SRCFILE(APFLIB/QDDSSRC)
             CRTLF      FILE(RVRFLF08) SRCFILE(APFLIB/QDDSSRC)
             CRTLF      FILE(RVRFLF09) SRCFILE(APFLIB/QDDSSRC)
             CRTLF      FILE(RVRFLF10) SRCFILE(APFLIB/QDDSSRC)
  ENDPGM:
             ENDPGM

