 /* 將應稅程式，掛上正式環境*/
 /*                           */
    PGM
             DCL      VAR(&JOBTYPE) TYPE(*CHAR) LEN(1)

             RTVJOBA  TYPE(&JOBTYPE)
             IF       COND(&JOBTYPE = '0') THEN(GOTO BATCH)

             SBMJOB     CMD(CALL PGM(UPDC)) JOB(UPDC) LOG(4 00 *MSG)
             SNDPGMMSG MSG('YOUR PROGRAM ALREADY BE SUBMITED....')
             GOTO     ENDPGM

  BATCH:
             CPYF       FROMFILE(REFLIB/ARAFPF) +
                          TOFILE(REFLIB/ARAFPF@) MBROPT(*REPLACE)
             CPYF       FROMFILE(REFLIB/ARAGPF) +
                          TOFILE(REFLIB/ARAGPF@) MBROPT(*REPLACE)
             CPYF       FROMFILE(REFLIB/SOSSPF) +
                          TOFILE(REFLIB/SOSSPF@) MBROPT(*REPLACE)
             DLTF       FILE(REFLIB/ARAFLF*)
             DLTF       FILE(REFLIB/ARAGLF*)
             DLTF       FILE(REFLIB/ARAHLF)
             DLTF       FILE(REFLIB/SOSSLF01)
             CPYSRCF    FROMFILE(DUTFLIB/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(ARAFPF)
             CPYSRCF    FROMFILE(DUTFLIB/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(ARAGPF)
             CPYSRCF    FROMFILE(DUTFLIB/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOSSPF)
             CPYSRCF    FROMFILE(DUTFLIB/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(WFJL21PF)
             CPYSRCF    FROMFILE(DUTFLIB/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOSXPF) +
                          MBROPT(*ADD)
             CPYSRCF    FROMFILE(DUTFLIB/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOSYPF) +
                          MBROPT(*ADD)
             CPYSRCF    FROMFILE(DUTFLIB/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOSZPF) +
                          TOMBR(*FROMMBR) MBROPT(*ADD)
             CPYSRCF    FROMFILE(DUTFLIB/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOS2PF) +
                          MBROPT(*ADD)
             CPYSRCF    FROMFILE(DUTFLIB/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(REWF81)
             RNMOBJ     OBJ(REFLIB/WFJL21PF) OBJTYPE(*FILE) +
                          NEWOBJ(BKWFJL21PF)
             RNMOBJ     OBJ(REFLIB/ARAFPF) OBJTYPE(*FILE) +
                          NEWOBJ(BKARAFPF)
             RNMOBJ     OBJ(REFLIB/ARAGPF) OBJTYPE(*FILE) +
                          NEWOBJ(BKARAGPF)
             RNMOBJ     OBJ(REFLIB/SOSSPF) OBJTYPE(*FILE) +
                          NEWOBJ(BKSOSSPF)
             RNMOBJ     OBJ(REFLIB/REWF81) OBJTYPE(*FILE) +
                          NEWOBJ(BKREWF81)
             CRTPF      FILE(REFLIB/WFJL21PF) +
                          SRCFILE(REFLIB/QDDSSRC) SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/ARAFPF) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/ARAGPF) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/SOS2PF) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/SOSSPF) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/SOSXPF) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/SOSYPF) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/SOSZPF) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/REWF81) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTLF      FILE(REFLIB/ARAFLF8) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAFLF9) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAHLF) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAGLF) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAGLF01) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAGLF02) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAGLF03) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAGLF04) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSSLF01) SRCFILE(REFLIB/QDDSSRC)

   /* DDS */
             CPYSRCF    FROMFILE(DUTYLIB/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(*ALL)
             RNMOBJ     OBJ(REPLIB/ARA0042D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARA0042D)
             RNMOBJ     OBJ(REPLIB/ARA007D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARA007D)
             RNMOBJ     OBJ(REPLIB/ARA008D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARA008D)
             RNMOBJ     OBJ(REPLIB/ARA0081D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARA0081D)
             RNMOBJ     OBJ(REPLIB/ARA0082D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARA0082D)
             RNMOBJ     OBJ(REPLIB/ARA0083D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARA0083D)
             RNMOBJ     OBJ(REPLIB/ARA016D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARA016D)
             RNMOBJ     OBJ(REPLIB/ARA0161D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARA0161D)
             RNMOBJ     OBJ(REPLIB/ARI021D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARI021D)
             RNMOBJ     OBJ(REPLIB/ARI024D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARI024D)
             RNMOBJ     OBJ(REPLIB/ARI0241D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARI0241D)
             RNMOBJ     OBJ(REPLIB/ARI025D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARI025D)
             RNMOBJ     OBJ(REPLIB/ARI029D) OBJTYPE(*FILE) +
                        NEWOBJ(BKARI029D)
             RNMOBJ     OBJ(REPLIB/SOA003D) OBJTYPE(*FILE) +
                        NEWOBJ(BKSOA003D)
             RNMOBJ     OBJ(REPLIB/SOA004D) OBJTYPE(*FILE) +
                        NEWOBJ(BKSOA004D)
             RNMOBJ     OBJ(REPLIB/SOA005D) OBJTYPE(*FILE) +
                        NEWOBJ(BKSOA005D)
             RNMOBJ     OBJ(REPLIB/SOA0061D) OBJTYPE(*FILE) +
                        NEWOBJ(BKSOA0061D)
             RNMOBJ     OBJ(REPLIB/SOA030D) OBJTYPE(*FILE) +
                        NEWOBJ(BKSOA030D)
             CRTDSPF    FILE(REPLIB/ARI021D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARA0042D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARA007D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARA008D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARA0081D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARA0082D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARA0083D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARA016D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARA0161D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARI024D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARI0241D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARI025D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/ARI029D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/SOA003D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/SOA004D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/SOA005D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/SOA0061D) SRCFILE(REPLIB/QDDSSRC)
             CRTDSPF    FILE(REPLIB/SOA030D) SRCFILE(REPLIB/QDDSSRC)

             RNMOBJ     OBJ(REPLIB/ARA015P) OBJTYPE(*FILE) +
                        NEWOBJ(BKARA015P)
             RNMOBJ     OBJ(REPLIB/ARB001P) OBJTYPE(*FILE) +
                        NEWOBJ(BKARB001P)
             RNMOBJ     OBJ(REPLIB/ARR047AP) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR047AP)
             RNMOBJ     OBJ(REPLIB/ARR047BP) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR047BP)
             RNMOBJ     OBJ(REPLIB/ARR048P) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR048P)
             RNMOBJ     OBJ(REPLIB/ARR050P) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR050P)
             RNMOBJ     OBJ(REPLIB/ARR051BP) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR051BP)
             RNMOBJ     OBJ(REPLIB/ARR057AP) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR057AP)
             RNMOBJ     OBJ(REPLIB/ARR057P) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR057P)
             RNMOBJ     OBJ(REPLIB/ARR060P) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR060P)
             RNMOBJ     OBJ(REPLIB/ARR061AP) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR061AP)
             RNMOBJ     OBJ(REPLIB/ARR061BP) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR061BP)
             RNMOBJ     OBJ(REPLIB/ARR067P) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR067P)
             RNMOBJ     OBJ(REPLIB/ARR072P) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR072P)
             RNMOBJ     OBJ(REPLIB/ARR077P) OBJTYPE(*FILE) +
                        NEWOBJ(BKARR077P)
             RNMOBJ     OBJ(REPLIB/IMR044P) OBJTYPE(*FILE) +
                        NEWOBJ(BKIMR044P)
             RNMOBJ     OBJ(REPLIB/IMR045P) OBJTYPE(*FILE) +
                        NEWOBJ(BKIMR045P)
             RNMOBJ     OBJ(REPLIB/JLB0213P) OBJTYPE(*FILE) +
                        NEWOBJ(BKJLB0213P)
             CRTPRTF    FILE(REPLIB/ARA015P) SRCFILE(REPLIB/QDDSSRC) +
                          PAGESIZE(66 198) CPI(15)
             CRTPRTF    FILE(REPLIB/ARB001P) SRCFILE(REPLIB/QDDSSRC)
             CRTPRTF    FILE(REPLIB/ARR047AP) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 157) +
                          CPI(12)
             CRTPRTF    FILE(REPLIB/ARR047BP) SRCFILE(REPLIB/QDDSSRC)
             CRTPRTF    FILE(REPLIB/ARR048P) SRCFILE(REPLIB/QDDSSRC) +
                          PAGESIZE(66 198) CPI(15)
             CRTPRTF    FILE(REPLIB/ARR050P) SRCFILE(REPLIB/QDDSSRC) +
                          PAGESIZE(42 198) CPI(15) OVRFLW(42)
             CRTPRTF    FILE(REPLIB/ARR051BP) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(84 198) +
                          CPI(15) OVRFLW(66)
             CRTPRTF    FILE(REPLIB/ARR057AP) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(42 198) +
                          CPI(15) OVRFLW(42)
             CRTPRTF    FILE(REPLIB/ARR057P) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(42 198) +
                          CPI(15) OVRFLW(42)
             CRTPRTF    FILE(REPLIB/ARR060P) SRCFILE(REPLIB/QDDSSRC) +
                          PAGESIZE(84 198) CPI(15) OVRFLW(66)
             CRTPRTF    FILE(REPLIB/ARR061AP) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)
             CRTPRTF    FILE(REPLIB/ARR061BP) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)
             CRTPRTF    FILE(REPLIB/ARR067P) SRCFILE(REPLIB/QDDSSRC) +
                          PAGESIZE(66 198) CPI(15)
             CRTPRTF    FILE(REPLIB/ARR072P) SRCFILE(REPLIB/QDDSSRC) +
                          PAGESIZE(66 198) CPI(15)
             CRTPRTF    FILE(REPLIB/ARR077P) SRCFILE(REPLIB/QDDSSRC) +
                          CPI(13.3)
             CRTPRTF    FILE(REPLIB/IMR044P) SRCFILE(REPLIB/QDDSSRC) +
                          PAGESIZE(42 198) CPI(15) OVRFLW(42)
             CRTPRTF    FILE(REPLIB/IMR045P) SRCFILE(REPLIB/QDDSSRC) +
                          PAGESIZE(42 198) CPI(15) OVRFLW(42)
             CRTPRTF    FILE(REPLIB/JLB0213P) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)
 /* RPG */
             CPYSRCF    FROMFILE(DUTYLIB/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(*ALL)

             RNMOBJ     OBJ(REPLIB/SOA0234) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA0234)
             RNMOBJ     OBJ(REPLIB/ARA0041) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0041)
             RNMOBJ     OBJ(REPLIB/ARA0042) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0042)
             RNMOBJ     OBJ(REPLIB/ARA007) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA007)
             RNMOBJ     OBJ(REPLIB/ARA008) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA008)
             RNMOBJ     OBJ(REPLIB/ARA0081) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0081)
             RNMOBJ     OBJ(REPLIB/ARA0082) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0082)
             RNMOBJ     OBJ(REPLIB/ARA0083) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0083)
             RNMOBJ     OBJ(REPLIB/ARA0084) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0084)
             RNMOBJ     OBJ(REPLIB/ARA0085) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0085)
             RNMOBJ     OBJ(REPLIB/ARA0091) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0091)
             RNMOBJ     OBJ(REPLIB/ARA0101) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0101)
             RNMOBJ     OBJ(REPLIB/ARA0102) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0102)
             RNMOBJ     OBJ(REPLIB/ARA0131) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0131)
             RNMOBJ     OBJ(REPLIB/ARA0151) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0151)
             RNMOBJ     OBJ(REPLIB/ARA0152) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0152)
             RNMOBJ     OBJ(REPLIB/ARA016) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA016)
             RNMOBJ     OBJ(REPLIB/ARA0161) OBJTYPE(*PGM) +
                        NEWOBJ(BKARA0161)
             RNMOBJ     OBJ(REPLIB/ARB001) OBJTYPE(*PGM) +
                        NEWOBJ(BKARB001)
             RNMOBJ     OBJ(REPLIB/ARI021) OBJTYPE(*PGM) +
                        NEWOBJ(BKARI021)
             RNMOBJ     OBJ(REPLIB/ARI024) OBJTYPE(*PGM) +
                        NEWOBJ(BKARI024)
             RNMOBJ     OBJ(REPLIB/ARI0241) OBJTYPE(*PGM) +
                        NEWOBJ(BKARI0241)
             RNMOBJ     OBJ(REPLIB/ARI025) OBJTYPE(*PGM) +
                        NEWOBJ(BKARI025)
             RNMOBJ     OBJ(REPLIB/ARI029) OBJTYPE(*PGM) +
                        NEWOBJ(BKARI029)
             RNMOBJ     OBJ(REPLIB/ARR0411) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0411)
             RNMOBJ     OBJ(REPLIB/ARR0471) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0471)
             RNMOBJ     OBJ(REPLIB/ARR0472) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0472)
             RNMOBJ     OBJ(REPLIB/ARR0481) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0481)
             RNMOBJ     OBJ(REPLIB/ARR0482) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0482)
             RNMOBJ     OBJ(REPLIB/ARR0501) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0501)
             RNMOBJ     OBJ(REPLIB/ARR0512) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0512)
             RNMOBJ     OBJ(REPLIB/ARR0571) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0571)
             RNMOBJ     OBJ(REPLIB/ARR0572) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0572)
             RNMOBJ     OBJ(REPLIB/ARR060) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR060)
             RNMOBJ     OBJ(REPLIB/ARR0601) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0601)
             RNMOBJ     OBJ(REPLIB/ARR0602) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0602)
             RNMOBJ     OBJ(REPLIB/ARR0611) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0611)
             RNMOBJ     OBJ(REPLIB/ARR0612) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0612)
             RNMOBJ     OBJ(REPLIB/ARR0621) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0621)
             RNMOBJ     OBJ(REPLIB/ARR0641) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0641)
             RNMOBJ     OBJ(REPLIB/ARR0671) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0671)
             RNMOBJ     OBJ(REPLIB/ARR0672) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0672)
             RNMOBJ     OBJ(REPLIB/ARR0721) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0721)
             RNMOBJ     OBJ(REPLIB/ARR074) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR074)
             RNMOBJ     OBJ(REPLIB/ARR0741) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0741)
             RNMOBJ     OBJ(REPLIB/ARR0742) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0742)
             RNMOBJ     OBJ(REPLIB/ARR0771) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR0771)
             RNMOBJ     OBJ(REPLIB/ARR08012) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR08012)
             RNMOBJ     OBJ(REPLIB/ARR08212) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR08212)
             RNMOBJ     OBJ(REPLIB/ARR09012) OBJTYPE(*PGM) +
                        NEWOBJ(BKARR09012)
             RNMOBJ     OBJ(REPLIB/DPA002) OBJTYPE(*PGM) +
                        NEWOBJ(BKDPA002)
             RNMOBJ     OBJ(REPLIB/IMA001) OBJTYPE(*PGM) +
                        NEWOBJ(BKIMA001)
             RNMOBJ     OBJ(REPLIB/IMR0441) OBJTYPE(*PGM) +
                        NEWOBJ(BKIMR0441)
             RNMOBJ     OBJ(REPLIB/IMR045) OBJTYPE(*PGM) +
                        NEWOBJ(BKIMR045)
             RNMOBJ     OBJ(REPLIB/IMR0451) OBJTYPE(*PGM) +
                        NEWOBJ(BKIMR0451)
             RNMOBJ     OBJ(REPLIB/JLB0112) OBJTYPE(*PGM) +
                        NEWOBJ(BKJLB0112)
             RNMOBJ     OBJ(REPLIB/JLB0212) OBJTYPE(*PGM) +
                        NEWOBJ(BKJLB0212)
             RNMOBJ     OBJ(REPLIB/JLB0213) OBJTYPE(*PGM) +
                        NEWOBJ(BKJLB0213)
             RNMOBJ     OBJ(REPLIB/JLB0215) OBJTYPE(*PGM) +
                        NEWOBJ(BKJLB0215)
             RNMOBJ     OBJ(REPLIB/JLB0312) OBJTYPE(*PGM) +
                        NEWOBJ(BKJLB0312)
             RNMOBJ     OBJ(REPLIB/JLB0432) OBJTYPE(*PGM) +
                        NEWOBJ(BKJLB0432)
             RNMOBJ     OBJ(REPLIB/JLB0512) OBJTYPE(*PGM) +
                        NEWOBJ(BKJLB0512)
             RNMOBJ     OBJ(REPLIB/MTA001) OBJTYPE(*PGM) +
                        NEWOBJ(BKMTA001)
             RNMOBJ     OBJ(REPLIB/MTB0031) OBJTYPE(*PGM) +
                        NEWOBJ(BKMTB0031)
             RNMOBJ     OBJ(REPLIB/SAR0661) OBJTYPE(*PGM) +
                        NEWOBJ(BKSAR0661)
             RNMOBJ     OBJ(REPLIB/SOA003) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA003)
             RNMOBJ     OBJ(REPLIB/SOA004) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA004)
             RNMOBJ     OBJ(REPLIB/SOA005) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA005)
             RNMOBJ     OBJ(REPLIB/SOA0061) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA0061)
             RNMOBJ     OBJ(REPLIB/SOA0081) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA0081)
             RNMOBJ     OBJ(REPLIB/SOA0101) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA0101)
             RNMOBJ     OBJ(REPLIB/SOA027) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA027)
             RNMOBJ     OBJ(REPLIB/SOA028) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA028)
             RNMOBJ     OBJ(REPLIB/SOA030) OBJTYPE(*PGM) +
                        NEWOBJ(BKSOA030)
             RNMOBJ     OBJ(REPLIB/WDS023) OBJTYPE(*PGM) +
                        NEWOBJ(BKWDS023)
             CRTRPGPGM  PGM(REPLIB/SOA0234) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0041) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0042) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA007) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA008) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0081) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0082) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0083) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0084) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0085) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0091) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0101) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0102) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0131) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0151) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0152) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA016) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARA0161) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARB001) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARI021) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARI024) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARI0241) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARI025) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARI029) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0411) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0471) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0472) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0481) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0482) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0501) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0512) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0571) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0572) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR060) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0601) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0602) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0611) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0612) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0621) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0641) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0671) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0672) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0721) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR074) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0741) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0742) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR0771) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR08012) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR08212) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/ARR09012) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/DPA002) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/IMA001) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/IMR0441) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/IMR045) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/IMR0451) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/JLB0112) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/JLB0212) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/JLB0213) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/JLB0215) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/JLB0312) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/JLB0432) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/JLB0512) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/MTA001) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/MTB0031) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SAR0661) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SOA003) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SOA004) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SOA005) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SOA0061) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SOA0081) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SOA0101) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SOA027) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SOA028) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/SOA030) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/WDS023) SRCFILE(REPLIB/QRPGSRC)
 /* CLP */
             CPYSRCF    FROMFILE(DUTYLIB/QCLSRC) +
                          TOFILE(REPLIB/QCLSRC) FROMMBR(*ALL)
             RNMOBJ     OBJ(REPLIB/JLB021C) OBJTYPE(*PGM) +
                        NEWOBJ(BKJLB021C)
             RNMOBJ     OBJ(REPLIB/JLB021C1) OBJTYPE(*PGM) +
                        NEWOBJ(BKJLB021C1)
             CRTCLPGM   PGM(REPLIB/JLB021C) SRCFILE(REPLIB/QCLSRC)
             CRTCLPGM   PGM(REPLIB/JLB021C1) SRCFILE(REPLIB/QCLSRC)

             CPYF       FROMFILE(REFLIB/ARAFPF@) +
                          TOFILE(REFLIB/ARAFPF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             CPYF       FROMFILE(REFLIB/ARAGPF@) +
                          TOFILE(REFLIB/ARAGPF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
             CPYF       FROMFILE(REFLIB/SOSSPF@) +
                          TOFILE(REFLIB/SOSSPF) MBROPT(*REPLACE) +
                          FMTOPT(*MAP *DROP)
  ENDPGM:    ENDPGM

