 /* 掛上正式環境*/
 /*                           */
    PGM
             DCL      VAR(&JOBTYPE) TYPE(*CHAR) LEN(1)

             RTVJOBA  TYPE(&JOBTYPE)
             IF       COND(&JOBTYPE = '0') THEN(GOTO BATCH)

  SBMJOB     CMD(CALL PGM(UPDPGM2)) JOB(UPDPGM) LOG(4 00 *MSG)
             SNDPGMMSG MSG('YOUR PROGRAM ALREADY BE SUBMITED....')
             GOTO     ENDPGM

  BATCH:
             RNMOBJ     OBJ(REFLIB/SOVQPF) OBJTYPE(*FILE) +
                          NEWOBJ(SOVQPF@)
             MONMSG CPF0000
             DLTF       FILE(REFLIB/SOVQLF*)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOVQPF)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOVQLF01)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOVQLF02)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOVQLF03)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(ARAFLF2)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(ARAGLF05)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(RERF)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(REWFD2)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(REWFD3)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(REWFD4)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(REWFD5)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(REWFD6)
             CRTPF      FILE(REFLIB/RERF  ) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/SOVQPF) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CPYF       FROMFILE(REFLIB/SOVQPF@) TOFILE(SOVQPF) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             CRTLF      FILE(REFLIB/SOVQLF01) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOVQLF02) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOVQLF03) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAFLF2)  SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAGLF05) SRCFILE(REFLIB/QDDSSRC)
             CRTPF      FILE(REFLIB/REWFD2) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/REWFD3) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/REWFD4) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/REWFD5) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CRTPF      FILE(REFLIB/REWFD6) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)

             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR010D) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR020D) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR030D) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR040D) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR010P1) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR010P2) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR020P1) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR020P2) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR040P1) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR040P2) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTR030P1) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(VTM000D) +
                          MBROPT(*REPLACE)

             CRTDSPF    FILE(REPLIB/VTM000D) SRCFILE(REPLIB/QDDSSRC) +
                          REPLACE(*YES)
             CRTDSPF    FILE(REPLIB/VTR010D) SRCFILE(REPLIB/QDDSSRC) +
                          REPLACE(*YES)
             CRTDSPF    FILE(REPLIB/VTR020D) SRCFILE(REPLIB/QDDSSRC) +
                          REPLACE(*YES)
             CRTDSPF    FILE(REPLIB/VTR030D) SRCFILE(REPLIB/QDDSSRC) +
                          REPLACE(*YES)
             CRTDSPF    FILE(REPLIB/VTR040D) SRCFILE(REPLIB/QDDSSRC) +
                          REPLACE(*YES)
             CRTPRTF    FILE(REPLIB/VTR010P1) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)
             CRTPRTF    FILE(REPLIB/VTR010P2) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)
             CRTPRTF    FILE(REPLIB/VTR020P1) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)
             CRTPRTF    FILE(REPLIB/VTR020P2) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)
             CRTPRTF    FILE(REPLIB/VTR040P1) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)
             CRTPRTF    FILE(REPLIB/VTR040P2) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)
             CRTPRTF    FILE(REPLIB/VTR030P1) +
                          SRCFILE(REPLIB/QDDSSRC) PAGESIZE(66 198) +
                          CPI(15)

 /* RPG */
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTA0021)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTA0022)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTA0023)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTA0024)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTA0025)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTA0111)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTA0171)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTA021 )
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTA022)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR000)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR010)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0101)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0102)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0103)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0104)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0105)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR020)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0201)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0202)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0203)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0204)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0205)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR040)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0401)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0402)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0403)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0404)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0405)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR030)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0301)
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(VTR0304)

             CRTRPGPGM  PGM(REPLIB/VTA0021) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTA0022) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTA0023) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTA0024) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTA0025) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTA0111) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTA0171) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTA021 ) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTA022 ) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR000 ) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR010 ) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0101) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0102) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0103) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0104) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0105) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR020 ) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0201) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0202) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0203) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0204) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0205) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR040 ) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0401) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0402) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0403) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0404) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0105) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR030 ) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0301) SRCFILE(REPLIB/QRPGSRC)
             CRTRPGPGM  PGM(REPLIB/VTR0304) SRCFILE(REPLIB/QRPGSRC)
  ENDPGM:
             ENDPGM

