 /* 掛上正式環境*/
 /*                           */
    PGM
             DCL      VAR(&JOBTYPE) TYPE(*CHAR) LEN(1)

             RTVJOBA  TYPE(&JOBTYPE)
             CHGJOB     CCSID(65535)
             IF       COND(&JOBTYPE = '0') THEN(GOTO BATCH)

  SBMJOB     CMD(CALL PGM(UPDPGM)) JOB(UPDPGM) LOG(4 00 *MSG)
             SNDPGMMSG MSG('YOUR PROGRAM ALREADY BE SUBMITED....')
             GOTO     ENDPGM

  BATCH:
             RNMOBJ     OBJ(REFLIB/SOSGPF) OBJTYPE(*FILE) +
                          NEWOBJ(SOSGPF@)
             MONMSG CPF0000
             DLTF       FILE(REFLIB/SOSGLF*)
             MONMSG CPF0000
             DLTF       FILE(REFLIB/SOSGJF*)
             MONMSG CPF0000
             DLTF       FILE(BRIOLIBPP/SOSGLF*)
             MONMSG CPF0000
             DLTF       FILE(REFLIB/ARAHLF)
             MONMSG CPF0000
             DLTF       FILE(REFLIB/IMISLF)
             MONMSG CPF0000
             DLTF       FILE(REFLIB/IMISLF99)
             MONMSG CPF0000
             DLTF       FILE(REFLIB/SOSGPF)
             MONMSG CPF0000

             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REFLIB/QDDSSRC) FROMMBR(SOSGPF)
             CRTPF      FILE(REFLIB/SOSGPF) SRCFILE(REFLIB/QDDSSRC) +
                          SIZE(*NOMAX)
             CPYF       FROMFILE(REFLIB/SOSGPF@) TOFILE(SOSGPF) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             CRTLF      FILE(BRIOLIBPP/SOSGLF91) +
                        SRCFILE(BRIOLIBPP/QDDSSRC)
             CRTLF      FILE(BRIOLIBPP/SOSGLF92) +
                        SRCFILE(BRIOLIBPP/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSGJF01) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSGLF) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSGLF01) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSGLF03) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSGLF05) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSGLF07) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSGLF1 ) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSGLF2 ) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/SOSGLF3 ) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/ARAHLF  ) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/IMISLF  ) SRCFILE(REFLIB/QDDSSRC)
             CRTLF      FILE(REFLIB/IMISLF99) SRCFILE(REFLIB/QDDSSRC)

             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(SOA003D) +
                          MBROPT(*REPLACE)
             CPYSRCF    FROMFILE(MICHELLE/QDDSSRC) +
                          TOFILE(REPLIB/QDDSSRC) FROMMBR(SOA005D) +
                          MBROPT(*REPLACE)

             CRTDSPF    FILE(REPLIB/SOA003D) SRCFILE(REPLIB/QDDSSRC) +
                          REPLACE(*YES)
             CRTDSPF    FILE(REPLIB/SOA005D) SRCFILE(REPLIB/QDDSSRC) +
                          REPLACE(*YES)
 /* RPG */
             CPYSRCF    FROMFILE(MICHELLE/QRPGSRC) +
                          TOFILE(REPLIB/QRPGSRC) FROMMBR(SOA005)

             CRTRPGPGM  PGM(REPLIB/SOA003) SRCFILE(REPLIB/QDDSSRC)
  ENDPGM:
             CHGJOB     CCSID(937)
             ENDPGM

