 /* 掛上正式環境*/
 /*                           */
    PGM
             DCL      VAR(&JOBTYPE) TYPE(*CHAR) LEN(1)

             RTVJOBA  TYPE(&JOBTYPE)
             IF       COND(&JOBTYPE = '0') THEN(GOTO BATCH)

  SBMJOB     CMD(CALL PGM(UPDSJ0C)) JOB(UPDSJ0C) LOG(4 00 *MSG)
             SNDPGMMSG MSG('YOUR PROGRAM ALREADY BE SUBMITED....')
             GOTO     ENDPGM

  BATCH:
             CLRPFM     FILE(WRK001)
             CALL       PGM(UPDSJ0)
             CALL       PGM(UPDSJ02)
  ENDPGM:
             ENDPGM

