             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DVP91)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&YMD8S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YMD8E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATE)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&$USER) TYPE(*CHAR) LEN(10)

 START:      CALL       PGM(VTA002) PARM(&IN03 &IN14 &IN98 )
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 300)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&$USER) VALUE(%SST(*LDA 101 10))
             CHGVAR     VAR(&DVP91) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DATE) VALUE(%SST(*LDA 201 8))
             CHGVAR     VAR(&YMD8S) VALUE(%SST(*LDA 800 8))
             CHGVAR     VAR(&YMD8E) VALUE(%SST(*LDA 810 8))

             OVRDBF     FILE(SOSIPF) SHARE(*YES)
             IF         (&DVP91='W') THEN(DO)
             OPNQRYF    FILE((SOSIPF)) OPTION(*ALL) QRYSLT(' SI21 +
                          *EQ %RANGE(' *CAT &YMD8S *CAT ' ' *CAT +
                          &YMD8E *CAT ') & (SI08  *EQ "A0002" )')   +
                     KEYFLD(*FILE) +
                     MAPFLD((SI01R '%SST(SI01 2 1)' *CHAR 1))

               /*         & SI01R *NE "3" +
                     & SI22  *EQ "D"') KEYFLD(*FILE) +
                     MAPFLD((SI01R '%SST(SI01 2 1)' *CHAR 1))  */

             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OPNQRYF    FILE((SOSGPF)) OPTION(*ALL) QRYSLT(' SG26 +
                          *EQ %RANGE(' *CAT &YMD8S *CAT ' ' *CAT +
                          &YMD8E *CAT ') & (SG04  *EQ "A0002" )     +
                          & SG14 *NE "*" +
                     ') KEYFLD(*FILE) +
                     MAPFLD((SG01R '%SST(SG01 2 1)' *CHAR 1))

            /*            & SG01R *NE "3" & SG14 *NE "*" +
                     ') KEYFLD(*FILE) +
                     MAPFLD((SG01R '%SST(SG01 2 1)' *CHAR 1))  */

             OVRDBF     FILE(ARAGPF) SHARE(*YES)
             OPNQRYF    FILE((ARAGPF)) OPTION(*ALL) QRYSLT(' AG11 +
                          *EQ %RANGE(' *CAT &YMD8S *CAT ' ' *CAT +
                          &YMD8E *CAT ') & (AG09  *EQ "A0002" ) ')  +
                          KEYFLD(*FILE)  +
                     MAPFLD((AG01R '%SST(AG01 2 1)' *CHAR 1))

              /*          & AG01R *NE "3" +
                     ') KEYFLD(*FILE) +
                     MAPFLD((AG01R '%SST(AG01 2 1)' *CHAR 1))   */

             OVRDBF     FILE(ARAFPF) SHARE(*YES)
             OPNQRYF    FILE((ARAFPF)) OPTION(*ALL) QRYSLT(' AF05 +
                          *EQ %RANGE(' *CAT &YMD8S *CAT ' ' *CAT +
                          &YMD8E *CAT ') & (AF03  *EQ "A0002" )     +
                     ') KEYFLD(*FILE) +
                     MAPFLD((AF01R '%SST(AF01 2 1)' *CHAR 1))

           /*             & AF01R *NE "3" +
                     ') KEYFLD(*FILE) +
                     MAPFLD((AF01R '%SST(AF01 2 1)' *CHAR 1))  */

             OVRDBF     FILE(RVRFPF) SHARE(*YES)
             CALL       PGM(VTA0021)
             CALL       PGM(VTA0025)  /* M001M改用VTA0025 */
             CALL       PGM(VTA0023)
             CALL       PGM(VTA0024)

             CLOF       OPNID(SOSIPF)
             CLOF       OPNID(SOSGPF)
             CLOF       OPNID(ARAGPF)
             CLOF       OPNID(ARAFPF)

             ENDDO

 /* M001M KN進項發票，應以確認日期為進貨日期，故以SI35修正之。*/

             IF         (&DVP91='K') THEN(DO)
             OPNQRYF    FILE((SOSIPF)) OPTION(*ALL) QRYSLT(' SI35 +
                          *EQ %RANGE(' *CAT &YMD8S *CAT ' ' *CAT +
                          &YMD8E *CAT ') & (SI08  *EQ "B0000" )     +
                          & SI18=" " +
                     & SI22  *EQ "D"') KEYFLD(*FILE)

             OVRDBF     FILE(SOSGPF) SHARE(*YES)
             OPNQRYF    FILE((SOSGPF)) OPTION(*ALL) QRYSLT(' SG26 +
                          *EQ %RANGE(' *CAT &YMD8S *CAT ' ' *CAT +
                          &YMD8E *CAT ') & (SG04  *EQ "B0000" )     +
                           & SG14 *NE "*" & SG01L *NE "K"') +
                     KEYFLD(*FILE) MAPFLD((SG01L '%SST(SG01 1 1)' +
                     *CHAR 1))

             OVRDBF     FILE(ARAGPF) SHARE(*YES)
             OPNQRYF    FILE((ARAGPF)) OPTION(*ALL) QRYSLT(' AG11 +
                          *EQ %RANGE(' *CAT &YMD8S *CAT ' ' *CAT +
                          &YMD8E *CAT ') & (AG09  *EQ "B0000" )     +
                     ') KEYFLD(*FILE)

             OVRDBF     FILE(RVRFPF) SHARE(*YES)

             CALL       PGM(VTA0021)
             CALL       PGM(VTA0025)  /* M002M */
             CALL       PGM(VTA0024)
             CLOF       OPNID(SOSIPF)
             CLOF       OPNID(SOSGPF)
             CLOF       OPNID(ARAGPF)

             ENDDO

             IF         (&DVP91='R' *OR &DVP91='S') THEN(DO)
             OVRDBF     FILE(RVRFPF) SHARE(*YES)
             CALL       PGM(VTA0024)
             ENDDO

             CHGVAR     VAR(&IN98)  VALUE('1')

             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
