             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DVP91)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&CMPS )  TYPE(*CHAR) LEN(2)
             DCL        VAR(&CMPE )  TYPE(*CHAR) LEN(2)
             DCL        VAR(&YMD8S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YMD8E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATE)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&$USER) TYPE(*CHAR) LEN(10)

 START:      CALL       PGM(VTA011) PARM(&IN03 &IN14 &IN98 )
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 300)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)
             CHGVAR     VAR(&$USER) VALUE(%SST(*LDA 101 10))
             CHGVAR     VAR(&DVP91) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&CMPS)  VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&CMPE)  VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DATE) VALUE(%SST(*LDA 201 8))
             CHGVAR     VAR(&YMD8S) VALUE(%SST(*LDA 800 8))
             CHGVAR     VAR(&YMD8E) VALUE(%SST(*LDA 810 8))

             OVRDBF     FILE(SOSIPF) SHARE(*YES)
             OPNQRYF    FILE((SOSIPF)) QRYSLT(' SI01 *EQ %RANGE("'  +
                          *CAT &CMPS  *CAT '" "' *CAT &CMPE *CAT '")  +
                          & SI21 *EQ %RANGE(' +
                          *CAT &YMD8S *CAT ' ' *CAT &YMD8E *CAT +
                          ') &  +
                          (SI16="N") & (SI18 *NE "*")   +
                          & PSI02 *NE "**"  ') KEYFLD(*FILE) +
                          MAPFLD((SI01R '%SST(SI01 2 1)' *CHAR 1) +
                          (PSI02 '%SST(SI02 1 2)' *CHAR 2))

             CALL       PGM(VTA0111)
             CLOF       OPNID(SOSIPF)
             CHGVAR     VAR(&IN98)  VALUE('1')
             DLTOVR     FILE(*ALL)

             ENDDO

             GOTO       START
             ENDPGM
