             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&DVP91)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&CMPS )  TYPE(*CHAR) LEN(2)
             DCL        VAR(&CMPE )  TYPE(*CHAR) LEN(2)
             DCL        VAR(&YMD8S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&YMD8E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATE)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&$USER) TYPE(*CHAR) LEN(10)

 START:      CALL       PGM(VTA021) PARM(&IN03 &IN98 )
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 300)) VALUE(' ')
             RETURN
             ENDDO

              CALL       PGM(VTA021C1)
              CHGVAR     VAR(&IN98)  VALUE('1')

             GOTO       START
             ENDPGM
