     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    AUTHOR       : A1650  DEREK                              */
     /*    CREATE DATE  : 2012/06/29                                */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : VTB004C                                   */
     /*    SYSTEM       :進銷存                                   */
     /*    SUBSYSTEM    :媒體申報                                 */
     /*    REMARK       :銷項資料人工輸入轉檔                     */
     /***************************************************************/
             PGM

             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL)  LEN(1)

 START:      CALL       PGM(VTB004) PARM(&IN03 &IN98 )
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 601 300)) VALUE(' ')
             RETURN
             ENDDO

              CLRPFM     FILE(WFSOVR)
              MONMSG     MSGID(CPF0000)

              CALL       PGM(VTB004C1)
              CHGVAR     VAR(&IN98)  VALUE('1')

             GOTO       START
             ENDPGM
