/********************************************************************/
/*                                                                  */
/* 5738SS1 V2R1M0 910524     RTVCLSRC Output     03/19/93 09:48:49  */
/*                                                                  */
/* Program name . . . . . . . . . . . . . . :   VTM000C           PN*/
/* Library name . . . . . . . . . . . . . . :   REPLIB            PL*/
/* Original source file . . . . . . . . . . :   QCLSRC            SN*/
/* Library name . . . . . . . . . . . . . . :   REPLIB            SL*/
/* Original source member . . . . . . . . . :                     SM*/
/* Source file change                                               */
/*   date/time  . . . . . . . . . . . . . . :                     SC*/
/* Patch option . . . . . . . . . . . . . . :   *NOPATCH          PO*/
/* User profile . . . . . . . . . . . . . . :   *USER             UP*/
/* Text . . . : 媒體申報主畫面                             A1034TX*/
/* Owner  . . . . . . . . . . . . . . . . . :   MICHELLE          OW*/
/* Patch change ID  . . . . . . . . . . . . :                     PC*/
/* Patch APAR ID  . . . . . . . . . . . . . :                     PA*/
/* User mod flag  . . . . . . . . . . . . . :   *YES              UM*/
/*                                                                ED*/
/********************************************************************/
     PGM
     DCL VAR(&WDATE) TYPE(*CHAR) LEN(6)
     DCL VAR(&$USER) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0101I) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0102I) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0101O) TYPE(*CHAR) LEN(1)
     DCLF FILE(*LIBL/VTM000D) RCDFMT(DSPC1)
     RTVDTAARA DTAARA(*LDA (101 10)) RTNVAR(&$USER)
     RTVDTAARA DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
     CHGVAR VAR(&$EGMDY) VALUE(&WDATE)
     CHGVAR VAR(&S0101I) VALUE(&$USER)
START:
     SNDRCVF DEV(*FILE) RCDFMT(DSPC1)
     CHGVAR VAR(&IN98) VALUE('0')
     IF COND(&IN03 *EQ '1') THEN(RETURN)
     IF COND(&DOPID *EQ '01') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTM001C')
     ENDDO
     IF COND(&DOPID *EQ '02') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTA002C')
     ENDDO
     IF COND(&DOPID *EQ '04') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTA003')
     ENDDO
     IF COND(&DOPID *EQ '03') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTA004')
     ENDDO
     IF COND(&DOPID *EQ '07') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTA017C')
     ENDDO
     IF COND(&DOPID *EQ '10') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTI001')
     ENDDO
     IF COND(&DOPID *EQ '41') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTR010C')
     ENDDO
     IF COND(&DOPID *EQ '42') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTR020C')
     ENDDO
     IF COND(&DOPID *EQ '43') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTR030C')
     ENDDO
     IF COND(&DOPID *EQ '44') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTR040C')
     ENDDO
     IF COND(&DOPID *EQ '45') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VTR050C')
     ENDDO
     IF COND(&DOPID *EQ '  ') THEN(GOTO CMDLBL(START))
     GOTO CMDLBL(CHKAUT)
CHKAUT: +
     CALL PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
     IF COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
     ELSE CMD(CHGVAR VAR(&IN98) VALUE('1'))
     GOTO CMDLBL(START)
     ENDPGM
