             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DVR91)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DVR92S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DVR92E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DVR96S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DVR96E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMD6S)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&YMD6E)  TYPE(*CHAR) LEN(6)

             CPYF       FROMFILE(REWFD2) TOFILE(QTEMP/REWFD2) +
                          CRTFILE(*YES)
             MONMSG     MSGID(CPF2817) EXEC(CLRPFM FILE(QTEMP/REWFD2))
             OVRDBF     FILE(REWFD2) TOFILE(QTEMP/REWFD2) SHARE(*YES)

             OVRPRTF    FILE(VTR003P) PAGESIZE(*N 132) CPI(12) +
                        USRDTA('進項人工')
             CHGVAR     VAR(&DVR91)  VALUE(%SST(*LDA 600 1))
             CHGVAR     VAR(&DVR92S) VALUE(%SST(*LDA 601 1))
             CHGVAR     VAR(&DVR92E) VALUE(%SST(*LDA 602 1))
             CHGVAR     VAR(&DVR96S) VALUE(%SST(*LDA 603 6))
             CHGVAR     VAR(&DVR96E) VALUE(%SST(*LDA 610 6))
             CHGVAR     VAR(&YMD6S)  VALUE(%SST(*LDA 630 6))
             CHGVAR     VAR(&YMD6E)  VALUE(%SST(*LDA 640 6))

             OVRDBF     FILE(SOVRPF) SHARE(*YES)
             OPNQRYF    FILE((SOVRPF)) QRYSLT('VR91L *EQ &DVR91  +
                           & VR92 *EQ %RANGE("' +
                          *CAT &DVR92S *CAT '" "' *CAT &DVR92E *CAT +
                          '") & CVR04 *EQ %RANGE("' *CAT &YMD6S +
                          *CAT '" "' *CAT &YMD6E *CAT '") & VR96 +
                          *EQ %RANGE("' *CAT &DVR96S *CAT '" "' +
                          *CAT &DVR96E *CAT '") ') +
                          KEYFLD(*FILE) MAPFLD((CVR04 VR04 *CHAR 6) +
                          (VR91L '%SST(VR91 1 1)' *CHAR 1))
             CALL       VTR0031
             CALL       VTR0032

             CLOF       OPNID(SOVRPF)
             DLTOVR     FILE(*ALL)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('VTR003P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
