     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : ANDY                                      */
     /*    CREATE DATE  : 81/07/09                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : WDS020C                                   */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :                                           */
     /*    REMARK       :送貨單號查詢                             */
     /***************************************************************/
             PGM      PARM(&DSE01 &DSE02 &WSE06 &DSE07)

             DCL        VAR(&DSE01) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DSE02) TYPE(*CHAR) LEN(12)
             DCL        VAR(&DSE07) TYPE(*CHAR) LEN(5)
   /*        DCL        VAR(&WSE06) TYPE(*CHAR) LEN(6) */
             DCL        VAR(&WSE06) TYPE(*CHAR) LEN(8)  /* M001M */
             DCL        VAR(&XSE06) TYPE(*CHAR) LEN(8)

             OVRDBF     FILE(SOSEPF) SHARE(*YES)

             OPNQRYF    FILE((SOSEPF)) QRYSLT(' SE01 *EQ "' *CAT +
                          &DSE01 *CAT '" *AND  SE06 *EQ ' *CAT +
                          &WSE06 *CAT '  *AND  SE07 *EQ "' *CAT +
                          &DSE07 *CAT '" *AND  SE36 *NE "T" ') +
                          KEYFLD((SE02) (SE10) (SE11))

             CALL       WDS020    PARM(&DSE02 &DSE01 &DSE07 &WSE06)

             CLOF       OPNID(SOSEPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
