     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/13                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : WOR100C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :主檔                                     */
     /*    REMARK       :客戶清冊                                 */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DWE01S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DWE01E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DWE07S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE07E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE08S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DWE08E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DWE10S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE10E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE11S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DWE11E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DWE18S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DWE18E) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DWE01S) VALUE(%SST(*LDA 601 5))
             CHGVAR     VAR(&DWE01E) VALUE(%SST(*LDA 606 5))
             CHGVAR     VAR(&DWE07S) VALUE(%SST(*LDA 611 1))
             CHGVAR     VAR(&DWE07E) VALUE(%SST(*LDA 612 1))
             CHGVAR     VAR(&DWE08S) VALUE(%SST(*LDA 629 2))
             CHGVAR     VAR(&DWE08E) VALUE(%SST(*LDA 631 2))
             CHGVAR     VAR(&DWE10S) VALUE(%SST(*LDA 613 1))
             CHGVAR     VAR(&DWE10E) VALUE(%SST(*LDA 615 1))
             CHGVAR     VAR(&DWE11S) VALUE(%SST(*LDA 633 2))
             CHGVAR     VAR(&DWE11E) VALUE(%SST(*LDA 635 2))
             CHGVAR     VAR(&DWE18S) VALUE(%SST(*LDA 617 6))
             CHGVAR     VAR(&DWE18E) VALUE(%SST(*LDA 623 6))

             OVRPRTF    FILE(WOR100P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客戶清冊')
             OVRDBF     FILE(WOWEPF) SHARE(*YES)



             OPNQRYF    FILE((WOWEPF)) QRYSLT(' WE01 *EQ %RANGE("' +
                          *CAT &DWE01S *CAT '" "' *CAT &DWE01E *CAT +
                          '") &  WE07  *EQ %RANGE("' *CAT &DWE07S +
                          *CAT '" "' *CAT &DWE07E *CAT '") & WE08  +
                          *EQ %RANGE("' *CAT &DWE08S *CAT '" "' +
                          *CAT &DWE08E *CAT '") & WE18 *EQ +
                          %RANGE("' *CAT &DWE18S *CAT '" "' *CAT +
                          &DWE18E *CAT '") & WE10 *EQ %RANGE("' +
                          *CAT &DWE10S *CAT '" "' *CAT &DWE10E *CAT +
                          '") & WE11  *EQ %RANGE("' *CAT &DWE11S +
                          *CAT '" "' *CAT &DWE11E *CAT '")') +
                          KEYFLD((WE07) (WE01))
             CALL       WOR1001

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('WOR100P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             CLOF       OPNID(WOWEPF)
             DLTOVR     FILE(WOWEPF)
             DLTOVR     FILE(WOR100P)

             ENDPGM
