     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1139  JANE                               */
     /*    CREATE DATE  : 81/02/13                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : WOR100C1                                  */
     /*    SYSTEM       :人頭馬匯東                               */
     /*    SUBSYSTEM    :主檔                                     */
     /*    REMARK       :客戶清冊                                 */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DWE1S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE1E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE2S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE2E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE3S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE3E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE4S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE4E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE5S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE5E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE6S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE6E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE07S) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE07E) TYPE(*CHAR) LEN(1)
             DCL        VAR(&DWE15S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DWE15E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DWE18S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DWE18E) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DWE07S) VALUE(%SST(*LDA 611 1))
             CHGVAR     VAR(&DWE07E) VALUE(%SST(*LDA 612 1))
             CHGVAR     VAR(&DWE15S) VALUE(%SST(*LDA 613 2))
             CHGVAR     VAR(&DWE15E) VALUE(%SST(*LDA 615 2))
             CHGVAR     VAR(&DWE18S) VALUE(%SST(*LDA 617 6))
             CHGVAR     VAR(&DWE18E) VALUE(%SST(*LDA 623 6))
             CHGVAR     VAR(&DWE1S)  VALUE(%SST(*LDA 629 1))
             CHGVAR     VAR(&DWE1E)  VALUE(%SST(*LDA 630 1))
             CHGVAR     VAR(&DWE2S)  VALUE(%SST(*LDA 631 1))
             CHGVAR     VAR(&DWE2E)  VALUE(%SST(*LDA 632 1))
             CHGVAR     VAR(&DWE3S)  VALUE(%SST(*LDA 633 1))
             CHGVAR     VAR(&DWE3E)  VALUE(%SST(*LDA 634 1))
             CHGVAR     VAR(&DWE4S)  VALUE(%SST(*LDA 635 1))
             CHGVAR     VAR(&DWE4E)  VALUE(%SST(*LDA 636 1))
             CHGVAR     VAR(&DWE5S)  VALUE(%SST(*LDA 637 1))
             CHGVAR     VAR(&DWE5E)  VALUE(%SST(*LDA 638 1))
             CHGVAR     VAR(&DWE6S)  VALUE(%SST(*LDA 639 1))
             CHGVAR     VAR(&DWE6E)  VALUE(%SST(*LDA 640 1))

             OVRPRTF    FILE(WOR120P) PAGESIZE(*N 198) CPI(15) +
                        USRDTA('客戶清冊')
             OVRDBF     FILE(REWF181) TOFILE(WOWEPF) SHARE(*YES)

             OPNQRYF    FILE((WOWEPF) (WOWFPF)) FORMAT(*LIBL/REWF181 +
                          *ONLY) QRYSLT('WE07 *EQ %RANGE("' *CAT +
                          &DWE07S *CAT '" "' *CAT &DWE07E *CAT '") +
                          & WF08A *EQ %RANGE("' *CAT &DWE1S *CAT '" +
                          "' *CAT &DWE1E *CAT '") & WF08B *EQ +
                          %RANGE("' *CAT &DWE2S *CAT '" "' *CAT +
                          &DWE2E *CAT '") & WF08C *EQ %RANGE("' +
                          *CAT &DWE3S *CAT '" "' *CAT &DWE3E *CAT +
                          '") & WF08D *EQ %RANGE("' *CAT &DWE4S +
                          *CAT '" "' *CAT &DWE4E *CAT '") & WF08E +
                          *EQ %RANGE("' *CAT &DWE5S *CAT '" "' *CAT +
                          &DWE5E *CAT '") & WF08F *EQ %RANGE("' +
                          *CAT &DWE6S *CAT '" "' *CAT &DWE6E *CAT +
                          '") &WE10 *EQ %RANGE("' *CAT &DWE15S *CAT +
                          '" "' *CAT &DWE15E *CAT '")') +
                          KEYFLD((WE01)) JFLD((1/WE01 2/WF01 *EQ)) +
                          MAPFLD((WF08A '%SST(WF08 1 1)') (WF08B +
                          '%SST(WF08 2 1)') (WF08C '%SST(WF08 3 +
                          1)') (WF08D '%SST(WF08 4 1)') (WF08E +
                          '%SST(WF08 5 1)') (WF08F '%SST(WF08 6 1)'))

             CALL       WOR1201

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('WOR120P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             CLOF       OPNID(WOWEPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
