   /*  CPYF FOR PROTOTYPING  */
   /*  MICHELLE      880430  */

     PGM
             DCL        VAR(&TYPE1) TYPE(*CHAR) LEN(1)
             RTVJOBA    TYPE(&TYPE1)
             IF (&TYPE1 = '0') THEN(GOTO START)
             SBMJOB     CMD(CALL PGM(Y2KM01C)) JOB(Y2KM01C) +
                          JOBQ(QINTER)
             GOTO END
    START:
 END:
     ENDPGM
