   /*  CPYF FOR PROTOTYPING  */
   /*  MICHELLE      880430  */

     PGM
             DCL        VAR(&TYPE1) TYPE(*CHAR) LEN(1)
             RTVJOBA    TYPE(&TYPE1)
             IF (&TYPE1 = '0') THEN(GOTO START)
             SBMJOB     CMD(CALL PGM(Y2KCPYC)) JOB(Y2KCPYC) +
                          JOBQ(QINTER)
             GOTO END
    START:
             DLTDTAARA  DTAARA(REFLIBT/DA*)
             MONMSG CPF0000
             DLTDTAARA  DTAARA(REPLIBT/RM*)
             MONMSG CPF0000
             DLTMSGF    MSGF(REFLIBT/RE*)
             MONMSG CPF0000
             DLTMSGF    MSGF(REFLIBT/S#*)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/RE@*)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/MTMDPF*)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/PUBF4FT)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/QSPLF)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/REW400)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/S#SDPF)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/S#SPPF)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/TEXT)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/STDPF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(RE*) FROMLIB(REFLIB) OBJTYPE(*MSGF) +
                          TOLIB(REFLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(S#*) FROMLIB(REFLIB) OBJTYPE(*MSGF) +
                          TOLIB(REFLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(DA*) FROMLIB(REFLIB) OBJTYPE(*DTAARA) +
                          TOLIB(REFLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(RM*) FROMLIB(REPLIB) OBJTYPE(*DTAARA) +
                          TOLIB(REPLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(RE@*) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(MTMDPF*) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PUBF4FT) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(QSPLF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(REW400) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(S#SDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(S#SPPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(TEXT) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(STDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000

/* OTHER MODULE */

             DLTDTAARA  DTAARA(GLFLIBT/PT*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PT#A*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PT#B*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PT#Y*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAA*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAB*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAC*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAI*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAH*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAF*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAX*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAK*)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT*) FROMLIB(GLFLIB) OBJTYPE(*DTAARA) +
                          TOLIB(GLFLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT#A*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT#B*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT#Y*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAA*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAB*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAC*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAI*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAH*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAF*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAX*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAK*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHD*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHB*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHA*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/PT#X*)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUA*)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUX*)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(CKHD*) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(CKHB*) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(CKHA*) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT#X*) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APUA*) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APUX*) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/LY#SPF)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APRF)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKRF)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLRF)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PTRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(LY#SPF) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APRF) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*NO)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(CKRF) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*NO)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLRF) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*NO)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PTRF) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*NO)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLS901) FROMLIB(GLPLIB) OBJTYPE(*PGM) +
                          TOLIB(GLPLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLS902) FROMLIB(GLPLIB) OBJTYPE(*PGM) +
                          TOLIB(GLPLIBT)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPN*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/PCC*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPRF)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/PCRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(NPRF) FROMLIB(GLALIB) OBJTYPE(*FILE) +
                          TOLIB(GLALIBT) DATA(*NO)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PCRF) FROMLIB(GLALIB) OBJTYPE(*FILE) +
                          TOLIB(GLALIBT) DATA(*NO)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(NPN*) FROMLIB(GLALIB) OBJTYPE(*FILE) +
                          TOLIB(GLALIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PCC*) FROMLIB(GLALIB) OBJTYPE(*FILE) +
                          TOLIB(GLALIBT) DATA(*YES)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUD*)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APUD*) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APS99*) FROMLIB(APPLIB) OBJTYPE(*PGM) +
                          TOLIB(APPLIBT)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/LYRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(LYRF) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*NO)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUZ*)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APUZ*) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APRF) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*NO)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(CKRF) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*NO)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLRF) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*NO)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PTRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PTRF) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*NO)
             MONMSG CPF0000
 END:
     ENDPGM
