   /*  CPYF FOR PROTOTYPING  */
   /*  MICHELLE      880430  */

     PGM
             DCL        VAR(&TYPE1) TYPE(*CHAR) LEN(1)
             RTVJOBA    TYPE(&TYPE1)
             IF (&TYPE1 = '0') THEN(GOTO START)
             SBMJOB     CMD(CALL PGM(Y2KCPY2C)) JOB(Y2KCPY2C) +
                          JOBQ(QINTER) LOG(4 00 *MSG)
             GOTO END
    START:
             DLTDTAARA  DTAARA(REFLIBT/DA*)
             MONMSG CPF0000
             DLTDTAARA  DTAARA(REPLIBT/RM*)
             MONMSG CPF0000
             DLTMSGF    MSGF(REFLIBT/RE*)
             MONMSG CPF0000
             DLTMSGF    MSGF(REFLIBT/S#*)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/RE@*)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/MTMDLF*)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/PA#FLF*)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/MTMDPF*)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/PUBF4FT)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/QSPLF)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/REW400)
             MONMSG CPF0000
  /*M001M    DLTF       FILE(REFLIBT/S#SDPF)  ¥ý¤£Âà88/05/11+
             MONMSG CPF0000       */
             DLTF       FILE(REFLIBT/S#SPPF)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/TEXT)
             MONMSG CPF0000
             DLTF       FILE(REFLIBT/STDPF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(RE*) FROMLIB(REFLIB) OBJTYPE(*MSGF) +
                          TOLIB(REFLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(S#*) FROMLIB(REFLIB) OBJTYPE(*MSGF) +
                          TOLIB(REFLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(DA*) FROMLIB(REFLIB) OBJTYPE(*DTAARA) +
                          TOLIB(REFLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(RM*) FROMLIB(REPLIB) OBJTYPE(*DTAARA) +
                          TOLIB(REPLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(RE@*) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(MTMDPF*) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(MTMDLF*) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTLF      FILE(REFLIBT/PA#FLF) SRCFILE(REFLIBT/QDDSSRC)
             MONMSG CPF0000
             CRTLF      FILE(REFLIBT/PA#FLF01) SRCFILE(REFLIBT/QDDSSRC)
             MONMSG CPF0000
             CRTLF      FILE(REFLIBT/PA#FLF02) SRCFILE(REFLIBT/QDDSSRC)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PUBF4FT) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(QSPLF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(REW400) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
/*M001M      CRTDUPOBJ  OBJ(S#SDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)  +
             MONMSG CPF0000   */
             CRTDUPOBJ  OBJ(S#SPPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(TEXT) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(STDPF) FROMLIB(REFLIB) OBJTYPE(*FILE) +
                          TOLIB(REFLIBT) DATA(*YES)
             MONMSG CPF0000
/* OTHER MODULE */

             DLTDTAARA  DTAARA(GLFLIBT/PT*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PT#ALF*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PT#A*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PT#B*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PT#Y*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAA*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAB*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLACLF*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAC*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAILF*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAI*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAHLF*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/GLAHLF*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAFLF*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAH*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAF*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAX*)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLAK*)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT*) FROMLIB(GLFLIB) OBJTYPE(*DTAARA) +
                          TOLIB(GLFLIBT)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT#A*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT#B*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT#Y*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAA*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAB*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAC*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAI*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAH*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAH*) FROMLIB(GLALIB) OBJTYPE(*FILE) +
                          TOLIB(GLALIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAF*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAX*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLAK*) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*YES)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHDLF*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHBLF*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHALF*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHAJF*)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUALF*)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUXLF*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHD*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHB*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKHA*)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/PT#X*)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUA*)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUX*)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(CKHD*) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(CKHB*) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(CKHA*) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PT#X*) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APUA*) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APUX*) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/LY#SPF)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPNALF*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPNBLF*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPNCLF*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPNDLF*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPNELF*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPNFLF*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPN*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/PCCALF*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/PCCCLF*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/PCC*)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/NPRF)
             MONMSG CPF0000
             DLTF       FILE(GLALIBT/PCRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(LY#SPF) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(NPRF) FROMLIB(GLALIB) OBJTYPE(*FILE) +
                          TOLIB(GLALIBT) DATA(*NO)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PCRF) FROMLIB(GLALIB) OBJTYPE(*FILE) +
                          TOLIB(GLALIBT) DATA(*NO)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(NPN*) FROMLIB(GLALIB) OBJTYPE(*FILE) +
                          TOLIB(GLALIBT) DATA(*YES)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PCC*) FROMLIB(GLALIB) OBJTYPE(*FILE) +
                          TOLIB(GLALIBT) DATA(*YES)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUDLF*)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUD*)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APUD*) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/LYRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(LYRF) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*NO)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUZLF*)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APUZ*)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APUZ*) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*YES)
             MONMSG CPF0000
             DLTF       FILE(APFLIBT/APRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(APRF) FROMLIB(APFLIB) OBJTYPE(*FILE) +
                          TOLIB(APFLIBT) DATA(*NO)
             MONMSG CPF0000
             DLTF       FILE(CKFLIBT/CKRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(CKRF) FROMLIB(CKFLIB) OBJTYPE(*FILE) +
                          TOLIB(CKFLIBT) DATA(*NO)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/GLRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(GLRF) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*NO)
             MONMSG CPF0000
             DLTF       FILE(GLFLIBT/PTRF)
             MONMSG CPF0000
             CRTDUPOBJ  OBJ(PTRF) FROMLIB(GLFLIB) OBJTYPE(*FILE) +
                          TOLIB(GLFLIBT) DATA(*NO)
             MONMSG CPF0000
 END:
     ENDPGM
