/********************************************************************/
/*                                                                ED*/
/********************************************************************/
     PGM
             DCL        VAR(&TYPE1) TYPE(*CHAR) LEN(1)
             RTVJOBA    TYPE(&TYPE1)
             IF (&TYPE1 = '0') THEN(GOTO START)
             SBMJOB     CMD(CALL PGM(Y2KM01C)) JOB(Y2KM01C) +
                          JOBQ(QINTER)
             GOTO END
    START:
             DSPFD      FILE(REFLIB/*ALL) TYPE(*MBRLIST) +
                          OUTPUT(*OUTFILE) OUTFILE(CHKM01)
             DSPFD      FILE(REFLIBT/*ALL) TYPE(*MBRLIST) +
                          OUTPUT(*OUTFILE) OUTFILE(CHKM02)
             RUNQRY     QRY(CHKM03Q) +
                          QRYFILE((CHKM01) +
                          (CHKM02)) OUTTYPE(*PRINTER)
             RUNQRY     QRY(CHKM04Q) +
                          QRYFILE((CHKM01) +
                          (CHKM02)) OUTTYPE(*PRINTER)
             RUNQRY     QRY(CHKM05Q) +
                          QRYFILE((CHKM02) +
                          (CHKM01)) OUTTYPE(*PRINTER)
 END:
     ENDPGM
