     A*  90/07/05  19:50:55    SSPGMR      REL-R02M00  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R DSPC1
     A*  90/07/05  19:50:55    SSPGMR      REL-R02M00  5728-PW1
     A                                      CA03(03 'RETURN')
     A                                      PROTECT
     A                                      OVERLAY
  #  A                                      ASSUME
  #  A                                      KEEP
  #  A                                      PUTRETAIN
     A                                  4 63'                  '
     A                                      DSPATR(RI)
     A                                  5 63' '
     A                                      DSPATR(RI)
     A                                  5 65' 1.癟琩高 '
     A                                  5 80' '
     A                                      DSPATR(RI)
     A                                  6 63' '
     A                                      DSPATR(RI)
     A                                  6 65' 2.厨琩高 '
     A                                  6 80' '
     A                                      DSPATR(RI)
     A                                  7 63' '
     A                                      DSPATR(RI)
     A                                  7 65' 3.уΩ琩高 '
     A                                  7 80' '
     A                                      DSPATR(RI)
     A                                  8 63' '
     A                                      DSPATR(RI)
     A                                  8 65' 4.╰参穨 '
     A                                  8 80' '
     A                                      DSPATR(RI)
     A                                  9 63' '
     A                                      DSPATR(RI)
     A                                  9 65' 匡拒:'
     A            DOPT           1A  B  9 74VALUES('1' '2' '3' '4')
     A                                      CHECK(ME)
     A                                      CHECK(MF)
     A                                      CHECK(ER)
     A                                  9 76'   '
     A                                  9 80' '
     A                                      DSPATR(RI)
     A                                 10 63'     PF3=EXIT     '
     A                                      DSPATR(RI)
