     A*****************************************************************
     A*    PROGRAM NAME : S@M01D                                      *
     A*    AUTHOR       : DAHLIA FENG                                 *
     A*    CREATE DATE  : 78/11/29                                    *
     A*    UPDATE DATE  :                                             *
     A*    PROCEDURE    : S@M01C                                      *
     A*    REMARK       : 安全管制系統                              *
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A                                      OVERLAY
     A                                      TEXT('安全管制系統')
     A                                  1  2'<FIA02CD>'
     A                                  1 25'***       系統狀況       ***'
     A                                  1 63'日期:'
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A                                  5 24'01.察看報表列印狀況　　'
     A                                  6 24'02.察看執行工作狀況　　'
     A                                  7 24'03.察看訊息狀況　　　　'
     A                                 17 25'90.結束　　　　　　　　'
     A                                 19 30'選擇項目:'
     A            DOPID          2A  B 19 42VALUES('01' '02' '03' '90' ' ')
