     A****************************************************************
     A*    DSPF NAME    : FIS210D#                                   *
     A*    AUTHOR       : A1040  JUSTIN                              *
     A*    CREATE DATE  : 78/10/11                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : FIS210#                                    *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :總帳系統                                  *
     A*    REMARK       :銷退折讓類別查詢                          *
     A****************************************************************
     A                                      PRINT
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      CA03(03)
     A                                      CA12(12)
     A          R SFLSR1                    SFL
     A            DNM02          1A  O  5  5
     A            DNM031        14A  O  5  8
     A            DNM032         1A  O  5 26
     A            DNM033        10O  O  5 28
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A                                      OVERLAY
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SFLSIZ(60)
     A                                      SFLPAG(20)
     A                                      SFLLIN(4)
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(UPT2030 PTMF)
     A  97                                  SFLMSGID(UPT2040 PTMF)
     A            DRRN           2S 0H      SFLRCDNBR
     A                                  1  2'<FIS210D>'
     A                                  1 22'***     銷退折讓類別維護    ***'
     A                                  1 64'日期:'
     A            DDATE          6  0   1 72EDTCDE(Y)
     A                                  3  1'代碼'
     A                                  3  8'說　明'
     A                                  3 25'類別'
     A                                  3 42'代碼'
     A                                  3 49'說　明'
     A                                  3 65'類別'
     A                                  4  1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A          R DSPC1
     A                                 20  1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                 23  2'PF03 =回主畫面'
     A                                    +1'PF12 =回前畫面'
     A                                    +1'PA1 =下一頁'
     A                                    +1'PA2 =上一頁'
     A  96        ERR1          50A    22 02MSGID(UPT2050 PTMF)
     A                                      DSPATR(HI)
