     A
     A          R FL0
     A            WHRTYP         1          COLHDG('TYPE OF FILE')
     A            WHRFI         11O         COLHDG('FILE NAME')
     A            WHRLI         11O         COLHDG('LIB  NAME')
     A            WHNO           5S 0       COLHDG('NO OF DEPENDENCY')
     A          K WHRFI
