     A          R GSET                      PUTOVR
     A            GCODE          2      1  2DSPATR(ND)
     A            GDATA        642      1  5DSPATR(ND)
     A          R GCLEAR                    PUTOVR
     A            GCODE          2      1 73DSPATR(BL RI)
     A          R DD1
     A                                      CF03(03)
     A                                 18 54'輸入格線資料存放位置'
     A                                 19 55'SOURCE FILE'
     A            FLD001        10   B    +1
     A                                 20 55'    LIBRARY'
     A            FLD002        10   B    +1
     A                                 21 55'     MEMBER'
     A            FLD003        10   B    +1
     A                                 22 55'PF3結束' DSPATR(RI)
