     A*  92/09/17  13:12:25    DPACK2      REL-R03M00  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A*  92/09/17  13:12:25    DPACK2      REL-R03M00  5728-PW1
     A                                      CA03(03)
     A                                  1 31'TEST P31'
     A                                  2 28'日期格式轉換'
     A                                  8 24'原始年月日期:'
     A            D01            8  0B  8 44
     A                                  9 24'原始日期格式:'
     A            D02            1A  B  9 44
     A                                 10 24'原始曆別    :'
     A            D03            1A  B 10 44
     A                                 11 24'轉換日期格式:'
     A            D04            1A  B 11 44
     A                                 12 24'轉換曆別    :'
     A            D05            1A  B 12 44
     A                                 14 17'-----------------------------------
     A                                      ----------'
     A                                 16 24'轉換後年月日:'
     A            D06            8  0B 16 44
     A  98        ERR00         50A  O 22  2MSGID(UGL 0001 FIMF)
     A                                      DSPATR(HI)
     A  97        ERR01         50A  O 22  2MSGID(UGL 0017 FIMF)
     A                                      DSPATR(HI)
     A  96        ERR02         50A  O 22  2MSGID(UCK 9999 FIMF)
     A                                      DSPATR(HI)
     A                                 23  2'PF3 =回主畫面'
