     A*  92/09/16  14:09:51    DPACK2      REL-R03M00  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A*  92/09/16  14:09:51    DPACK2      REL-R03M00  5728-PW1
     A                                      CA03(03)
     A                                  1 35'TEST P32'
     A                                  2 26'計算起日－迄日相距日數'
     A                                  7 31'輸入起日:'
     A            D01            8  0B  7 43
     A                                  8 31'輸入迄日:'
     A            D02            8  0B  8 43
     A                                 10 31'日期格式:'
     A            D03            1   B 10 44
     A                                 11 31'曆　　別:'
     A            D04            1   B 11 44
     A                                 13 17'-----------------------------------
     A                                      ----------'
     A                                 15 31'相距日數:'
     A            D05            9  0O 15 44EDTCDE(M)
     A  98        ERR00         50A  O 22  2MSGID(UGL 0001 FIMF)
     A                                      DSPATR(HI)
     A  97        ERR01         50A  O 22  2MSGID(UGL 0017 FIMF)
     A                                      DSPATR(HI)
     A  96        ERR02         50A  O 22  2MSGID(UCK 9999 FIMF)
     A                                      DSPATR(HI)
     A                                 23  2'PF3 =回主畫面'
