     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*===============================================================*
     A*  SC01   : DSPC1                    * FOR MAIN SCREEN          *
     A*===============================================================*
     A          R DSPC
     A                                      CA03(03)
     A                                  1 35'TEST P45'
     A                                  1 64'日期:'
     A            DDATE          6  0O  1 72EDTCDE(Y)
     A                                  8 31'中國年:'
     A            DCYR           7  0B  8 43
     A                                 10 31'西元年:'
     A            DWYR           6  0O 10 43
     A                                 23  2'PF3 =回主畫面'
