     A          R P51DSF
     A                                      CA03(03)
     A            AA             6  0B 10 40
     A            BB             3A  B 12 40
     A            CC             1A  B 14 40
     A            DD            13A  O 16 40
