     A*  90/10/02  11:29:33    A1062       REL-R02M00  5728-PW1
     A                                      DSPSIZ(24 80 *DS3)
     A          R DSPD1
     A*  90/10/02  11:29:33    A1062       REL-R02M00  5728-PW1
     A                                      CA03(03)
     A            P5301I         4A  B  5 40
     A            P5302I        11Y 2B  6 40CHECK(RB)
     A                                      EDTCDE(4)
     A            P5303I         2  0B  7 40EDTCDE(4)
     A            P5304I         4A  B  8 40
     A            P5305I         1A  B  9 40
     A                                 11  6'         1         2         3    -
     A                                           4         5         6         -
     A                                      7'
     A                                 12  6'1234567890123456789012345678901234-
     A                                      56789012345678901234567890123456789-
     A                                      0'
     A            P5301O        70A  O 14  6
     A            P5302O        70A  O 15  6
     A            P5303O        70A  O 16  6
     A            P5304O        70A  O 17  6
     A            P5305O        70A  O 18  6
     A            P5306O        70A  O 19  6
