     A*********************************************
     A*          印表機檔(P68)                  *
     A*********************************************
     A                                      UNIQUE
     A          R P68R
     A            P6801          1  0       COLHDG('印表機代碼')
     A            P6802         10          COLHDG('印表機')
     A            P6803         10          COLHDG('OUTQ')
     A            P6804         10O         COLHDG('印表機描述')
     A          K P6801
