     A
     A          R OWN0
     A            ODLBNM        10          COLHDG('LIBRARY')
     A            ODOBNM        10O         COLHDG('OBJECT')
     A            ODOBTP         8O         COLHDG('OBJECT TYPE')
     A            ODOBOW        10          COLHDG('OBJECT OWNER')
     A          K ODOBNM
