     A
     A          R PG0
     A            WHLIB         10          COLHDG('PGM LIB')
     A            WHPNAM        10          COLHDG('PGM NAME')
     A            WHTEXT        50          COLHDG('TEXT')
     A            WHFNAM        11          COLHDG('REFERED FILE')
     A            WHLNAM        11          COLHDG('FILE LIB')
     A            WHFUSG         2S 0       COLHDG('FILE USAGE')
     A          K WHFNAM
     A          K WHLNAM
