      ****************************************************************
      * 泛太資訊科技開發股份有限公司－版權所有      TEL:7313250    *
      ****************************************************************
     A                                      UNIQUE
     A          R C@0
     A            C@01          10          COLHDG('FILE NAME')
     A            C@02          60          COLHDG('KEY STRING')
     A            C@03          10          COLHDG('USER ID')
     A            C@04          10          COLHDG('JOB NAME')
     A            C@05           6S 0       COLHDG('TIME')
     A          K C@01
     A          K C@02
