     A* LOGICAL FOR APPLICATION:   77777    QSECOFR
     A          R FILEREC                   PFILE(PTOPERLIB/QPFRDOC)
     A            SRCSEQ                    TEXT('SRCSEQ')
     A                                      COLHDG('SRCSEQ')
     A            SRCDTA                    TEXT('SRCDTA')
     A                                      COLHDG('SRCDTA')
     A          K SRCSEQ                    SIGNED
