     A****************************************************************
     A*                        COPYRIGHT 1990                        *
     A*                MICHAELS, ROSS & COLE LIMITED                 *
     A*                     ALL RIGHTS RESERVED                      *
     A****************************************************************
     A*        PRINTER FILE - 77777           VERSION-01  RELEASE-1.0*
     A*        PRINTER FILE - Document Listing                       *
     A*        WRITTEN BY   - QSECOFR                                *
     A*        DATE WRITTEN - 10/12/90 , TIME WRITTEN -   09:00:17   *
     A****************************************************************
     A          R HDG00                     SKIPB(01)
     A                                      SPACEA(01)
     A                                     1' '
     A          R DET00
     A                                      SPACEB(1)
     A            SRCDTA       080       001
     A          R TOT02
     A                                      SPACEA(1)
     A                                     1' '
     A          R TOT01
     A                                      SPACEA(1)
     A                                     1' '
