     A****************************************************************
     A*    PRTF NAME    : PYR222P                                    *
     A*    AUTHOR       : A1043  JACKIE                              *
     A*    CREATE DATE  : 78/10/19                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PYR222                                     *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :人事薪資系統                              *
     A*    PURPOSE      :年度薪資扣繳總表列印                      *
     A****************************************************************
     A                                      REF(PIPF)
     A          R PH1                       SKIPB(2)
     A            CM02      R              1REFFLD(CM02 CMPF)
     A                                   169'日期:'
     A            DDATE          6  0    177EDTCDE(Y)
     A                                   186'頁次:'
     A                                   194PAGNBR
     A                                      SPACEA(1)
     A            DYY            2  0      2EDTCDE(1)
     A                                     6'年度薪資扣繳清冊'
     A                                   169'時間:'
     A                                   177TIME
     A                                      EDTWRD('  :  :  ')
     A                                   187'<PYR222P>'
     A                                      SPACEA(2)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                    49'一月'
     A                                    60'二月'
     A                                    71'三月'
     A                                    82'四月'
     A                                    93'五月'
     A                                   104'六月'
     A                                   115'七月'
     A                                   126'八月'
     A                                   137'九月'
     A                                   148'十月'
     A                                   157'十一月'
     A                                   168'十二月'
     A                                      SPACEA(1)
     A                                    49'應稅'
     A                                    60'應稅'
     A                                    71'應稅'
     A                                    82'應稅'
     A                                    93'應稅'
     A                                   104'應稅'
     A                                   115'應稅'
     A                                   126'應稅'
     A                                   137'應稅'
     A                                   148'應稅'
     A                                   159'應稅'
     A                                   170'應稅'
     A                                      SPACEA(1)
     A                                    49'扣繳'
     A                                    60'扣繳'
     A                                    71'扣繳'
     A                                    82'扣繳'
     A                                    93'扣繳'
     A                                   104'扣繳'
     A                                   115'扣繳'
     A                                   126'扣繳'
     A                                   137'扣繳'
     A                                   148'扣繳'
     A                                   159'扣繳'
     A                                   170'扣繳'
     A                                      SPACEA(1)
     A                                     1'部門說明'
     A                                    18'員工編號'
     A                                    30'員工姓名'
     A                                    45'稅後淨額'
     A                                    56'稅後淨額'
     A                                    67'稅後淨額'
     A                                    78'稅後淨額'
     A                                    89'稅後淨額'
     A                                   100'稅後淨額'
     A                                   111'稅後淨額'
     A                                   122'稅後淨額'
     A                                   133'稅後淨額'
     A                                   144'稅後淨額'
     A                                   155'稅後淨額'
     A                                   166'稅後淨額'
     A                                   183'合　計'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A*
     A          R PD11                      SPACEA(1)
     A  31        PNM03         14         2
     A            EM01      R             20REFFLD(EM01 EMPF)
     A            EM02      R             31REFFLD(EM02 EMPF)
     A            PPI381    R             47REFFLD(PI38) EDTCDE(1)
     A            PPI382    R             58REFFLD(PI38) EDTCDE(1)
     A            PPI383    R             69REFFLD(PI38) EDTCDE(1)
     A            PPI384    R             80REFFLD(PI38) EDTCDE(1)
     A            PPI385    R             91REFFLD(PI38) EDTCDE(1)
     A            PPI386    R            102REFFLD(PI38) EDTCDE(1)
     A            PPI387    R            113REFFLD(PI38) EDTCDE(1)
     A            PPI388    R            124REFFLD(PI38) EDTCDE(1)
     A            PPI389    R            135REFFLD(PI38) EDTCDE(1)
     A            PPI38A    R            146REFFLD(PI38) EDTCDE(1)
     A            PPI38B    R            157REFFLD(PI38) EDTCDE(1)
     A            PPI38C    R            168REFFLD(PI38) EDTCDE(1)
     A            PPI38T         9S 0    179EDTCDE(1)
     A*
     A          R PD12                      SPACEA(1)
     A            PPI281    R             47REFFLD(PI38) EDTCDE(1)
     A            PPI282    R             58REFFLD(PI38) EDTCDE(1)
     A            PPI283    R             69REFFLD(PI38) EDTCDE(1)
     A            PPI284    R             80REFFLD(PI38) EDTCDE(1)
     A            PPI285    R             91REFFLD(PI38) EDTCDE(1)
     A            PPI286    R            102REFFLD(PI38) EDTCDE(1)
     A            PPI287    R            113REFFLD(PI38) EDTCDE(1)
     A            PPI288    R            124REFFLD(PI38) EDTCDE(1)
     A            PPI289    R            135REFFLD(PI38) EDTCDE(1)
     A            PPI28A    R            146REFFLD(PI38) EDTCDE(1)
     A            PPI28B    R            157REFFLD(PI38) EDTCDE(1)
     A            PPI28C    R            168REFFLD(PI38) EDTCDE(1)
     A            PPI28T         9S 0    179EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A          R PD13                      SPACEA(1)
     A            PNET1     R             47REFFLD(PI38) EDTCDE(1)
     A            PNET2     R             58REFFLD(PI38) EDTCDE(1)
     A            PNET3     R             69REFFLD(PI38) EDTCDE(1)
     A            PNET4     R             80REFFLD(PI38) EDTCDE(1)
     A            PNET5     R             91REFFLD(PI38) EDTCDE(1)
     A            PNET6     R            102REFFLD(PI38) EDTCDE(1)
     A            PNET7     R            113REFFLD(PI38) EDTCDE(1)
     A            PNET8     R            124REFFLD(PI38) EDTCDE(1)
     A            PNET9     R            135REFFLD(PI38) EDTCDE(1)
     A            PNETA     R            146REFFLD(PI38) EDTCDE(1)
     A            PNETB     R            157REFFLD(PI38) EDTCDE(1)
     A            PNETC     R            168REFFLD(PI38) EDTCDE(1)
     A            PNETT          9S 0    179EDTCDE(1)
     A*
     A          R PT11                      SPACEB(1)
     A                                     1'部門合計'
     A            PDV381         7S 0     45EDTCDE(1)
     A            PDV382         7S 0     56EDTCDE(1)
     A            PDV383         7S 0     67EDTCDE(1)
     A            PDV384         7S 0     78EDTCDE(1)
     A            PDV385         7S 0     89EDTCDE(1)
     A            PDV386         7S 0    100EDTCDE(1)
     A            PDV387         7S 0    111EDTCDE(1)
     A            PDV388         7S 0    122EDTCDE(1)
     A            PDV389         7S 0    133EDTCDE(1)
     A            PDV38A         7S 0    144EDTCDE(1)
     A            PDV38B         7S 0    155EDTCDE(1)
     A            PDV38C         7S 0    166EDTCDE(1)
     A            PDV38T        10S 0    177EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A          R PT12                      SPACEA(1)
     A            PDV281         7S 0     45EDTCDE(1)
     A            PDV282         7S 0     56EDTCDE(1)
     A            PDV283         7S 0     67EDTCDE(1)
     A            PDV284         7S 0     78EDTCDE(1)
     A            PDV285         7S 0     89EDTCDE(1)
     A            PDV286         7S 0    100EDTCDE(1)
     A            PDV287         7S 0    111EDTCDE(1)
     A            PDV288         7S 0    122EDTCDE(1)
     A            PDV289         7S 0    133EDTCDE(1)
     A            PDV28A         7S 0    144EDTCDE(1)
     A            PDV28B         7S 0    155EDTCDE(1)
     A            PDV28C         7S 0    166EDTCDE(1)
     A            PDV28T        10S 0    177EDTCDE(1)
     A*
     A          R PT13                      SPACEA(1)
     A            PDVNT1         7S 0     45EDTCDE(1)
     A            PDVNT2         7S 0     56EDTCDE(1)
     A            PDVNT3         7S 0     67EDTCDE(1)
     A            PDVNT4         7S 0     78EDTCDE(1)
     A            PDVNT5         7S 0     89EDTCDE(1)
     A            PDVNT6         7S 0    100EDTCDE(1)
     A            PDVNT7         7S 0    111EDTCDE(1)
     A            PDVNT8         7S 0    122EDTCDE(1)
     A            PDVNT9         7S 0    133EDTCDE(1)
     A            PDVNTA         7S 0    144EDTCDE(1)
     A            PDVNTB         7S 0    155EDTCDE(1)
     A            PDVNTC         7S 0    166EDTCDE(1)
     A            PDVNTT        10S 0    177EDTCDE(1)
     A                                      SPACEA(2)
     A*
     A          R PT21                      SPACEB(1)
     A                                     1'公司合計'
     A            PCO381         7S 0     45EDTCDE(1)
     A            PCO382         7S 0     56EDTCDE(1)
     A            PCO383         7S 0     67EDTCDE(1)
     A            PCO384         7S 0     78EDTCDE(1)
     A            PCO385         7S 0     89EDTCDE(1)
     A            PCO386         7S 0    100EDTCDE(1)
     A            PCO387         7S 0    111EDTCDE(1)
     A            PCO388         7S 0    122EDTCDE(1)
     A            PCO389         7S 0    133EDTCDE(1)
     A            PCO38A         7S 0    144EDTCDE(1)
     A            PCO38B         7S 0    155EDTCDE(1)
     A            PCO38C         7S 0    166EDTCDE(1)
     A            PCO38T        10S 0    177EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A          R PT22                      SPACEA(1)
     A            PCO281         7S 0     45EDTCDE(1)
     A            PCO282         7S 0     56EDTCDE(1)
     A            PCO283         7S 0     67EDTCDE(1)
     A            PCO284         7S 0     78EDTCDE(1)
     A            PCO285         7S 0     89EDTCDE(1)
     A            PCO286         7S 0    100EDTCDE(1)
     A            PCO287         7S 0    111EDTCDE(1)
     A            PCO288         7S 0    122EDTCDE(1)
     A            PCO289         7S 0    133EDTCDE(1)
     A            PCO28A         7S 0    144EDTCDE(1)
     A            PCO28B         7S 0    155EDTCDE(1)
     A            PCO28C         7S 0    166EDTCDE(1)
     A            PCO28T        10S 0    177EDTCDE(1)
     A*
     A          R PT23                      SPACEA(1)
     A            PCONT1         7S 0     45EDTCDE(1)
     A            PCONT2         7S 0     56EDTCDE(1)
     A            PCONT3         7S 0     67EDTCDE(1)
     A            PCONT4         7S 0     78EDTCDE(1)
     A            PCONT5         7S 0     89EDTCDE(1)
     A            PCONT6         7S 0    100EDTCDE(1)
     A            PCONT7         7S 0    111EDTCDE(1)
     A            PCONT8         7S 0    122EDTCDE(1)
     A            PCONT9         7S 0    133EDTCDE(1)
     A            PCONTA         7S 0    144EDTCDE(1)
     A            PCONTB         7S 0    155EDTCDE(1)
     A            PCONTC         7S 0    166EDTCDE(1)
     A            PCONTT        10S 0    177EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A          R PT31                      SPACEB(1)
     A                                     1'總合計'
     A            PSM381         7S 0     45EDTCDE(1)
     A            PSM382         7S 0     56EDTCDE(1)
     A            PSM383         7S 0     67EDTCDE(1)
     A            PSM384         7S 0     78EDTCDE(1)
     A            PSM385         7S 0     89EDTCDE(1)
     A            PSM386         7S 0    100EDTCDE(1)
     A            PSM387         7S 0    111EDTCDE(1)
     A            PSM388         7S 0    122EDTCDE(1)
     A            PSM389         7S 0    133EDTCDE(1)
     A            PSM38A         7S 0    144EDTCDE(1)
     A            PSM38B         7S 0    155EDTCDE(1)
     A            PSM38C         7S 0    166EDTCDE(1)
     A            PSM38T        10S 0    177EDTCDE(1)
     A                                      SPACEA(1)
     A*
     A          R PT32                      SPACEA(1)
     A            PSM281         7S 0     45EDTCDE(1)
     A            PSM282         7S 0     56EDTCDE(1)
     A            PSM283         7S 0     67EDTCDE(1)
     A            PSM284         7S 0     78EDTCDE(1)
     A            PSM285         7S 0     89EDTCDE(1)
     A            PSM286         7S 0    100EDTCDE(1)
     A            PSM287         7S 0    111EDTCDE(1)
     A            PSM288         7S 0    122EDTCDE(1)
     A            PSM289         7S 0    133EDTCDE(1)
     A            PSM28A         7S 0    144EDTCDE(1)
     A            PSM28B         7S 0    155EDTCDE(1)
     A            PSM28C         7S 0    166EDTCDE(1)
     A            PSM28T        10S 0    177EDTCDE(1)
     A*
     A          R PT33                      SPACEA(1)
     A            PSMNT1         7S 0     45EDTCDE(1)
     A            PSMNT2         7S 0     56EDTCDE(1)
     A            PSMNT3         7S 0     67EDTCDE(1)
     A            PSMNT4         7S 0     78EDTCDE(1)
     A            PSMNT5         7S 0     89EDTCDE(1)
     A            PSMNT6         7S 0    100EDTCDE(1)
     A            PSMNT7         7S 0    111EDTCDE(1)
     A            PSMNT8         7S 0    122EDTCDE(1)
     A            PSMNT9         7S 0    133EDTCDE(1)
     A            PSMNTA         7S 0    144EDTCDE(1)
     A            PSMNTB         7S 0    155EDTCDE(1)
     A            PSMNTC         7S 0    166EDTCDE(1)
     A            PSMNTT        10S 0    177EDTCDE(1)
     A*
     A          R PE1                       SPACEB(2)
     A                                    25'接下頁'
     A*
     A          R PE2                       SPACEB(2)
     A                                    10'PYR222P--->'
     A                                    25'報表結束'
