     A*  90/05/14  13:42:57    A1062       REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : R@A002D                                    *
     A*    AUTHOR       : A1062   JEANNY LIN                         *
     A*    CREATE DATE  : 79/05/14                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : R@A002                                     *
     A*    SYSTEM       :應用程式版權保護系統                      *
     A*    PURPOSE      :應用程式版權資料更新                      *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/R@RF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A*  90/05/14  13:42:57    A1062       REL-R02M00  5728-PW1
     A                                      CHGINPDFT(UL)
     A                                      CA03(03)
     A                                  1  2'<R@A002>'
     A                                  1 23'*** 應用程式版權資料更新 ***'
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A                                  2  2'<R@A002.1>'
     A                                  2 64'作業:'
     A                                  2 72'更新'
     A                                      DSPATR(RI)
     A                                  6  6'公司別:'
     A            DRA01     R        B  6 16REFFLD(RA01)
     A                                  6 33'序　號:'
     A            DRA02     R        B  6 43REFFLD(RA02)
     A                                  8  6' CPU-ID :'
     A            DRA03     R        B  8 16REFFLD(RA03) CHECK(RB)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  8 33'機　型:'
     A            DRA04     R        B  8 43REFFLD(RA04) CHECK(RB)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  8 54'到期日:'
     A            DRA05     R        B  8 64REFFLD(RA05) CHECK(RB)
     A                                      EDTCDE(Y)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                 11  6'子系統:'
     A            DRA601         2A  B 11 16
     A            DRA602         2A  B 11 22
     A            DRA603         2A  B 11 28
     A            DRA604         2A  B 11 34
     A            DRA605         2A  B 11 40
     A            DRA606         2A  B 11 46
     A            DRA607         2A  B 11 52
     A            DRA608         2A  B 11 58
     A            DRA609         2A  B 11 64
     A            DRA610         2A  B 11 70
     A            DRA611         2A  B 12 16
     A            DRA612         2A  B 12 22
     A            DRA613         2A  B 12 28
     A            DRA614         2A  B 12 34
     A            DRA615         2A  B 12 40
     A            DRA616         2A  B 12 46
     A            DRA617         2A  B 12 52
     A            DRA618         2A  B 12 58
     A            DRA619         2A  B 12 64
     A            DRA620         2A  B 12 70
     A            DRA621         2A  B 13 16
     A            DRA622         2A  B 13 22
     A            DRA623         2A  B 13 28
     A            DRA624         2A  B 13 34
     A            DRA625         2A  B 13 40
     A            DRA626         2A  B 13 46
     A            DRA627         2A  B 13 52
     A            DRA628         2A  B 13 58
     A            DRA629         2A  B 13 64
     A            DRA630         2A  B 13 70
     A            DRA631         2A  B 14 16
     A            DRA632         2A  B 14 22
     A            DRA633         2A  B 14 28
     A            DRA634         2A  B 14 34
     A            DRA635         2A  B 14 40
     A            DRA636         2A  B 14 46
     A            DRA637         2A  B 14 52
     A            DRA638         2A  B 14 58
     A            DRA639         2A  B 14 64
     A            DRA640         2A  B 14 70
     A                                 17  6'對應碼:'
     A            DRA07     R        B 17 16REFFLD(RA07) CHECK(RB)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                      EDTCDE(3)
     A  98        ERR1          50A  O 22  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 22  2MSGID(UPT 0080 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 22  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A                                 23  2'PF3 =回主畫面'
