     A*  90/05/30  17:53:54    QSECOFR     REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : R@A003D                                    *
     A*    AUTHOR       : A1062   JEANNY LIN                         *
     A*    CREATE DATE  : 79/05/29                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : R@A003                                     *
     A*    SYSTEM       :應用程式版權保護系統                      *
     A*    PURPOSE      :應用程式版權資料列印                      *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/R@RF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A*  90/05/30  17:53:54    QSECOFR     REL-R02M00  5728-PW1
     A                                      CF03(03 '結束執行')
     A                                  1  2'<R@R003>'
     A                                  1 25'***應用程式版權資料列印***'
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTCDE(Y)
     A                                  7 30'公司別　　起:'
     A            DRA011    R        B  7 46REFFLD(RA01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  9 30'　　　　　迄:'
     A            DRA012    R        B  9 46REFFLD(RA01)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                 12 30'列印份數    :'
     A            CPY            3Y 0B 12 46EDTCDE(Z)
     A                                      CHECK(RB)
     A                                 13 30'列表機　    :'
     A            PRTID          1Y 0B 13 46EDTCDE(Z)
     A  27        PRINTMARK     40A  O 16 30MSGID(UPT 0001 PTMF)
     A                                 21 29'***請準備８０行報表紙***'
     A  98        ERR1          50A  O 22  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 22  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A                                 23  2'PF3=回主畫面'
