     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : R@A003P                                    *
     A*    AUTHOR       : A1062   JEANNY LIN                         *
     A*    CREATE DATE  : 79/05/29                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : R@A003                                     *
     A*    SYSTEM       :應用程式版權保護系統                      *
     A*    PURPOSE      :應用程式版權資料列印                      *
     A****************************************************************
     A                                      REF(*LIBL/R@RF)
     A          R PH1                       SKIPB(2)
     A                                     1'應用程式版權資料明細表'
     A                                    95'日期:'
     A            DDATE          6  0    103EDTCDE(Y)
     A                                   111'頁次:'
     A                                   119PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'公司別:'
     A            DRA011    R             11REFFLD(RA01)
     A                                    20'-'
     A            DRA012    R             22REFFLD(RA01)
     A                                    95'時間:'
     A                                   103TIME
     A                                   113'< R@R003 >'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===='
     A                                      SPACEA(1)
     A                                     4'公司別'
     A                                    14'序號'
     A                                    25'CPU-ID'
     A                                    35'機型'
     A                                    46'到期日'
     A                                    57'對應碼'
     A                                    76'中文說明'
     A                                   104'備註'
     A                                      SPACEA(1)
     A                                     4'子系統'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            RA01      R              7
     A            RA02      R             16
     A            RA03      R             24
     A            RA04      R             36
     A            RA05      R             46EDTCDE(Y)
     A            RA07      R             57EDTCDE(3)
     A            RA08      R             68
     A            RA09      R            105
     A                                      SPACEA(1)
     A            RA601          2         7
     A            RA602          2        10
     A            RA603          2        13
     A            RA604          2        16
     A            RA605          2        19
     A            RA606          2        22
     A            RA607          2        25
     A            RA608          2        28
     A            RA609          2        31
     A            RA610          2        34
     A            RA611          2        37
     A            RA612          2        40
     A            RA613          2        43
     A            RA614          2        46
     A            RA615          2        49
     A            RA616          2        52
     A            RA617          2        55
     A            RA618          2        58
     A            RA619          2        61
     A            RA620          2        64
     A            RA621          2        67
     A            RA622          2        70
     A            RA623          2        73
     A            RA624          2        76
     A            RA625          2        79
     A            RA626          2        82
     A            RA627          2        85
     A            RA628          2        88
     A            RA629          2        91
     A            RA630          2        94
     A            RA631          2        97
     A            RA632          2       100
     A            RA633          2       103
     A            RA634          2       106
     A            RA635          2       109
     A            RA636          2       112
     A            RA637          2       115
     A            RA638          2       118
     A            RA639          2       121
     A            RA640          2       124
     A                                      SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ----'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'*** 接下頁 ***'
     A          R PE2
     A                                     1'*** 報表結束 ***'
