     A*****************************************************************
     A*          應用程式版權資料主檔(R@RAPF)   KEY=RA01+RA02       *
     A*****************************************************************
     A                                      REF(R@RF)
     A                                      UNIQUE
     A          R RA0
     A            RA01      R               COLHDG('公司別')
     A            RA02      R               COLHDG('序號')
     A            RA03      R               COLHDG(' CPU-ID')
     A            RA04      R               COLHDG('機型')
     A            RA05      R               COLHDG('到期日')
     A            RA06      R               COLHDG('子系統')
     A            RA07      R               COLHDG('對應碼')
     A            RA08      R               COLHDG('中文說明')
     A            RA09      R               COLHDG('備註')
     A          K RA01
     A          K RA02
