     A*  89/11/29  10:23:44    A1046       REL-R01M02  5728-PW1
     A*****************************************************************
     A*    DSPF    NAME : S@M01D                                      *
     A*    AUTHOR       : JOHNSON CHEN                                *
     A*    CREATE DATE  : 78/11/29                                    *
     A*    UPDATE DATE  :                                             *
     A*    PROCEDURE    : S@M01C                                      *
     A*    REMARK       : 安全管制系統主畫面建立                    *
     A*****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A*  89/11/29  10:23:44    A1046       REL-R01M02  5728-PW1
     A*                                     OVERLAY
     A                                  1  2'<S@M01C>'
     A                                  1 23'***'
     A                                  1 28'安　全　管　制　系　統'
     A                                  1 54'***'
     A                                  5  6'01.程式代碼建立（選擇）'
     A                                  7  6'02.程式代碼維護'
     A                                  9  6'03.程式使用權隱藏'
     A                                 11  6'04.程式使用權設定（依使用者別）'
     A                                 13  6'05.程式使用權設定（依程式別）'
     A                                  5 45'13.程式使用權檢核表（依使用者別-
     A                                      ）'
     A                                  7 45'14.程式使用權檢核表（依程式別）'
     A                                  9 45'80.系統狀況查詢'
     A                                 13 45'90.結束作業'
     A                                 15 25'選擇項目:'
     A            DOPT           2A  B 15 37VALUES('01' '02' '03' '04' '13' '14-
     A                                      ' '1 ' ' 1' '2 ' '80' '90' '05' +
     A                                      ' 2' '3 ' ' 3' '4 ' ' 4' '5 ' ' 5')
     A                                      DSPATR(MDT)
     A  98        ERR1          70A    22  2MSGID(UPT2023 PTMF)
     A                                      DSPATR(HI)
