     A****************************************************************
     A*    PRTF NAME    : S@R06P                                     *
     A*    AUTHOR       : A1046  JOHNSON CHEN                        *
     A*    CREATE DATE  : 78/11/27                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : S@R062                                     *
     A*    SYSTEM       :泛太系統                                  *
     A*    SUBSYSTEM    :安全管制系統                              *
     A*    PURPOSE      :程式使用權檢核表列印                      *
     A****************************************************************
     A                                      REF(S@RF)
     A          R PH1                       SKIPB(2)
     A                                     1'泛太資訊科技開發股份有限公司'
     A                                    52'日期:'
     A            DDATE          6  0     60EDTCDE(Y)
     A                                    69'頁次:'
     A                                    76PAGNBR
     A                                      EDTCDE(2)
     A                                      SPACEA(1)
     A                                     1'程式使用權資料列印'
     A                                    23'(依使用者別)'
     A                                    52'時間:'
     A                                    60TIME
     A                                      EDTWRD('  :  :  ')
     A                                    70'<S@R06P>'
     A                                      SPACEA(2)
     A                                     3'使用者代號:'
     A            SU01      R             17
     A                                      SPACEA(1)
     A                                     2'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     3'程式代號'
     A                                    18'程式名稱'
     A                                    55'LIBRARY'
     A                                    64'子系統'
     A                                    72'使用權利'
     A                                      SPACEA(1)
     A                                     2'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A*
     A          R PD1                       SPACEA(1)
     A            SU02      R              3
     A            SP02      R             14
     A            SP03      R             55
     A            SP04      R             67
     A            SU04      R             76
     A*
     A          R PE1                       SPACEB(2)
     A                                    25'接下頁'
     A*
     A          R PE2                       SPACEB(2)
     A                                    10'S@R06P--->'
     A                                    25'報表結束'
