     A          R S@RFR
     A*****************************************************************
     A*          程式主檔  (S@SPPF)       KEY=SP01                  *
     A*****************************************************************
     A            SP01          10          COLHDG('程式代號')
     A            SP02          40O         COLHDG('程式名稱')
     A            SP03          10          COLHDG('所在LIBRARY')
     A            SP04           2          COLHDG('所在子系統')
     A            SP05           1          COLHDG('使用權隱藏')
     A                                      VALUES('Y' 'N')
     A            SPYY           6  0       COLHDG('異動日期')
     A            SPZZ          10          COLHDG('使用者代號')
     A*****************************************************************
     A*     終端機使用權檔(S@SRPF)       KEY=SR01+SR02             *
     A*****************************************************************
     A            SR01          10          COLHDG('使用者代號')
     A            SR02          10          COLHDG('終端機代號')
     A            SR03           1          COLHDG('使用權設定')
     A                                      VALUES('Y' 'N')
     A            SRYY           6  0       COLHDG('異動日期')
     A            SRZZ          10          COLHDG('使用者代號')
     A*****************************************************************
     A*      程式使用權主檔(S@SUPF)       KEY=SU01+SU02+SU03        *
     A*****************************************************************
     A            SU01          10          COLHDG('使用者代號')
     A            SU02          10          COLHDG('程式代號')
     A            SU03          10          COLHDG('所在LIBRARY')
     A            SU04           1          COLHDG('使用權設定')
     A                                      VALUES('Y' 'N')
     A            SUYY           6  0       COLHDG('異動日期')
     A            SUZZ          10          COLHDG('使用者代號')
     A*****************************************************************
