     A*********************************************
     A*          終端機使用權主檔(S@SRPF)           *
     A*********************************************
     A                                      REF(S@RF)
     A                                      UNIQUE
     A          R SR0
     A            SR01      R
     A            SR02      R
     A            SR03      R
     A            SRYY      R
     A            SRZZ      R
     A          K SR01
     A          K SR02
