     A*********************************************
     A*          程式說明暫存檔(S@TXPF)         *
     A*********************************************
     A                                      UNIQUE
     A          R TX0
     A            ODLBNM        10          COLHDG('LIBRARY')
     A            ODOBNM        10          COLHDG('PROGRAM NAME')
     A            ODOBTX        50O         COLHDG('PROGRAM TEXT')
     A          K ODOBNM
