     A                                      UNIQUE
     A          R TX0
     A            ATFILE        10A         COLHDG('FILE NAME')
     A            ATTXT         50A         COLHDG('TEXT')
     A          K ATFILE
