M001AI                                      201 2080DATE
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I                                      858 8650YMD8E
M001AC           *LIKE     DEFN DBGN3     OBGN3            *START KEY
B2MODC*          *LIKE     DEFN DBGN3     OBGN3 + 2        *START KEY
M`01DC*                    Z-ADD0         DATE    80
M001AC                     Z-ADD0         DATE    60
M001AC                     MOVE WSI35S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
M001DC*          WSI35S    IFGT WSI35E
M001AC           YMD8S     IFGT YMD8E
M001AC                     MOVE DATE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    I02DM
M001DC*                    PARM $EGMDY    S001I2  80
M001AC                     PARM $EGMDY    S001I2  60
M001DC*          DATE      PARM           S001O1  80
M001AC           DATE      PARM           S001O1  60
M001AC/COPY HBP2CVTR
