      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARA012                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/03/18                                      *
      * UPDATE DATE  : 81/04/18 BY STEPHANIE                         *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款作業                                 *
      * REMARK       :轉帳資料批次作業                             *
      ****************************************************************
     FARA012D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
B2MODI                                      111 1240$CHYMD
B2MODI                                      127 1320$EGMDY
     I********                              601 602 DSC01
B2MODI                                      611 6220WSC08
B2MODI                                      611 614 YY
B2MODI                                      615 622 MMDD
B2MODI                                      659 6640DSC08
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN98     PARM *IN98     IN98    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
     C                     END
  02-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         WSC08
|    C                     Z-ADD0         DSC08
|    C*上月最後一日
      *
B2MODC                     Z-ADD$CHYMD    CHKMDY  80
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE '01'      CHKMDY
B2VFYC                     MOVE '2001'    CHKMDY
B2INF *CVR3012 sev.30 Field CHKMDY contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     CALL 'P62'
B2MODC                     PARM CHKMDY    P6201I  80
     C                     PARM -1        P6202I  40
B2MODC           CHKMDY    PARM           P6201O  80
B2CHKC                     ADD  110000    CHKMDY
B2INF *CVR3012 sev.30 Field CHKMDY contains more than one year
      *
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM CHKMDY    S001I2  80
B2???C           DSC08     PARM           S001O1  80
B2INF *CVR3012 sev.30 Field S001O1 contains more than one year
B2INF *CVR3012 sev.30 Field DSC08 contains more than one year
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*單據日期檢查
|    C** DEFAULT VALUE
|    C                     CALL 'P09'
B2???C                     PARM DSC08     P0901I  80
B2INF *CVR3012 sev.30 Field DSC08 contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0911O  1
| 03-C           P0911O    IFEQ 'N'
|   C                     SETON                     619399
| 03*C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE DSC08     YY
B2NEWC                     MOVE DSC08     HB2@YY  2
B2CHKC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2CHKC                     MOVE HB2@Y4    YY
B2INF *CVR3012 sev.30 Field DSC08 contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2???C                     MOVELDSC08     MMDD
B2INF *CVR3012 sev.30 Field DSC08 contains more than one year
B2INF *CVR3012 sev.30 Field MMDD contains more than one year
| 03-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
