      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARA009                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/03/18                                      *
      * UPDATE DATE  : 81/04/18 BY STEPHANIE                         *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款作業                                 *
      * REMARK       :轉帳資料批次作業                             *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.02 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 010101 = *LOVAL/123199=*HIVAL
     A*---------------------------------------------------------------
      ****************************************************************
     FARAALF01IF  E           K        DISK
     FARA009D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I********                              601 602 DSC01
B2MODI                                      603 6100WSC39S
B2MODI                                      603 606 YYS
B2MODI                                      607 610 MMDDS
B2MODI                                      611 6180WSC39E
B2MODI                                      611 614 YYE
B2MODI                                      615 618 MMDDE
B2MODI                                      619 619 DSC33S
B2MODI                                      620 620 DSC33E
B2MODI                                      621 622 DSC31S
B2MODI                                      623 624 DSC31E
B2MODI                                      625 636 DSC02S
B2MODI                                      637 648 DSC02E
B2MODI                                      649 6540DSC39S
B2MODI                                      655 6600DSC39E
B2MODI                                      661 662 DSC01S
B2MODI                                      663 664 DSC01E
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
B2000C           *LIKE     DEFN AA02      WAA02
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN98     PARM *IN98     IN98    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C           *IN03     OREQ '0'
    C           *IN14     ANDEQ'1'
  03-C           *IN04     IFEQ '1'
    C                     EXSR RTNF4                      .CHECK      ?
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*****                MOVE *BLANK    DSC01
|    C                     Z-ADD0         WSC39S
|    C                     Z-ADD0         WSC39E
B2000C                     Z-ADD$EGMDY    DSC39S
B2000C                     Z-ADD$EGMDY    DSC39E
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC31S
|    C                     MOVE *BLANK    DSC31E
|    C                     MOVE *BLANK    DSC02S
|    C                     MOVE *BLANK    DSC02E
|    C                     MOVE *BLANK    DSC01S
|    C                     MOVE *BLANK    DSC01E
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司區間檢查
| 01-C           DSC01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC01E
| 01-C                     END
|    C*
| 02-C           DSC01S    IFGT DSC01E
|   C                     SETON                     669099
| 02-C                     END
|    C   99                GOTO END100
|    C*
|    C*通路區間檢查
| 03-C           DSC33E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC33E
| 03-C                     END
|    C*
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     639099
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*地區區間檢查
| 05-C           DSC31E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC31E
| 05-C                     END
|    C*
| 06-C           DSC31S    IFGT DSC31E
|   C                     SETON                     649099
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*單據日期檢查
|    C** DEFAULT VALUE
B2CHKC           DSC39S    IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M002MC                     Z-ADD010192    DSC39S
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
| 07-C                     END
B2CHKC           DSC39E    IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M002MC                     Z-ADD123129    DSC39E
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
| 08-C                     END
|    C**
|    C                     CALL 'P09'
B2???C*M001M               PARM DSC39S    P0901I  80
B2???C                     PARM DSC39S    P0901I  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|    C                     PARM           P0911O  1
| 09-C           P0911O    IFEQ 'N'
|   C                     SETON                     619399
| 09*C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE DSC39S    YYS
B2NEWC                     MOVE DSC39S    HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    YYS
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2000C                     MOVELDSC39S    MMDDS
| 09-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
B2???C*M001M               PARM DSC39E    P0901I  80
B2???C                     PARM DSC39E    P0901I  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|    C                     PARM           P0911O  1
| 10-C           P0911O    IFEQ 'N'
|   C                     SETON                     629399
| 10*C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE DSC39E    YYE
B2NEWC                     MOVE DSC39E    HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    YYE
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2000C                     MOVELDSC39E    MMDDE
| 10-C                     END
|    C   99                GOTO END100
|    C*日期區間檢查
B2000C           WSC39S    IFGT WSC39E
|   C                     SETON                     616291
|   C                     SETON                     99
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C*單據區間檢查
| 12-C           DSC02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC02E
| 12-C                     END
|    C*
| 13-C           DSC02S    IFGT DSC02E
|   C                     SETON                     659099
| 13-C                     END
|    C   99                GOTO END100
|    C*
B2000C                     MOVELWSC39S    WAA02
|    C*
|    C*日期是否小於開立日期
B2000C           WAA02     SETLLAA0
B2000C           WAA02     READEAA0                      46
| 14-C           *IN46     DOWEQ'0'
B2000C           AA09      IFGT WSC39S
|   C*                    SETON                     6162
|   C*                    SETON                     8899
|   C   99                GOTO END100
| 15-C                     END
B2000C           WAA02     READEAA0                      46
| 14-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           D#ROW     IFEQ 8
|   C           D#COL     ANDEQ36
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 01-C                     END
|    C*
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDEQ41
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 02-C                     END
|    C*
| 03-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE36
|   C           D#COL     ANDLE37
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31S
|   C                     GOTO ENDF4
| 03-C                     END
|    C*
| 04-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31E
|   C                     GOTO ENDF4
| 04-C                     END
|    C*
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
