     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARA006                                     *
     A*    AUTHOR       : A1118  PHILIP                              *
     A*    DATE WRITTEN : 81/03/27                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業系統                          *
     A*    PROCEDURE    :票據兌現處理 (A/U/D/I)                    *
     A****************************************************************
     FARAELF1 IF  E           K        DISK
     F            AE0                               KRENAMEAE0L
     FARAEPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FARABLF01IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FARA006D CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFLSR1
     F                                              KINFDS DSPFDS
     E*: FUNCTION DATA :
     E                    WFUN    5   7  6
     E*: A/U/D/I AUT
     E                    WA01        7  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I                                      140 140 $RMK02
 @   I**                                    141 141 $RMK03
     I**                                    162 1620$EVR
     I**                                    125 1270$CPY
     I**                                    598 5990$LPRT
     I**                                    501 505 $WRHUS
     I**                                    506 506 $PURID
     I**                                    507 508 $TRNID
     I                                      509 513 $APAUT
     I**                                    514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I            DS
     I                                        1  14 DAE03
     I                                        9  14 DAE031
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C*                    MOVE *BLANKS   APPSCR  6
     C*                    MOVE *BLANK    PARMI1 10
     C*                    MOVE *BLANK    PARMO1 10
     C*
     C           *LIKE     DEFN AE01      OBGN1            *START KEY
B2MODC           *LIKE     DEFN AE02      OBGN2 + 6        *START KEY
     C           *LIKE     DEFN AE03      OBGN3            *START KEY
     C*  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN AE01      BBGN1            *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN AE02      BBGN2 + 6        *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN AE02      BBGN2W- 2        *SUBFIL BUTTOM
     C           *LIKE     DEFN AE03      BBGN3            *SUBFIL BUTTOM
     C                     MOVE *BLANK    WBOTOM  1
     C           *LIKE     DEFN RRN1      WRRN1
     C           *LIKE     DEFN RRN1      WPRCD
     C           *LIKE     DEFN RRN1      DSPRCD
B2MODC           *LIKE     DEFN AE02      HAE02 + 6                    OM
     C           *LIKE     DEFN AE03      HAE03                        OM
B2000C           *LIKE     DEFN AE02      DBGN2W           *SUBFIL BUTTOM
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYAE     KLIST
     C                     KFLD           AE01
     C                     KFLD           AE02
     C                     KFLD           AE03
     C           KEYAE1    KLIST
     C                     KFLD           DAE01
     C                     KFLD           WAE02
     C                     KFLD           DAE03
     C           KEYAE3    KLIST
     C                     KFLD           DAE01
     C                     KFLD           WAE02
     C                     KFLD           HAE03
     C           KEYAE2    KLIST
     C                     KFLD           AE01
     C                     KFLD           WAE02
     C                     KFLD           AE03
     C           KEYBG     KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2W
     C                     KFLD           DBGN3
     C           KEYBG3    KLIST
     C                     KFLD           BBGN1
     C                     KFLD           BBGN2W
     C                     KFLD           BBGN3
     C           KEYAB     KLIST
     C                     KFLD           AB011
     C                     KFLD           AB021
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
     C*
     C                     MOVE *ALL'0'   *IN,60
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN120
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $RMK01    WA01,6
|    C                     MOVE $RMK02    WA01,7
|    C                     MOVE 'SCR001'  APPSCR  6
B2CHKC                     Z-ADD123199    DBGN2
B2INF *CVR3012 sev.30 Field DBGN2 contains more than one year
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD123199    OBGN2
B2VFYC                     Z-ADD20123199  OBGN2
B2INF *CVR3012 sev.30 Field OBGN2 contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C* 日期轉換
B2MODC                     Z-ADD0         DATE    80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM $EGMDY    S001I2  80
B2INF *CVR3012 sev.30 Field $EGMDY contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           DATE      PARM           S001O1  80
|    C*
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN120....F6(ADD)
      *==============================================================*
02===C           RTN120    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9699
| 01-C                     ELSE
|    C                     EXSR RTN200
| 02-C           DRRN1     IFGT 0
|   C           DRRN1     SUB  1         HRRN1
| 02-C                     END
|    C                     EXSR RTN191
|    C                     EXSR RTN192
| 01-C                     END
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*
B2???C           DBGN1     IFNE OBGN1
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN1 is not a date or year
B2INF *CVR3012 sev.30 Field DBGN2 contains more than one year
B2INF *CVR3012 sev.30 Field OBGN2 contains more than one year
B2INF *CVR0001 sev.00 Field DBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN3 is not a date or year
|   C           DBGN2     ORNE OBGN2
|   C           DBGN3     ORNE OBGN3
     C*
B2CHKC           DBGN2     IFEQ 0
B2INF *CVR3012 sev.30 Field DBGN2 contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     Z-ADD123199    DBGN2
B2INF *CVR3012 sev.30 Field DBGN2 contains more than one year
     C                     END
     C*
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
B2???C                     MOVE DBGN2     OBGN2
B2INF *CVR3012 sev.30 Field DBGN2 contains more than one year
B2INF *CVR3012 sev.30 Field OBGN2 contains more than one year
|   C                     MOVE DBGN3     OBGN3
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 4040*NF
| 01-C           *IN40     DOWEQ'0'                        *40 LOOP
|   C           *IN03     ANDEQ'0'
|   C           *IN12     ANDEQ'0'
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C* 日期轉換FOR SCREEN 2 KEY
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DAE02     S001I2  80
B2INF *CVR3012 sev.30 Field DAE02 contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           WAE02     PARM           S001O1  80
|   C*
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           DOPT1     ANDNE' '
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           UPD       TAG
|   C*
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   40*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
| 02-C           DOPT1     IFNE '1'
B2000C           KEYAE2    CHAINAE0L                 40
| 02-C                     END
|    C*兌現金額檢查
| 03-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
| 04-C           AE04      IFNE 0
|   C                     SETON                     608899
| 04-C                     END
| 03-C                     END
|    C   99                GOTO END180
|    C*兌現挑選
| 05-C           DOPT1     IFEQ '6'
|   C                     CALL 'ARA0061'
|   C                     PARM AE01      A006I1  2
|   C                     PARM AE03      A006I2 14
B2MODC                     PARM AE02      A006I3  80
|   C           *IN03     PARM *IN03     IN03    1
|   C           *IN12     PARM *IN12     IN12    1
|   C                     MOVE *BLANK    DOPT1
| 05-C                     END
|    C*兌現取消
| 06-C           DOPT1     IFEQ '7'
|   C                     CALL 'ARA0062'
|   C                     PARM AE01      A006I1  2
|   C                     PARM AE03      A006I2 14
B2MODC                     PARM AE02      A006I3  80
|   C           *IN03     PARM *IN03     IN03    1
|   C           *IN12     PARM *IN12     IN12    1
|   C                     MOVE *BLANK    DOPT1
| 06-C                     END
|    C*
05===C           END180    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1
|    C                     Z-ADD10        WPRCD
|    C                     Z-ADD0         DSPRCD
|    C           HRRN1     DIV  WPRCD     DSPRCD
|    C                     MULT WPRCD     DSPRCD
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C* 日期轉換FOR SCREEN 2 START KEY
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DBGN2     S001I2  80
B2INF *CVR3012 sev.30 Field DBGN2 contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           DBGN2W    PARM           S001O1  80
B2000C           KEYBG     SETLLAE0L
|    C                     MOVE DBGN1     BBGN1
B2???C                     MOVE DBGN2     BBGN2
B2INF *CVR3012 sev.30 Field DBGN2 contains more than one year
B2INF *CVR3012 sev.30 Field BBGN2 contains more than one year
|    C                     MOVE DBGN3     BBGN3
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
| 02-C*          BBGN1     IFNE DBGN1
|   C*          BBGN2     ORNE DBGN2
|   C*          BBGN3     ORNE DBGN3
|   C*          KEYBG3    SETGTAE0L
| 02-C*                    END
|   C                     EXSR RTN193
|   C*                    MOVE AE01      BBGN1
|   C*                    MOVE AE02      BBGN2
|   C*                    MOVE AE03      BBGN3
|   C*          *LOVAL    SETLLAE0L
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANK    DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN1      DOWLTDSPRCD
|   C                     READ AE0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     ADD  1         RRN1
|   C* 日期轉換
|   C                     Z-ADD0         DAE02   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM AE02      S001I2  80
B2???C           DAE02     PARM           S001O1  80
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field DAE02 contains more than one year
|   C* GET帳號說明
|   C                     MOVELAE01      AB011
|   C                     MOVE AE03      AB021
|   C           KEYAB     CHAINAB0                  40
|   C   40                MOVE *BLANKS   AB03
|   C*
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C           *LOVAL    SETLLAE0
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
11===C           RTN210    BEGSR
|    C*
|    C                     SETON                     3031  *ADD MSG
|    C                     EXSR RTN251                     *CLR FIELD
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C                     EXSR RTN253
|   C                     WRITEAE0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
12===C           RTN220    BEGSR
|    C*
|    C                     EXSR RTN251                     *CLR FIELD
B2000C           KEYAE2    CHAINAE0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     30
|   C                     SETON                     31    *CAN INPUT
|   C                     EXFMTDSPD2
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C* 入帳日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2MODC                     PARM HAE02     S001I2  80
B2MODC           WAE02     PARM           S001O1  80
B2000C           KEYAE3    CHAINAE0                  40
|   C                     EXSR RTN253
|   C  N40                UPDATAE0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
13===C           RTN230    BEGSR
|    C*
|    C                     SETOF                     3031  *DEL MSG
|    C                     EXSR RTN251                     *CLR FIELD
B2000C           KEYAE2    CHAINAE0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     GOTO DLTEND
| 01-C                     END
|    C                     EXSR RTN252                     *FIEL->SCRN
| 02-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 03-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 04-C           DLTFLG    IFEQ 'Y'
|   C                     DELETAE0
| 04-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
|   C*
| 02-C                     END
|    C*
13===C           DLTEND    ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
14===C           RTN240    BEGSR
|    C*
|    C                     SETOF                     3031  *INQ MSG
|    C                     EXSR RTN251                     *CLR FIELD
B2000C           KEYAE2    CHAINAE0L                 40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     GOTO INQEND
| 01-C                     END
|    C                     EXSR RTN252                     *FIEL->SCRN
| 02-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     Z-ADDRRN1      DRRN1
| 03-C                     END
|   C*
| 02-C                     END
|    C*
14===C           INQEND    ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
15===CSR         RTN251    BEGSR
|    C*
|    C                     MOVE *BLANK    DAE01
|    C                     MOVE *BLANK    #B03
B2000C                     Z-ADD$EGMDY    DAE02
|    C                     MOVE *BLANK    DAE03
|    C                     MOVE *BLANK    AB03
|    C                     Z-ADD0         HAE02
|    C                     MOVE *BLANK    HAE03
|    C                     Z-ADD0         AE04
|    C*
15===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
16===CSR         RTN252    BEGSR
|    C*
|    C*公司名稱
|    C                     MOVE AE01      DAE01
|    C           DAE01     CHAIN#B0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #B03
| 01-C                     END
|    C*銀行帳號
|    C                     MOVE AE03      DAE03
|    C                     MOVE AE03      HAE03
|    C* GET帳號說明
|    C                     MOVELAE01      AB011
|    C                     MOVE AE03      AB021
|    C           KEYAB     CHAINAB0                  40
|    C   40                MOVE *BLANKS   AB03
|    C* 入帳日期轉換
|    C                     Z-ADD0         DAE02   60
B2MODC                     Z-ADDAE02      WAE02   80
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM AE02      S001I2  80
B2???C           DAE02     PARM           S001O1  80
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field DAE02 contains more than one year
B2???C                     Z-ADDDAE02     HAE02
B2INF *CVR3012 sev.30 Field DAE02 contains more than one year
B2INF *CVR3012 sev.30 Field HAE02 contains more than one year
|    C*
16===CSR         END252    ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
17===CSR         RTN253    BEGSR
|    C*
|    C                     MOVE DAE01     AE01
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DAE02     S001I2  80
B2INF *CVR3012 sev.30 Field DAE02 contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           AE02      PARM           S001O1  80
|    C                     MOVE DAE03     AE03
| 01-C           DOPT1     IFEQ '1'
|   C                     Z-ADD0         AE04
| 01-C                     END
|    C*
B2000C                     Z-ADDDATE      AEXX
B2000C                     TIME           AEYY
|    C                     MOVE $USER     AEZZ
|    C*
17===CSR                   ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' SCREEN
     C*==============================================================*
18===CSR         RTN280    BEGSR
|    C*
|    C*公司檢查
| 01-C           DOPT1     IFEQ '1'
| 02-C           DAE01     IFEQ *BLANK
|   C                     SETON                     609399
| 02*C                     ELSE
|   C           DAE01     CHAIN#B0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     SETON                     609299
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END280
|    C*帳戶號碼檢查
| 04-C           DAE03     IFEQ *BLANKS
|   C                     MOVE *BLANKS   AB03
|   C                     SETON                     619399
| 04*C                     ELSE
|   C                     MOVELDAE01     AB011
|   C                     MOVE DAE03     AB021
|   C           KEYAB     CHAINAB0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   AB03
|   C                     SETON                     619299
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END280
|    C* CHK 銀行入帳日期
B2CHKC           DAE02     IFEQ 0
B2INF *CVR3012 sev.30 Field DAE02 contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     629399
| 06*C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DAE02     P0901I  80
B2INF *CVR3012 sev.30 Field DAE02 contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     629099
| 07*C                     ELSE
|   C* 入帳日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DAE02     S001I2  80
B2INF *CVR3012 sev.30 Field DAE02 contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           WAE02     PARM           S001O1  80
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END280
|    C*
B2???C           DAE02     IFNE HAE02
B2INF *CVR3012 sev.30 Field DAE02 contains more than one year
B2INF *CVR3012 sev.30 Field HAE02 contains more than one year
B2INF *CVR0001 sev.00 Field DAE03 is not a date or year
B2INF *CVR0001 sev.00 Field HAE03 is not a date or year
|   C           DAE03     ORNE HAE03
B2000C           KEYAE1    CHAINAE0                  40
| 09-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '2'
| 10-C           *IN40     IFEQ '0'
|   C                     SETON                     606162
|   C                     SETON                     9199
| 10-C                     END
| 09*C                     ELSE
| 11-C           *IN40     IFEQ '1'
|   C                     SETON                     606162
|   C                     SETON                     9299
| 11-C                     END
| 09-C                     END
| 08-C                     END
|    C   99                GOTO END280
|    C*
18===CSR         END280    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
19===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C*
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           APPSCR    IFEQ 'SCR002'
|   C**
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE18
|   C           D#COL     ANDLE31
|   C                     CALL 'WDS0141'
|   C           DAE031    PARM DAE031    PARMO1  9
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
19===C           ENDF4     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
20===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
21===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
21===C                     ENDSR'*DETC'
**
新增修改      刪除查詢
