     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARA016                                     *
     A*    AUTHOR       : TINA                                       *
     A*    DATE WRITTEN : 82/08/25                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業系統                          *
     A*    PROCEDURE    :人工發票控制新增　 (U/I)                  *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 123199 = 123129
     A*---------------------------------------------------------------
     A* M004      | 00.05.02 |菸酒稅實施，修改應稅
     A*---------------------------------------------------------------
     A****************************************************************
     FSOSIPF  IF  E           K        DISK
     FSOSJPF  IF  E           K        DISK
     FSOSILF02IF  E           K        DISK
     F            SI0                               KRENAMESI0L
     FSOSSPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMEPF  IF  E           K        DISK
     FSOSGPF  IF  E           K        DISK
     FSOSEPF  IF  E           K        DISK
     FSOSCPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FARA0161DCF  E                    WORKSTN
     F                                        RRN1  KSFILE SFLSR1
     F                                              KINFDS DSPFDS
     F                                              KINFSR ERRSR
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        5  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
M001AI                                      201 2080DATE
 @   I**                                    139 139 $RMK01
 @   I**                                    140 140 $RMK02
 @   I**                                    141 141 $RMK03
     I**                                    162 1620$EVR
     I**                                    125 1270$CPY
     I**                                    598 5990$LPRT
     I**                                    501 505 $WRHUS
     I**                                    506 506 $PURID
     I**                                    507 508 $TRNID
     I                                      509 513 $APAUT
     I**                                    514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     IDA02        DS
     I                                        1   43DUTY
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*原因代碼
     I            DS
     I                                        1   3 DSS16
     I                                        1   1 DSS16L
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C           *LIKE     DEFN SI01      OBGN1            *START KEY
B2000C           *LIKE     DEFN SI21      OBGN0 - 2        *START KEY
     C           *LIKE     DEFN SI12      OBGN2            *START KEY
     C           *LIKE     DEFN SI13      OBGN3            *START KEY
     C           *LIKE     DEFN SI02      OBGN4            *START KEY
     C*  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN SI01      BBGN1            *SUBFIL BUTTOM
B2000C           *LIKE     DEFN SI21      BBGN0 - 2        *SUBFIL BUTTOM
     C           *LIKE     DEFN SI12      BBGN2            *SUBFIL BUTTOM
     C           *LIKE     DEFN SI13      BBGN3            *SUBFIL BUTTOM
     C           *LIKE     DEFN SI02      BBGN4            *SUBFIL BUTTOM
     C*
B2000C           *LIKE     DEFN SI21      SBGN0            *START KEY
B2000C           *LIKE     DEFN SI21      TBGN0            *START KEY
     C*
     C                     MOVE *BLANK    WBOTOM  1
     C           *LIKE     DEFN RRN1      WRRN1
     C           *LIKE     DEFN RRN1      WPRCD
     C           *LIKE     DEFN RRN1      DSPRCD
     C*
     C*==============================================================*
     C*                    PLIST    PARAMETER  GET
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYSI     KLIST
     C                     KFLD           SI01
     C                     KFLD           SI02
     C           KEYSS     KLIST
     C                     KFLD           DSS01
     C                     KFLD           DSS02
     C           KEYSI0    KLIST
     C                     KFLD           SI01
     C                     KFLD           RSI21
     C                     KFLD           SI12
     C                     KFLD           SI13
     C                     KFLD           SI02
     C           KEYSD     KLIST
     C                     KFLD           SI10
     C                     KFLD           SJ03
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYBG     KLIST
     C                     KFLD           DBGN1
     C                     KFLD           SBGN0
     C                     KFLD           DBGN2
     C                     KFLD           DBGN3
     C                     KFLD           DBGN4
     C           KEYBG3    KLIST
     C                     KFLD           BBGN1
     C                     KFLD           TBGN0
     C                     KFLD           BBGN2
     C                     KFLD           BBGN3
     C                     KFLD           BBGN4
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
     C*
     C                     MOVE *ALL'0'   *IN,60
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C           *IN12     ANDEQ'0'
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR  6
M002MC                     Z-ADD123129    DBGN0
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M002MC                     Z-ADD123129    OBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     Z-ADD0         SI21
|    C* 日期轉換
B2MODC*M001D               Z-ADD0         DATE    80
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
B2???C*                    PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC*M001D     DATE      PARM           S001O1  80
|    C*
|    C           *NAMVAR   DEFN           DA02
|    C                     IN   *NAMVAR
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
B2CHKC           DBGN0     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M002MC                     Z-ADD123129    DBGN0
| 01-C                     END
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC           DBGN1     IFNE OBGN1
B2OLDC           DBGN0     ORNE OBGN0
B2OLDC           DBGN2     ORNE OBGN2
B2OLDC           DBGN3     ORNE OBGN3
B2OLDC           DBGN4     ORNE OBGN4
B2NEWC*M001D               MOVE DBGN0     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    H@8N01  80
B2NEWC*          DBGN1     IFNE OBGN1
B2NEWC*          H@8N01    ORNE OBGN0
B2NEWC*          DBGN2     ORNE OBGN2
B2NEWC*          DBGN3     ORNE OBGN3
B2NEWC*M001D     DBGN4     ORNE OBGN4
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN4 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN4 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC                     MOVE DBGN0     OBGN0
B2NEWC*M001D               MOVE DBGN0     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*M001D               MOVE HB2@T8    OBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN2     OBGN2
|   C                     MOVE DBGN3     OBGN3
|   C                     MOVE DBGN4     OBGN4
| 02*C                     ELSE
|   C                     EXSR RTN171
| 03-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 03-C                     END
| 02-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 4040*NF
| 01-C           *IN40     DOWEQ'0'                        *40 LOOP
|   C           *IN03     ANDEQ'0'
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           UPD       TAG
|   C*
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   40*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
04===C           END180    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1
|    C                     Z-ADD10        WPRCD
|    C                     Z-ADD0         DSPRCD
|    C           HRRN1     DIV  WPRCD     DSPRCD
|    C                     MULT WPRCD     DSPRCD
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C* 日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DBGN0     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    SBGN0
B2000C           KEYBG     SETLLSI0L
|    C                     MOVE DBGN1     BBGN1
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC                     MOVE DBGN0     BBGN0
B2NEWC*M001D               MOVE DBGN0     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*M001D               MOVE HB2@T8    BBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     MOVE DBGN2     BBGN2
|    C                     MOVE DBGN3     BBGN3
|    C                     MOVE DBGN4     BBGN4
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC           BBGN1     IFNE DBGN1
B2OLDC           BBGN0     ORNE DBGN0
B2OLDC           BBGN2     ORNE DBGN2
B2OLDC           BBGN3     ORNE DBGN3
B2OLDC           BBGN4     ORNE DBGN4
B2NEWC*M001D               MOVE DBGN0     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    H@8N01  80
B2NEWC*          BBGN1     IFNE DBGN1
B2NEWC*          BBGN0     ORNE H@8N01
B2NEWC*          BBGN2     ORNE DBGN2
B2NEWC*          BBGN3     ORNE DBGN3
B2NEWC*M001D     BBGN4     ORNE DBGN4
B2INF *CVR0001 sev.00 Field BBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field BBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field BBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field BBGN4 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN4 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2MODC                     PARM BBGN0     S001I2  60
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    TBGN0
B2000C           KEYBG3    SETGTSI0L
| 02-C                     END
|   C                     EXSR RTN193
|   C* 日期轉換
M001AC                     Z-ADDSI21      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           BBGN0     PARM           S001O1  60
|   C                     MOVE SI01      BBGN1
|   C                     MOVE SI12      BBGN2
|   C                     MOVE SI13      BBGN3
|   C                     MOVE SI02      BBGN4
|   C           *LOVAL    SETLLSI0L
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANK    DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN1      DOWLTDSPRCD
|   C                     READ SI0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
      *須已送貨確認
|   C           SI10      CHAINSC0                  41
|   C           SI11      CHAINSE0                  40
B2CHKC           *IN40     IFEQ '0'
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2INF *CVR0001 sev.00 Field SC03 is not a date or year
B2INF *CVR0001 sev.00 Field SC13 is not a date or year
|   C           SE24      ANDNE0
     C           *IN41     OREQ '0'
     C           SC03      ANDEQ'S3'
     C           SC13      ANDEQ'V'
|   C*已存在SOSSPF者不可出現
|   C           KEYSI     CHAINSS0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     ADD  1         RRN1
B2CHKC           SI21      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C* 日期轉換
M001AC                     Z-ADDSI21      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           DSI21     PARM           S001O1  60
| 05*C                     ELSE
|   C                     Z-ADD0         DSI21
| 05-C                     END
|   C                     WRITESFLSR1
| 04-C                     END
| 03-C                     END
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C*                    SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
09===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'5'       RTN250           *INQ
| 01-C                     END
|    C           *LOVAL    SETLLSI0L
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
10===C           RTN210    BEGSR
|    C*
|    C                     SETON                     31
B2MODC                     Z-ADDSI21      RSI21   80
|    C           KEYSI     CHAINSI0                  40
|    C                     EXSR RTN251                     *CLR FIELD
|    C                     EXSR RTN252                     *FILE->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C                     CAS            RTN280           *CHK
| 03-C                     END
| 04-C           *IN05     IFNE '1'
|   C           *IN99     ANDEQ'0'
|   C                     EXSR RTN253                     *SCR->FILE
|   C                     WRITESS0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
10===C           ADDEND    ENDSR
      *==============================================================*
      *          RTN250....訂單明細
      *==============================================================*
11===C           RTN250    BEGSR
|    C*
|    C*單據號碼
| 01-C           SI11      IFEQ *ALL'*'
|   C                     MOVE SI10      SI11W  12
| 01*C                     ELSE
|   C                     MOVE SI11      SI11W
| 01-C                     END
|    C*
M001AC                     Z-ADDSI21      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           DSI21     PARM           S001O1  60
|    C                     CALL 'ARA0042'
|    C                     PARM SI11W     A042I1 12
B2???C                     PARM DSI21     A042I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|    C           *IN03     PARM           IN03    1
|    C                     MOVE 'SCR001'  APPSCR
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     Z-ADDRRN1      DRRN1
| 02-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
12===CSR         RTN251    BEGSR
|    C*
|    C                     Z-ADD0         DSS06C
|    C                     Z-ADD0         DSS22C
|    C                     Z-ADD0         DSS25
M004AC                     Z-ADD0         DSS31
M004AC                     Z-ADD0         DSS32
M004AC                     Z-ADD0         DIFSA
M004AC                     Z-ADD0         DIFTX
M004AC                     Z-ADD0         DIF25
|    C                     Z-ADD0         DSS26
|    C                     Z-ADD0         DSS27
M004AC                     Z-ADD0         DSS29
M004AC                     Z-ADD0         DSS30
|    C                     Z-ADD0         DSS28
|    C                     MOVE *BLANK    DSS01
|    C                     MOVE *BLANK    #B03A
|    C                     MOVE *BLANK    DSS02
|    C                     MOVE *BLANK    DSS03
|    C                     MOVE *BLANK    DSS04
|    C                     MOVE *BLANK    #B03B
|    C                     MOVE *BLANK    DSS08
|    C                     MOVE *BLANK    DSS09
|    C                     MOVE *BLANK    ME04
|    C                     MOVE *BLANK    DSS16
|    C                     MOVE *BLANK    #A03
|    C                     MOVE *BLANK    DSS36
|    C                     MOVE *BLANK    DSS20
|    C                     MOVE *BLANK    DSS11
|    C*
12===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
13===CSR         RTN252    BEGSR
|    C*
|    C                     MOVELSI01      DSS01
|    C                     MOVELSI02      DSS02
|    C                     MOVELSI01      DSS03
|    C                     MOVELSI12      DSS08
|    C                     MOVELSI13      DSS09
|    C                     MOVELSI25      DSS27
M004AC                     Z-ADDSI24      DSS30
M004AC                     Z-ADDSI23      DSS32
|    C*公司名稱
|    C           DSS01     CHAIN#B0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #B03A
| 01-C                     END
|    C*公司名稱
|    C           DSS03     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #B03B
| 02-C                     END
|    C*原因代碼
|    C                     MOVEL'MANVOID' #A01
|    C                     MOVELDSS16     #A02
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #A03
| 03-C                     END
|    C*送貨日期
B2CHKC           SI06      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001AC                     Z-ADDSI06      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           DSS06C    PARM           S001O1  60
| 04*C                     ELSE
|   C                     Z-ADD0         DSS06C
| 04-C                     END
B2000C                     Z-ADDDSS06C    DSS22C
|    C*客戶名稱
|    C                     MOVELDSS08     ME01
|    C                     MOVELDSS09     ME02
|    C           KEYME     CHAINME0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    ME04
| 05*C                     ELSE
|   C                     MOVE ME04      ME04
| 05-C                     END
|    C*
|    C           KEYSI     SETLLSJ0
|    C           KEYSI     READESJ0                      41
| 06-C           *IN41     DOWEQ'0'
|   C                     ADD  SJ07      DSS28
|   C*
|   C           KEYSI     READESJ0                      41
| 06-C                     END
|    C*
13===CSR         END252    ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
14===C           RTN253    BEGSR
|    C*
|    C                     MOVELDSS01     SS01
|    C                     MOVELDSS02     SS02
|    C                     MOVELDSS03     SS03
|    C                     MOVELDSS04     SS04
|    C                     MOVELDSS08     SS08
|    C                     MOVELDSS09     SS09
|    C                     MOVELDSS16     SS16
|    C                     MOVELDSS36     SS36
|    C                     MOVELDSS20     SS20
|    C                     MOVELSI10      SS10
|    C                     MOVELDSS11     SS11
|    C                     Z-ADDDSS27     SS27
M004AC                     Z-ADDDSS30     SS30
|    C                     Z-ADDDSS28     SS28
|    C                     Z-ADDDSS25     SS25
M004AC                     Z-ADDDSS29     SS29
M004AC                     Z-ADDDSS32     SS32
M004AC                     Z-ADDDSS31     SS31
|    C                     Z-ADDDSS26     SS26
B2000C                     Z-ADDSI21      SS21
B2000C                     Z-ADDSI06      SS06
B2000C                     Z-ADDSI35      SS35
|    C*
|    C*人工發票日期
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSS22C    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    SS22
|    C*
B2000C                     Z-ADDDATE      SSXX
B2000C                     TIME           SSYY
|    C                     MOVE $USER     SSZZ
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' SCREEN
     C*==============================================================*
15===CSR         RTN280    BEGSR
|    C*AVOID DUPLICATE
|    C           KEYSS     SETLLSS0                      41
| 01-C           *IN41     IFEQ '1'
|   C                     SETON                     609799
| 01-C                     END
|    C*
|    C*原因不可空白
| 02-C           DSS16     IFEQ *BLANK
|   C                     SETON                     649399
| 02-C                     END
|    C   99                GOTO END280
M004AC*
M004AC           SI22      IFEQ 'D'                        應稅
M004AC           DSS29     IFEQ 0
M004AC           DSS31     MULT DUTY      DSS29     H
M004AC                     ELSE
M004AC           DUTY      ADD  0.005     WTY1    53
M004AC           DUTY      SUB  0.005     WTY2    53
M004AC           DSS31     MULT WTY1      WR1     90H
M004AC           DSS31     MULT WTY2      WR2     90H
M004AC           DSS29     IFLT WR2
M004AC           DSS29     ORGT WR1
M004AC                     SETON                     996983
M004AC                     END
M004AC                     END
M004AC                     END
M004AC           DSS31     ADD  DSS29     DSS25
M004AC   99                GOTO END280
|    C*
M004AC           DSS04     IFNE *BLANKS
M004AC           DSS29     IFNE 0
M004AC           SI22      IFNE 'D'                        應稅
M004AC                     SETON                     698499
M004AC                     END
M004AC                     END
M004AC                     END
M004AC   99                GOTO END280
     C*
|    C                     MOVEL'MANVOID' #A01
|    C                     MOVELDSS16     #A02
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     SETON                     648999
| 03-C                     END
|    C   99                GOTO END280
|    C*人工發票號碼空白
| 04-C           DSS04     IFEQ *BLANKS
B2CHKC           DSS22C    IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     658799
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END280
|    C*
| 06-C           DSS04     IFEQ *BLANKS
| 07-C           DSS11     IFNE *BLANKS
|   C                     SETON                     688799
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END280
|    C*
| 08-C           DSS04     IFEQ *BLANKS
| 09-C           DSS25     IFNE 0
|   C                     SETON                     668799
| 09-C                     END
| 08-C                     END
|    C   99                GOTO END280
|    C*
M004AC           DSS04     IFEQ *BLANKS
M004AC           DSS29     IFNE 0
M004AC                     SETON                     698799
M004AC                     END
M004AC                     END
M004AC   99                GOTO END280
|    C*
M004AC           DSS04     IFEQ *BLANKS
M004AC           DSS31     IFNE 0
M004AC                     SETON                     628799
M004AC                     END
M004AC                     END
M004AC   99                GOTO END280
|    C*
| 10-C           DSS04     IFEQ *BLANKS
| 11-C           DSS26     IFNE 0
|   C                     SETON                     678799
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END280
|    C*
|    C*人工發票號碼不為空白
| 12-C           DSS04     IFNE *BLANKS
B2CHKC           DSS22C    IFEQ 0
|   C                     SETON                     659399
| 13-C                     END
| 12-C                     END
|    C   99                GOTO END280
|    C*日期轉換
B2CHKC           DSS22C    IFNE 0
|   C                     CALL 'P09'
B2???C                     PARM DSS22C    P0901I  60
|   C                     PARM           P0901O  1
| 15-C           P0901O    IFEQ 'N'
|   C                     SETON                     659099
| 15-C                     END
| 14-C                     END
|    C   99                GOTO END280
|    C*原因代碼為Ｒ，發票號碼不為空白者，退貨單號不可空白
| 16-C           DSS16L    IFEQ 'R'
|   C           DSS04     ANDNE*BLANKS
|   C           DSS11     ANDEQ*BLANKS
|   C                     SETON                     689399
| 16-C                     END
|    C   99                GOTO END280
| 17-C           DSS16L    IFNE 'R'
|   C           DSS11     ANDNE*BLANKS
|   C                     SETON                     688799
| 17-C                     END
|    C   99                GOTO END280
|    C*CHK退貨單號
| 18-C           DSS11     IFNE *BLANKS
|   C           DSS11     SETLLSG0                      40
| 19-C           *IN40     IFEQ '0'
|   C                     SETON                     688999
| 19-C                     END
| 18-C                     END
|    C   99                GOTO END280
|    C*
| 20-C           DSS04     IFNE *BLANKS
| 21-C           DSS25     IFEQ 0
|   C                     SETON                     668699
| 21-C                     END
| 20-C                     END
|    C   99                GOTO END280
|    C*
|    C*原因S01者原發票和人工發金額控制
| 22-C           DSS16     IFEQ 'S01'
|   C           DSS27     ADD  DSS28     WORK1  110
| 23-C           DSS26     IFEQ 0
|   C           WORK1     SUB  DSS25     DSS26
| 23-C                     END
|   C           DSS25     ADD  DSS26     WORK2  110H
| 24-C           WORK1     IFNE WORK2
|   C                     SETON                     6667
|   C                     SETON                     8599
| 24-C                     END
| 22-C                     END
M004AC           DSS32     SUB  DSS31     DIFSA
M004AC           DSS30     SUB  DSS29     DIFTX
M004AC           DSS27     SUB  DSS25     DIF25
|    C*
|    C*
15===CSR         END280    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
16===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C*
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
|    C* 原因
| 01-C           APPSCR    IFEQ 'SCR002'
| 02-C*M004M     D#ROW     IFEQ 11
M004MC           D#ROW     IFEQ 8
|   C           D#COL     ANDGE18
|   C           D#COL     ANDLE20
|   C                     CALL 'WDS012'
|   C                     PARM 'MANVOID 'PARMI1
|   C           DSS16     PARM DSS16     PARMO1
| 02-C                     END
| 01-C                     END
|    C*
16===C           ENDF4     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
17===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
18===C           ERRSR     BEGSR
|    C*
|    C*                    CALL 'P50'
|    C*          DMSG      PARM           P5001O 78
|    C*                    SETON                     9799
|    C*
18===C*                    ENDSR'*DETC'
*ERR*C                     ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
**
新增　　      　　查詢
