      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARA014                                        *
      * AUTHER       : D910074 TINA                                  *
      * CREATE DATE  : 82/03/03                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款系統                                 *
      *  REMARK      :沖帳批次作業　　　                           *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 99.08.20 | OLD SOURCD LOSE RE-MODIFY
     A*---------------------------------------------------------------
      ****************************************************************
     FARACPF  IF  E           K        DISK
     FARA014D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FPA#BPF  IF  E           K        DISK
     FARABLF01IF  E           K        DISK
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
M001MI                                      201 2080DATE
     I                                      601 602 DAC01
     I                                      603 604 DAD10S
     I                                      605 606 DAD10E
     I                                      607 611 DAC02
     I                                      612 6200DAC08
     I                                      621 634 DAC12
     I                                      629 634 DAC121
     I                                      637 6420DAC04
B2MODI                                      643 6500WAC04
B2MODI                                      653 656 FAC03
B2MODI                                      657 658 FAC05
B2MODI                                      659 672 FAC06
     I*DAC01第一碼
     I                                      601 601 AA
     I*DAD10S第一碼
     I                                      603 603 BB
     I*DAD10E第一碼
     I                                      605 605 CC
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN98     PARM *IN98     IN98    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYAC     KLIST
     C                     KFLD           DAC01
     C                     KFLD           DAC02
     C                     KFLD           FAC03
     C                     KFLD           WAC04
     C                     KFLD           FAC05
     C                     KFLD           FAC06
     C           KEYAB     KLIST
     C                     KFLD           AB011
     C                     KFLD           AB021
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C*
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03-C                     END
  01-C                     END
     C*
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL*BLANKS   DAC01
|    C                     MOVEL*BLANKS   DAD10S
|    C                     MOVEL*BLANKS   DAD10E
|    C                     MOVEL'A0002'   DAC02
|    C                     MOVEL*BLANKS   DAC12
|    C                     Z-ADD$EGMDY    DAC04
|    C                     Z-ADD0         DAC08
M001AC                     Z-ADD0         W6      60
B2MODC*M001D               Z-ADD0         DATE    80
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*固定之KEY值
|    C                     MOVEL*BLANKS   FAC03   4
|    C                     MOVEL'20'      FAC05   2
|    C                     MOVEL*BLANKS   FAC06  14
|    C*M001D               CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
|    C*                    PARM $EGMDY    S001I2  60
B2MODC*M001D     DATE      PARM           S001O1  80
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*收款公司
| 01-C           DAC01     IFEQ *BLANKS
|   C                     SETON                     609599
| 01*C                     ELSE
|   C           DAC01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     SETON                     608499
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END100
|    C*沖帳公司
| 03-C           DAD10S    IFEQ *BLANKS
|   C                     SETON                     619599
| 03-C                     END
|    C           DAD10S    CHAIN#B0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     SETON                     618499
| 04-C                     END
|    C   99                GOTO END100
|    C*
| 05-C           DAD10E    IFEQ *BLANKS
|   C                     SETON                     629599
| 05-C                     END
|    C           DAD10E    CHAIN#B0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     SETON                     628499
| 06-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           DAD10S    IFGT DAD10E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*沖帳公司之第一碼需與收款公司之第一碼相同
| 08-C           BB        IFNE AA
|   C           CC        ORNE AA
|   C                     SETON                     6162
|   C                     SETON                     8599
| 08-C                     END
|    C   99                GOTO END100
|    C*收款金額
| 09-C           DAC08     IFEQ 0
|   C                     SETON                     639599
| 09-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|   C*
|   C                     CALL 'P09'
|   C                     PARM DAC04     P0901I  60
|   C                     PARM           P0901O  1
| 25-C           P0901O    IFEQ 'N'
|   C                     SETON                     649399
| 25-C                     END
|   C   99                GOTO END100
      *
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC04     S001I2  60
B2000C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WAC04
|    C**入帳帳號 M002 重新啟用
| 10-C*M002M     DAC12     IFEQ *BLANKS
M002MC           DAC121    IFEQ *BLANKS
|   C                     SETON                     659599
| 10-C                     END
|    C   99                GOTO END100
     C*
     C                     MOVELDAC01     AB011
     C                     MOVELDAC121    AB021
|    C** M002 重新啟用
|    C           KEYAB     CHAINAB0                  40
| 11-C           *IN40     IFEQ '1'
|   C                     SETON                     8465
|   C                     SETON                     99
M002AC                     ELSE
M002AC                     MOVELAB02      DAC12
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C*CHECK AC0是否己存在同KEY值之收款
B2000C           KEYAC     CHAINAC0                  40
| 12-C           *IN40     IFEQ '0'
|   C                     SETON                     9499
|   C                     SETON                     606162
|   C                     SETON                     63
| 12-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE37
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS0141'
|   C                     PARM           DAC121
M002AC                     SETOF                     659599
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          RTNOUTLDA ... OUTLDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
