     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARA0052                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/03/26                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :收款沖帳處理－沖帳修改                    *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 123199 = 123129
     A*---------------------------------------------------------------
     A****************************************************************
     FARACPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSIPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FARADPF  UF  E           K        DISK
     FARADLF09IF  E           K        DISK
     F            AD0                               KRENAMEAD0L
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSOSJPF  IF  E           K        DISK
     FARAKLF01IF  E           K        DISK
     FARA0052DCF  E                    WORKSTN
     F*                                             KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
M001AI                                      201 2080$EG8
     I*           DS
     I*                                       1   1 DOPT1
     I*                                       1   10WNUM
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WAC01     PARM           A005I1  2        公司別
     C           WAC02     PARM           A005I2  5        客戶代號
     C           WAC03     PARM           A005I3  4        分店代號
B2MODC           WAC04     PARM           A005I4  80       收款日期
     C           WAC05     PARM           A005I5  2        收款種類
     C           WAC06     PARM           A005I6 14        票據號碼
     C                     PARM *IN03     IN03    1
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C*
B2MODC           *LIKE     DEFN DBGN0     OBGN0            *START KEY
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
B2MODC           *LIKE     DEFN DBGN0     BBGN0 + 2        *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C*
B2MODC           *LIKE     DEFN DBGN0     SBGN0 + 2        *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN0     TBGN0 + 2        *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN0     UBGN0            *SUBFIL BUTTOM
     C*
     C           *LIKE     DEFN AC01      WAC01                        OM
     C           *LIKE     DEFN AC02      WAC02                        OM
     C           *LIKE     DEFN AC03      WAC03                        OM
B2000C           *LIKE     DEFN AC04      WAC04                        OM
     C           *LIKE     DEFN AC05      WAC05                        OM
     C           *LIKE     DEFN AC06      WAC06                        OM
     C           *LIKE     DEFN AC10      WAC10                        OM
B2000C           *LIKE     DEFN AD12      WAD12                        OM
B2000C           *LIKE     DEFN AD12      KAD12                        OM
     C*
     C           *LIKE     DEFN AD08      WAD08                        OM
     C           *LIKE     DEFN AD08      WTAD08                       OM
     C           *LIKE     DEFN AD08      WKAD8                        OM
M001AC                     Z-ADD0         WSB0    60
M001AC                     Z-ADD0         WWAD12  60
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYAC     KLIST
     C                     KFLD           WAC01
     C                     KFLD           WAC02
     C                     KFLD           WAC03
     C                     KFLD           WAC04
     C                     KFLD           WAC05
     C                     KFLD           WAC06
     C           KEYSI     KLIST
     C                     KFLD           AD10
     C                     KFLD           AD07
     C           KEYAD2    KLIST
     C                     KFLD           WAC01
     C                     KFLD           WAC02
     C                     KFLD           WAC03
     C                     KFLD           WAC04
     C                     KFLD           WAC05
     C                     KFLD           WAC06
     C                     KFLD           SBGN0
     C                     KFLD           DBGN1
     C           KEYADB    KLIST
     C                     KFLD           WAC01
     C                     KFLD           WAC02
     C                     KFLD           WAC03
     C                     KFLD           WAC04
     C                     KFLD           WAC05
     C                     KFLD           WAC06
     C                     KFLD           TBGN0
     C                     KFLD           BBGN1
     C                     KFLD           KAD12
     C           KEYAD4    KLIST
     C                     KFLD           WAC01
     C                     KFLD           WAC02
     C                     KFLD           WAC03
     C                     KFLD           WAC04
     C                     KFLD           WAC05
     C                     KFLD           WAC06
     C                     KFLD           AD07
     C                     KFLD           AD10
     C                     KFLD           AD12
     C           KEYAD5    KLIST
     C                     KFLD           WAC01
     C                     KFLD           WAC02
     C                     KFLD           WAC03
     C                     KFLD           WAC04
     C                     KFLD           WAC05
     C                     KFLD           WAC06
     C           KEY#B     KLIST
     C                     KFLD           AC01
     C           KEYME     KLIST
     C                     KFLD           AC02
     C                     KFLD           AC03
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C           *IN12     ANDEQ'0'                        *12    OFF
    C*
    C                     EXSR RTN195                     *EXFMT
  02-C           *IN03     IFEQ '0'
    C           *IN12     ANDEQ'0'
  03-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  03-C                     END
  02-C                     END
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE 'SCR001'  APPSCR
B2MODC                     Z-ADD0         DATE    80
M001AC                     Z-ADD$EG8      DATE
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
B2???C*                    PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC*          DATE      PARM           S001O1  80
|    C***
|    C* GET HEADING
B2000C           KEYAC     CHAINAC0                  40
|    C* GET公司名稱／客戶簡稱
|    C           KEY#B     CHAIN#B0                  40
|    C   40                MOVE *BLANKS   #B03
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANKS   ME04
|    C* GET日期轉換
M001AC                     Z-ADDAC04      WWAC04  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WWAC04    S001I2  60
B2MODC           DAC04     PARM           S001O1  60
M001AC                     Z-ADDAC07      WWAC07  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WWAC07    S001I2  60
B2MODC           DAC07     PARM           S001O1  60
|    C* GET種類
|    C                     MOVE *BLANKS   MTYPE
|    C                     MOVE *BLANK    #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVEL'COLLECT' #A01
|    C                     MOVELAC05      #A02
|    C           KEY#A     CHAIN#A0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      MTYPE
| 04-C                     END
|    C*
|    C* GET舊總沖銷金額
|    C                     Z-ADD0         WTAD08
M002MC                     Z-ADD123129    DBGN0
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD123199    SBGN0
M002MC                     Z-ADD123129    SBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M002MC                     Z-ADD123129    OBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2000C           KEYAD5    SETLLAD0
B2000C           KEYAD5    READEAD0                      44
| 05-C           *IN44     DOWEQ'0'
|   C                     ADD  AD08      WTAD08           舊總沖銷金額
B2000C           KEYAD5    READEAD0                      44
| 05-C                     END
|    C           *LOVAL    SETLLAD0
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
B2CHKC           DBGN0     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     Z-ADD123129    DBGN0
| 01-C                     END
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC           DBGN0     IFNE OBGN0
B2OLDC           DBGN1     ORNE OBGN1
B2NEWC* M001D              MOVE DBGN0     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    H@8N01  80
B2NEWC*          H@8N01    IFNE OBGN0
B2NEWC*          DBGN1     ORNE OBGN1
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN1 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC                     MOVE DBGN0     OBGN0
B2NEWC* M001D              MOVE DBGN0     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    OBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN1     OBGN1
| 02*C                     ELSE
|   C                     EXSR RTN17A
|   C  N99                EXSR RTN171
| 02-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN17A....READC SFL
      *==============================================================*
03===C           RTN17A    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C           *IN03     ANDEQ'0'
|   C* CHK沖銷金額
| 02-C           DOPT1     IFEQ '5'
|   C           *IN12     ANDEQ'0'
      *沖帳查詢
|   C                     CALL 'ARA0053'
|   C                     PARM           AD10
|   C                     PARM           AD07
|   C           *IN03     PARM *IN03     IN03    1
|   C           *IN12     PARM *IN12     IN12    1
|   C                     MOVEL*BLANKS   DOPT1
|   C                     SETON                     99
|   C                     Z-ADDRRN1      DRRN1
| 02-C                     END
     C*明細查詢
| 02-C           DOPT1     CASEQ'7'       RTN240
| 01-C                     END
|    C           *LOVAL    SETLLSI0
      *
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *57 END
|    C                     SETOF                     12
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C                     Z-ADDWTAD08    WAD08            新總沖銷金額
|    C*
|    C                     READCSFLSR1                 5757*NF
|    C*
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C*
|   C                     SETOF                     6061  *DOP *IND
|   C* CHK沖銷金額
| 02-C           DOPT1     IFNE *BLANKS
      *分配日期
B2CHKC           DAD12     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     629399
| 03*C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DAD12     P0901I  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0901O  1
| 04-C           P0901O    IFEQ 'N'
|   C                     SETON                     629099
| 04-C                     END
| 03-C                     END
|   C   99                GOTO DSP
|   C*
| 05-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
| 06-C           HAD09     IFEQ 'V'
|   C                     SETON                     608799
| 06-C                     END
| 05-C                     END
|   C   99                GOTO DSP
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DAD12     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WWAD12    PARM           S001O1  60
M001AC                     MOVE WWAD12    HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    WAD12
| 07-C           DOPT1     IFNE '5'
| 07-C           DOPT1     IFNE '7'
      *收款日期需小於分配日期
| 08-C           DOPT1     IFNE '4'
B2000C           WAD12     IFLT AC04
|   C                     SETON                     628699
| 09-C                     END
| 08-C                     END
|   C   99                GOTO DSP
|   C*是否月結
|   C                     MOVELAC01      AC01L   1
|   C           AC01L     CHAINAK0                  40
| 10-C           *IN40     IFEQ '0'
B2MODC                     MOVELWAD12     WAD12L  60
B2000C           WAD12L    IFLE AK01
|   C                     SETON                     608599
| 11-C                     END
| 10-C                     END
|   C   99                GOTO DSP
| 07-C                     END
| 07-C                     END
|   C*
|   C           SI30      SUB  DAD08     WKAD8
|   C                     ADD  HAD08     WKAD8
| 12-C           WKAD8     IFLT 0
|   C                     SETON                     618899
| 12-C                     END
|   C   99                GOTO DSP
| 13-C           DOPT1     IFEQ '2'
|   C           DAD08     ANDLE0
|   C                     SETON                     619399
| 13-C                     END
|   C   99                GOTO DSP
| 14-C           DOPT1     IFEQ '4'
|   C                     SUB  HAD08     WAD08
| 14-C                     END
| 15-C           DOPT1     IFEQ '2'
|   C                     ADD  DAD08     WAD08
|   C                     SUB  HAD08     WAD08
| 15-C                     END
| 02-C                     END
|   C   99                GOTO DSP
|   C*
|   C           DSP       TAG
|   C   99                Z-ADDRRN1      DRRN1
|   C*
|   C           UPD       TAG
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *57 END
|    C*
| 16-C           *IN99     IFEQ '0'
|   C           AC10      SUB  WAD08     WAC10
|   C                     ADD  WTAD08    WAC10
| 17-C           WAC10     IFLT 0
|   C                     SETON                     8899
| 17-C                     END
| 16-C                     END
|    C   99                GOTO END171
|    C*
| 18-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     EXSR RTN19S
|   C                     SETOF                     54
|   C                     SETON                     9512
| 18-C                     END
|    C*
04===C           END171    ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD8         WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     52
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C                     SETON                     51
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DBGN0     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WSB0      PARM           S001O1  60
M001AC                     MOVE WSB0      HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    SBGN0
|    C*
B2000C           KEYAD2    SETLLAD0L
|    C*
|    C                     EXSR RTN193
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     9840  *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
B2000C                     Z-ADDBBGN0     TBGN0
B2000C           KEYADB    SETGTAD0L
|   C                     EXSR RTN193
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     5446
|    C                     MOVE *BLANK    DOPT1
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
|    C*
| 01-C           RRN1      DOWLTDSPRC1
|   C           *IN46     ANDEQ'0'
|   C*
B2000C           KEYAC     READEAD0L                     46
| 02-C           *IN46     IFEQ '0'
|   C*
|   C                     ADD  1         RRN1
|   C***  日期轉換
M001AC                     Z-ADDAD12      WWAD12
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WWAD12    S001I2  60
B2MODC           DAD12     PARM           S001O1  60
      *過帳註記
|   C                     MOVELAD09      HAD09
|   C* GET沖銷金額
|   C                     Z-ADDAD08      DAD08
|   C                     Z-ADDAD08      HAD08
|   C*
|   C           KEYSI     CHAINSI0                  40
|   C***  日期轉換
M001AC                     Z-ADDSI21      WSI21   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WSI21     S001I2  60
B2MODC           DAD11     PARM           S001O1  60
|   C*
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     5346
| 02-C                     END
|   C*
| 01-C                     END
|    C*
B2000C                     Z-ADDAD11      BBGN0
|    C                     MOVE AD07      BBGN1
B2000C                     MOVE AD12      KAD12
|    C*
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C*                    SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C*                    SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN19C....SCREEN TO FILE --- HEADFILE
     C*==============================================================*
09===C           RTN19C    BEGSR
|    C*** ARACPF
|    C                     SUB  WAD08     AC10
|    C                     ADD  WTAD08    AC10
|    C**
B2000C                     Z-ADDDATE      ACXX
B2000C                     TIME           ACYY
|    C                     MOVE $USER     ACZZ
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN19D....SCREEN TO FILE --- D
     C*==============================================================*
10===C           RTN19D    BEGSR
|    C*** ARADPF
| 01-C           DOPT1     IFEQ '2'
      *
|   C                     ADD  DAD08     AD08
|   C                     SUB  HAD08     AD08
| 01-C                     END
|    C**
B2000C                     Z-ADDDATE      ADXX
B2000C                     TIME           ADYY
|    C                     MOVE $USER     ADZZ
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN19S....SAVE D
     C*==============================================================*
11===C           RTN19S    BEGSR
|    C*****************
|    C* UPDATE ARADPF *
|    C*****************
|    C                     SETOF                     29
|    C                     READCSFLSR1                 5757
| 01-C           *IN57     DOWEQ'0'
|   C*
|   C                     SETON                     29
      *分配日期
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DAD12     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WWAD12    PARM           S001O1  60
M001AC                     MOVE WWAD12    HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    AD12
      *
| 02-C           DOPT1     IFEQ '2'
      *
B2000C           KEYAD4    CHAINAD0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     EXSR RTN19D
|   C                     UPDATAD0
|   C                     EXSR RTN19F                     *SAV OTHER FILE
| 03-C                     END
| 02-C                     END
|   C*
| 04-C           DOPT1     IFEQ '4'
|   C                     SETON                     29
B2000C           KEYAD4    CHAINAD0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     DELETAD0
|   C                     EXSR RTN19F                     *SAV OTHER FILE
| 05-C                     END
| 04-C                     END
|   C*
|   C                     READCSFLSR1                 5757
| 01-C                     END
|    C*****************
|    C* UPDATE IMICPF *
|    C*****************
| 06-C           *IN29     IFEQ '1'
B2000C           KEYAC     CHAINAC0                  40
|   C                     EXSR RTN19C
|   C                     UPDATAC0
| 06-C                     END
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          RTN19F....UPDATE  SOSIPF
     C*==============================================================*
12===C           RTN19F    BEGSR
|    C*****************
|    C* UPDATE SOSIPF *
|    C*****************
|    C*
|    C           KEYSI     CHAINSI0                  40
B2000C                     Z-ADDDATE      SIXX
B2000C                     TIME           SIYY
|    C                     MOVE $USER     SIZZ
| 01-C           *IN40     IFEQ '0'
|   C*
| 02-C           DOPT1     IFEQ '2'
|   C                     ADD  DAD08     SI26
|   C                     SUB  HAD08     SI26
|   C                     SUB  DAD08     SI30
|   C                     ADD  HAD08     SI30
| 02-C                     END
|   C*
| 03-C           DOPT1     IFEQ '4'
|   C                     SUB  HAD08     SI26
|   C                     ADD  HAD08     SI30
| 03-C                     END
|   C                     UPDATSI0
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
10===C           RTN240    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C           KEYSI     CHAINSI0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C*
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN298                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     OREQ '0'
|   C                     MOVE 'SCR001'  APPSCR
|   C*                    Z-ADDRRN       DRRN
| 02-C                     END
|   C*
| 01-C                     END                             *IN12 ENDIF
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
11===CSR         RTN252    BEGSR
|    C*
|    C*公司代號
|    C           SI01      CHAIN#B0                  40
|    C   40                MOVE *BLANKS   D#B03
|    C  N40                MOVEL#B03      D#B03
|    C*
|    C*客戶簡稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANK    ME04
|    C*
|    C*發票日期-CHINESE
M001AC                     Z-ADDSI21      WSI21   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WSI21     S001I2  60
B2MODC           DSI21     PARM           S001O1  60
|    C*
     C                     Z-ADD0         DSI35
B2CHKC           SI35      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001AC                     Z-ADDSI35      WSI35   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WSI35     S001I2  60
B2MODC           DSI35     PARM           S001O1  60
     C                     END
|    C*發票餘額
|    C*          SI25      SUB  SI27      ENDSUB
|    C*                    SUB  SI28      ENDSUB
|    C*
11===CSR                   ENDSR
     C*==============================================================*
     C*          RTN291....INIT 'SC02' -- SFLSR2
     C*==============================================================*
12===C           RTN291    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C*                    Z-ADD8         DSPRC2  40       *SFL SIZE
|    C*                    Z-ADD8         WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYSI     SETLLSJ0
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN298....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
13===C           RTN298    BEGSR
|    C*
|    C           KEYSI     READESJ0                      44*NF/EOF
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C                     EXSR RTN29B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           KEYSI     READESJ0                      44*NF/EOF
| 01-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          RTN29B....FILE TO SCREEN --- MOVE
     C*==============================================================*
14===C           RTN29B    BEGSR
|    C*訂購數量
|    C           SJ04      SUB  SJ13      D#A
|    C*售價
| 01-C           D#A       IFGT 0
|   C           SJ06      SUB  SJ07      PRICE1  90
|   C           PRICE1    DIV  D#A       PRICE
| 01*C                     ELSE
|   C                     Z-ADD0         PRICE
| 01-C                     END
|    C*發票金額
|    C           SJ06      SUB  SJ07      DSJ06
|    C*
     C                     MOVEL*BLANK    MA03
     C           SJ03      CHAINMA0                  40
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
13===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
13===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
14===C**         RTNF4     BEGSR
|    C*
|    C*
14===C**         ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
15===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
15===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
