     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARA0083                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/03/27                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :銷貨折讓處理－發票分配查詢                *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 00.04.13 | FOR DUTY菸酒稅法實施
     A*---------------------------------------------------------------
     A****************************************************************
     FSOSJLF01IF  E           K        DISK
     F                                              KINFDS SJRCDN
     F            SJ0                               KRENAMESJ0L
      *發票主檔
M002AFSOSIPF  IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FSOSGPF  IF  E           K        DISK
M002AFSOSYPF  IF  E           K        DISK
M002AFSOS2PF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FARAGLF  IF  E           K        DISK
     F                                              KINFDS AGRCDN
     F            AG0                               KRENAMEAG0L
     FMTMEPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FARA0083DCF  E                    WORKSTN
     F                                        RRN1  KSFILE SFLSR1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
M001AI                                      201 2080DATE
     IAGRCDN      DS
     I                                     *RECORD  DAGRN
     ISJRCDN      DS
     I                                     *RECORD  DSJRN
     I            DS
     I                                        1   9 SH03
     I                                        1   4 SH03L
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WAG02     PARM           A008I1 12        折讓單號
     C           WAG03     PARM           A008I2  9        產品編號
     C           WSH02     PARM           A008I3 12        產品編號
     C                     PARM *IN03     IN03    1
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     Z-ADD0         WKAG8  110                   OM
     C*
     C           *LIKE     DEFN AG02      WAG02                        OM
     C           *LIKE     DEFN AG03      WAG03                        OM
     C*
     C           *LIKE     DEFN AG05      WTAG05                       OM
     C           *LIKE     DEFN AG07      WTAG07                       OM
M002AC           *LIKE     DEFN AG21      WTAG21                       OM
     C           *LIKE     DEFN AG08      WTAG08                       OM
     C           *LIKE     DEFN AG12      WTAG12                       OM
     C           *LIKE     DEFN AG13      WTAG13                       OM
     C           *LIKE     DEFN AG14      WTAG14                       OM
     C           *LIKE     DEFN AG15      WTAG15                       OM
     C           *LIKE     DEFN AG16      WTAG16                       OM
     C** FOR CHECK
     C           *LIKE     DEFN AG05      WKAG05           新總分配數量
     C           *LIKE     DEFN AG12      WKAG12           新總訂購數量
     C           *LIKE     DEFN AG13      WKAG13           新總搭贈數量
B2MODC*M001D     *LIKE     DEFN SG26      HSG26 - 2                    OM
     C**
     C           *LIKE     DEFN AG05      WAG05                        OM
     C           *LIKE     DEFN AG07      WAG07                        OM
M002AC           *LIKE     DEFN AG21      WAG21                        OM
     C           *LIKE     DEFN AG08      WAG08                        OM
     C           *LIKE     DEFN AG12      WAG12                        OM
     C           *LIKE     DEFN AG13      WAG13                        OM
     C           *LIKE     DEFN AG14      WAG14                        OM
     C           *LIKE     DEFN AG15      WAG15                        OM
     C           *LIKE     DEFN AG16      WAG16                        OM
     C*
     C           *LIKE     DEFN SG10      OSG10                        OM
     C*
     C           *LIKE     DEFN MA41      WMA41                        OM
     C*
     C           *LIKE     DEFN SJ08      WSJ08                        OM
     C           *LIKE     DEFN SJ09      WSJ09                        OM
     C           *LIKE     DEFN SJ14      WSJ14                        OM
     C           *LIKE     DEFN SJ15      WSJ15                        OM
     C*
     C           *LIKE     DEFN SH02      WSH02                        OM
     C           *LIKE     DEFN SH06      WSH06                        OM
     C           *LIKE     DEFN SH04      WSH045                       OM
     C           *LIKE     DEFN SH12      WSH12                        OM
     C           *LIKE     DEFN SH13      WSH13                        OM
     C*
     C           *LIKE     DEFN SH03      KSH03                        OM
     C           *LIKE     DEFN SH04      WSH041                       OM
     C           *LIKE     DEFN SH05      WSH051                       OM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSH     KLIST
     C                     KFLD           WSH02
     C                     KFLD           WAG03
     C           KEYSG     KLIST
     C                     KFLD           WSH02
     C           KEYAG2    KLIST
     C                     KFLD           WAG02
     C                     KFLD           WAG03
     C           KEYAG3    KLIST
     C                     KFLD           SG09
     C                     KFLD           SH03
     C                     KFLD           DAG04
     C           KEYSJ2    KLIST
     C                     KFLD           SG01
     C                     KFLD           SG04
     C****                 KFLD           SG05
     C                     KFLD           WAG03
     C           KEYAG4    KLIST
     C                     KFLD           WAG02
     C                     KFLD           WAG03
     C                     KFLD           DAG04
     C           KEYSJ4    KLIST
     C                     KFLD           SG01
     C                     KFLD           SG04
     C                     KFLD           WAG03
     C                     KFLD           DAG04
     C           KEYSI     KLIST
     C                     KFLD           SH01
     C                     KFLD           DAG04
     C           KEY#B     KLIST
     C                     KFLD           SH01
     C           KEYMA     KLIST
     C                     KFLD           SH03
     C           KEYMD     KLIST
     C                     KFLD           SG04
     C           KEYME     KLIST
     C                     KFLD           SG04
     C                     KFLD           SG05
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C           *IN12     ANDEQ'0'                        *12    OFF
    C*
    C                     EXSR RTN195                     *EXFMT
  02-C           *IN03     IFEQ '0'
    C           *IN12     ANDEQ'0'                        *12    OFF
  03-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  03-C                     END
    C*
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE 'SCR001'  APPSCR
|    C*M001D               Z-ADD0         DATE    60
|    C* M001D              CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
B2???C*                    PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|    C*          DATE      PARM           S001O1  60
|    C                     SETOF                     59
|    C***********************
|    C* GET HEADING(SOSHPF) *
|    C***********************
|    C           KEYSH     CHAINSH0                  40
M002AC           KEYSH     CHAINS20                  41
| 04-C           *IN40     IFEQ '0'
|   C* GET公司名稱
|   C           KEY#B     CHAIN#B0                  40
|   C   40                MOVE *BLANKS   #B03
|   C* GET產品名稱
|   C           KEYMA     CHAINMA0                  40
|   C   40                MOVE *BLANKS   MA03
|   C* GET退貨數量／未分配數量
|   C           SH04      ADD  SH05      DATA2
|   C                     SUB  SH06      DATA2
|   C* GET未分配訂購數量
|   C           SH04      SUB  SH12      DSH041
|   C* GET未分配搭贈數量
|   C           SH05      SUB  SH13      DSH051
|   C*
|   C                     Z-ADDDSH041    WSH041
|   C                     Z-ADDDSH051    WSH051
|   C                     Z-ADDSH07      DSH07
|   C                     Z-ADDSH07      WSH07  112
M002AC           *IN41     IFEQ '0'
M002AC                     ADD  S207      DSH07
M002AC                     ADD  S207      WSH07
M002AC                     END
| 04-C                     END
|    C*
|    C***********************
|    C* GET HEADING(SOSGPF) *
|    C***********************
|    C           KEYSG     CHAINSG0                  40
| 05-C           *IN40     IFEQ '0'
|   C* GET客戶簡稱
|   C           KEYME     CHAINME0                  40
|   C   40                MOVE *BLANKS   ME04
|   C* GET日期轉換
M001AC                     Z-ADDSG06      WSG06   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WSG06     S001I2  60
|   C           DSG06     PARM           S001O1  60
| 05-C                     END
      *
|    C* GET日期轉換
M001AC                     Z-ADDSG26      WSG26   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WSG26     S001I2  60
|    C           DSG26     PARM           S001O1  60
      *
|    C****
|    C* GET（舊）總分配數量／總銷退金額／總銷退成本
|    C****
|    C                     Z-ADD0         WTAG05
|    C                     Z-ADD0         WTAG07
M002AC                     Z-ADD0         WTAG21
|    C                     Z-ADD0         WTAG08
|    C****
|    C* GET（舊）總訂贈數量／總搭購金額／總銷退成本－FOB/FHI/DUTY
|    C****
|    C                     Z-ADD0         WTAG12
|    C                     Z-ADD0         WTAG13
|    C                     Z-ADD0         WTAG14
|    C                     Z-ADD0         WTAG15
|    C                     Z-ADD0         WTAG16
|    C           KEYAG2    SETLLAG0L
|    C*
|    C           KEYAG2    READEAG0L                     46
| 06-C           *IN46     DOWEQ'0'
|   C*
|   C                     ADD  AG05      WTAG05
|   C                     ADD  AG07      WTAG07
M002AC                     ADD  AG21      WTAG21
|   C                     ADD  AG08      WTAG08
|   C                     ADD  AG12      WTAG12
|   C                     ADD  AG13      WTAG13
|   C                     ADD  AG14      WTAG14
|   C                     ADD  AG15      WTAG15
|   C                     ADD  AG16      WTAG16
|   C           KEYAG2    READEAG0L                     46
| 06-C                     END
|    C****
|    C* GET（新）總分配數量／總銷退金額／總銷退成本
|    C****
|    C                     Z-ADDWTAG05    WAG05
|    C                     Z-ADDWTAG07    WAG07
M002AC                     Z-ADDWTAG21    WAG21
|    C                     Z-ADDWTAG08    WAG08
|    C****
|    C* GET（新）總訂贈數量／總搭購金額／總銷退成本－FOB/FHI/DUTY
|    C****
|    C                     Z-ADDWTAG12    WAG12
|    C                     Z-ADDWTAG13    WAG13
|    C                     Z-ADDWTAG14    WAG14
|    C                     Z-ADDWTAG15    WAG15
|    C                     Z-ADDWTAG16    WAG16
|    C           *LOVAL    SETLLAG0L
|    C           *LOVAL    SETLLSJ0L
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
      *
|    C                     SETON                     12
|    C*
02===C                     ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
03===C           RTN191    BEGSR
|    C*
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD8         WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     52
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C                     SETON                     51
|    C*
|    C           KEYAG2    SETLLAG0L
|    C           KEYSJ2    SETLLSJ0L
|    C*
03===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
04===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
|   C***                  MOVE SI02      BBGN1
|   C***        *LOVAL    SETLLSI0
| 01-C                     END
|    C*
04===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
05===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C*
|   C           KEYAG2    READEAG0L                     46
| 02-C           *IN46     IFEQ '0'
|   C                     ADD  1         RRN1
|   C*
|   C                     MOVELDAGRN     HRCDN
|   C                     MOVE AG04      DAG04
|   C                     Z-ADDAG06      DAG06
|   C*
|   C                     Z-ADDAG12      DAG12
|   C                     Z-ADDAG12      HAG12
|   C                     Z-ADDAG13      DAG13
|   C                     Z-ADDAG13      HAG13
|   C*
|   C                     Z-ADDAG07      DAG07
|   C                     Z-ADDAG07      HAG07
M002AC                     Z-ADDAG21      DAG21
M002AC                     Z-ADDAG21      HAG21
|   C*
|   C                     Z-ADDAG05      HAG05
|   C                     Z-ADDAG08      HAG08
|   C                     Z-ADDAG14      HAG14
|   C                     Z-ADDAG15      HAG15
|   C                     Z-ADDAG16      HAG16
M002AC* GET發票未沖稅額
M002AC           KEYSI     CHAINSI0                  41
M002AC           *IN41     IFEQ '0'
M002AC           KEYSI     CHAINSY0                  42
M002AC           *IN42     IFEQ '0'
M002AC           SI24      SUB  SY08      DSI24
M002AC           DSI24     SUB  SY07      DSI24
M002AC                     ELSE
M002AC                     Z-ADDSI24      DSI24
M002AC                     END
M003AC                     ELSE
"    C                     Z-ADD0         DSI24
M002AC                     END
|   C* GET發票數量／售價／發票金額
|   C           KEYSJ4    CHAINSJ0L                 40
| 03-C           *IN40     IFEQ '0'
|   C           SJ04      SUB  SJ13      DSJ04A
|   C****ERIC   SJ06      SUB  SJ07      DSJ06B
|   C           SJ06      SUB  SJ07      DSJ06B    H
     C           DSJ04A    IFNE 0
|   C           DSJ06B    DIV  DSJ04A    DSJ06A
     C                     ELSE
     C                     Z-ADD0         DSJ06A
     C                     END
|   C                     Z-ADDSJ08      HSJ08
|   C                     Z-ADDSJ09      HSJ09
|   C                     Z-ADDSJ14      HSJ14
|   C                     Z-ADDSJ15      HSJ15
|   C*
M002AC*發票日期
M002AC                     Z-ADDSJ16      WSJ16   60
M002AC                     CALL 'RES001'
M002AC                     PARM 'YMD'     S001I1  3
M002AC                     PARM WSJ16     S001I2  60
M002AC           DSI21     PARM           S001O1  60
M002AC*
|   C                     WRITESFLSR1
M003AC                     ELSE
"    C                     Z-ADD0         DSJ06A
"    C                     Z-ADD0         DSI21
"    C                     WRITESFLSR1
| 03-C                     END
|   C*
| 03*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLSJ0L
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
06===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C*                    SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C*                    SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
06===C                     ENDSR
