     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARA0101                                    *
     A*    AUTHOR       : A1118  PHILIP                              *
     A*    DATE WRITTEN : 81/04/28                                   *
     A*    UPDATE DATE  : 81/04/30  每月改成每兩月統計             *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    REMARK       :統一發票申報錯誤報表列印及資料轉檔        *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     FSOSIPF  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FARA010P O   E             39     PRINTER
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DSI01
     I*                                     603 604 DSI01E
     I                                      613 6160DSI21S
     I                                      617 6200DSI21E
     I                                      621 6260WSI21S
     I                                      627 6320WSI21E
     I                                      680 680 ERRCD
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN87     PARM *IN87     IN87    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           SI12
     C                     KFLD           SI13
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C  N87                EXSR RTN010
     C*新增資料
     C                     EXSR RTN100                     *DATA->FILE
     C*
     CLR                   EXSR RTNLR
      *=========================================================*
      *          RTN010....INIT                                 *
      *=========================================================*
01===C           RTN010    BEGSR
|    C*SYSTEM DATE
|    C*M001D               Z-ADD0         DATE    60
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
B2???C*                    PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|    C*M001D     DATE      PARM           S001O1  60
|    C                     SETON                     87
|    C                     MOVE *BLANK    ERRCD
      *
|    C**GET發票公司
|    C           SI01      CHAIN#B0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #B17
| 01-C                     END
|    C*
     C                     WRITEPH1
01===C                     ENDSR
      *=========================================================*
      *          RTN100....DATA TO HEADING FILE                 *
      *=========================================================*
02===C           RTN100    BEGSR
     C************
|    C**發票日期
     C************
M001AC                     Z-ADDSI21      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
|    C           PSI21     PARM           S001O1  60
     C************
|    C**客戶簡稱
     C************
|    C           KEYME     CHAINME0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    ME04
| 03-C                     END
     C*
     C***************
|    C**客戶統一編號
     C***************
     C           SI08      CHAINMD0                  53
     C*
     C   53                MOVE *BLANK    MD17
     C**************
|    C*WRITE REPORT
     C**************
|    C                     WRITEPD1
     C*
09===C                     ENDSR
      *=========================================================*
      *          RTN900....OVERFLOW
      *=========================================================*
02===C           RTN900    BEGSR
|    C*OVERFLOW CON.
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
     C*
09===C                     ENDSR
      *==============================================================*
      *          RTNLR.... LR
      *==============================================================*
05===C           RTNLR     BEGSR
|    C*
| 01-C           *IN87     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C                     WRITEPE2
|    C*
05===C                     ENDSR
