     FARAKPF  UF  E           K        DISK
     FARA013XDCF  E                    WORKSTN
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I            DS
B2MODI                                        1   60WAK01
B2MODI                                        1   40WYY
B2MODI                                        5   60WMM
     I            DS
     I                                        1   40DAK01
     I                                        1   20DMM
     I                                        3   40DYY
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRM
     C*
  01-C           *IN03     DOWEQ'0'
    C*
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C*
    C                     EXSR RTN100                     *CHECK SCR01?
  02-C           *IN14     IFEQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXSR RTN200                     *PROCESS    ?
    C                     SETON                     98                ?
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         DAK01
|    C*
|    C                     Z-ADD0         DATE    60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM $EGMDY    S001I2  60
|    C           DATE      PARM           S001O1  60
|    C*
      *
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *
B2CHKC           DAK01     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     609599
| 01*C                     ELSE
| 02-C           DMM       IFGT 12
|   C           DMM       ORLT 1
|   C                     SETON                     609399
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END100
      *
|    C                     Z-ADDDMM       WMM
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDYY       WYY
B2NEWC                     MOVE DYY       HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    WYY
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          WAK01     IFLE 9209
B2NEWC           WAK01     IFLE 199209
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     SETON                     609299
| 03-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTN200....DATA PROCESS
      *===============================================================*
03===C           RTN200    BEGSR
|    C*
B2000C           WAK01     SETLLAK0
     C                     READ AK0                      46
     C           *IN46     DOWEQ'0'
     C           DAK02     IFEQ *BLANKS
     C           DAK02     OREQ AK02
|    C                     DELETAK0
     C                     END
     C                     READ AK0                      46
     C                     END
|    C*
03===C                     ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
