     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARA003                                     *
     A*    AUTHOR       : A1005  ROGER CHIEN                         *
     A*    DATE WRITTEN : 80/11/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    PROCEDURE    :稅率資料維護                              *
     A****************************************************************
     FARA003D CF  E                    WORKSTN
     IDA02        DS
     I                                        1   4 CHK
     I                                        1   43ARDA02
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *NAMVAR   DEFN           DA02
     C           *LOCK     IN   DA02
  01-C           CHK       IFEQ *BLANKS
    C                     Z-ADD0         ARDA02
  01-C                     END
     C           ARDA02    MULT 100       DDA02
     C                     EXFMTDSPC1                                  L
      *
  02-C           *IN03     IFEQ '0'
    C           DDA02     DIV  100       ARDA02
  02-C                     END
     C                     OUT  DA02
     C                     SETON                     LR
