     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : ARA0082                                    *
     H*    AUTHOR       : A1084  CHARLES
     H*    CREATE DATE  : 81/01/16                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H*    SUBSYSTEM    :                                            *
     H*    REMARK       :銷退折讓資料全頁查詢(WINDOW)              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M002      | 00.04.18 | FOR DUTY菸酒稅法實施
     A*---------------------------------------------------------------
     F****************************************************************
     FARAGLF03IF  E           K        DISK
     FSOSIPF  IF  E           K        DISK
M002AFSOSYPF  IF  E           K        DISK
     FARA0082DCF  E                    WORKSTN
      *發票號碼
     E                    W01        10 12
      *訂購數量
     E                    W02        10  5 0
      *搭贈數量
     E                    W03        10  4 0
      *單價
     E                    W04        10  9 2
      *金額
     E                    W05        10  9 0
M002A *稅額
M002AE                    W06        10  6 0
     I*
     I            DS
@    I                                        1 120 W01
     I                                        1  12 AG021
     I                                       13  24 AG022
     I                                       25  36 AG023
     I                                       37  48 AG024
     I                                       49  60 AG025
     I                                       61  72 AG026
     I                                       73  84 AG027
     I                                       85  96 AG028
     I                                       97 108 AG029
     I                                      109 120 AG0210
     I            DS
@    I                                        1  500W02
     I                                        1   50AG121
     I                                        6  100AG122
     I                                       11  150AG123
     I                                       16  200AG124
     I                                       21  250AG125
     I                                       26  300AG126
     I                                       31  350AG127
     I                                       36  400AG128
     I                                       41  450AG129
     I                                       46  500AG1210
     I            DS
@    I                                        1  400W03
     I                                        1   40AG131
     I                                        5   80AG132
     I                                        9  120AG133
     I                                       13  160AG134
     I                                       17  200AG135
     I                                       21  240AG136
     I                                       25  280AG137
     I                                       29  320AG138
     I                                       33  360AG139
     I                                       37  400AG1310
     I            DS
@    I                                        1  902W04
     I                                        1   92AG061
     I                                       10  182AG062
     I                                       19  272AG063
     I                                       28  362AG064
     I                                       37  452AG065
     I                                       46  542AG066
     I                                       55  632AG067
     I                                       64  722AG068
     I                                       73  812AG069
     I                                       82  902AG0610
     I            DS
@    I                                        1  900W05
     I                                        1   90AG0711
     I                                       10  180AG072
     I                                       19  270AG073
     I                                       28  360AG074
     I                                       37  450AG075
     I                                       46  540AG076
     I                                       55  630AG077
     I                                       64  720AG078
     I                                       73  810AG079
     I                                       82  900AG0710
M002AI            DS
M002AI                                        1  600W06
M002AI                                        1   60AG211
M002AI                                        7  120AG212
M002AI                                       13  180AG213
M002AI                                       19  240AG214
M002AI                                       25  300AG215
M002AI                                       31  360AG216
M002AI                                       37  420AG217
M002AI                                       43  480AG218
M002AI                                       49  540AG219
M002AI                                       55  600AG2110
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           SI01
     C                     PARM           AG03
     C                     PARM           AG04
     C*==============================================================*
     C*                    KEY LIST FOR NMPF
     C*==============================================================*
     C           KEYSI     KLIST                           *KEY TOP
     C                     KFLD           SI01
     C                     KFLD           AG04
     C           KEYAG     KLIST                           *KEY TOP
     C                     KFLD           AG03
     C                     KFLD           AG04
     C*
     C           KEYAGT    KLIST                           *KEY TOP
     C                     KFLD           AG03
     C                     KFLD           AG04
     C                     KFLD           WAG02T
     C*
     C           KEYAGB    KLIST                           *KEY BOTTOM
     C                     KFLD           AG03
     C                     KFLD           AG04
     C                     KFLD           WAG02B
     C*
     C           *LIKE     DEFN AG02      WAG02T
     C           *LIKE     DEFN AG02      WAG02B
     C*==============================================================*
     C*          MAIN ROUTINE
     C*==============================================================*
|    C*累計銷退金額，訂購分配數量，搭贈分配數量
     C                     EXSR RTN010                     *INIT
     C*
     C           KEYSI     CHAINSI0                  40    *1 SETLL
     C           *IN40     IFEQ '1'
     C                     Z-ADD0         SI27
M002AC                     Z-ADD0         SI28
     C                     END
M002AC           KEYSI     CHAINSY0                  50    *1 SETLL
M002AC           *IN50     IFEQ '1'
M002AC                     Z-ADD0         SY08
M002AC                     END
     C           KEYAGB    SETLLAG0                        *1 SETLL
     C                     EXSR RTN100                     *1 READ NEXT
     C*
  01-C           *IN03     DOWEQ'0'
    C*
    C                     EXFMTDSPC1
    C*
  02-C           *IN25     IFEQ '1'                        *ROLLUP
    C           *IN97     ANDEQ'0'                        *LAST PAGE
    C           KEYAGB    SETGTAG0                        *AFTER 1 SETLL
    C                     EXSR RTN100                     *READ NEXT
  02-C                     END
    C*
  03-C           *IN26     IFEQ '1'                        *ROLLDOWN
    C           *IN98     ANDEQ'0'                        *FIRST PAGE
    C           KEYAGT    SETLLAG0
    C                     EXSR RTN200                     *READ PREV
  03-C                     END
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*累計銷退金額，訂購分配數量，搭贈分配數量
     C           KEYAG     SETLLAG0
     C           KEYAG     READEAG0                      46
     C           *IN46     DOWEQ'0'
     C                     ADD  AG07      TOT07
M002AC                     ADD  AG21      TOT08
     C                     ADD  AG12      TOT12
     C                     ADD  AG13      TOT13
     C           KEYAG     READEAG0                      46
     C                     END
|    C*
|    C                     MOVE *BLANKS   WAG02T
|    C                     MOVE *BLANKS   WAG02B
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....READ NEXT
     C*==============================================================*
02===CSR         RTN100    BEGSR
|    C*
|    C                     MOVE *BLANKS   W01
|    C                     Z-ADD0         W02
|    C                     Z-ADD0         W03
|    C                     Z-ADD0         W04
|    C                     Z-ADD0         W05
M002AC                     Z-ADD0         W06
|    C                     Z-ADD0         WI      20
|    C   25                SETOF                     98
|    C*
|    C           KEYAG     READEAG0                      97
|    C  N97                EXSR RTN810                     *GET KEY TOP
|    C*
| 01-C                     DO   10        WI
|   C*
| 02-C           *IN97     IFEQ '0'
|   C                     MOVE AG02      W01,WI
|   C                     Z-ADDAG12      W02,WI
|   C                     Z-ADDAG13      W03,WI
|   C                     Z-ADDAG06      W04,WI
|   C                     Z-ADDAG07      W05,WI
M002AC                     Z-ADDAG21      W06,WI
|   C                     EXSR RTN820                     *GET KEY BOT
| 02*C                     ELSE
|   C           WI        ADD  60        WO      20
|   C                     MOVEA*ALL'1'   *IN,WO
|   C                     SETOF                     9998
|   C                     Z-ADD10        WI
| 02-C                     END
|   C*
|    C           KEYAG     READEAG0                      97
| 01-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....READ PREVIOUS
     C*==============================================================*
03===CSR         RTN200    BEGSR
|    C*
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     MOVEA*BLANKS   W01
|    C                     Z-ADD0         W02
|    C                     Z-ADD0         W03
|    C                     Z-ADD0         W04
|    C                     Z-ADD0         W05
M002AC                     Z-ADD0         W06
|    C                     Z-ADD11        WI
|    C*
|    C           KEYAG     REDPEAG0                      98*READ EQ DIV
|    C                     EXSR RTN820                     *GET KEY BOTTOM
|    C*
| 01-C                     DO   10                         *SFL FULL
|   C*
| 02-C           *IN98     IFEQ '1'                        *READP EOF
|   C                     MOVE WAG02T    WAG02B           *KEY BOTTOM
|   C           KEYAGB    SETLLAG0
|   C                     EXSR RTN100                     *READ NEXT
|   C                     GOTO END200
| 02-C                     END
|   C*
|   C                     SUB  1         WI
|   C                     MOVE AG02      W01,WI
|   C                     Z-ADDAG12      W02,WI
|   C                     Z-ADDAG13      W03,WI
|   C                     Z-ADDAG06      W04,WI
|   C                     Z-ADDAG07      W05,WI
M002AC                     Z-ADDAG21      W06,WI
|   C                     EXSR RTN810                     *GET KEY TOP
|   C*
|    C           KEYAG     REDPEAG0                      98*READ EQ DIV
| 01-C                     END
|    C*
03===C           END200    ENDSR
     C*==============================================================*
     C*          RTN810....READ NEXT CLEAR & INIT
     C*==============================================================*
05===CSR         RTN810    BEGSR
|    C                     MOVE AG02      WAG02T           *KEY TOP
05===C                     ENDSR
     C*==============================================================*
     C*          RTN820....READ PREV CLEAR & INIT
     C*==============================================================*
06===CSR         RTN820    BEGSR
|    C                     MOVE AG02      WAG02B           *KEY BOTTOM
06===C                     ENDSR
