      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARA015                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 82/03/03                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款作業                                 *
      * REMARK       :銷退折讓批次作業                             *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FARA015D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      119 1240$EGMDY
     I*公司，客戶(A002)
     I                                      601 602 DSG01S
     I                                      603 604 DSG01E
     I                                      605 609 DSG04
     I*銷退日期（期間）
     I                                      610 6150DSG06S
     I                                      616 6210DSG06E
M001MI                                      622 6290YSG06S
M001MI                                      630 6370YSG06E
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN98     PARM *IN98     IN98    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE 'A0002'   DSG04
|    C                     MOVE *BLANK    DSG01S
|    C                     MOVE *BLANK    DSG01E
|    C                     Z-ADD0         DSG06S
|    C                     Z-ADD0         DSG06E
|    C                     Z-ADD0         YSG06S
|    C                     Z-ADD0         YSG06E
M001AC                     Z-ADD0         W6      60
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*公司別
| 01-C           DSG01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG01S
| 01-C                     END
|    C*
| 02-C           DSG01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG01E
| 02-C                     END
|    C*
| 03-C           DSG01S    IFGT DSG01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*銷退日期
|    C                     CALL 'P09'
|    C                     PARM DSG06S    P0901I  60
|    C                     PARM           P0901O  1
|    C*
| 04-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 04*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG06S    S001I2  60
|   C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YSG06S
| 04-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSG06E    P0901I  60
|    C                     PARM           P0901O  1
|    C*
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 05*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG06E    S001I2  60
|   C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YSG06E
| 05-C                     END
|    C*
| 06-C           YSG06S    IFGT YSG06E
|   C                     SETON                     6269
|   C                     SETON                     9299
| 06-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
