      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARA010                                        *
      * AUTHER       : A1118 PHILP TSAI                              *
      * CREATE DATE  : 81/04/29                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款子系統                               *
      * REMARK       :統一發票申報表　                             *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FARA010D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FPA#BPF  IF  E           K        DISK
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DSI01
     I*                                     603 604 DSI01E
     I                                      613 6160DSI21S
     I                                      613 6140MMS
     I                                      615 6160YYS
     I                                      617 6200DSI21E
     I                                      617 6180MME
     I                                      619 6200YYE
     I                                      621 6260WSI21S
     I                                      627 6320WSI21E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN87     PARM *IN87     IN87    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N87N97N98          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C*統一發票作業檢查碼
  02-C           *IN87     IFEQ '1'
    C                     SETON                       99
  02-C                     END
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  03-C           *IN03     IFEQ '0'
  04-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  04*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  03-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSI01
|    C*****                MOVE *BLANK    DSI01E
|    C                     Z-ADD0         DSI21S
|    C                     Z-ADD0         DSI21E
|    C                     Z-ADD0         WSI21S
|    C                     Z-ADD0         WSI21E
|    C                     MOVEL'SCR001'  APPSCR  6
     C*
     C                     Z-ADD1         $EVR
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司代號
| 01-C           DSI01     IFEQ *BLANK
|   C                     SETON                     609699
| 01*C                     ELSE
|   C           DSI01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     SETON                     609599
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C*(CHECK DATE)-申報年月
|    C*
| 06-C           DSI21S    IFEQ 0
|   C                     SETON                     619699
     C                     ELSE
     C           MMS       IFLE 0
     C           MMS       ORGE 13
|   C                     SETON                     619499
     C                     ELSE
     C                     Z-ADDDSI21S    DSI21E
     C                     MOVE MMS       WSI21S
     C*M001M               MOVELYYS       WSI21S
M001AC                     MOVE YYS       HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    FYY4    40
M001AC                     MOVELFYY4      WSI21S
     C                     MOVE MME       WSI21E
     C*M001M               MOVELYYE       WSI21E
M001AC                     MOVE YYE       HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    FYY4    40
M001AC                     MOVELFYY4      WSI21E
| 06-C                     END
| 06-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
