     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARA008                                     *
     A*    AUTHOR       : A1092  TAYLOR                              *
     A*    DATE WRITTEN : 81/03/25                                   *
     A*    UPDATE DATE  : 81/04/17 PHILIP                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款系統                              *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :銷退折讓處理                              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 123199 = 123129
     A*---------------------------------------------------------------
     A* M003      | 00.04.14 | FOR DUTY菸酒稅法實施
     A*---------------------------------------------------------------
     A* M004      | 02.04.14 | RE-MODIFY M003
     A*---------------------------------------------------------------
     A****************************************************************
     FSOSGPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSGLF2 IF  E           K        DISK
     F            SG0                               KRENAMESG0L
     FSOSHPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSIPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSJPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
M003AFSOSXPF  UF  E           K        DISK
M003AF                                              KINFSR ERRSR
M003AF*M004DSOSZPF  UF  E           K        DISK
M003AF*M004D                                              KINFSR ERRSR
M003AFSOSYPF  UF  E           K        DISK
M003AF                                              KINFSR ERRSR
M003AFSOS2PF  UF  E           K        DISK
M003AF                                              KINFSR ERRSR
     FARAGPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMDPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FIMIAPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMAPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FARACLF04UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMEPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#GPF  IF  E           K        DISK
B2CHKFARA008D CF  E                    WORKSTN
B2INF *CVR3010 sev.30 DISPLAY file ARA008D must be converted, because file
B2INF *   SG06 (and more) are shared by name with other database fields
B2INF *   which require to be expanded. Please convert ARA008D, enlarging
B2INF *   all involved fields prior to compilation, or manually insert in
B2INF *   this source the proper RENAME and MOVE statements to avoid name
B2INF *   sharing
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E**                  WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        5  1
     E* ARRAY 狀態
     E                    ARR     4   4 10
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
M001AI                                      201 2080DATE
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $AMAUT
     I*                                     514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C                     MOVE *BLANK    WQUERY  1
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
B2MODC           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C           *LIKE     DEFN DBGN3     OBGN3            *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN3     BBGN3            *SUBFIL BUTTOM
      *
     C           *LIKE     DEFN IA01      WIA01
     C           *LIKE     DEFN IA10      WIA10
      *
B2MODC           *LIKE     DEFN DBGN2     SBGN2 + 2        *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN2     TBGN2 + 2        *SUBFIL BUTTOM
M001AC                     Z-ADD0         WTB2    60
M001AC                     Z-ADD0         WSB2    60
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSG2    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           SBGN2
     C                     KFLD           DBGN3
     C           KEYSG3    KLIST
     C                     KFLD           BBGN1
     C                     KFLD           TBGN2
     C                     KFLD           BBGN3
     C           KEYSG4    KLIST
     C                     KFLD           SG01
     C           KEYSI     KLIST
     C                     KFLD           SG01
     C                     KFLD           AG04
     C           KEYSJ     KLIST
     C                     KFLD           SG01
     C                     KFLD           AG04
     C                     KFLD           AG03
     C           KEYSH1    KLIST
     C                     KFLD           SG02
M004AC           KEYSH2    KLIST
M004AC                     KFLD           SG02
M004AC                     KFLD           SH03
M002AC           KEYS2     KLIST
M002AC                     KFLD           SH02
M002AC                     KFLD           SH03
     C           KEYME     KLIST
     C                     KFLD           SG04
     C                     KFLD           SG05
     C           KEYIA     KLIST
     C                     KFLD           WIA01
     C                     KFLD           SH10
     C                     KFLD           SH03
     C           KEYMA     KLIST
     C                     KFLD           SH03
     C           KEYAC     KLIST
     C                     KFLD           AC01
     C                     KFLD           AC02
     C                     KFLD           AC03
     C                     KFLD           AC05
     C                     KFLD           AC06
      *==============================================================*
      *                    SGIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
M002MC                     Z-ADD123129    DBGN2
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M002MC                     Z-ADD123129    OBGN2
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2MODC*                    Z-ADD0         DATE    80
|    C* M001D              CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
B2???C*                    PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC*          DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC           DBGN1     IFNE OBGN1
B2OLDC           DBGN2     ORNE OBGN2
B2OLDC           DBGN3     ORNE OBGN3
B2NEWC* M001D              MOVE DBGN2     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    H@8N01  80
B2NEWC*          DBGN1     IFNE OBGN1
B2NEWC*          H@8N01    ORNE OBGN2
B2NEWC*          DBGN3     ORNE OBGN3
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN3 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C*
B2CHKC           DBGN2     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M002MC                     Z-ADD123129    DBGN2
| 02-C                     END
|   C*
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC                     MOVE DBGN2     OBGN2
B2NEWC* M001D              MOVE DBGN2     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    OBGN2
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN3     OBGN3
| 01*C                     ELSE
      *READC SFL
|   C                     EXSR RTN171
| 03-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 03-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN185                     *GET HEADER
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C*          UPD       TAG
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C   99                GOTO END180
|    C*結案碼檢核
| 02-C           DOPT1     IFEQ '4'
      *SG16='V'已結帳
| 03-C           HSG16     IFEQ 'V'
|   C                     SETON                     608899
|   C                     Z-ADDRRN1      DRRN1
| 03-C                     END
|   C   99                GOTO END180
      *已過帳
|   C           SG02      SETLL#G0                      40
| 04-C           *IN40     IFEQ '1'
|   C                     SETON                     608699
|   C                     Z-ADDRRN1      DRRN1
| 04-C                     END
|   C   99                GOTO END180
|   C*
| 05-C           SG14      IFEQ 'A'
|   C           SG14      OREQ 'N'
|   C                     SETON                     608799
|   C                     Z-ADDRRN1      DRRN1
| 05-C                     END
|   C*
| 02-C                     END
|    C   99                GOTO END180
|    C*
04===C           END180    ENDSR
      *==============================================================*
      *          RTN185....GET SCR002 HEADER
      *==============================================================*
05===CSR         RTN185    BEGSR
|    C* GET 公司
|    C           SG01      CHAIN#B0                  40
|    C   40                MOVE *BLANKS   #B03
|    C*
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANKS   ME04
|    C*
|    C           SG02      CHAINSG0                  40
M003AC           SG02      CHAINSX0                  41
M003AC                     Z-ADDSG10      DSG10
M003AC           *IN41     IFEQ '0'
M003AC                     ADD  SX10      DSG10
M003AC                     END
|    C* 日期轉換
M001AC                     Z-ADDSG06      WSG06   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WSG06     S001I2  60
B2MODC           LSG06     PARM           S001O1  60
|    C*
|    C* 日期轉換
M001AC                     Z-ADDSG26      WSG26   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WSG26     S001I2  60
B2MODC           LSG26     PARM           S001O1  60
|    C*
|    C*          *LOVAL    SETLLSG0
05===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DBGN2     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WSB2      PARM           S001O1  60
M001AC                     MOVE WSB2      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SBGN2
B2000C           KEYSG2    SETLLSG0L
|    C                     MOVE DBGN1     BBGN1
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC                     MOVE DBGN2     BBGN2
B2NEWC* M001D              MOVE DBGN2     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    BBGN2
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     MOVE DBGN3     BBGN3
|    C*
M003AC           SG02      CHAINSX0                  41
M003AC                     Z-ADDSG10      DSG10
M003AC           *IN41     IFEQ '0'
M003AC                     ADD  SX10      DSG10
M003AC                     END
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP SGIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST SGG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC           BBGN1     IFNE DBGN1
B2OLDC           BBGN2     ORNE DBGN2
B2OLDC           BBGN3     ORNE DBGN3
B2NEWC* M001D              MOVE DBGN2     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    H@8N01  80
B2NEWC*          BBGN1     IFNE DBGN1
B2NEWC*          BBGN2     ORNE H@8N01
B2NEWC*          BBGN3     ORNE DBGN3
B2INF *CVR0001 sev.00 Field BBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field BBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN3 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C***  日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2MODC                     PARM BBGN2     S001I2  60
B2MODC           WTB2      PARM           S001O1  60
M001AC                     MOVE WTB2      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    TBGN2
B2000C           KEYSG3    SETGTSG0L
M003AC           SG02      CHAINSX0                  41
M003AC                     Z-ADDSG10      DSG10
M003AC           *IN41     IFEQ '0'
M003AC                     ADD  SX10      DSG10
M003AC                     END
| 02-C                     END
|   C                     EXSR RTN193
|   C                     MOVE SG01      BBGN1
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC                     MOVE DSG06     BBGN2
B2NEWC* M001D              MOVE DSG06     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    BBGN2
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE SG02      BBGN3
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANK    DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ SG0L                     46
M003AC           SG02      CHAINSX0                  41
M003AC                     Z-ADDSG10      DSG10
M003AC           *IN41     IFEQ '0'
M003AC                     ADD  SX10      DSG10
M003AC                     END
| 02-C           *IN46     IFEQ '0'
|   C* 日期轉換
M001AC                     Z-ADDSG06      WSG06   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WSG06     S001I2  60
B2MODC           DSG06     PARM           S001O1  60
|   C* 狀態
|   C                     SELEC
      *待確認
|   C           SG14      WHEQ '*'
|   C                     MOVELARR,1     DFLD1
      *未完全確認
|   C           SG14      WHEQ ' '
|   C                     MOVELARR,2     DFLD1
      *已完全確認
|   C           SG14      WHEQ 'V'
|   C                     MOVELARR,3     DFLD1
      *已轉帳
|   C           SG14      WHEQ 'A'
|   C                     MOVELARR,4     DFLD1
      *已轉帳
|   C           SG14      WHEQ 'N'
|   C                     MOVELARR,4     DFLD1
|   C                     ENDSL
|   C                     ADD  1         RRN1
      *結帳碼
     C*專櫃代號
     C           SG04      IFEQ 'B0000'
     C                     MOVELSG18      SG04
     C                     END
     C*
|   C                     MOVE SG16      HSG16
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     94    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN SGIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C*                    MOVE WFUN,WNUM DFUN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
| 02-C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C*          DOPT1     CASEQ'5'       RTN240           *INQ
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLSG0
|    C           *LOVAL    SETLLSH0
|    C           *LOVAL    SETLLSI0
|    C           *LOVAL    SETLLAG0
M002AC           *LOVAL    SETLLSX0
M002AC           *LOVAL    SETLLSY0
M002AC*M004D     *LOVAL    SETLLSZ0
M002AC           *LOVAL    SETLLS20
|    C*          *LOVAL    SETLLMD0
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN220....UPD DATA --- SFLSR
     C*==============================================================*
11===C           RTN220    BEGSR
|    C*
|    C                     SETON                     30
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN298                     *READ DATA
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
|   C                     EXSR RTN280                      CHK SFLSR
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR RTN185                      GET HDN
|   C                     EXSR RTN291                     *INT SFLSR
|   C                     EXSR RTN298                     *READ DATA
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          RTN230....DEL DATA --- SFLSR2
     C*==============================================================*
12===C           RTN230    BEGSR
|    C*
|    C                     SETOF                     30    *NO INPUT
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN298                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     EXSR RTN280                      CHK SFLSR
|   C*
| 04-C           *IN99     IFEQ '0'                         SAVE
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 05-C           DLTFLG    IFEQ 'Y'
|   C                     EXSR RTN29T                      DLT D
| 05-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN240....INQ DATA --- SFLSR2
     C*==============================================================*
13===C*          RTN240    BEGSR
|    C*
|    C*                    SETOF                     30    *NO INPUT
|    C*                    EXSR RTN291                     *INT SFLSR
|    C*                    EXSR RTN298                     *READ DATA TO SFLSR
|    C*
| 01-C*          *IN03     DOWEQ'0'                        *CTL LOOP
|   C*          APPSCR    ANDEQ'SCR002'
|   C*
|   C*                    WRITEDSPC2
|   C*                    EXFMTSFLCR2
|   C*                    MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C*          *IN03     IFEQ '0'
| 03-C*          *IN12     IFEQ '0'
|   C*
| 04-C*          *IN99     IFEQ '0'                         SAVE
|   C*                    MOVE 'SCR001'  APPSCR
| 04-C*                    END
|   C*
| 03*C*                    ELSE
|   C*                    MOVE 'SCR001'  APPSCR
| 03-C*                    END                             *IN03 ENDIF
| 02-C*                    END                             *IN12 ENDIF
|   C*
| 01-C*                    END                             *ENDDO
|    C*
13===C*                    ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC03' --- SFLSR
     C*==============================================================*
14===C           RTN280    BEGSR
|    C*
|    C*CHK SCREEN
|    C                     SETON                     54
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*
|   C                     SETOF                     60
|   C*                                  DATA ENTRY & *IN99 OFF ->CHECK
|   C   99                GOTO UPD
|   C* CHK可用量
|   C*結案碼檢核
| 02-C           DOPT2     IFEQ '2'
      *SG16='V'已結帳
| 03-C           HSG16     IFEQ 'V'
|   C                     SETON                     608899
|   C                     Z-ADDRRN2      DRRN2
| 03-C                     END
|   C   99                GOTO UPD
      *
| 04-C           SG14      IFEQ 'A'
|   C           SG14      OREQ 'N'
|   C                     SETON                     608699
|   C                     Z-ADDRRN2      DRRN2
| 04-C                     END
|   C   99                GOTO UPD
| 02-C                     END
|   C*
| 05-C           DOPT1     IFEQ '4'
|   C*
|   C                     MOVELSH11      WIA01
|   C           KEYIA     CHAINIA0                  40
| 06-C           *IN40     IFEQ '0'
|   C           IA10      SUB  SH06      WIA10
| 07-C           WIA10     IFLT 0
|   C                     SETON                     608799
| 07-C                     END
| 06-C                     END
|   C           *LOVAL    SETLLIA0
| 05-C                     END
      *
|   C   99                GOTO DSP
|   C*
| 08-C           DOPT2     IFEQ '2'
|   C           DOPT2     OREQ '4'
|   C                     MOVELSG01      AC01
|   C                     MOVELSG04      AC02
|   C                     MOVELSG05      AC03
B2000C                     Z-ADDSG26      AC04
|   C                     MOVEL'50'      AC05
|   C                     MOVELSG09      AC06
|   C           KEYAC     CHAINAC0                  40
| 09-C           *IN40     IFEQ '0'
|   C           AC08      ANDNEAC10
|   C                     SETON                     608599
| 09-C                     END
|   C           *LOVAL    SETLLAC0
| 08-C                     END
|   C   99                GOTO UPD
|   C*
|   C           DSP       TAG
|   C   99                Z-ADDRRN2      DRRN2
| 10-C           DOPT2     IFEQ '2'
|   C           *LOVAL    SETLLSG0
M002AC           *LOVAL    SETLLSX0
M002AC           *LOVAL    SETLLS20
|   C                     CALL 'ARA0081'
|   C                     PARM SG09      A008I1 12
|   C                     PARM SH03      A008I2  9
|   C                     PARM SG02      A008I3 12
|   C           *IN03     PARM           IN03    1
| 10-C                     END
|   C*
| 11-C           DOPT2     IFEQ '5'
|   C                     CALL 'ARA0083'
|   C                     PARM SG09      A008I1 12
|   C                     PARM SH03      A008I2  9
|   C                     PARM SG02      A008I3 12
|   C           *IN03     PARM           IN03    1
| 11-C                     END
|   C*
|   C                     MOVE *BLANKS   DOPT2
|   C           UPD       TAG
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
|    C   99                GOTO END280
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 12-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 12-C                     END
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
14===C           END280    ENDSR
     C*==============================================================*
     C*          RTN291....INIT 'SC03' -- SFLSR2
     C*==============================================================*
15===C           RTN291    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD16        DSPRC2  40
|    C                     Z-ADD8         WPRCD2  40       *SGG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYSH1    SETLLSH0
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          RTN298....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
16===C           RTN298    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '4'
|   C                     SETON                     54
| 01*C                     ELSE
|   C                     SETOF                     54
| 01-C                     END
|    C*
|    C           KEYSH1    READESH0                      44*NF/EOF
|    C*
| 02-C           *IN44     DOWEQ'0'
M003AC           KEYS2     CHAINS20                  41
M003AC                     Z-ADDSH07      DSH07
M003AC           *IN41     IFEQ '0'
M003AC                     Z-ADDS207      DS207
M003AC                     ELSE
M003AC                     Z-ADD0         DS207
M003AC                     END
|   C                     EXSR RTN29B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           KEYSH1    READESH0                      44*NF/EOF
| 02-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          RTN29B....FILE TO SCREEN --- MOVE
     C*==============================================================*
17===C           RTN29B    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT2
|    C* GET 未分配數量
|    C           SH04      SUB  SH12      DFLD2
|    C           SH05      SUB  SH13      DFLD3
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          RTN29S....SAVE D
     C*==============================================================*
18===C           RTN29S    BEGSR
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          RTN29T....DLT D
     C*==============================================================*
19===C           RTN29T    BEGSR
|    C* SOSHPF
|    C           KEYSH1    SETLLSH0
|    C           KEYSH1    READESH0                      44
| 01-C           *IN44     DOWEQ'0'
|   C***
|   C* IMIAPF
| 02-C           SG17      IFEQ *BLANKS
|   C                     MOVELSH11      WIA01
|   C           KEYIA     CHAINIA0                  40
B2000C                     Z-ADDDATE      IAXX
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 03-C           *IN40     IFEQ '0'
|   C                     SUB  SH06      IA06
|   C                     SUB  SH06      IA07
|   C                     SUB  SH06      IA10
|   C*
|   C                     UPDATIA0
| 03*C                     ELSE
|   C                     MOVE SH10      IA02
|   C                     MOVE SH03      IA03
|   C           IA03      CHAINMA0                  40
|   C  N40                MOVE MA09      IA04
|   C  N40                MOVE MA08      IA05
|   C   40                MOVE *BLANKS   IA04
|   C   40                MOVE *BLANKS   IA05
|   C                     Z-SUBSH06      IA06
|   C                     Z-SUBSH06      IA07
|   C                     Z-ADD0         IA08
|   C                     Z-ADD0         IA09
|   C                     Z-SUBSH06      IA10
|   C                     WRITEIA0
| 03-C                     END
|   C* MTMAPF
|   C           KEYMA     CHAINMA0                  40
|   C                     Z-ADD0         WQTY    70
B2000C                     Z-ADDDATE      MAXX
B2000C                     TIME           MAYY
|   C                     MOVE $USER     MAZZ
| 04-C           *IN40     IFEQ '0'
|   C                     SUB  SH06      MA30
|   C                     SUB  SH06      WQTY
|   C**
|   C           WQTY      MULT MA31      FOB    174
|   C                     ADD  FOB       MA26      H
|   C           WQTY      MULT MA32      FHI    174
|   C                     ADD  FHI       MA27      H
|   C           WQTY      MULT MA33      DUTY   174
|   C                     ADD  DUTY      MA28      H
|   C*
|   C                     UPDATMA0
| 04-C                     END
| 02-C                     END
|   C*** UPD SOSHPF
M003AC*M004D     KEYSH1    CHAINS20                  41
M004AC           KEYSH2    CHAINS20                  41
M003AC           *IN41     IFEQ '0'
M003AC                     DELETS20
M003AC                     END
|   C                     Z-ADD0         SH06
|   C                     Z-ADD0         SH07
|   C                     Z-ADD0         SH12
|   C                     Z-ADD0         SH13
|   C                     Z-ADD0         SH08
|   C                     Z-ADD0         SH14
|   C                     Z-ADD0         SH15
|   C                     Z-ADD0         SH16
| 05-C           SG17      IFEQ *BLANKS
|   C                     Z-ADD0         SH17
|   C                     Z-ADD0         SH18
|   C                     Z-ADD0         SH19
|   C                     Z-ADD0         SH20
| 05-C                     END
|   C                     UPDATSH0
|   C           KEYSH1    READESH0                      44
| 01-C                     END
|    C* ARAGPF
|    C           SG09      SETLLAG0
|    C           SG09      READEAG0                      44
| 06-C           *IN44     DOWEQ'0'
|   C*  SOSJPF
|   C           KEYSJ     CHAINSJ0                  40
M003AC*M004D     KEYSJ     CHAINSZ0                  41
| 07-C           *IN40     IFEQ '0'
      *分配數量
|   C                     SUB  AG05      SJ08
      *銷退金額
|   C                     SUB  AG07      SJ09
M003AC*M004D               SUB  AG21      SJ09
M003AC*M004D     *IN41     IFEQ '0'
M003AC*  "                 SUB  AG21      SZ09
M003AC*  "       SZ09      IFNE 0
M003AC*  "                 UPDATSZ0
M003AC*  "                 ELSE
M003AC*  "                 DELETSZ0
M003AC*  "                 END
M003AC*M004D               END
      *訂購分配數量
|   C                     SUB  AG12      SJ14
      *搭贈分配數量
|   C                     SUB  AG13      SJ15
|   C                     UPDATSJ0
| 07-C                     END
|   C*  SOSIPF 發票金額
|   C           KEYSI     CHAINSI0                  40
      *銷退金額
|   C                     SUB  AG07      SI28
M003AC                     SUB  AG21      SI28
|   C                     UPDATSI0
M003AC           KEYSI     CHAINSY0                  41
M003AC           *IN41     IFEQ '0'
M003A *銷退稅額
M003AC                     SUB  AG21      SY08
M003AC           SY08      IFEQ 0
M004AC           SY07      ANDEQ0
M003AC                     DELETSY0
M003AC                     ELSE
M003AC                     UPDATSY0
M003AC                     END
M003AC                     END
|   C*ARAGPF銷貨折讓明細檔
|   C                     DELETAG0
|   C           SG09      READEAG0                      44
| 06-C                     END
|    C*  MTMDPF
|    C           SG04      CHAINMD0                  40
      *MD29=使用額度 MD31=應收帳款
|    C*客戶代號第一碼不為Ｂ專櫃時方更新使用額度(MD29)
|    C*                    MOVELMD01      WMD01T  1
M003AC           SG02      CHAINSX0                  41
M003AC           *IN41     IFEQ '1'
M003AC                     Z-ADD0         SX10
M003AC                     END
| 08-C*          WMD01T    IFNE 'B'
|   C                     ADD  SG10      MD29
M003AC                     ADD  SX10      MD29
| 08-C*                    END
|    C*
|    C                     ADD  SG10      MD31
M003AC                     ADD  SX10      MD31
|    C                     UPDATMD0
|    C*  SOSGPF
|    C           SG02      CHAINSG0                  40
M003AC           SG02      CHAINSX0                  41
M003AC           *IN41     IFEQ '0'
M003AC                     DELETSX0
M003AC                     END
|    C                     Z-ADD0         SG10
|    C                     Z-ADD0         SG13
|    C                     Z-ADD0         SG19
|    C                     Z-ADD0         SG20
|    C                     Z-ADD0         SG21
| 09-C           SG17      IFEQ *BLANKS
|   C                     Z-ADD0         SG22
|   C                     Z-ADD0         SG23
|   C                     Z-ADD0         SG24
      *跨月註記
|   C                     Z-ADD0         SG25
| 09-C                     END
     C           SG17      IFEQ *BLANKS
     C                     Z-ADD0         SG26
     C                     END
|    C                     MOVE '*'       SG14
|    C                     UPDATSG0
      *****************
      *      ARACPF
      *****************
|    C                     MOVELSG01      AC01
|    C                     MOVELSG04      AC02
|    C                     MOVELSG05      AC03
|    C                     MOVEL'50'      AC05
|    C                     MOVELSG09      AC06
|    C           KEYAC     CHAINAC0                  40
B2000C                     Z-ADDDATE      ACXX
B2000C                     TIME           ACYY
|    C                     MOVE $USER     ACZZ
B2000C                     Z-ADDSG26      AC04
|    C                     Z-ADDSG10      AC08
M003AC           SG02      CHAINSX0                  41
M003AC           *IN41     IFEQ '0'
M003AC                     ADD  SX10      AC08
M003AC                     END
|    C                     MOVELSG11      AC09
|    C                     Z-ADDAC08      AC10
| 10-C           *IN40     IFEQ '0'
| 11-C           AC08      IFEQ 0
|   C                     DELETAC0
| 11*C                     ELSE
|   C                     UPDATAC0
| 11-C                     END
| 10*C                     ELSE
| 12-C           AC08      IFNE 0
|   C                     Z-ADD0         AC07
|   C                     Z-ADD0         AC11
|   C                     MOVEL*BLANKS   AC12
|   C                     MOVEL*BLANKS   AC13
|   C                     MOVEL*BLANKS   AC14
|   C                     WRITEAC0
| 12-C                     END
| 10-C                     END
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
20===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
20===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
21===C           RTNF4     BEGSR
|    C*
|    C*
21===C           ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
22===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
22===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
**
尚未分配分配中　分配畢　已轉帳　
