      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARA0091                                       *
      * AUTHER       : A1087 JOYCE                                   *
      * CREATE DATE  : 81/03/18                                      *
      * UPDATE DATE  : 81/04/18  BY STEPHANIE                        *
      *                1.流程修改                                  *
      *                81/04/18  BY STEPHANIE                        *
      *                1.保留量還原                                *
      *                81/04/27  BY STEPHANIE                        *
      *                1.轉帳單據之成本由原單據之轉帳成本轉入      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款作業                                 *
      * REMARK       :轉帳資料批次作業                             *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.02 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M003      | 00.04.27 | FOR DUTY菸酒稅法實施
     A*---------------------------------------------------------------
     A* M999      | 02.12.30 |計算產品真正銷售金額含小數2位
     A*---------------------------------------------------------------
      ****************************************************************
     FSOSCPF  UF  E           K        DISK                      A
     FSOSDLF01UF  E           K        DISK                      A
     FSOSEPF  UF  E           K        DISK
     FSOSELF  UF  E           K        DISK                      A
     F            SE0                               KRENAMESE0L
     FSOSFLF01UF  E           K        DISK                      A
     FSOSQPF  UF  E           K        DISK                      A
     FSOSRPF  UF  E           K        DISK                      A
     FMTMFPF  IF  E           K        DISK
     FSOSIPF  O   E           K        DISK
     FSOSJPF  O   E           K        DISK
     FSOSGPF  UF  E           K        DISK                      A
     FSOSHLF01UF  E           K        DISK                      A
     FSOSPPF  O   E           K        DISK
     FSOSNPF  UF  E           K        DISK                      A
     FSOSOLF01UF  E           K        DISK                      A
     FIMIIPF  UF  E           K        DISK
     FIMIJPF  IF  E           K        DISK
     FIMIAPF  UF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMDPF  UF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOSAPF  IF  E           K        DISK
     FSOSBPF  IF  E           K        DISK
     FARA009P O   E             39     PRINTER
     I**********
     I            DS
     I                                        1   2 HSC01
     I                                        1   1 FSC01
     I            DS
     I                                        1   2 HSE01
     I                                        1   1 FSE01
     I            DS
     I                                        1   2 HSN01
     I                                        1   1 FSN01
     I            DS
     I                                        1   2 HSG01
     I                                        1   1 FSG01
     I            DS
B2MODI                                        1   80HSC07
M001MI                                        3   40HSC07Y
     I            DS
B2MODI                                        1   80HSG06
M001MI                                        3   40HSG06Y
     I            DS
B2MODI                                        1   80HSN05
M001MI                                        3   40HSN05Y
     I            DS
B2MODI                                        1   80HSE39
M001MI                                        3   40HSE39Y
     I            DS
B2MODI                                        1   80HSC08
B2MODI                                        1   60SC08YM
B2MODI                                        1   40HSC08Y
B2MODI                                        5   60SC08M
B2MODI                                        7   80SC08D
     I            DS
B2MODI                                        1   80HSE06
B2MODI                                        1   40HSE06Y
     I            DS
B2MODI                                        1   80WSC08
B2MODI                                        1   40WSC08Y
B2MODI                                        5   60WSC08M
B2MODI                                        7   80WSC08D
     I            DS
     I                                        1   30MD26
     I                                        1   10MD26M
     I                                        2   30MD26D
     IDA02        DS
     I                                        1   43DUTY
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
M001AI                                      201 2080DATE
B2MODI                                      603 6100WSC39S
B2MODI                                      619 619 DSC33S
B2MODI                                      620 620 DSC33E
B2MODI                                      621 622 DSC31S
B2MODI                                      623 624 DSC31E
B2MODI                                      625 636 DSC02S
B2MODI                                      637 648 DSC02E
B2MODI                                      649 6540DSC39S
B2MODI                                      655 6600DSC39E
     I            DS
     I                                        1   9 WSA01
     I                                        1   4 WSA011
     I            DS
     I                                        1   9 WSB02
     I                                        1   4 WSB021
     I            DS
     I                                        1  10 SI02
     I                                        1   2 SI02L
     I                                        2   2 SI021
     I            DS
     I                                        1  12 HSN02
     I                                        3   4 HSN02L
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEYIA     KLIST
     C                     KFLD           IA01
     C                     KFLD           IA02
     C                     KFLD           IA03
     C           KEYSD     KLIST
     C                     KFLD           HSC02
     C           KEYSE     KLIST
     C                     KFLD           HSC29
     C           KEYSF1    KLIST
     C                     KFLD           HSC29
     C                     KFLD           OSD16
     C           KEYSF2    KLIST
     C                     KFLD           HSC29
     C           KEYSH2    KLIST
     C                     KFLD           HSG02
     C           KEYSO2    KLIST
     C                     KFLD           HSN02
     C           KEYMA     KLIST
     C                     KFLD           MA01
     C           KEY#B     KLIST
     C                     KFLD           #B01
     C           KEYSA1    KLIST
     C                     KFLD           WSA01
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
     C                     KFLD           WSA05
     C           KEYSA2    KLIST
     C                     KFLD           WSA01
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
      *FOR 產品前四碼
     C           SA1KEY    KLIST
     C                     KFLD           KSA01
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
     C                     KFLD           WSA05
     C           SA2KEY    KLIST
     C                     KFLD           KSA01
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
     C           KEYSB1    KLIST
     C                     KFLD           WSB01
     C                     KFLD           WSB02
     C                     KFLD           SB04
     C                     KFLD           WSB05
     C           KEYSB2    KLIST
     C                     KFLD           WSB01
     C                     KFLD           WSB02
     C                     KFLD           SB04
      *FOR 產品前四碼
     C           SB1KEY    KLIST
     C                     KFLD           WSB01
     C                     KFLD           KSB02
     C                     KFLD           SB04
     C                     KFLD           WSB05
     C           SB2KEY    KLIST
     C                     KFLD           WSB01
     C                     KFLD           KSB02
     C                     KFLD           SB04
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEYMC     KLIST
     C                     KFLD           MC01
     C           KEYSQ     KLIST
     C                     KFLD           SQ01
     C                     KFLD           SF26
     C                     KFLD           SF03
     C           KEYSR     KLIST
     C                     KFLD           SR02
     C                     KFLD           SR03
     C                     KFLD           SR04
     C*
      *==============================================================*
      *                   *LIKE DEFN
      *==============================================================*
     C           *LIKE     DEFN SD04      WQTYB
     C           *LIKE     DEFN SD04      WQTYA
     C           *LIKE     DEFN SD04      WQTYN
     C*
     C           *LIKE     DEFN SJ02      WSJ02
     C           *LIKE     DEFN #210      W#210
     C           *LIKE     DEFN #208      O#208
     C           *LIKE     DEFN #209      O#209
     C           *LIKE     DEFN #213      O#212
     C           *LIKE     DEFN #213      O#213
     C           *LIKE     DEFN #214      O#214
     C*
     C           *LIKE     DEFN SD02      WSD02
     C           *LIKE     DEFN SD02      HSD02
     C           *LIKE     DEFN SD16      OSD16
     C           *LIKE     DEFN SD07      TSD07
     C           *LIKE     DEFN SD07      WSD04
     C           *LIKE     DEFN SD07      WSD09
     C           *LIKE     DEFN SD06      WSD06
     C           *LIKE     DEFN SD08      WSD08
     C           *LIKE     DEFN SD13      WSD13
     C           *LIKE     DEFN SD14      WSD14
     C*
     C           *LIKE     DEFN SO02      WSO02
     C           *LIKE     DEFN SH02      WSH02
     C           *LIKE     DEFN SG02      HSG02
     C           *LIKE     DEFN SG02      WSG02
     C           *LIKE     DEFN SG03      HSG03
     C           *LIKE     DEFN SG07      HSG07
     C           *LIKE     DEFN SG09      HSG09
     C           *LIKE     DEFN SG09      WSG09
     C           *LIKE     DEFN SN03      HSN03
     C           *LIKE     DEFN SN04      HSN04
     C           *LIKE     DEFN SN12      HSN12
     C           *LIKE     DEFN SN13      HSN13
     C           *LIKE     DEFN SN14      HSN14
     C           *LIKE     DEFN SN15      HSN15
     C           *LIKE     DEFN SO13      HSO13
     C           *LIKE     DEFN SO14      HSO14
     C           *LIKE     DEFN SO15      HSO15
     C*
     C           *LIKE     DEFN SC02      HSC02
     C           *LIKE     DEFN SC29      HSC29
     C           *LIKE     DEFN SC30      HSC30
     C*          *LIKE     DEFN SC01      HSC01
     C           *LIKE     DEFN SC03      HSC03
     C*          *LIKE     DEFN SC07      HSC07
     C*          *LIKE     DEFN SC08      HSC08
     C           *LIKE     DEFN SC39      HSC39
     C           *LIKE     DEFN SC11      HSC11
     C*
     C           *LIKE     DEFN SA01      KSA01
     C           *LIKE     DEFN SA05      WSA05
     C*
     C           *LIKE     DEFN SB01      WSB01
     C           *LIKE     DEFN SB02      KSB02
     C           *LIKE     DEFN SB05      WSB05
     C*
     C*          *LIKE     DEFN IB01      WIB01
     C*          *LIKE     DEFN IB02      WIB02
     C*          *LIKE     DEFN IB03      WIB03
     C*
     C           *LIKE     DEFN MA41      WMA41
     C*
     C           *LIKE     DEFN SF02      WSF02
     C           *LIKE     DEFN SF07      TSF07
     C*
     C*          *LIKE     DEFN SE01      HSE01
     C           *LIKE     DEFN SE03      HSE03
     C*          *LIKE     DEFN SE06      HSE06
     C           *LIKE     DEFN SE07      HSE07
     C           *LIKE     DEFN SE30      HSE30
     C*
     C           *LIKE     DEFN SJ04      TSJ04
     C           *LIKE     DEFN SI23      WSI23
     C*
     C           *LIKE     DEFN SQ06      WFOB1
     C           *LIKE     DEFN SQ07      WFHI1
     C           *LIKE     DEFN SQ08      WDUTY1
     C           *LIKE     DEFN SQ06      WFOB2
     C           *LIKE     DEFN SQ07      WFHI2
     C           *LIKE     DEFN SQ08      WDUTY2
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     WRITEPH1
     C*
     C                     EXSR RTN010                     *INIT ENVIRM
     C*銷售訂單
     C                     READ SC0                      46*READ DATA  AGE
  01-C           *IN46     DOWEQ'0'
    C                     MOVE *BLANKS   SJ02
  02-C           SC03      IFEQ 'S9'
    C                     EXSR RTN050
  02*C                     ELSE
    C                     EXSR RTN100                     *DATA->FILE
  02-C                     END
    C                     MOVEA*ALL'0'   *IN,60
    C                     READ SC0                      46*READ DATA  AGE
  01-C                     END
     C*
     C*送貨單
     C                     READ SE0                      46*READ DATA  AGE
  03-C           *IN46     DOWEQ'0'
    C                     EXSR RTN300                     *DATA->FILE
    C                     MOVEA*ALL'0'   *IN,60
    C                     READ SE0                      46*READ DATA  AGE
  03-C                     END
     C*
     C*銷貨退回
     C                     READ SG0                      46*READ DATA  AGE
  04-C           *IN46     DOWEQ'0'
    C                     EXSR RTN500                     *DATA->FILE
    C                     MOVEA*ALL'0'   *IN,60
    C                     READ SG0                      46*READ DATA  AGE
  04-C                     END
     C*
     C*產品收回
     C                     READ SN0                      46*READ DATA  AGE
  05-C           *IN46     DOWEQ'0'
    C                     EXSR RTN700                     *DATA->FILE
    C                     MOVEA*ALL'0'   *IN,60
    C                     READ SN0                      46*READ DATA  AGE
  05-C                     END
     C*
     C*調撥
     C                     READ II0                      46*READ DATA  AGE
  06-C           *IN46     DOWEQ'0'
    C           II02      SETLLIJ0
    C           II02      READEIJ0                      44
  07-C           *IN44     DOWEQ'0'
    C                     EXSR RTN990                     還原保留量AGE
    C                     MOVEA*ALL'0'   *IN,60
    C           II02      READEIJ0                      44
  07-C                     END
    C                     MOVE 'V'       II08
    C                     UPDATII0
    C*新增一筆至原始／轉帳單據對照檔中
    C                     MOVE II02      SP01
    C                     MOVE *BLANKS   SP02
    C                     MOVE *BLANKS   SP03
    C                     MOVE *BLANKS   SP04
    C                     MOVE 'Y'       SP05
    C                     Z-ADDDATE      SPXX
    C                     TIME           SPYY
    C                     MOVE $USER     SPZZ
    C                     WRITESP0
    C                     WRITEPD1
    C                     SETON                     10
  08-C           *IN39     IFEQ '1'
    C                     WRITEPE1
    C                     WRITEPH1
    C                     SETOF                     39
  08-C                     END
    C*
    C                     READ II0                      46*READ DATA  AGE
  06-C                     END
     C*
     C  N10                WRITEPE3
     C                     WRITEPE2
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ENVIRMENT
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*稅率資料
|    C           *NAMVAR   DEFN           DA02
|    C                     IN   *NAMVAR
|    C*
|    C                     MOVE *BLANKS   OSD16
|    C                     Z-ADD0         TSD07
|    C                     Z-ADD0         TSJ04
|    C                     Z-ADD0         WSI23
|    C                     Z-ADD0         WSD04
|    C                     Z-ADD0         WSD09
|    C                     MOVE *BLANKS   HSC02
|    C                     MOVE *BLANKS   HSC29
|    C*
|    C                     MOVE *BLANKS   HSC01
|    C                     MOVE *BLANKS   HSC03
|    C                     Z-ADD0         HSC07
|    C                     Z-ADD0         HSC08
|    C                     Z-ADD0         HSC39
|    C                     MOVE *BLANKS   HSC11
|    C**
|    C*M001D               Z-ADD0         DATE    80
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
|    C*                    PARM $EGMDY    S001I2  80
|     *CVR3012 sev.30 Field $EGMDY contains more than one year
|     *CVR3012 sev.30 Field S001I2 contains more than one year
|    C*M001D     DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN050....GET HEADING  FILE
     C*==============================================================*
02===C           RTN050    BEGSR
|    C*
|    C                     EXSR RTN110
|     *
|    C           HSC02     CHAINSC0                  41
|    C                     MOVE 'N'       SC35
|    C                     UPDATSC0
|    C*
|    C           HSC29     CHAINSE0L                 41
| 01-C           *IN41     IFEQ '0'
|   C                     MOVE 'N'       SE36
|   C                     UPDATSE0L
| 01-C                     END
|    C*
|    C*
|    C*檢核出貨倉可用＝Ｙ－＞將確認數量差額還原
|    C           HSC29     SETLLSF0
|    C           HSC29     READESF0                      44
| 02-C           *IN44     DOWEQ'0'
|   C*
|   C           SF04      ADD  SF05      WQTYB              確認前
|   C           SF19      ADD  SF20      WQTYA              確認後
|   C           WQTYB     SUB  WQTYA     WQTYN              差值
| 03-C           WQTYN     IFNE 0
|   C                     MOVELSF16      IA01
|   C*                    MOVE SF26      IA02
|    *以頭檔物流點
|   C                     MOVELSE07      IA02
|   C                     MOVE SF03      IA03
|   C           KEYIA     CHAINIA0                  40
|   C                     SUB  WQTYN     IA09
|   C                     ADD  WQTYN     IA10
|   C  N40                UPDATIA0
| 03-C                     END
|   C*
|   C           HSC29     READESF0                      44
| 02-C                     END
|    C*
|    C                     EXSR RTN060
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN060....GET HEADING  FILE
     C*==============================================================*
03===C           RTN060    BEGSR
|    C*新增一筆至原始／轉帳單據對照檔中
|    C                     MOVE HSC02     SP01
|    C                     MOVE *BLANKS   SP02
|    C                     MOVE HSC30     SP03
|    C                     MOVE *BLANKS   SP04
|    C                     MOVE 'N'       SP05
|    C                     Z-ADDDATE      SPXX
|    C                     TIME           SPYY
|    C                     MOVE $USER     SPZZ
|    C                     WRITESP0
|    C                     WRITEPD1
|    C                     SETON                     10
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
| 02-C           HSC03     IFNE 'S2'
|   C           HSC03     ANDNE'S3'
|   C                     MOVE HSC29     SP01
|   C                     MOVE *BLANKS   SP02
|   C                     MOVE *BLANKS   SP03
|   C                     MOVE *BLANKS   SP04
|   C                     MOVE 'Y'       SP05
|   C                     Z-ADDDATE      SPXX
|   C                     TIME           SPYY
|   C                     MOVE $USER     SPZZ
|   C                     WRITESP0
|   C                     WRITEPD1
|   C                     SETON                     10
| 03-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 03-C                     END
| 02-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING  FILE
     C*==============================================================*
04===C           RTN100    BEGSR
|    C*
|    C                     EXSR RTN110
|    C*
|    C                     SETOF                     596557*57 FOR GUI
|    C* USE單別GET相關資料
|    C                     MOVELSC03      #201
|    C                     MOVELSC03      #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C*
|   C                     MOVE #208      O#208
|   C                     MOVE #209      O#209
|   C                     MOVE #212      O#212
|   C                     MOVE #213      O#213
|   C                     MOVE #214      O#214
|   C*
|   C** IF #207='Y'-->產生轉帳訂單
| 02-C           #207      IFEQ 'Y'
|   C           KEYSD     SETLLSD0
|   C           KEYSD     READESD0                      44
|   C                     MOVE SD16      OSD16
| 03-C           *IN44     DOWEQ'0'
|   C*產品歸屬不等於公司第一碼
| 04-C           SD16      IFNE FSC01
|   C                     EXSR RTN210                     *ADD->SD0
|   C** IF #209='Y'-->產生轉帳發票
| 05-C           O#209     IFEQ 'Y'
|   C                     EXSR RTN250                     *ADD->SJ0
| 05*C                     ELSE
|    *W1S4虛擬發票-->R1SD
|   C                     MOVELHSC30     SJ02
| 05-C                     END
|   C                     SETON                     5965
| 04-C                     END
|    *******
|    *******
|   C*
|   C           KEYSD     READESD0                      44
|    *******PRINT REPORT
| 06-C           *IN44     IFEQ '1'
|   C           *IN59     ANDEQ'0'
|   C                     EXSR RTN060
| 06-C                     END
|    *******
| 07-C           *IN44     IFEQ '1'
|   C           *IN59     ANDEQ'1'
|   C           SD16      ORNE OSD16
|   C           *IN59     ANDEQ'1'
|   C                     EXSR RTN220                     *ADD->SC0
|   C*
| 08-C           O#209     IFEQ 'Y'
|   C           *IN57     ANDEQ'1'
|   C                     EXSR RTN260                     *ADD->SI0
| 08-C                     END
|   C*
|   C** IF #208='Y'-->產生轉帳送貨單
|   C                     SETOF                     58
|   C*
|   C           KEYSF1    SETLLSF0
|   C           KEYSF1    READESF0                      45
| 09-C           *IN45     DOWEQ'0'
|   C*
|   C*************        EXSR RTN290                     還原保留量
|   C*
| 10-C           SF16      IFNE FSC01
|   C                     EXSR RTN230                     *ADD->SF0
|   C                     SETON                     58
| 10-C                     END
|   C*
|   C           KEYSF1    READESF0                      45
| 09-C                     END
|   C*
| 11-C           *IN58     IFEQ '1'
|   C           KEYSE     SETLLSE0L
|   C           KEYSE     READESE0L                     45
| 12-C           *IN45     IFEQ '0'
|   C                     EXSR RTN240                     *ADD->SE0
|   C                     SETOF                     58
| 12-C                     END
| 11-C                     END
|   C*
|   C                     SETOF                     5957
| 07-C                     END
|   C*
| 13-C           SD16      IFNE OSD16
|   C                     MOVE SD16      OSD16
| 13-C                     END
|   C*
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
|    C                     EXSR RTN150                     *UPD->SC0
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN110....MOVE DATA TO STORAGE
      *==============================================================*
05===C           RTN110    BEGSR
|    C*
|    C                     MOVE SC02      HSC02
|    C                     MOVE SC29      HSC29
|    C                     MOVE SC30      HSC30
|    C*
|    C                     MOVE SC01      HSC01
|    C                     MOVE SC03      HSC03
|    C                     Z-ADDSC07      HSC07
|    C                     Z-ADDSC08      HSC08
|    C                     Z-ADDSC39      HSC39
|    C                     MOVE SC11      HSC11
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN150....UPDDTA DATA TO SOSCPF
      *                   還原保留量
      *==============================================================*
06===C           RTN150    BEGSR
|    C*
|    C           HSC02     CHAINSC0                  41
| 01-C           *IN65     IFEQ '1'
|   C                     MOVE 'V'       SC35
| 01*C                     ELSE
|   C                     MOVE 'N'       SC35
| 01-C                     END
|    C                     UPDATSC0
|    C*
|    C           HSC29     CHAINSE0L                 41
| 02-C           *IN41     IFEQ '0'
| 03-C           *IN65     IFEQ '1'
|   C                     MOVE 'V'       SE36
| 03*C                     ELSE
|   C                     MOVE 'N'       SE36
| 03-C                     END
|   C                     UPDATSE0L
| 02-C                     END
|    C*
|    C                     SETOF                     65
|    C*
|    C*檢核出貨倉可用＝Ｙ－＞將確認數量差額還原
|    C           HSC29     SETLLSF0
|    C           HSC29     READESF0                      44
| 04-C           *IN44     DOWEQ'0'
|   C*
| 05-C           O#212     IFEQ 'Y'
|   C*
|   C           SF04      ADD  SF05      WQTYB              確認前
|   C           SF19      ADD  SF20      WQTYA              確認後
|   C           WQTYB     SUB  WQTYA     WQTYN              差值
| 06-C           WQTYN     IFNE 0
|   C                     MOVELSF16      IA01
|   C*                    MOVE SF26      IA02
|    *以頭檔物流點
|   C                     MOVELSE07      IA02
|   C                     MOVE SF03      IA03
|   C           KEYIA     CHAINIA0                  40
|   C                     SUB  WQTYN     IA09
|   C                     ADD  WQTYN     IA10
|   C  N40                UPDATIA0
| 06-C                     END
|   C*
| 05-C                     END
|   C*
| 07-C           HSC03     IFEQ 'S7'
|   C           KEYSQ     CHAINSQ0                  40
|   C*
|   C                     Z-ADDDATE      SQXX
|   C                     TIME           SQYY
|   C                     MOVE $USER     SQZZ
|   C*
|   C           SF19      ADD  SF20      WORK
|   C           WORK      MULT SF10      WFOB1
|   C           WORK      MULT SF11      WFHI1
|   C           WORK      MULT SF12      WDUTY1
|   C           WORK      MULT SF28      WFOB2
|   C           WORK      MULT SF29      WFHI2
|   C           WORK      MULT SF30      WDUTY2
|   C*
| 08-C           *IN40     IFEQ '0'
|   C                     ADD  SF19      SQ04
|   C                     ADD  SF20      SQ05
|   C                     ADD  WFOB1     SQ06
|   C                     ADD  WFHI1     SQ07
|   C                     ADD  WDUTY1    SQ08
|   C                     ADD  WFOB2     SQ13
|   C                     ADD  WFHI2     SQ14
|   C                     ADD  WDUTY2    SQ15
|   C                     UPDATSQ0
| 08*C                     ELSE
|    *
| 09-C           SF19      IFNE 0
|   C           SF20      ORNE 0
|   C                     MOVE *BLANKS   SQ01
|   C                     MOVE SF26      SQ02
|   C                     MOVE SF03      SQ03
|   C                     Z-ADDSF19      SQ04
|   C                     Z-ADDSF20      SQ05
|   C                     Z-ADDWFOB1     SQ06
|   C                     Z-ADDWFHI1     SQ07
|   C                     Z-ADDWDUTY1    SQ08
|   C                     MOVE *BLANKS   SQ09
|   C                     Z-ADD0         SQ10
|   C                     Z-ADD0         SQ11
|   C                     Z-ADD0         SQ12
|   C                     Z-ADDWFOB2     SQ13
|   C                     Z-ADDWFHI2     SQ14
|   C                     Z-ADDWDUTY2    SQ15
|   C                     Z-ADD0         SQ16
|   C                     Z-ADD0         SQ17
|   C                     Z-ADD0         SQ18
|   C                     WRITESQ0
| 09-C                     END
|    *
| 08-C                     END
|   C*
| 07-C                     END
|   C*
|   C           HSC29     READESF0                      44
| 04-C                     END
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA TO SOSDLF01
      *==============================================================*
07===C           RTN210    BEGSR
|    C                     MOVELSD02      HSD02
|    C**訂單明細檔新增
|    C                     MOVE HSC01     SD01
|    C                     MOVELOSD16     SD01
|    C* GET 單別
|    C                     MOVELHSC03     #201
|    C                     MOVELHSC03     #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#205      SC03
| 01*C                     ELSE
|   C                     MOVE *BLANK    SC03
| 01-C                     END
|    C* GET 訂單號碼
| 02-C           *IN59     IFEQ '0'
|   C                     CALL 'RES004'
|   C                     PARM SD01      S004I1  2
|   C                     PARM SC03      S004I2  2
|   C                     PARM HSC07Y    S004I3  20
|   C           WSD02     PARM           S004O1 12
|   C*
| 02-C                     END
|    C                     MOVE WSD02     SD02
|    C* GET單價(SD06)
|    C                     MOVE SD03      MA01
|    C                     MOVE SD03      WSA01
|    C                     MOVE SD03      WSB02
|    C                     Z-ADDHSC07     WSA05
|    C                     Z-ADDHSC07     WSB05
|    C                     MOVE HSC01     #B01
|    C                     Z-ADD0         WSD13
|    C                     Z-ADD0         WSD14
|    C* GET 零售價 FOR單價(SD06)
|    C           KEYMA     CHAINMA0                  40
| 03-C           WSA05     IFLT MA39
|   C                     Z-ADDMA41      WMA41
|   C                     Z-ADDMA41      WSD06
| 03*C                     ELSE
|   C                     Z-ADDMA46      WMA41
|   C                     Z-ADDMA46      WSD06
| 03-C                     END
|    C*
|     *
| 04-C           O#209     IFEQ 'Y'
|   C                     Z-ADDSD10      SD06
|   C                     ADD  SD11      SD06
|   C                     ADD  SD12      SD06
| 04*C                     ELSE
|    *W1S4--->R1SD
|   C                     Z-ADD0         SD06
| 04-C                     END
|    C*
|    C* GET金額／總金額／正常單價
|    C           SD04      MULT SD06      SD07      H
|    C*金額=SD07=SD131 20021202
|    C           SD04      MULT SD06      SD131     H
|    C                     ADD  SD07      TSD07
|    C                     Z-ADDSD06      SD08
|     *
|    C           KEY#B     CHAIN#B0                  40
|    C           #B14      CHAINMD0                  40
|    C                     MOVE #B14      WSB01
|    C                     Z-ADD1         RATE
|    C                     MOVE 'N'       SA04
|    C                     MOVE 'N'       SB04
|    C                     EXSR RTN281
|    C** GET正常折扣
| 05-C           O#214     IFEQ 'N'
|   C                     Z-ADD0         SD13
| 05*C                     ELSE
|   C           SD15      SUB  SD08      WSD13
|   C           WSD13     MULT SD04      SD13      H
| 05-C                     END
|    C* GET正常搭贈SD09
| 06-C           O#213     IFEQ 'N'
|   C                     Z-ADD0         SD09
| 06*C                     ELSE
|   C                     Z-ADD0         WSD09
|   C                     Z-ADDSD04      WSD04
|   C                     EXSR RTN282
|   C                     Z-ADDWSD09     SD09
| 06-C                     END
|    C**
|    C                     Z-ADDSD22      SD10
|    C                     Z-ADDSD23      SD11
|    C                     Z-ADDSD24      SD12
|    C*
|     **************
|    C** GET特別折扣
|     *新－＞僅計算訂購數
|    C           SD04      MULT SD15      SD14      H
|     ***************
|    C                     SUB  SD13      SD14
|    C                     SUB  SD07      SD14
| 07-C           SD14      IFLT 0
|   C                     ADD  SD14      SD13
|   C                     Z-ADD0         SD14
| 07-C                     END
|    C*
|    C** GET產品歸屬
|    C                     MOVE OSD16     SD16
|    C*
|    C* GET單價／搭贈待核註記
|    C                     MOVE 'C'       SD17
|    C                     MOVE 'C'       SD18
|    C***
|    C                     Z-ADDHSC08     SD19
|    C                     MOVE HSC11     SD20
|    C                     MOVE HSC11     SD21
|    C*
|    C                     Z-ADDDATE      SDXX
|    C                     TIME           SDYY
|    C                     MOVE $USER     SDZZ
|    C*
|    C                     WRITESD0
|    C*WRITE SOSRPF禮盒銷售分析成本
|    C                     EXSR RTN211
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN211   禮盒銷售分析成本
      *==============================================================*
08===C           RTN211    BEGSR
|    C*
|    C           SD03      CHAINMA0                  42
| 01-C           *IN42     IFEQ '0'
|    *禮盒碼
|   C           MA54      ANDEQ'Y'
|    *
|   C           SD03      SETLLMF0
|   C           SD03      READEMF0                      44
| 02-C           *IN44     DOWEQ'0'
|    *非附屬品
| 03-C           MF07      IFNE 'Y'
|   C           MF02      CHAINMA0                  42
|    *HSD02未轉帳前訂單號碼
|   C                     MOVELHSD02     SR02
|   C                     MOVELMF01      SR03
|   C                     MOVELMF02      SR04
|   C           KEYSR     CHAINSR0                  42
| 04-C           *IN42     IFEQ '0'
|   C                     MOVELSD01      SR01
|    *SD02轉帳後訂單號碼
|   C                     MOVELSD02      SR02
|   C*
|   C                     Z-ADDDATE      SRXX
|   C                     TIME           SRYY
|   C                     MOVE $USER     SRZZ
|    *
|   C                     WRITESR0
| 04-C                     END                             *IN42
| 03-C                     END                             MF07
|   C           SD03      READEMF0                      44
| 02-C                     END
| 01-C                     END
|     *
08===C                     ENDSR
      *==============================================================*
      *          RTN220....ADD DATA TO SOSCPF
      *==============================================================*
09===C           RTN220    BEGSR
|    C*
|    C**訂單主檔新增
|    C                     MOVELWSD02     SC01
|    C                     MOVE WSD02     SC02
|    C* GET 單別
|    C                     MOVELHSC03     #201
|    C                     MOVELHSC03     #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#205      SC03
| 01*C                     ELSE
|   C                     MOVE *BLANK    SC03
| 01-C                     END
|    C* GET 客戶代號／分店
|    C                     MOVE HSC01     #B01
|    C           KEY#B     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#B14      SC04
|   C                     MOVEL#B15      SC05
| 02*C                     ELSE
|   C                     MOVE *BLANK    SC04
|   C                     MOVE *BLANK    SC05
| 02-C                     END
|    C* GET客戶訂單號碼
|    C                     MOVE *BLANKS   SC06
|    C* GET訂單／交貨日期／訂單狀態
|    C                     Z-ADDHSC07     SC07
|    C                     Z-ADDHSC08     SC08
|    C                     Z-ADDHSC39     SC39
|    C                     MOVE HSC11     SC11
|    C                     MOVE 'V'       SC13
|    C* GET發票聯數／（原）試飲原因代碼／（原）出貨物流點／總金額
|    C                     Z-ADD3         SC09
|    C                     Z-ADDTSD07     SC12
|    C                     Z-ADD0         TSD07
|    C* GET發票地址（總／分）／送貨地址（總／分）
|    C                     MOVELSC04      SC14
|    C                     MOVELSC05      SC15
|    C                     MOVELSC04      SC16
|    C                     MOVELSC05      SC17
|    C* GET（原）訂單註記１，２，３，（原）核準備註
|    C* GET單價／額度／逾期／搭贈／試飲　待核註記
|    C                     MOVE 'C'       SC22
|    C                     MOVE 'C'       SC23
|    C                     MOVE 'C'       SC24
|    C                     MOVE 'C'       SC25
|    C                     MOVE 'C'       SC26
|    C* GET業務人員／客戶地區／區域
|    C                     MOVE SC04      ME01
|    C                     MOVE SC05      ME02
|    C           KEYME     CHAINME0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELME15      SC27
|   C                     MOVE ME07      SC31
|   C                     MOVE ME08      SC32
| 03*C                     ELSE
|   C                     MOVE *BLANKS   SC27
|   C                     MOVE *BLANKS   SC31
|   C                     MOVE *BLANKS   SC32
| 03-C                     END
|    C*
|    C* GET業務員組別
|    C                     MOVE SC27      MC01
|    C           KEYMC     CHAINMC0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVELMC03      SC28
| 04*C                     ELSE
|   C                     MOVE *BLANKS   SC28
| 04-C                     END
|    C* GET送貨單號
|    C                     MOVE SC03      S004I2
|    C                     MOVEL'D'       S004I2
| 05-C           #208      IFEQ 'Y'
|   C                     CALL 'RES005'
|   C                     PARM SC01      S004I1  2
|   C                     PARM           S004I2  2
|   C                     PARM HSC07Y    S004I3  20
|   C           SC29      PARM           S004O1 12
|   C*
| 05-C                     END
|    C*
| 06-C           #208      IFEQ 'N'
|   C                     MOVE *ALL'*'   SC29
| 06-C                     END
|    C*發票號碼
|    C                     MOVE SJ02      SC30
|    C* GET通路／型態
|    C           SC04      CHAINMD0                  40
| 07-C           *IN40     IFEQ '0'
|   C                     MOVE MD07      SC33
|   C                     MOVE MD08      SC34
| 07*C                     ELSE
|   C                     MOVE *BLANKS   SC33
|   C                     MOVE *BLANKS   SC34
| 07-C                     END
|    C* GET轉帳註記／進貨物流點／結帳註記
|    C                     MOVE 'T'       SC35
|    C                     MOVE SC11      SC36
|    C                     MOVE *BLANKS   SC38
|    C***
|    C                     Z-ADDDATE      SCXX
|    C                     TIME           SCYY
|    C                     MOVE $USER     SCZZ
|    C*
|    C                     WRITESC0
|    C*
|    C*新增一筆至原始／轉帳單據對照檔中
|    C                     MOVE HSC02     SP01
|    C                     MOVE WSD02     SP02
|    C                     MOVE HSC30     SP03
|    C                     MOVE SJ02      SP04
|    C                     MOVE 'N'       SP05
|    C                     Z-ADDDATE      SPXX
|    C                     TIME           SPYY
|    C                     MOVE $USER     SPZZ
|    C                     WRITESP0
|    C                     WRITEPD1
|    C                     SETON                     10
| 08-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 08-C                     END
|    C*
|    C*
| 09-C           #208      IFEQ 'Y'
|   C*新增一筆至原始／轉帳單據對照檔中
|   C                     MOVE HSC29     SP01
|   C                     MOVE SC29      SP02
|   C                     MOVE *BLANKS   SP03
|   C                     MOVE *BLANKS   SP04
|   C                     MOVE 'Y'       SP05
|   C                     Z-ADDDATE      SPXX
|   C                     TIME           SPYY
|   C                     MOVE $USER     SPZZ
|   C                     WRITESP0
|   C                     WRITEPD1
|   C                     SETON                     10
| 10-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 10-C                     END
|   C*
|   C*
| 09-C                     END
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN230....ADD DATA TO SOSFPF
      *==============================================================*
10===C           RTN230    BEGSR
|    C*
|    C**送貨明細檔新增
|    C                     MOVE SC01      SF01
|    C* GET 送貨單號
|    C                     MOVE SC29      SF02
|    C* GET單價(SF06)
|    C                     MOVE SF03      MA01
|    C                     MOVE SF03      WSA01
|    C                     MOVE SF03      WSB02
|    C                     Z-ADDHSC07     WSA05
|    C                     Z-ADDHSC07     WSB05
|    C                     MOVE HSC01     #B01
|    C                     Z-ADD0         WSD13
|    C                     Z-ADD0         WSD14
|    C* GET 零售價 FOR單價(SF06)
|    C           KEYMA     CHAINMA0                  40
| 01-C           WSA05     IFLT MA39
|   C                     Z-ADDMA41      WMA41
|   C                     Z-ADDMA41      WSD06
| 01*C                     ELSE
|   C                     Z-ADDMA46      WMA41
|   C                     Z-ADDMA46      WSD06
| 01-C                     END
|    C*
|    C           KEY#B     CHAIN#B0                  40
|    C           #B14      CHAINMD0                  40
|    C                     MOVE #B14      WSB01
|    C                     Z-ADD1         RATE
|    C                     MOVE 'N'       SA04
|    C                     MOVE 'N'       SB04
|    C                     EXSR RTN281
|     *售價＝牌價も（１－（正折％＋特折％））
|    C           WMA41     MULT RATE      WSD08     H
|     *折扣ＵＮＩＴ＝牌價－售價
|    C           WMA41     SUB  WSD08     WRK    110H
|     *特折ＵＮＩＴ＝折扣ＵＮＩＴ－正折ＵＮＩＴ
|    C           WRK       SUB  WSD13     WSD14
| 02-C           WSD14     IFLT 0
|   C                     ADD  WSD14     WSD13
|   C                     Z-ADD0         WSD14
| 02-C                     END
|    C** GET正常折扣
| 03-C           O#214     IFEQ 'N'
|   C                     Z-ADD0         SF13
| 03*C                     ELSE
|   C           WSD13     MULT SF04      SF13      H
| 03-C                     END
|    C*
| 04-C           HSE03     IFEQ 'D4'
|   C           HSE03     OREQ 'D6'
|   C                     Z-ADD0         SF06
| 04*C                     ELSE
|   C                     Z-ADDSF10      SF06
|   C                     ADD  SF11      SF06
|   C                     ADD  SF12      SF06
| 04-C                     END
|    C* GET金額／正常單價
|    C           SF04      MULT SF06      SF07      H
|    C                     Z-ADDSF06      SF08
|    C* GET正常搭贈SF09
| 05-C           O#213     IFEQ 'N'
|   C                     Z-ADD0         SF09
| 05*C                     ELSE
|   C                     Z-ADD0         WSD09
|   C                     Z-ADDSF04      WSD04
|   C                     EXSR RTN282
|   C                     Z-ADDWSD09     SF09
| 05-C                     END
|    C*
|    C                     Z-ADDSF28      SF10
|    C                     Z-ADDSF29      SF11
|    C                     Z-ADDSF30      SF12
|    C** GET牌價
|    C                     Z-ADDWMA41     SF15
|     **************
|     **************
|    C** GET特別折扣
|     *新－＞僅計算訂購數
|    C           SF04      MULT SF15      SF14      H
|     **************
|    C                     SUB  SF13      SF14
|    C                     SUB  SF07      SF14
| 06-C           SF14      IFLT 0
|   C                     ADD  SF14      SF13
|   C                     Z-ADD0         SF14
| 06-C                     END
|    C*
|    C** GET產品歸屬
|    C                     MOVE OSD16     SF16
|    C*
|    C* GET單價／搭贈待核註記
|    C                     MOVE 'C'       SF17
|    C                     MOVE 'C'       SF18
|    C***
|    C                     Z-ADDSC08      SF25
|    C                     MOVE SC11      SF26
|    C                     MOVE SC11      SF27
|    C*
|    C                     Z-ADDDATE      SFXX
|    C                     TIME           SFYY
|    C                     MOVE $USER     SFZZ
|    C*
|    C                     WRITESF0
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN240....ADD DATA TO SOSELF
      *==============================================================*
11===C           RTN240    BEGSR
|    C*
|    C**送貨主檔新增
|    C                     MOVE SC01      SE01
|    C                     MOVE SC29      SE02
|    C* GET 單別
|    C                     MOVELSE03      #201
|    C                     MOVELSE03      #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#205      SE03
| 01*C                     ELSE
|   C                     MOVE *BLANK    SE03
| 01-C                     END
|    C* GET 客戶代號／分店
|    C                     MOVE SC04      SE04
|    C                     MOVE SC05      SE05
|    C* GET交貨日期／出貨物流點／總金額／送訂單狀態
|    C                     Z-ADDSC08      SE06
|    C                     MOVE SC11      SE07
|    C                     Z-ADDSC12      SE08
|    C                     MOVE 'V'       SE09
|    C* GET送貨地址（總／分）
|    C                     MOVE SC16      SE10
|    C                     MOVE SC17      SE11
|    C* GET備註１，２，３
|    C                     MOVE SC18      SE12
|    C                     MOVE SC19      SE13
|    C                     MOVE SC20      SE14
|    C* GET單價／額度／逾期／搭贈／試飲　待核註記
|    C                     MOVE 'C'       SE15
|    C                     MOVE 'C'       SE16
|    C                     MOVE 'C'       SE17
|    C                     MOVE 'C'       SE18
|    C                     MOVE 'C'       SE19
|    C* GET列印序號／列印註記／進貨物流點
|    C                     Z-ADD0         SE20
|    C                     MOVE *BLANKS   SE25
|    C                     MOVE SC11      SE26
|    C* GET通路／型態／訂單號碼
|    C                     MOVE SC33      SE27
|    C                     MOVE SC34      SE28
|    C                     MOVE SC02      SE29
|    C* GET發票號碼
|    C                     MOVE SC30      SE30
|    C* GET業務人員（組別）／客戶地區／區域
|    C                     MOVE SC27      SE32
|    C                     MOVE SC28      SE33
|    C                     MOVE SC31      SE34
|    C                     MOVE SC32      SE35
|    C* GET轉帳註記
|    C                     MOVE 'T'       SE36
|    C***
|    C                     MOVE *BLANKS   SE40
|    C* GET 發票客戶代號／分店
|    C                     MOVE SE04      SE41
|    C                     MOVE SE05      SE42
|    C***
|    C                     Z-ADDDATE      SEXX
|    C                     TIME           SEYY
|    C                     MOVE $USER     SEZZ
|    C*
|    C                     WRITESE0L
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN250....ADD DATA TO SOSJPF
      *==============================================================*
12===C           RTN250    BEGSR
|    C* GET 產品代號
|    C                     MOVE SD03      SJ03
|    C* GET 數量
|    C           SD04      ADD  SD05      SJ04
|    C* GET單價(SJ05)
|    C           SD01      CHAIN#B0                  40
| 01-C           *IN40     IFEQ '0'
|   C           SJ03      CHAINMA0                  40
|   C*
| 02-C           #B06      IFEQ 'A'
| 03-C           HSC08     IFLT MA39
|   C                     Z-ADDMA40      SJ05
| 03*C                     ELSE
|   C                     Z-ADDMA45      SJ05
| 03-C                     END
| 02*C                     ELSE
| 04-C           HSC08     IFLT MA39
|   C                     Z-ADDMA41      SJ05
| 04*C                     ELSE
|   C                     Z-ADDMA46      SJ05
| 04-C                     END
| 02-C                     END
| 01*C                     ELSE
|   C                     Z-ADD0         SJ05
| 01-C                     END
|    C*
|    C*發票明細金額
| 05-C           SJ04      IFNE 0
|   C**發票明細檔新增
|   C                     MOVE SD01      SJ01
|   C* GET發票號碼
| 06-C           *IN57     IFEQ '0'
|   C*
|   C                     MOVE *BLANKS   ERR     1
|   C                     MOVE *BLANKS   CHKNO   4
| 07-C           O#209     IFEQ 'Y'
|   C*須產生發票
|   C                     MOVELSC03      #201
|   C                     MOVELSC03      #202
|   C           KEY#2     CHAIN#20                  40
|   C                     MOVE #210      W#210
|   C*產生虛擬發票－＞發票號碼為訂單號碼後十碼
| 08-C           #210      IFEQ 'Y'
|   C                     MOVE SD02      WSJ02
| 08*C                     ELSE
|   C*產生正式發票
|    *以確認年月
|   C*                    MOVELHSC39     S014I2
|   C                     MOVE HSC39     W39     60
|   C                     MOVELW39       S014I2
|    *
|   C                     Z-ADDWSC39S    W6      60
|   C                     CALL 'RES014'
|   C                     PARM SD01      S014I1  2
|   C                     PARM           S014I2  40
|   C                     PARM W6        S014I3  60
|   C           WSJ02     PARM           S014O1 10
|   C           CHKNO     PARM           S014O2  4
|   C           ERR       PARM           S014O3  1
| 08-C                     END
| 07-C                     END
|   C*無須產生發票
| 09-C           O#209     IFEQ 'N'
|   C                     MOVE *ALL'*'   WSJ02
| 09-C                     END
|   C*
| 06-C                     END
|   C                     MOVE WSJ02     SJ02
|   C*
|   C* GET 金額／折扣／銷退數量／銷退金額
|    *SJ07=(SJ05 - SD06) *(SJ04 - SJ13)
|   C                     Z-ADDSD05      SJ13
|   C           SJ05      SUB  SD06      WFLD1  112
|   C           SJ04      SUB  SJ13      WFLD2   90
|   C           WFLD1     MULT WFLD2     SJ07      H
|   C*911125
|   C           WFLD1     MULT WFLD2     SJ071     H
|    *SJ07=(SJ05) *(SJ04 - SJ13)
|   C           WFLD2     MULT SJ05      SJ06      H
|   C*          WFLD2     MULT SJ05      SJ061     H
M999MC           WFLD2     MULT SD06      SJ061     H
|   C                     ADD  SJ04      TSJ04
|   C                     ADD  SD07      WSI23
|   C                     Z-ADD0         SJ08
|   C                     Z-ADD0         SJ09
|   C                     MOVE SD16      SJ10
|    ******發票客戶
|   C                     MOVELHSC01     #B01
|   C           KEY#B     CHAIN#B0                  40
| 10-C           *IN40     IFEQ '0'
|   C                     MOVE #B14      SJ11
|   C                     MOVE #B15      SJ12
| 10*C                     ELSE
|   C                     MOVEL*BLANKS   SJ11
|   C                     MOVEL*BLANKS   SJ12
| 10-C                     END
|    *******
|   C                     Z-ADDSC39      SJ16
|   C                     Z-ADD0         SJ14
|   C                     Z-ADD0         SJ15
|   C***
|   C                     Z-ADDDATE      SJXX
|   C                     TIME           SJYY
|   C                     MOVE $USER     SJZZ
|   C*
|   C                     WRITESJ0
|   C                     SETON                     57
| 05-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN260....ADD DATA TO SOSIPF
      *==============================================================*
13===C           RTN260    BEGSR
|    C*
|    C*發票金額
|    C                     MOVE SC09      SI17
|    C                     MOVE SC37      SI22
|    C                     Z-ADDWSI23     SI23
|    C                     Z-ADD0         WSI23
| 01-C           SI22      IFEQ 'D'
|   C*M003D     SI17      ANDEQ3
|   C           SI23      MULT DUTY      SI24      H
| 01*C                     ELSE
|   C                     Z-ADD0         SI24
| 01-C                     END
|    C*
|    C*發票金額＜＞０
|    C           SI23      ADD  SI24      SI25
| 02-C           TSJ04     IFNE 0
|   C                     Z-ADD0         TSJ04
|   C**發票主檔新增
|   C                     MOVE SC01      SI01
|   C                     MOVE SC30      SI02
|   C                     MOVE SC33      SI03
|   C                     MOVE SC34      SI04
|   C                     MOVE SC11      SI05
|   C                     MOVE CHKNO     SI07
|   C                     MOVE SC04      SI08
|   C                     MOVE SC05      SI09
|   C                     MOVE SC02      SI10
|   C                     MOVE SC29      SI11
|   C                     MOVE SC14      SI12
|   C                     MOVE SC15      SI13
|   C                     MOVE SC16      SI14
|   C                     MOVE SC17      SI15
|   C                     MOVE W#210     SI16
|    *發票第二碼為數字表虛擬發票
| 03-C           SI021     IFGE '0'
|   C           SI02L     ANDNE'**'
|   C                     MOVEL'Y'       SI16
|   C                     MOVE *BLANK    SI07
| 03-C                     END
|    *
|   C                     MOVE *BLANKS   SI18
|   C                     MOVE *BLANKS   SI19
|   C                     MOVE *BLANKS   SI20
| 04-C           SC08      IFNE 0
|    *CVR2001 sev.20 Converted code may contain conceptual errors. Please
|    *   verify
|   C                     Z-ADDSC08      SI06
| 04*C                     ELSE
|   C                     Z-ADDSC07      SI06
| 04-C                     END
|   C                     Z-ADDSC39      SI21
|   C*
|   C*發票金額
|   C           SI23      ADD  SI24      SI25
|   C                     Z-ADD0         SI26
|   C                     Z-ADD0         SI27
|   C                     Z-ADD0         SI28
|   C*應收日期
|   C*          SC08      IFNE 0
|   C*                    Z-ADDSC08      WSC08   60
|   C*                    ELSE
|   C*                    Z-ADDSC07      WSC08   60
|   C*                    END
|   C                     Z-ADDSC39      WSC08   80
|   C*
|   C           SC14      CHAINMD0                  40
| 05-C           *IN40     IFEQ '0'
| 06-C                     SELEC
|   C           MD23      WHEQ 'C'
|   C                     Z-ADDWSC08     SI29
|   C           MD23      WHEQ 'D'
|   C           SC08      SUB  19110000  P6201I
|    *CVR0001 sev.00 Field P6201I is not a date or year
|    *CVR5008 sev.50 The converter tool cannot handle op-code SUB
|    *   involving not-expanded and expanded date fields requiring
|    *   add/remove century. Code must be adjusted manually
|   C                     CALL 'P62'
|   C                     PARM           P6201I  60
|   C                     PARM MD25      P6202I  40
|   C           W6        PARM           P6211O  60
|   C           W6        ADD  19110000  SI29
|   C           MD23      WHEQ 'M'
| 07-C           WSC08D    IFGT MD24
|   C                     ADD  1         WSC08M
| 07-C                     END
|   C                     ADD  MD26M     WSC08M
| 08-C           WSC08M    IFGT 12
|   C                     SUB  12        WSC08M
|   C                     ADD  1         WSC08Y
| 08-C                     END
|   C*
|   C*M001M               MOVELWSC08Y    P2201I  40
|   C                     MOVELWSC08Y    W6      60
|   C                     MOVE WSC08M    W6
|   C           W6        SUB  191100    P2201I  40
|    *CVR0001 sev.00 Field WSC08M is not a date or year
|    *CVR0004 sev.00 Assumed to be the update of a date field in the zone
|    *   that does not contain a year
|   C*M001M               SUB  1100      P2201I
|   C                     CALL 'P22'
|   C                     PARM           P2201I
|   C                     PARM           P2201O  1
|   C                     PARM           P2202O  20
|   C*
| 09-C           MD26D     IFGT P2202O
|   C                     Z-ADDP2202O    WSC08D
| 09*C                     ELSE
|   C                     Z-ADDMD26D     WSC08D
| 09-C                     END
|   C*
|   C                     Z-ADDWSC08     SI29
| 06-C                     ENDSL
| 05-C                     END
|   C*
|   C                     Z-ADDSI25      SI30
|   C                     MOVE SC27      SI31
|   C                     MOVE SC28      SI32
|   C                     Z-ADD0         SI33
|   C                     MOVE *BLANKS   SI34
|   C                     Z-ADDSC39      SI35
|   C*
|   C***
|   C                     Z-ADDDATE      SIXX
|   C                     TIME           SIYY
|   C                     MOVE $USER     SIZZ
|   C*
|   C                     WRITESI0
|   C*
|   C*更新客戶之應收帳款**
|   C*
|   C           SI08      CHAINMD0                  40
| 10-C           *IN40     IFEQ '0'
|   C                     ADD  SI25      MD29
|   C                     ADD  SI25      MD31
|   C                     UPDATMD0
| 10-C                     END
| 02-C                     END
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          RTN281....GET 單價／正常折扣
     C*==============================================================*
14===C           RTN281    BEGSR
|    C*
|    C                     SETOF                     61
|    C                     MOVELWSA011    KSA01
|    C                     MOVELWSB021    KSB02
|     *
|    C           KEYSB1    SETGTSB0
|    C           KEYSB2    REDPESB0                      48
| 01-C           *IN48     DOWEQ'0'
|   C           *IN61     ANDEQ'0'
| 02-C           WSA05     IFGE SB05
|   C           WSA05     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
| 03-C           SB04      IFEQ 'N'
|   C           WMA41     MULT SB06      WSD13     H      *正常折扣
|   C                     SUB  SB06      RATE
| 03*C                     ELSE
|   C                     SUB  SB06      RATE
| 03-C                     END
|   C                     SETON                     61
| 02*C                     ELSE
|   C           KEYSB2    REDPESB0                      48
| 02-C                     END
| 01-C                     END
|    C*
| 04-C           *IN61     IFEQ '0'
|   C           SB1KEY    SETGTSB0
|   C           SB2KEY    REDPESB0                      48
| 05-C           *IN48     DOWEQ'0'
|   C           *IN61     ANDEQ'0'
| 06-C           WSA05     IFGE SB05
|   C           WSA05     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
| 07-C           SB04      IFEQ 'N'
|   C           WMA41     MULT SB06      WSD13     H      *正常折扣
|   C                     SUB  SB06      RATE
| 07*C                     ELSE
|   C                     SUB  SB06      RATE
| 07-C                     END
|   C                     SETON                     61
| 06*C                     ELSE
|   C           SB2KEY    REDPESB0                      48
| 06-C                     END
| 05-C                     END
| 04-C                     END
|    C*
| 08-C           *IN61     IFEQ '0'
|   C           KEYSA1    SETGTSA0
|   C           KEYSA2    REDPESA0                      48
| 09-C           *IN48     DOWEQ'0'
|   C           *IN61     ANDEQ'0'
| 10-C           WSA05     IFGE SA05
|   C           WSA05     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
| 11-C           SA04      IFEQ 'N'
|   C           WMA41     MULT SA06      WSD13     H      *正常折扣
|   C                     SUB  SA06      RATE
| 11*C                     ELSE
|   C                     SUB  SA06      RATE
| 11-C                     END
|   C                     SETON                     61
| 10*C                     ELSE
|   C           KEYSA2    REDPESA0                      48
| 10-C                     END
| 09-C                     END
| 08-C                     END
|    C*
| 12-C           *IN61     IFEQ '0'
|   C           SA1KEY    SETGTSA0
|   C           SA2KEY    REDPESA0                      48
| 13-C           *IN48     DOWEQ'0'
|   C           *IN61     ANDEQ'0'
| 14-C           WSA05     IFGE SA05
|   C           WSA05     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
| 15-C           SA04      IFEQ 'N'
|   C           WMA41     MULT SA06      WSD13     H      *正常折扣
|   C                     SUB  SA06      RATE
| 15*C                     ELSE
|   C                     SUB  SA06      RATE
| 15-C                     END
|   C                     SETON                     61
| 14*C                     ELSE
|   C           SA2KEY    REDPESA0                      48
| 14-C                     END
| 13-C                     END
| 12-C                     END
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN282....GET 正常搭贈
     C*==============================================================*
15===C           RTN282    BEGSR
|    C*
|    C                     MOVE 'A'       SA04
|    C                     MOVE 'A'       SB04
|    C*
|    C                     SETOF                     61
|    C                     MOVELWSA011    KSA01
|    C                     MOVELWSB021    KSB02
|     *
|    C           KEYSB1    SETGTSB0
|    C           KEYSB2    REDPESB0                      48
| 01-C           *IN48     DOWEQ'0'
|   C           *IN61     ANDEQ'0'
| 02-C           WSA05     IFGE SB05
|   C           WSA05     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
|   C*
| 03-C           WSD04     IFLT SB08
|   C           SB08      OREQ 0
|   C                     Z-ADD0         WSD09
| 03*C                     ELSE
| 04-C           WSD04     IFGE SB08
|   C           WSD04     ANDLTSB10
|   C           WSD04     ORGE SB08
|   C           SB10      ANDEQ0
|   C           WSD04     DIV  SB08      WSD09
|   C                     MULT SB07      WSD09
| 04*C                     ELSE
| 05-C           WSD04     IFGE SB10
|   C           WSD04     ANDLTSB12
|   C           WSD04     ORGE SB10
|   C           SB12      ANDEQ0
|   C           WSD04     DIV  SB10      WSD09
|   C                     MULT SB09      WSD09
| 05*C                     ELSE
| 06-C           WSD04     IFGE SB12
|   C           SB12      ANDNE0
|   C           WSD04     DIV  SB12      WSD09
|   C                     MULT SB11      WSD09
| 06-C                     END
| 05-C                     END
| 04-C                     END
| 03-C                     END
|   C*
|   C                     SETON                     61
| 02*C                     ELSE
|   C           KEYSB2    REDPESB0                      48
| 02-C                     END
| 01-C                     END
|    C*
| 07-C           *IN61     IFEQ '0'
|   C           SB1KEY    SETGTSB0
|   C           SB2KEY    REDPESB0                      48
| 08-C           *IN48     DOWEQ'0'
|   C           *IN61     ANDEQ'0'
| 09-C           WSA05     IFGE SB05
|   C           WSA05     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
|   C*
| 10-C           WSD04     IFLT SB08
|   C           SB08      OREQ 0
|   C                     Z-ADD0         WSD09
| 10*C                     ELSE
| 11-C           WSD04     IFGE SB08
|   C           WSD04     ANDLTSB10
|   C           WSD04     ORGE SB08
|   C           SB10      ANDEQ0
|   C           WSD04     DIV  SB08      WSD09
|   C                     MULT SB07      WSD09
| 11*C                     ELSE
| 12-C           WSD04     IFGE SB10
|   C           WSD04     ANDLTSB12
|   C           WSD04     ORGE SB10
|   C           SB12      ANDEQ0
|   C           WSD04     DIV  SB10      WSD09
|   C                     MULT SB09      WSD09
| 12*C                     ELSE
| 13-C           WSD04     IFGE SB12
|   C           SB12      ANDNE0
|   C           WSD04     DIV  SB12      WSD09
|   C                     MULT SB11      WSD09
| 13-C                     END
| 12-C                     END
| 11-C                     END
| 10-C                     END
|   C*
|   C                     SETON                     61
| 09*C                     ELSE
|   C           SB2KEY    REDPESB0                      48
| 09-C                     END
| 08-C                     END
| 07-C                     END
|    C*
| 14-C           *IN61     IFEQ '0'
|   C           KEYSA1    SETGTSA0
|   C           KEYSA2    REDPESA0                      48
| 15-C           *IN48     DOWEQ'0'
|   C           *IN61     ANDEQ'0'
| 16-C           WSA05     IFGE SA05
|   C           WSA05     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
|   C*
| 17-C           WSD04     IFLT SA08
|   C           SA08      OREQ 0
|   C                     Z-ADD0         WSD09
| 17*C                     ELSE
| 18-C           WSD04     IFGE SA08
|   C           WSD04     ANDLTSA10
|   C           WSD04     ORGE SA08
|   C           SA10      ANDEQ0
|   C           WSD04     DIV  SA08      WSD09
|   C                     MULT SA07      WSD09
| 18*C                     ELSE
| 19-C           WSD04     IFGE SA10
|   C           WSD04     ANDLTSA12
|   C           WSD04     ORGE SA10
|   C           SA12      ANDEQ0
|   C           WSD04     DIV  SA10      WSD09
|   C                     MULT SA09      WSD09
| 19*C                     ELSE
| 20-C           WSD04     IFGE SA12
|   C           SA12      ANDNE0
|   C           WSD04     DIV  SA12      WSD09
|   C                     MULT SA11      WSD09
| 20-C                     END
| 19-C                     END
| 18-C                     END
| 17-C                     END
|   C*
|   C                     SETON                     61
| 16*C                     ELSE
|   C           KEYSA2    REDPESA0                      48
| 16-C                     END
| 15-C                     END
| 14-C                     END
|     *
| 21-C           *IN61     IFEQ '0'
|   C           SA1KEY    SETGTSA0
|   C           SA2KEY    REDPESA0                      48
| 22-C           *IN48     DOWEQ'0'
|   C           *IN61     ANDEQ'0'
| 23-C           WSA05     IFGE SA05
|   C           WSA05     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
|   C*
| 24-C           WSD04     IFLT SA08
|   C           SA08      OREQ 0
|   C                     Z-ADD0         WSD09
| 24*C                     ELSE
| 25-C           WSD04     IFGE SA08
|   C           WSD04     ANDLTSA10
|   C           WSD04     ORGE SA08
|   C           SA10      ANDEQ0
|   C           WSD04     DIV  SA08      WSD09
|   C                     MULT SA07      WSD09
| 25*C                     ELSE
| 26-C           WSD04     IFGE SA10
|   C           WSD04     ANDLTSA12
|   C           WSD04     ORGE SA10
|   C           SA12      ANDEQ0
|   C           WSD04     DIV  SA10      WSD09
|   C                     MULT SA09      WSD09
| 26*C                     ELSE
| 27-C           WSD04     IFGE SA12
|   C           SA12      ANDNE0
|   C           WSD04     DIV  SA12      WSD09
|   C                     MULT SA11      WSD09
| 27-C                     END
| 26-C                     END
| 25-C                     END
| 24-C                     END
|   C*
|   C                     SETON                     61
| 23*C                     ELSE
|   C           SA2KEY    REDPESA0                      48
| 23-C                     END
| 22-C                     END
| 21-C                     END
|    C*
| 28-C           *IN61     IFEQ '0'
|   C                     Z-ADD0         WSD09
| 28-C                     END
15===C                     ENDSR
     C*==============================================================*
     C*          RTN300....GET HEADING  FILE
     C*==============================================================*
16===C           RTN300    BEGSR
|    C*
|    C                     EXSR RTN310
|    C*
|    C                     SETOF                     5965
|    C* USE單別GET相關資料
|    C                     MOVELSE03      #201
|    C                     MOVELSE03      #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C*
|   C** IF #208='Y'-->產生轉帳送貨單
| 02-C           #208      IFEQ 'Y'
|   C           KEYSF2    SETLLSF0
|   C           KEYSF2    READESF0                      44
|   C                     MOVE SF16      OSD16
| 03-C           *IN44     DOWEQ'0'
|   C*
|   C                     EXSR RTN490                     還原保留量
|   C*
| 04-C           SF16      IFNE FSE01
|   C                     EXSR RTN410                     *ADD->SF0
|   C                     SETON                     5965
| 04-C                     END
|   C*
|   C           KEYSF2    READESF0                      44
| 05-C           *IN44     IFEQ '1'
|   C           *IN59     ANDEQ'1'
|   C           SF16      ORNE OSD16
|   C           *IN59     ANDEQ'1'
|   C                     EXSR RTN420                     *ADD->SE0
|   C*
|   C                     SETOF                     59
| 05-C                     END
|    *****PRINT REPORT
| 06-C           *IN44     IFEQ '1'
|   C           *IN59     ANDEQ'0'
|   C           SF16      ANDEQFSE01
|   C                     EXSR RTN411
| 06-C                     END
|   C*
| 07-C           SF16      IFNE OSD16
|   C                     MOVE SF16      OSD16
| 07-C                     END
|   C*
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
|    C                     EXSR RTN350                     *UPD->SC0
|    C*
16===C                     ENDSR
      *==============================================================*
      *          RTN310....MOVE DATA TO STORAGE
      *==============================================================*
17===C           RTN310    BEGSR
|    C*
|    C                     MOVE SE01      HSE01
|    C                     MOVE SE02      HSC29
|    C                     MOVE SE03      HSE03
|    C                     Z-ADDSE06      HSE06
|    C                     MOVE SE07      HSE07
|    C                     Z-ADD0         TSF07
|    C                     MOVE SE30      HSE30
|    C                     Z-ADDSE39      HSE39
|    C*
17===C                     ENDSR
      *==============================================================*
      *          RTN350....UPDDTA DATA TO SOSEPF
      *==============================================================*
18===C           RTN350    BEGSR
|    C*
|    C           HSC29     CHAINSE0                  41
| 01-C           *IN65     IFEQ '1'
|   C                     MOVE 'V'       SE36
|   C                     SETOF                     65
| 01*C                     ELSE
|   C                     MOVE 'N'       SE36
| 01-C                     END
|    C                     UPDATSE0
18===C                     ENDSR
      *==============================================================*
      *          RTN410....ADD DATA TO SOSFPF
      *==============================================================*
19===C           RTN410    BEGSR
|    C*
|    C**送貨明細檔新增
|    C                     MOVE HSE01     SF01
|    C                     MOVELOSD16     SF01
|    C* USE單別GET相關資料
|    C                     MOVELHSE03     #201
|    C                     MOVELHSE03     #202
|    C           KEY#2     CHAIN#20                  40
|    C   40                MOVE *BLANKS   SE03
|    C  N40                MOVE #205      SE03
|    C* GET 送貨單號
| 01-C           *IN59     IFEQ '0'
|   C                     CALL 'RES005'
|   C                     PARM SF01      S004I1  2
|   C                     PARM SE03      S004I2  2
|   C                     PARM HSE39Y    S004I3  20
|   C           WSF02     PARM           S004O1 12
|   C*
|   C*新增一筆至原始／轉帳單據對照檔中
|   C                     MOVE HSC29     SP01
|   C                     MOVE WSF02     SP02
|   C                     MOVE *BLANKS   SP03
|   C                     MOVE *BLANKS   SP04
|   C                     MOVE 'Y'       SP05
|   C                     Z-ADDDATE      SPXX
|   C                     TIME           SPYY
|   C                     MOVE $USER     SPZZ
|   C                     WRITESP0
|   C                     WRITEPD1
|   C                     SETON                     10
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|   C*
|   C*
| 01-C                     END
|    C* GET單價(SF06)
|    C                     MOVE WSF02     SF02
|    C                     MOVE SF03      MA01
|    C                     MOVE SF03      WSA01
|    C                     MOVE SF03      WSB02
|    C                     Z-ADDHSE06     WSA05
|    C                     Z-ADDHSE06     WSB05
|    C                     MOVE HSE01     #B01
|    C                     Z-ADD0         WSD13
|    C                     Z-ADD0         WSD14
|    C* GET 零售價 FOR單價(SF06)
|    C           KEYMA     CHAINMA0                  40
| 03-C           WSA05     IFLT MA39
|   C                     Z-ADDMA41      WMA41
|   C                     Z-ADDMA41      WSD06
| 03*C                     ELSE
|   C                     Z-ADDMA46      WMA41
|   C                     Z-ADDMA46      WSD06
| 03-C                     END
|    C*
|    C           KEY#B     CHAIN#B0                  40
|    C           #B14      CHAINMD0                  40
|    C                     MOVE #B14      WSB01
|    C                     Z-ADD1         RATE    76
|    C                     MOVE 'N'       SA04
|    C                     MOVE 'N'       SB04
|    C                     EXSR RTN281
|    C** GET正常折扣
| 04-C           #214      IFEQ 'N'
|   C                     Z-ADD0         SF13
| 04*C                     ELSE
|   C           WSD13     MULT SF04      SF13      H
| 04-C                     END
|    C*
|    C                     MOVE 'S'       SA04
|    C                     MOVE 'S'       SB04
|    C                     EXSR RTN281
|    C           WMA41     MULT RATE      WSD06     H
|    C                     Z-ADDWSD06     SF06
|    C* GET金額／正常單價
|    C           SF04      MULT SF06      SF07      H
|    C                     ADD  SF07      TSF07
|    C                     Z-ADDSF06      SF08
|    C* GET正常搭贈SF09
| 05-C           #213      IFEQ 'N'
|   C                     Z-ADD0         SF09
| 05*C                     ELSE
|   C                     Z-ADD0         WSD09
|   C                     Z-ADDSF04      WSD04
|   C                     EXSR RTN282
|   C                     Z-ADDWSD09     SF09
| 05-C                     END
|    C*
|    C                     Z-ADDSF28      SF10
|    C                     Z-ADDSF29      SF11
|    C                     Z-ADDSF30      SF12
|    C** GET牌價
|    C                     Z-ADDWMA41     SF15
|    C*
|    C** GET特別折扣
|    C           SF04      ADD  SF05      WSD14
|    C           WSD14     MULT SF15      SF14      H
|    C                     SUB  SF13      SF14
|    C                     SUB  SF07      SF14
| 06-C           SF14      IFLT 0
|   C                     ADD  SF14      SF13
|   C                     Z-ADD0         SF14
| 06-C                     END
|    C*
|    C** GET產品歸屬
|    C                     MOVE OSD16     SF16
|    C*
|    C* GET單價／搭贈待核註記
|    C                     MOVE 'C'       SF17
|    C                     MOVE 'C'       SF18
|    C***
|    C                     Z-ADDSE06      SF25
|    C                     MOVE SE07      SF26
|    C                     MOVE SE07      SF27
|     *
| 07-C           SE03      IFEQ 'DH'
|   C                     Z-ADD0         SF06
|   C                     Z-ADD0         SF07
|   C                     Z-ADD0         TSF07
|   C                     Z-ADD0         SF08
|   C                     Z-ADD0         SF09
|   C                     Z-ADD0         SF13
|   C                     Z-ADD0         SF14
| 07-C                     END
|    C*
|    C                     Z-ADDDATE      SFXX
|    C                     TIME           SFYY
|    C                     MOVE $USER     SFZZ
|    C*
|    C                     WRITESF0
|    C*
19===C                     ENDSR
      *==============================================================*
      *          RTN411....PRINT REPORT
      *==============================================================*
20===C           RTN411    BEGSR
|    C*
|    C                     MOVE HSC29     SP01
|    C                     MOVE *BLANKS   SP02
|    C                     MOVE HSE30     SP03
|    C                     MOVE *BLANKS   SP04
|    C                     MOVE 'Y'       SP05
|    C                     Z-ADDDATE      SPXX
|    C                     TIME           SPYY
|    C                     MOVE $USER     SPZZ
|    C                     WRITESP0
|    C                     WRITEPD1
|    C                     SETON                     10
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C*
20===C                     ENDSR
      *==============================================================*
      *          RTN420....ADD DATA TO SOSELF
      *==============================================================*
21===C           RTN420    BEGSR
|    C*
|    C**送貨主檔新增
|    C                     MOVELWSF02     SE01
|    C                     MOVE WSF02     SE02
|    C* GET 單別
|    C                     MOVELHSE03     #201
|    C                     MOVELHSE03     #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#205      SE03
| 01*C                     ELSE
|   C                     MOVE *BLANK    SE03
| 01-C                     END
|    C* GET 客戶代號／分店
|    C           HSE01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVE #B14      SE04
|   C                     MOVE #B15      SE05
| 02*C                     ELSE
|   C                     MOVE *BLANK    SE04
|   C                     MOVE *BLANK    SE05
| 02-C                     END
|    C* GET原交貨日期／原出貨物流點／總金額／送訂單狀態
|    C                     Z-ADDTSF07     SE08
|    C                     Z-ADD0         TSF07
|    C                     MOVE 'V'       SE09
|    C* GET送貨地址（總／分）
|    C                     MOVE SE04      SE10
|    C                     MOVE SE05      SE11
|    C* GET原備註１，２，３
|    C* GET單價／額度／逾期／搭贈／試飲　待核註記
|    C                     MOVE 'C'       SE15
|    C                     MOVE 'C'       SE16
|    C                     MOVE 'C'       SE17
|    C                     MOVE 'C'       SE18
|    C                     MOVE 'C'       SE19
|    C* GET列印序號／列印註記／進貨物流點
|    C                     Z-ADD0         SE20
|    C                     MOVE *BLANKS   SE25
|    C                     MOVE SE07      SE26
|    C* GET通路／型態／訂單號碼／發票號碼
|    C           SE04      CHAINMD0                  40
| 03-C           *IN40     IFEQ '0'
|   C*                    MOVE SD07      SE27
|   C*                    MOVE SD08      SE28
M001MC                     MOVE MD07      SE27
M001MC                     MOVE MD08      SE28
| 03*C                     ELSE
|   C                     MOVE *BLANKS   SE27
|   C                     MOVE *BLANKS   SE28
| 03-C                     END
|    C                     MOVE *BLANKS   SE29
|    C                     MOVE *BLANKS   SE30
|    C* GET業務人員（組別）／客戶地區／區域
|    C                     MOVE SE04      ME01
|    C                     MOVE SE05      ME02
|    C           KEYME     CHAINME0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVE ME07      SE34
|   C                     MOVE ME08      SE35
|   C                     MOVE ME15      SE32
| 04*C                     ELSE
|   C                     MOVE *BLANKS   SE34
|   C                     MOVE *BLANKS   SE35
|   C                     MOVE *BLANKS   SE32
| 04-C                     END
|    C*
|    C           SE32      CHAINMC0                  40
|    C   40                MOVE *BLANKS   SE33
|    C  N40                MOVE MC03      SE33
|    C* GET轉帳註記
|    C                     MOVE 'T'       SE36
|    C***
|    C                     MOVE *BLANKS   SE40
|    C***
|    C                     Z-ADDDATE      SEXX
|    C                     TIME           SEYY
|    C                     MOVE $USER     SEZZ
|    C*
|    C                     MOVE SE04      SE41
|    C                     MOVE SE05      SE42
|    C                     WRITESE0L
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          RTN490....還原保留量
     C*==============================================================*
22===C           RTN490    BEGSR
|    C*
|    C*檢核出貨倉可用＝Ｙ－＞將確認數量差額還原
| 01-C           #212      IFEQ 'Y'
|   C*
|   C           SF04      ADD  SF05      WQTYB              確認前
|   C           SF19      ADD  SF20      WQTYA              確認後
|   C           WQTYB     SUB  WQTYA     WQTYN              差值
| 02-C           WQTYN     IFNE 0
|   C                     MOVELSF16      IA01
|   C*                    MOVE SF26      IA02
|    *以頭檔物流點
|   C                     MOVELSE07      IA02
|   C                     MOVE SF03      IA03
|   C           KEYIA     CHAINIA0                  40
|   C                     SUB  WQTYN     IA09
|   C                     ADD  WQTYN     IA10
|   C  N40                UPDATIA0
| 02-C                     END
| 01-C                     END
|    C*
|    C*單別＝Ｄ８　補貨送貨單
| 03-C           HSE03     IFEQ 'D8'
|   C           SF04      ADD  SF05      WQTYB              確認前
|   C           SF19      ADD  SF20      WQTYA              確認後
|   C           WQTYB     SUB  WQTYA     WQTYN              差值
| 04-C           WQTYN     IFNE 0
|   C                     MOVELSF16      IA01
|   C                     MOVE SF27      IA02
|   C                     MOVE SF03      IA03
|   C           KEYIA     CHAINIA0                  40
|   C                     ADD  WQTYN     IA09
|   C                     SUB  WQTYN     IA10
|   C  N40                UPDATIA0
| 04-C                     END
| 03-C                     END
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          RTN500....GET HEADING  FILE (銷售退回)
     C*==============================================================*
23===C           RTN500    BEGSR
|    C*
|    C                     EXSR RTN510
|    C*
|    C                     SETOF                     5965
|    C                     Z-ADD0         SG22
|    C                     Z-ADD0         SG23
|    C                     Z-ADD0         SG24
|    C*
|    C           KEYSH2    SETLLSH0
|    C           KEYSH2    READESH0                      44
|    C                     MOVE SH11      OSD16
| 01-C           *IN44     DOWEQ'0'
|   C*
| 02-C           SH11      IFNE FSG01
|    *GET轉帳折讓單號及退貨單號
|   C                     EXSR RTN610                     *ADD->SH0
|   C                     SETON                     5965
| 02-C                     END
|   C*
|   C           KEYSH2    READESH0                      44
| 03-C           *IN44     IFEQ '1'
|   C           *IN59     ANDEQ'1'
|   C           SH11      ORNE OSD16
|   C           *IN59     ANDEQ'1'
|   C                     EXSR RTN620                     *ADD->SG0
|   C*
|   C                     SETOF                     59
| 03-C                     END
|   C*
| 04-C           SH11      IFNE OSD16
|   C                     MOVE SH11      OSD16
| 04-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     EXSR RTN550                     *UPD->SC0
|    C*
23===C                     ENDSR
      *==============================================================*
      *          RTN510....MOVE DATA TO STORAGE
      *==============================================================*
24===C           RTN510    BEGSR
|    C*
|    C                     MOVE SG01      HSG01
|    C                     MOVE SG02      HSG02
|    C                     MOVE SG03      HSG03
|    C                     Z-ADDSG06      HSG06
|    C                     MOVE SG07      HSG07
|    C                     MOVE SG09      HSG09
|    C*
24===C                     ENDSR
      *==============================================================*
      *          RTN550....UPDDTA DATA TO SOSGPF
      *==============================================================*
25===C           RTN550    BEGSR
|    C*
|    C           HSG02     CHAINSG0                  41
| 01-C           *IN65     IFEQ '1'
|   C                     MOVE 'A'       SG14
|   C                     SETOF                     65
| 01*C                     ELSE
|   C                     MOVE 'N'       SG14
| 01-C                     END
|    C                     UPDATSG0
|    C*
25===C                     ENDSR
      *==============================================================*
      *          RTN610....ADD DATA TO SOSFPF
      *==============================================================*
26===C           RTN610    BEGSR
|    C*
|    C**銷退明細檔新增
|    C                     MOVE HSG01     SH01
|    C                     MOVELOSD16     SH01
|    C* GET 退貨單號
| 01-C           *IN59     IFEQ '0'
|   C                     CALL 'RES006'
|   C                     PARM SH01      S006I1  2
|   C                     PARM 'RA'      S006I2  2
|   C                     PARM HSG06Y    S006I3  20
|   C           WSH02     PARM           S006O1 12
|   C* GET 折讓單號
|   C                     CALL 'RES012'
|   C                     PARM SH01      S006I1  2
|   C                     PARM 'CA'      S006I2  2
|   C                     PARM HSG06Y    S006I3  20
|   C           WSG09     PARM           S006O1 12
|   C*
|   C*新增一筆至原始／轉帳單據對照檔中
|   C                     MOVE HSG02     SP01
|   C                     MOVE WSH02     SP02
|   C                     MOVE *BLANKS   SP03
|   C                     MOVE *BLANKS   SP04
|   C                     MOVE 'N'       SP05
|   C                     Z-ADDDATE      SPXX
|   C                     TIME           SPYY
|   C                     MOVE $USER     SPZZ
|   C                     WRITESP0
|   C                     WRITEPD1
|   C                     SETON                     10
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|   C*
|   C*
| 01-C                     END
|    C                     MOVE WSH02     SH02
|    C*
|    C                     Z-ADDSH12      SH04
|    C                     Z-ADDSH13      SH05
|    C*
|    C                     Z-ADD0         SH06
|    C                     Z-ADD0         SH07
|    C*                    Z-ADDSH20      SH08
|    C                     Z-ADD0         SH08
|    C                     MOVE HSG06     SH09
|    C                     MOVE HSG07     SH10
|    C                     MOVE OSD16     SH11
|    C                     Z-ADD0         SH12
|    C                     Z-ADD0         SH13
|    C*                    Z-ADDSH17      SH14
|    C*                    Z-ADDSH18      SH15
|    C*                    Z-ADDSH19      SH16
|    C                     Z-ADD0         SH14
|    C                     Z-ADD0         SH15
|    C                     Z-ADD0         SH16
|    C*
|    C                     Z-ADDDATE      SHXX
|    C                     TIME           SHYY
|    C                     MOVE $USER     SHZZ
|    C*
|    C                     WRITESH0
|    C                     ADD  SH17      SG22
|    C                     ADD  SH18      SG23
|    C                     ADD  SH19      SG24
|    C*
26===C                     ENDSR
      *==============================================================*
      *          RTN620....ADD DATA TO SOSGLF
      *==============================================================*
27===C           RTN620    BEGSR
|    C*
|    C**銷退主檔新增
|    C                     MOVELWSH02     SG01
|    C                     MOVE WSH02     SG02
|    C                     MOVE 'RA'      SG03
|    C* GET 客戶代號／分店
|    C           HSG01     CHAIN#B0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVE #B14      SG04
|   C                     MOVE #B15      SG05
| 01*C                     ELSE
|   C                     MOVE *BLANK    SG04
|   C                     MOVE *BLANK    SG05
| 01-C                     END
|    C                     MOVE WSG09     SG09
|    C                     Z-ADD0         SG10
|    C* GET業務人員（組別）／客戶地區／區域
|    C                     MOVE SG04      ME01
|    C                     MOVE SG05      ME02
|    C           KEYME     CHAINME0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVE ME15      SG11
|   C                     MOVE ME07      SG15
| 02*C                     ELSE
|   C                     MOVE *BLANKS   SG11
|   C                     MOVE *BLANKS   SG15
| 02-C                     END
|    C*
|    C           SG11      CHAINMC0                  40
|    C   40                MOVE *BLANKS   SG12
|    C  N40                MOVE MC03      SG12
|    C*
|    C                     Z-ADD0         SG13
|    C* GET狀態
|    C                     MOVE '*'       SG14
|    C***
|    C                     MOVE *BLANKS   SG16
|    C                     MOVE HSG02     SG17
|    C                     MOVE HSG09     SG18
|    C***
|    C*                    Z-ADDSG22      SG19
|    C*                    Z-ADDSG23      SG20
|    C*                    Z-ADDSG24      SG21
|    C                     Z-ADD0         SG19
|    C                     Z-ADD0         SG20
|    C                     Z-ADD0         SG21
|    C*跨月折讓註記
|    C                     Z-ADD0         SG25
|    C                     Z-ADDDATE      SGXX
|    C                     TIME           SGYY
|    C                     MOVE $USER     SGZZ
|    C*
|    C                     WRITESG0
|    C                     Z-ADD0         SG22
|    C                     Z-ADD0         SG23
|    C                     Z-ADD0         SG24
|    C*
27===C                     ENDSR
     C*==============================================================*
     C*          RTN700....GET HEADING  FILE (產品收回)
     C*==============================================================*
28===C           RTN700    BEGSR
|    C*
|    C                     EXSR RTN710
|    C*
|    C                     SETOF                     5965
|    C* USE單別GET相關資料
|    C                     MOVELHSN02L    #201
|    C                     MOVELHSN02L    #202
|    C           KEY#2     CHAIN#20                  40
|    C*
|    C           KEYSO2    SETLLSO0
|    C           KEYSO2    READESO0                      44
|    C                     MOVE SO11      OSD16
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     EXSR RTN890                     還原保留量
|   C                     EXSR RTN800                     KEEP DATA
|   C*
| 02-C           SO11      IFNE FSN01
|   C                     EXSR RTN810                     *ADD->SF0
|   C                     SETON                     5965
| 02-C                     END
|   C*
|   C           KEYSO2    READESO0                      44
| 03-C           *IN44     IFEQ '1'
|   C           *IN59     ANDEQ'1'
|   C           SO11      ORNE OSD16
|   C           *IN59     ANDEQ'1'
|   C                     EXSR RTN820                     *ADD->SE0
|   C*
|   C                     SETOF                     59
| 03-C                     END
|   C*
| 04-C           SO11      IFNE OSD16
|   C                     MOVE SO11      OSD16
| 04-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     EXSR RTN750                     *UPD->SC0
|    C*
28===C                     ENDSR
      *==============================================================*
      *          RTN710....MOVE DATA TO STORAGE
      *==============================================================*
29===C           RTN710    BEGSR
|    C*
|    C                     MOVE SN01      HSN01
|    C                     MOVE SN02      HSN02
|    C                     MOVE SN03      HSN03
|    C                     MOVE SN04      HSN04
|    C                     Z-ADDSN05      HSN05
|    C                     Z-ADD0         HSN12
|    C                     Z-ADD0         HSN13
|    C                     Z-ADD0         HSN14
|    C                     Z-ADD0         HSN15
|    C*
29===C                     ENDSR
      *==============================================================*
      *          RTN750....UPDDTA DATA TO SOSNPF
      *==============================================================*
30===C           RTN750    BEGSR
|    C*
|    C           HSN02     CHAINSN0                  41
| 01-C           *IN65     IFEQ '1'
|   C                     MOVE 'V'       SN10
|   C                     SETOF                     65
| 01*C                     ELSE
|   C                     MOVE 'N'       SN10
| 01-C                     END
|    C                     UPDATSN0
|    C*
30===C                     ENDSR
      *==============================================================*
      *          RTN800....MOVE DATA TO STORAGE
      *==============================================================*
31===C           RTN800    BEGSR
|    C*
|    C                     Z-ADDSO13      HSO13
|    C                     Z-ADDSO14      HSO14
|    C                     Z-ADDSO15      HSO15
|    C*
31===C                     ENDSR
      *==============================================================*
      *          RTN810....ADD DATA TO SOSOPF
      *==============================================================*
32===C           RTN810    BEGSR
|    C*
|    C**收回明細檔新增
|    C                     MOVE HSN01     SO01
|    C                     MOVELOSD16     SO01
|    C* GET 收回單號
| 01-C           *IN59     IFEQ '0'
|    *
| 02-C           HSN02L    IFEQ 'R2'
|   C                     MOVEL'RB'      S007I2
| 02*C                     ELSE
|   C                     MOVEL'RC'      S007I2
| 02-C                     END
|    *
|   C                     CALL 'RES015'
|   C                     PARM SO01      S007I1  2
|   C                     PARM           S007I2  2
|   C                     PARM HSN05Y    S007I4  20
|   C           WSO02     PARM           S007O1 12
|   C*新增一筆至原始／轉帳單據對照檔中
|   C                     MOVE HSN02     SP01
|   C                     MOVE WSO02     SP02
|   C                     MOVE *BLANKS   SP03
|   C                     MOVE *BLANKS   SP04
|    *R3=試飲收回
| 03-C           HSN02L    IFEQ 'R3'
|   C                     MOVE 'N'       SP05
| 03*C                     ELSE
|   C                     MOVEL'Y'       SP05
| 03-C                     END
|   C                     Z-ADDDATE      SPXX
|   C                     TIME           SPYY
|   C                     MOVE $USER     SPZZ
|   C                     WRITESP0
|   C*
|   C                     WRITEPD1
|   C                     SETON                     10
| 04-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 04-C                     END
|   C*
| 01-C                     END
|    C                     MOVE WSO02     SO02
|    C*
|    C                     MOVE SO10      SO09
|     *
| 05-C           SO05      IFNE 0
|   C           SO16      DIV  SO05      SO12      H
| 05*C                     ELSE
|   C                     Z-ADD0         SO12
| 05-C                     END
|    C           SO12      ADD  SO05      WORK   134
|    C                     ADD  WORK      HSN12
|    C                     Z-ADDHSO13     SO16
|    C                     Z-ADDHSO14     SO17
|    C                     Z-ADDHSO15     SO18
|    C                     ADD  SO16      HSN13
|    C                     ADD  SO17      HSN14
|    C                     ADD  SO18      HSN15
|     *
|    C                     Z-ADDDATE      SOXX
|    C                     TIME           SOYY
|    C                     MOVE $USER     SOZZ
|    C*
|    C                     WRITESO0
|    C*
32===C                     ENDSR
      *==============================================================*
      *          RTN820....ADD DATA TO SOSNLF
      *==============================================================*
33===C           RTN820    BEGSR
|    C*
|    C**收回主檔新增
|    C                     MOVELWSO02     SN01
|    C                     MOVE WSO02     SN02
|    C                     MOVE HSN04     SN03
|    C                     MOVE HSN04     SN04
|    C                     MOVE *BLANKS   SN11
|    C* GET 客戶代號／分店
|    C           HSN01     CHAIN#B0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVE #B14      ME01
|   C                     MOVE #B15      ME02
|   C                     MOVE #B14      SN03
|   C                     MOVE #B15      SN11
| 01*C                     ELSE
|   C                     MOVE *BLANK    ME01
|   C                     MOVE *BLANK    ME02
| 01-C                     END
|    C* GET業務人員（組別）／客戶地區
|    C           KEYME     CHAINME0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVE ME15      SN07
| 02*C                     ELSE
|   C                     MOVE *BLANKS   SN07
| 02-C                     END
|    C*
|    C           SN07      CHAINMC0                  40
|    C   40                MOVE *BLANKS   SN08
|    C  N40                MOVE MC03      SN08
|    C*
|    C                     MOVE *BLANKS   SN09
|    C* GET轉帳
|    C                     MOVE 'T'       SN10
|     *試飲收回金額為０
| 03-C           HSN02L    IFEQ 'R3'
|   C                     Z-ADD0         SN12
| 03*C                     ELSE
|   C                     Z-ADDHSN12     SN12
| 03-C                     END
|    C                     Z-ADDHSN13     SN13
|    C                     Z-ADDHSN14     SN14
|    C                     Z-ADDHSN15     SN15
|    C***
|    C                     Z-ADDDATE      SNXX
|    C                     TIME           SNYY
|    C                     MOVE $USER     SNZZ
|    C*
|    C                     WRITESN0
|    C*
33===C                     ENDSR
     C*==============================================================*
     C*          RTN890....還原保留量
     C*==============================================================*
34===C           RTN890    BEGSR
|    C*
|    C*檢核出貨倉可用＝Ｙ－＞將確認數量差額還原
| 01-C           #219      IFEQ '-'
|   C           SO04      SUB  SO05      WQTYN              差值
| 02-C           WQTYN     IFNE 0
|   C                     MOVELSO11      IA01
|   C*                    MOVE SO09      IA02
|    *以頭檔物流點
|   C                     MOVE SN03      IA02
|   C                     MOVE SO03      IA03
|   C           KEYIA     CHAINIA0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     SUB  WQTYN     IA09
|   C                     ADD  WQTYN     IA10
|   C                     UPDATIA0
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
34===C                     ENDSR
     C*==============================================================*
     C*          RTN990....還原保留量
     C*==============================================================*
35===C           RTN990    BEGSR
|    C*
|    C           IJ04      SUB  IJ05      WQTYN              差值
| 01-C           WQTYN     IFNE 0
|   C                     MOVELII01      IA01
|   C                     MOVE II03      IA02
|   C                     MOVE IJ03      IA03
|   C           KEYIA     CHAINIA0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     SUB  WQTYN     IA09
|   C                     ADD  WQTYN     IA10
|   C                     UPDATIA0
| 02-C                     END
| 01-C                     END
|    C*
35===C                     ENDSR
