     FARAKLF01IF  E           K        DISK
     FARA013D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
B2MODI                                      601 6060DATE
B2MODI                                      601 6040DATEY
B2MODI                                      605 6060DATEM
B2MODI                                      607 6100DAK01
B2MODI                                      607 6080DAK01M
B2MODI                                      609 6100DAK01Y
B2MODI                                      611 611 DAK02
     I            DS
B2MODI                                        1   60AK01
B2MODI                                        1   40AK01Y
B2MODI                                        5   60AK01M
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN97     PARM *IN96     IN96    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYAK     KLIST
     C                     KFLD           DAK02
     C                     KFLD           DATE
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N10N96          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C           *IN03     OREQ '0'
    C           *IN14     ANDEQ'1'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL*BLANKS   DAK02
|    C                     Z-ADD0         DATE
|    C                     Z-ADD0         DAK01
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
| 03-C           DAK02     IFEQ *BLANKS
     C                     SETON                     619599
     C                     END
|    C   99                GOTO END100
     C*
B2CHKC           DAK01     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
     C                     Z-ADD0         AK01
     C           DAK02     SETLLAK0
     C           DAK02     READEAK0                      45
     C           *IN45     IFEQ '0'
     C                     ADD  1         AK01M
     C           AK01M     IFGT 12
     C                     Z-ADD1         AK01M
B2000C                     ADD  1         AK01Y
     C                     END
     C                     END
B2TRCC                     Z-ADDAK01Y     DAK01Y
     C                     Z-ADDAK01M     DAK01M
     C                     END
|    C** DEFAULT VALUE
B2CHKC           DAK01     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
     C                     SETON                     609599
     C                     ELSE
     C           DAK01M    IFLT 1
     C           DAK01M    ORGT 12
     C                     SETON                     609899
     C                     END
| 03-C                     END
|    C   99                GOTO END100
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVELDAK01Y    DATEY
B2NEWC                     MOVE DAK01Y    HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    DATEY
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     MOVELDAK01M    DATEM
B2000C           KEYAK     SETLLAK0                      40
     C           *IN40     IFEQ '1'
     C                     SETON                     6061
     C                     SETON                     8699
     C                     END
|    C   99                GOTO END100
      *
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
