     A*================================================================
     A* MODI CODE |  AUTHOR  |  DATE  | DESCRIPTION
     A*----------------------------------------------------------------
     A* M004      | MICHELLE |00.05.15|µÒ°sµ|ªk¹ê¬I
     A*================================================================
     FSOSIPF  IF  E           K        DISK
     FARAGLF04IF  E           K        DISK
     FARAFLF8 IF  E           K        DISK
     FARB001P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I            DS
     I                                        1  10 SI02
     I                                        1   1 SI02A
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
     C                     WRITEPH1
     C           *LOVAL    SETLLSI0
     C                     READ SI0                      46
     C           *IN46     DOWEQ'0'
      *
     C           SI02A     IFNE '@'
     C           SI16      ANDNE'Y'
     C                     Z-ADDSI28      SI278
     C                     Z-ADD0         AGF07
M004AC                     Z-ADD0         AGF09
     C           SI02      SETLLAG0
     C           SI02      READEAG0                      45
     C           *IN45     DOWEQ'0'
     C                     ADD  AG07      AGF07
M004AC                     ADD  AG21      AGF09
     C           SI02      READEAG0                      45
     C                     END
     C           SI278     SUB  AGF07     DIF
M004AC           DIF       SUB  AGF09     DIF
     C           DIF       IFNE 0
     C   39                EXSR RTN900
     C                     MOVEL'¾P°h'  STAT
     C                     SETON                     10
     C                     WRITEPD1
     C                     END
      *
     C                     Z-ADDSI27      SI278
     C                     Z-ADD0         AGF07
M004AC                     Z-ADD0         AGF09
     C           SI02      SETLLAF0
     C           SI02      READEAF0                      45
     C           *IN45     DOWEQ'0'
     C                     ADD  AF07      AGF07
M004AC                     ADD  AF09      AGF09
     C           SI02      READEAF0                      45
     C                     END
     C           SI278     SUB  AGF07     DIF
M004AC           DIF       SUB  AGF09     DIF
     C           DIF       IFNE 0
     C   39                EXSR RTN900
     C                     MOVEL'»ù®t'  STAT
     C                     SETON                     10
     C                     WRITEPD1
     C                     END
      *
     C                     END
     C                     READ SI0                      46
     C                     END
     C*
     C  N10                WRITEPE3
     C                     WRITEPE2
     C                     SETON                     LR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
