     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARI021                                     *
     A*    AUTHOR       : A1139  JANE                                *
     A*    DATE WRITTEN : 81/03/25                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :發票資料查詢                              *
     A*===============================================================
     A* MODI CODE |  DATE  |  AUTHOR  | DESCRIPTION
     A*---------------------------------------------------------------
     A*  M005     |01.01.12| MICHELLE |菸酒稅修正
     A*---------------------------------------------------------------
     A****************************************************************
     FSOSIPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSILF94IF  E           K        DISK
     F            SI0                               KRENAMESI0L
     FSOSJPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMEPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMAPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FARI021D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E*                   WFUN    6   6  6
     E*: FUNCTION DATA :
     E**                  WTYPE   5   9 10
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     I*SDS        SDS
     I*                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
M001AI                                      201 2080DATE
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 507 $TRNID
     I*                                     508 512 $APAU1
     I*                                     513 513 $WRHTY
     I*                                     514 521 $#101
     I*                                     522 522 $APAU2
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     MOVE *BLANKS   APPSCR  6
     C                     Z-ADD0         HRRN1   40
     C                     MOVE *BLANK    WBOTOM  1
     C                     MOVE *BLANK    WBOTM2  1
     C*
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
M001AC           *LIKE     DEFN DBGN3     OBGN3            *START KEY
B2MODC*          *LIKE     DEFN DBGN3     OBGN3 + 2        *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
B2MODC           *LIKE     DEFN DBGN3     SBGN3 + 2        *SUBFIL BOTTOM
     C**
     C           *LIKE     DEFN SI12      DSI12                        OM
     C           *LIKE     DEFN SI13      DSI13                        OM
     C           *LIKE     DEFN SI02      DSI02                        OM
     C*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSI1    KLIST
     C                     KFLD           DSI12
     C                     KFLD           DSI13
     C                     KFLD           DSI02
     C           KEYSI2    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C                     KFLD           SBGN3
     C           KEYSI4    KLIST
     C                     KFLD           SI01
     C                     KFLD           SI02
     C*
     C           KEYSJ     KLIST
     C                     KFLD           SI01
     C                     KFLD           SI02
     C           KEYSI     KLIST
     C                     KFLD           SI12
     C                     KFLD           SI13
     C           KEYME     KLIST
     C                     KFLD           SI08
     C                     KFLD           SI09
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C**                   MOVE $ADD      WA01,1
|    C**                   MOVE $UPD      WA01,2
|    C**                   MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $INQ      WA01,6
|    C*
M001DC*                    Z-ADD123199    DBGN3
M001AC                     Z-ADD123129    DBGN3
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD123199    OBGN3   60
B2VFYC                     Z-ADD123129    OBGN3
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C*
|    C                     MOVE 'SCR001'  APPSCR
M001DC*                    Z-ADD0         DATE    80
M001AC*                    Z-ADD0         DATE    60
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001AC*                    PARM $EGMDY    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          DATE      PARM           S001O1  80
M001AC*          DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
B2CHKC           DBGN3     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001DC*                    Z-ADD123199    DBGN3
M001AC                     Z-ADD123129    DBGN3
| 01-C                     END
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          DBGN1     IFNE OBGN1
B2OLDC*          DBGN2     ORNE OBGN2
B2OLDC*          DBGN3     ORNE OBGN3
B2NEWC*                    MOVE DBGN3     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    H@8N01  80
B2NEWC           DBGN1     IFNE OBGN1
B2NEWC           DBGN2     ORNE OBGN2
B2NEWC*          H@8N01    ORNE OBGN3
M001AC           DBGN3     ORNE OBGN3
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN2 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDBGN3     OBGN3
M001AC                     Z-ADDDBGN3     OBGN3
B2NEWC*                    MOVE DBGN3     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    OBGN3
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
| 02*C                     ELSE
|   C                     EXSR RTN171
| 03-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 03-C                     END
| 02-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
| 05-C           DOPT1     IFEQ '5'
|   C                     EXSR RTN200
| 05*C                     ELSE
      *DOPT1='6'
|   C                     CALL 'ARA0053'
|   C                     PARM           SI01
|   C                     PARM           SI02
|   C                     PARM           IN03    1
|   C                     PARM           IN12    1
| 05-C                     END
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *57 END
| 06-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 06-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN180....CHECK 'SC01' SCREEN
     C*==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
04===C                     ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD12        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTOM  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C*
M001AC                     Z-ADD0         XSBGN3  60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM DBGN3     S001I2  80
M001AC                     PARM DBGN3     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          SBGN3     PARM           S001O1  80
M001AC           XSBGN3    PARM           S001O1  60
M001AC                     MOVE XSBGN3    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SBGN3
B2000C           KEYSI2    SETLLSI0L
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
|    C***
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ SI0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*
|   C*
M001AC                     Z-ADDSI21      XSI21   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SI21      S001I2  80
M001AC                     PARM XSI21     S001I2  60
M001DC*          DSI21     PARM           S001O1  80
M001AC           DSI21     PARM           S001O1  60
|   C*
|   C*
|   C           SI27      ADD  SI28      DTOT
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
09===C           RTN200    BEGSR
|    C*
|    C*                    MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLSI0
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
10===C           RTN240    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C           KEYSI4    CHAINSI0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C*
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN298                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     OREQ '0'
|   C                     MOVE 'SCR001'  APPSCR
|   C*                    Z-ADDRRN       DRRN
| 02-C                     END
|   C*
| 01-C                     END                             *IN12 ENDIF
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
11===CSR         RTN252    BEGSR
|    C*
|    C*公司代號
|    C           SI01      CHAIN#B0                  40
|    C   40                MOVE *BLANKS   D#B03
|    C  N40                MOVEL#B03      D#B03
|    C*
|    C*客戶簡稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANK    ME04
|    C*
|    C*發票日期-CHINESE
M001AC                     Z-ADDSI21      XSI21   60
     C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SI21      S001I2  80
M001AC                     PARM XSI21     S001I2  60
M001DC*          DSI21     PARM           S001O1  80
M001AC           DSI21     PARM           S001O1  60
|    C*
     C                     Z-ADD0         DSI35
B2CHKC           SI35      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001AC                     Z-ADDSI35      XSI35   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SI35      S001I2  80
M001AC                     PARM XSI35     S001I2  60
M001DC*          DSI35     PARM           S001O1  80
M001AC           DSI35     PARM           S001O1  60
     C                     END
|    C*發票餘額
|    C*          SI25      SUB  SI27      ENDSUB
|    C*                    SUB  SI28      ENDSUB
|    C*
11===CSR                   ENDSR
     C*==============================================================*
     C*          RTN291....INIT 'SC02' -- SFLSR2
     C*==============================================================*
12===C           RTN291    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C*                    Z-ADD8         DSPRC2  40       *SFL SIZE
|    C*                    Z-ADD8         WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYSJ     SETLLSJ0
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN298....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
13===C           RTN298    BEGSR
|    C*
|    C           KEYSJ     READESJ0                      44*NF/EOF
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C                     EXSR RTN29B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           KEYSJ     READESJ0                      44*NF/EOF
| 01-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          RTN29B....FILE TO SCREEN --- MOVE
     C*==============================================================*
14===C           RTN29B    BEGSR
|    C*訂購數量
|    C           SJ04      SUB  SJ13      D#A
|    C*售價
| 01-C           D#A       IFGT 0
|   C           SJ06      SUB  SJ07      PRICE1 112
|   C***********PRICE1    DIV  D#A       PRICE
|   C           PRICE1    DIV  D#A       PRICE     H
| 01*C                     ELSE
|   C                     Z-ADD0         PRICE
| 01-C                     END
|    C*發票金額
M005MC*發票金額－未稅
|    C           SJ06      SUB  SJ07      DSJ06
|    C*
     C                     MOVEL*BLANK    MA03
     C           SJ03      CHAINMA0                  40
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' --- SFLSR
     C*==============================================================*
15===C           RTN280    BEGSR
|    C*CHK SCREEN
15===C           END280    ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
16===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
17===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
17===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
