     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARI028                                     *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    DATE WRITTEN : 07/07/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :票據未兌現查詢                            *
     A****************************************************************
     FARACLF07IF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMEPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FARI028D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
     I*
     I                                      601 605 DBGN1
     I                                      606 609 DBGN2
     I                                      610 6150DBGN3
     I            DS
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
B2MODC           *LIKE     DEFN DBGN3     OBGN3            *START KEY
B2MODC           *LIKE     DEFN DBGN3     SBGN3 + 2        *START KEY
     C*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYAC2    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C                     KFLD           SBGN3
     C           KEYME     KLIST
     C                     KFLD           AC02
     C                     KFLD           AC03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     IFEQ '1'
    C                     EXSR RTN192
  02*C                     ELSE
    C                     EXSR RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE 'SCR001'  APPSCR  60
|    C                     Z-ADD0         HRRN    40
B2MODC                     Z-ADD0         DATE    80
M001DC*                    Z-ADD010101    DBGN3
M001AC                     Z-ADD010192    DBGN3
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
     C                     MOVE *BLANK    DBGN1
     C                     MOVE *BLANK    DBGN2
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD010101    OBGN3
M001AC                     Z-ADD010192    OBGN3
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     MOVE *BLANK    OBGN1
     C                     MOVE *BLANK    OBGN2
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001AC                     PARM $EGMDY    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          DATE      PARM           S001O1  80
M001AC           DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
B2CHKC           DBGN3     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001DC*                    Z-ADD010101    DBGN3
M001AC                     Z-ADD010192    DBGN3
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
| 01-C                     END
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          DBGN1     IFNE OBGN1
B2OLDC*          DBGN2     ORNE OBGN2
B2NEWC*                    MOVE DBGN3     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    H@8N01  80
B2NEWC           DBGN1     IFNE OBGN1
B2NEWC           DBGN2     ORNE OBGN2
B2NEWC*          H@8N01    ORNE OBGN3
B2OLDC           DBGN3     ORNE OBGN3
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN2 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     Z-ADD0         HRRN
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC                     Z-ADDDBGN3     OBGN3
B2NEWC*                    MOVE DBGN3     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    OBGN3
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
|    C*
02===C                     ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
03===C           RTN191    BEGSR
|    C*
|    C                     Z-ADD1         DRRN    40
|    C                     Z-ADD0         RRN     40
|    C                     Z-ADD0         WRRN    40
|    C                     Z-ADD14        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN      DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTOM  1
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C*
M001AC                     Z-ADD0         XBGN3   60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM DBGN3     S001I2  80
M001AC                     PARM DBGN3     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          SBGN3     PARM           S001O1  80
M001AC           XBGN3     PARM           S001O1  60
M001AC                     MOVE XBGN3     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SBGN3
B2000C           KEYAC2    SETLLAC0
|    C*
03===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
04===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
04===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
05===C           RTN193    BEGSR
|    C*
|    C                     Z-ADDWRRN      RRN
|    C                     ADD  WPRCD1    DSPRC1
|    C*
| 01-C           RRN       DOWLTDSPRC1
|   C                     READ AC0                      46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*客戶簡稱
|   C           KEYME     CHAINME0                  40
|   C   40                MOVE *BLANK    ME04
|   C*收款日期，預兌日期
M001AC                     Z-ADDAC04      XAC04   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AC04      S001I2  80
M001AC                     PARM XAC04     S001I2  60
M001DC*          WAC04     PARM           S001O1  80
M001AC           WAC04     PARM           S001O1  60
M001AC                     Z-ADDAC07      XAC07   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AC07      S001I2  80
M001AC                     PARM XAC07     S001I2  60
M001DC*          WAC07     PARM           S001O1  80
M001AC           WAC07     PARM           S001O1  60
|   C*
|   C                     ADD  1         RRN
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRC1
|   C                     MOVE 'Y'       WBOTOM
| 02-C                     END
|   C*
| 01-C                     END
|    C                     Z-ADDRRN       DRRN
|    C                     Z-ADDRRN       WRRN
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
06===C           RTN195    BEGSR
|    C*
| 01-C           RRN       IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
07===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
07===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
