     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARI024                                     *
     A*    AUTHOR       : A1139  JANE                                *
     A*    DATE WRITTEN : 81/03/31                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :折讓查詢(I)                               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M004      | 00.05.17 |菸酒稅法實施
     A*================================================================
     A****************************************************************
     FARAHLF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     F                                              KINFDS AHRCDN
     FSOSHPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
M004AFARAFPF  IF  E           K        DISK
M004AF            AF0                               KRENAMEAF0L
M004AF                                              KINFSR ERRSR
M004AFSOSXPF  IF  E           K        DISK
M004AF                                              KINFSR ERRSR
M004AFSOS2PF  IF  E           K        DISK
M004AF                                              KINFSR ERRSR
     FMTMEPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FPA#BPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FARI024D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E*                   WFUN    6   6  6
     E*: FUNCTION DATA :
     E**                  WTYPE   5   9 10
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     I*SDS        SDS
     I*                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
M001AI                                      201 2080DATE
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     IAHRCDN      DS
     I                                     *RECORD  RCDN
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     MOVE *BLANKS   APPSCR  6
     C                     Z-ADD0         HRRN1   40
     C                     Z-ADD0         HRRN2   40
     C                     MOVE *BLANK    WBOTOM  1
     C                     MOVE *BLANK    WBOTM2  1
     C*
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
B2MODC*          *LIKE     DEFN DBGN3     OBGN3 + 2        *START KEY
M001AC           *LIKE     DEFN DBGN3     OBGN3
     C           *LIKE     DEFN DBGN4     OBGN4            *START KEY
B2MODC           *LIKE     DEFN DBGN3     DBGN3D+ 2        *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BOTTOM
     C           *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BOTTOM
     C           *LIKE     DEFN DBGN3     BBGN3            *SUBFIL BOTTOM
     C           *LIKE     DEFN DBGN3     BBGN4            *SUBFIL BOTTOM
B2MODC           *LIKE     DEFN DBGN3     BBGN3D+ 2        *SUBFIL BOTTOM
     C**
     C           *LIKE     DEFN AH01      DAH01
     C           *LIKE     DEFN AH02      DAH02
     C           *LIKE     DEFN AH03      DAH03
     C           *LIKE     DEFN AH04      DAH04
     C*
     C           *LIKE     DEFN AH02      KAH02
     C           *LIKE     DEFN AH03      KAH03
     C           *LIKE     DEFN AH04      KAH04
B2000C           *LIKE     DEFN AH05      KAH05
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYAH1    KLIST
     C                     KFLD           DAH01
     C                     KFLD           DAH03
     C                     KFLD           DAH02
     C                     KFLD           DAH04
     C           KEYAH2    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN3D
     C                     KFLD           DBGN2
     C                     KFLD           DBGN4
     C           KEYAH3    KLIST
     C                     KFLD           BBGN1
     C                     KFLD           BBGN3D
     C                     KFLD           BBGN2
     C                     KFLD           BBGN4
     C           KEYAH4    KLIST
     C                     KFLD           AH02
     C                     KFLD           HAH05
     C                     KFLD           AH03
     C                     KFLD           AH04
     C*
     C           KEYME     KLIST
     C                     KFLD           AH02
     C                     KFLD           AH03
     C*
     C           KEYSH     KLIST
     C                     KFLD           DAH07
     C*
     C           KEYKEP    KLIST
     C                     KFLD           KAH02
     C                     KFLD           KAH05
     C                     KFLD           KAH03
     C                     KFLD           KAH04
     C*
M004AC           KEYS2     KLIST
M004AC                     KFLD           SH02
M004AC                     KFLD           SH03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD123199    OBGN3
B2VFYC*                    Z-ADD20123199  OBGN3
M001AC                     Z-ADD123129    OBGN3
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C**                   MOVE $ADD      WA01,1
|    C**                   MOVE $UPD      WA01,2
|    C**                   MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C**                   MOVE $RMK01    WA01,6
|    C*
|    C                     MOVE 'SCR001'  APPSCR
M001DC*                    Z-ADD0         DATE    80
M001AC*                    Z-ADD0         DATE    60
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001AC*                    PARM $EGMDY    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          DATE      PARM           S001O1  80
M001AC*          DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
B2CHKC           DBGN3     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
| 01*C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          DBGN1     IFNE OBGN1
B2OLDC*          DBGN2     ORNE OBGN2
B2OLDC*          DBGN4     ORNE OBGN4
B2NEWC                     MOVE DBGN3     HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    H@8N01  80
B2NEWC           DBGN1     IFNE OBGN1
B2NEWC           DBGN2     ORNE OBGN2
M001AC           DBGN3     ORNE OBGN3
M001DC*          H@8N01    ORNE OBGN3
B2NEWC           DBGN4     ORNE OBGN4
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN4 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN4 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
B2REM ***************************
B2REM ****  CONVERSION START  ***
BAREM ***************************
M001DC*                    MOVE DBGN3     OBGN3
M001AC                     MOVE DBGN3     OBGN3
B2NEWC*                    MOVE DBGN3     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    OBGN3
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN4     OBGN4
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
| 02-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C           *IN12     ANDEQ'0'
|   C                     EXSR RTN180                     *CHK
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C*
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *57 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN180....CHECK 'SC01' SCREEN
     C*==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
B2???C           KEYAH4    CHAINARAHLF               40
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields HAH05 and AH05 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
| 02-C           DOPT1     IFEQ '5'
| 03-C           RCDN      IFNE 'SG0'
|   C                     SETON                     608899
| 03-C                     END
| 02-C                     END
B2000C           KEYKEP    SETGTARAHLF
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
04===C                     ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD12        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
      *
B2CHKC           DBGN3     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001DC*                    Z-ADD123199    DBGN3
M001AC                     Z-ADD123129    DBGN3
| 01-C                     END
M001AC                     Z-ADD0         XBGN3D  60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM DBGN3     S001I2  80
M001AC                     PARM DBGN3     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          DBGN3D    PARM           S001O1  80
M001AC           XBGN3D    PARM           S001O1  60
M001AC                     MOVE XBGN3D    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DBGN3D
      *
B2000C           KEYAH2    SETLLARAHLF
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
M001AC                     Z-ADD0         XAH051  60
M001AC                     Z-ADDAH05      XAH05   60
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM AH05      S001I2  80
M001AC                     PARM XAH05     S001I2  60
M001DC*          WAH051    PARM           S001O1  80
M001AC           XAH051    PARM           S001O1  60
M001AC                     MOVE XAH051    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WAH051  80
      *
B2000C                     Z-ADDWAH051    BBGN3D
M001AC                     Z-ADDAH05      BBGN3D
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
|    C***
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ ARAHLF                   46
|   C**
| 02-C           *IN46     IFEQ '0'
|   C*
| 03-C           RCDN      IFEQ 'AF0'
|   C                     MOVE '價差'  KIND
|   C                     MOVE *BLANKS   DAH07
M004AC           AH04      CHAINAF0L                 47
M004AC           *IN47     IFEQ '0'
M004AC           AH06      ADD  AF09      WAH06
M004AC                     Z-ADDAF09      WTAX
M004AC                     ELSE
M004AC                     Z-ADDAH06      WAH06
M004AC                     Z-ADD0         WTAX
M004AC                     END
M005AC           AF08      IFEQ '80'
  "  C                     MOVE '勾稽'  KIND
M005AC                     END
| 03*C                     ELSE
|   C                     MOVE '銷退'  KIND
|   C                     MOVE AH07      DAH07
M004AC           AH07      CHAINSX0                  47
M004AC           *IN47     IFEQ '0'
M004AC           AH06      ADD  SX10      WAH06
M004AC                     Z-ADDSX10      WTAX
M004AC                     ELSE
M004AC                     Z-ADDAH06      WAH06
M004AC                     Z-ADD0         WTAX
M004AC                     END
| 03-C                     END
|   C*
|   C*折讓日期
M001AC                     Z-ADDAH05      XAH05   60
B2TRCC                     Z-ADDAH05      HAH05
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AH05      S001I2  80
M001AC                     PARM XAH05     S001I2  60
M001DC*          DAH05     PARM           S001O1  80
M001AC           DAH05     PARM           S001O1  60
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
      *KEEP KEY
     C                     MOVELAH02      KAH02
     C                     MOVELAH03      KAH03
B2000C                     Z-ADDAH05      KAH05
     C                     MOVELAH04      KAH04
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C***
| 01-C                     END
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
09===C           RTN200    BEGSR
|    C*
|    C*                    MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'5'       RTN240
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLARAHLF
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
10===C           RTN240    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C*
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN292                     *READ DATA TO SFLSR
|    C*
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C*          *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
| 02-C           RRN2      IFGT 0
|   C                     SETON                     50    *SFLDSP
| 02*C                     ELSE
|   C                     SETON                     94    *NO DTA
| 02-C                     END
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     SETOF                     50
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 04-C           *IN25     CASEQ'1'       RTN292
|   C                     CAS            RTN271
| 04-C                     END
|   C                     SETOF                     12
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
|   C*
| 01-C                     END                             *IN12 ENDIF
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
11===CSR         RTN252    BEGSR
|    C*
|    C*公司代號
|    C           AH01      CHAIN#B0                  40
|    C   40                MOVE *BLANKS   D#B03
|    C  N40                MOVEL#B03      D#B03
|    C*
|    C*客戶簡稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANK    ME04
|    C*
|    C*退貨日期
M001AC                     Z-ADDAH08      XAH08   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AH08      S001I2  80
M001AC                     PARM XAH08     S001I2  60
M001DC*          DAH08     PARM           S001O1  80
M001AC           DAH08     PARM           S001O1  60
|    C*
|    C*M004A增加稅額欄位顯示
|    C*
M004AC           RCDN      IFEQ 'AF0'
M004AC           AH04      CHAINAF0L                 47
M004AC           *IN47     IFEQ '0'
M004AC                     Z-ADDAF09      WTAX
M004AC                     ELSE
M004AC                     Z-ADD0         WTAX
M004AC                     END
| 03*C                     ELSE
M004AC           AH07      CHAINSX0                  47
M004AC           *IN47     IFEQ '0'
M004AC                     Z-ADDSX10      WTAX
M004AC                     ELSE
M004AC                     Z-ADD0         WTAX
M004AC                     END
| 03-C                     END
11===CSR                   ENDSR
      *==============================================================*
      *          RTN271....READC SFL
      *==============================================================*
12===C           RTN271    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR2                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C           *IN03     ANDEQ'0'
|   C           *IN12     ANDEQ'0'
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT2     IFNE *BLANK
|   C                     EXSR RTN280                     *CALL SUBPGM
|   C                     Z-ADDRRN2      HRRN2
|   C                     MOVE *BLANKS   DOPT2
|   C*
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                 5757*NF
| 01-C                     END                             *57 END
|    C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR RTN291
|   C                     EXSR RTN292
|   C                     SETOF                     5412
|   C                     SETON                     95
| 04-C                     END
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' --- SFLSR
     C*==============================================================*
13===C           RTN280    BEGSR
|    C*CHK SCREEN
| 01-C           DOPT2     IFEQ '5'
|   C                     CALL 'ARI0241'
|   C                     PARM AH04      I242I1 12
|   C                     PARM AH07      I241I2 12
|   C                     PARM SH03      I241I3  9
|   C           *IN03     PARM           IN03    1
|   C           *IN12     PARM           IN12    1
| 01-C                     END
|    C*
13===C           END280    ENDSR
     C*==============================================================*
     C*          RTN291....INIT 'SC02' -- SFLSR2
     C*==============================================================*
14===C           RTN291    BEGSR
|    C*
|    C                     MOVE *BLANK    DOPT2
|    C                     Z-ADD0         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD0         DSPRC2  40       *SFL SIZE
|    C                     Z-ADD8         WPRCD2  40       *PAG RCD
|    C           HRRN2     DIV  WPRCD2    DSPRC2
|    C                     MULT WPRCD2    DSPRC2
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C                     SETOF                     53
|    C*
|    C                     SETON                     5254  *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYSH     SETLLSH0
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN292....ROLLUP SCREEN2
     C*==============================================================*
15===C           RTN292    BEGSR
|    C*
| 01-C           WBOTM2    IFEQ 'Y'
|   C                     SETON                         98
|   C                     Z-ADDRRN2      DRRN2
| 01*C                     ELSE
|   C                     EXSR RTN293
| 01-C                     END
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          RTN293....ADD SUBFILE DATA -- SRCREEN2
     C*==============================================================*
16===C           RTN293    BEGSR
|    C*
|    C                     SETOF                         54
|    C                     MOVE *BLANKS   DOPT2
|    C                     Z-ADDWRRN2     RRN2
|    C                     ADD  WPRCD2    DSPRC2
|    C**
| 01-C           RRN2      DOWLTDSPRC2
|   C           KEYSH     READESH0                      44*NF/EOF
|   C*
| 02-C           *IN44     IFEQ '0'
|   C*退貨總數
|   C           SH04      ADD  SH05      DTOT
|   C*
M004AC           KEYS2     CHAINS20                  45
M004AC           *IN45     IFEQ '1'
M004AC                     Z-ADD0         S207
M004AC                     END
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
| 02*C                     ELSE
|   C                     Z-ADDRRN2      DSPRC2
|   C                     MOVE 'Y'       WBOTM2
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN2      DRRN2      50
|    C                     Z-ADDRRN2      WRRN2
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
17===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
18===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
18===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
