     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARI0261                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/03/26                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :收款沖帳處理－沖帳修改                    *
     A****************************************************************
     FARACPF  IF  E           K        DISK
     FSOSIPF  IF  E           K        DISK
     FARADLF04IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FARI0261DCF  E                    WORKSTN
     F*                                             KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WAC01     PARM           A005I1  2        公司別
     C           WAC02     PARM           A005I2  5        客戶代號
     C           WAC03     PARM           A005I3  4        分店代號
B2MODC           WAC04     PARM           A005I4  80       收款日期
     C           WAC05     PARM           A005I5  2        收款種類
     C           WAC06     PARM           A005I6 14        票據號碼
     C                     PARM *IN03     IN03    1
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C*
B2MODC           *LIKE     DEFN DBGN0     OBGN0            *START KEY
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
B2MODC           *LIKE     DEFN DBGN0     BBGN0            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C*
B2MODC           *LIKE     DEFN DBGN0     SBGN0 + 2        *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN0     TBGN0 + 2        *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN0     UBGN0            *SUBFIL BUTTOM
     C*
     C           *LIKE     DEFN AC01      WAC01                        OM
     C           *LIKE     DEFN AC02      WAC02                        OM
     C           *LIKE     DEFN AC03      WAC03                        OM
B2000C           *LIKE     DEFN AC04      WAC04                        OM
     C           *LIKE     DEFN AC05      WAC05                        OM
     C           *LIKE     DEFN AC06      WAC06                        OM
     C           *LIKE     DEFN AC10      WAC10                        OM
     C*
     C           *LIKE     DEFN AD08      WAD08                        OM
     C           *LIKE     DEFN AD08      WTAD08                       OM
     C           *LIKE     DEFN AD08      WKAD8                        OM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYAC     KLIST
     C                     KFLD           WAC01
     C                     KFLD           WAC02
     C                     KFLD           WAC03
     C                     KFLD           WAC04
     C                     KFLD           WAC05
     C                     KFLD           WAC06
     C           KEYSI     KLIST
     C                     KFLD           AD10
     C                     KFLD           AD07
     C           KEYAD2    KLIST
     C                     KFLD           WAC01
     C                     KFLD           WAC02
     C                     KFLD           WAC03
     C                     KFLD           WAC04
     C                     KFLD           WAC05
     C                     KFLD           WAC06
     C                     KFLD           SBGN0
     C                     KFLD           DBGN1
     C           KEYADB    KLIST
     C                     KFLD           WAC01
     C                     KFLD           WAC02
     C                     KFLD           WAC03
     C                     KFLD           WAC04
     C                     KFLD           WAC05
     C                     KFLD           WAC06
     C                     KFLD           TBGN0
     C                     KFLD           BBGN1
     C           KEYME     KLIST
     C                     KFLD           AC02
     C                     KFLD           AC03
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C*                    EXSR RTN192                     *READ NEXT PAGE
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C           *IN12     ANDEQ'0'                        *12    OFF
    C*
    C                     EXSR RTN195                     *EXFMT
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE 'SCR001'  APPSCR
B2MODC*                    Z-ADD0         DATE    80
M001AC                     Z-ADD0         DATE    60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001AC                     PARM $EGMDY    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          DATE      PARM           S001O1  80
M001AC           DATE      PARM           S001O1  60
|    C***
|    C* GET HEADING
B2000C           KEYAC     CHAINAC0                  40
|    C* GET公司名稱／客戶簡稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANKS   ME04
|    C* GET日期轉換
M001AC                     MOVE AC04      XAC04   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AC04      S001I2  80
M001AC                     PARM XAC04     S001I2  60
M001DC*          DAC04     PARM           S001O1  80
M001AC           DAC04     PARM           S001O1  60
M001AC                     MOVE AC07      WAC07   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AC07      S001I2  80
M001AC                     PARM WAC07     S001I2  60
M001DC*          DAC07     PARM           S001O1  80
M001AC           DAC07     PARM           S001O1  60
M001AC                     MOVE AC11      WAC11   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AC11      S001I2  80
M001AC                     PARM WAC11     S001I2  60
B2MODC*          DAC11     PARM           S001O1  80
M001AC           DAC11     PARM           S001O1  60
|    C* GET種類
|    C                     MOVE *BLANKS   MTYPE
     C                     MOVE *BLANK    #A01
     C                     MOVE *BLANK    #A02
     C                     MOVEL'COLLECT' #A01
     C                     MOVELAC05      #A02
     C           KEY#A     CHAIN#A0                  40
     C           *IN40     IFEQ '0'
     C                     MOVEL#A03      MTYPE
     C                     END
      *
B2CHKC                     Z-ADD123129    DBGN0
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD123199    OBGN0
B2VFYC*                    Z-ADD29991231  OBGN0
M001AC                     Z-ADD123129    OBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
B2CHKC           DBGN0     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     Z-ADD123129    DBGN0
| 01-C                     END
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC           DBGN0     IFNE OBGN0
B2OLDC           DBGN1     ORNE OBGN1
B2NEWC*                    MOVE DBGN0     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    H@8N01  80
B2NEWC*          H@8N01    IFNE OBGN0
B2NEWC*          DBGN1     ORNE OBGN1
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN1 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC                     MOVE DBGN0     OBGN0
B2NEWC*                    MOVE DBGN0     HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    OBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN1     OBGN1
| 02-C                     END
|    C*
02===C                     ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
03===C           RTN191    BEGSR
|    C*
|    C                     Z-ADD1         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD999       WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETON                     52
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C                     SETON                     51
|    C*
|    C*
M001AC                     Z-ADD0         WBGN0   60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM DBGN0     S001I2  80
M001AC                     PARM DBGN0     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          SBGN0     PARM           S001O1  80
M001AC           WBGN0     PARM           S001O1  60
B2NEWC                     MOVE WBGN0     HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    SBGN0
|    C*
B2000C           KEYAD2    SETLLAD0
|    C*
|    C                     EXSR RTN193
|    C*
03===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
04===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     9840  *LST PAG
     C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
B2000C*                    Z-ADDBBGN0     TBGN0
M001AC                     Z-ADD0         W6      60
M001AC                     CALL 'RES001'
M001AC                     PARM 'MDY'     S001I1  3
M001AC                     PARM BBGN0     S001I2  60
M001AC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    TBGN0
B2000C           KEYADB    SETGTAD0
|   C                     EXSR RTN193
| 01-C                     END
|    C*
04===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
05===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     5446
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
|    C*
| 01-C           RRN1      DOWLTDSPRC1
|   C           *IN46     ANDEQ'0'
|   C*
B2000C           KEYAC     READEAD0                      46
| 02-C           *IN46     IFEQ '0'
|   C*
|   C                     ADD  1         RRN1
|   C*
|   C           KEYSI     CHAINSI0                  40
|   C***  日期轉換
M001AC                     Z-ADDSI21      WSI21   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SI21      S001I2  80
M001AC                     PARM WSI21     S001I2  60
M001DC*          DAD11     PARM           S001O1  80
M001AC           DAD11     PARM           S001O1  60
|   C*
M001AC                     Z-ADDSI29      WSI29   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SI29      S001I2  80
M001AC                     PARM WSI29     S001I2  60
M001DC*          DSI29     PARM           S001O1  80
M001AC           DSI29     PARM           S001O1  60
|   C*
M001AC                     Z-ADDAD12      WAD12   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AD12      S001I2  80
M001AC                     PARM WAD12     S001I2  60
M001DC*          DAD12     PARM           S001O1  80
M001AC           DAD12     PARM           S001O1  60
|   C*
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     46
| 02-C                     END
|   C*
| 01-C                     END
|    C*
M001AC                     Z-ADDAD11      WAD11   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AD11      S001I2  80
M001AC                     PARM WAD11     S001I2  60
M001DC*          BBGN0     PARM           S001O1  80
M001AC           BBGN0     PARM           S001O1  60
B2NEWC*                    MOVE WBBGN0    HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    BBGN0
|    C                     MOVE AD07      BBGN1
|    C*
|    C*
|    C                     Z-ADDRRN1      WRRN1
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
06===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
06===C                     ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
