     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARI0231                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/03/10                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款系統                              *
     A*    REMARK       :應收帳款查詢－帳款明細查詢                *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.10.22 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 123199 = 123129
     A*---------------------------------------------------------------
     A****************************************************************
     FSOSILF93IF  E           K        DISK
     FSOSJPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
B2CHKFARI0231DCF  E                    WORKSTN
B2INF *CVR3009 sev.30 DISPLAY file ARI0231D must be converted, because
B2INF *   field SI21 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert ARI0231D, enlarging SI21
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E*                   WFUN    6   6  6
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     I*SDS        SDS
     I*                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I*                                     514 521 $#101
     I*                                     522 522 $APAU2
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           DSI12     PARM           I231I1  5        客戶代號
     C                     PARM *IN03     IN03    1
     C                     PARM *IN12     IN12    1
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C           *LIKE     DEFN SJ04      WSJ04
B2MODC           *LIKE     DEFN DBGN      SBGN  + 2
B2MODC*M001M     *LIKE     DEFN DBGN      BBGN  + 8
M001MC           *LIKE     DEFN DBGN      BBGN
M001AC           *LIKE     DEFN DBGN      WSBGN
     C*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSI1    KLIST
     C                     KFLD           DSI12
     C           KEYSI2    KLIST
     C                     KFLD           DSI12
     C           KEYSI3    KLIST
     C                     KFLD           DSI12
     C           KEYSI4    KLIST
     C                     KFLD           DSI12
     C                     KFLD           SI21
     C                     KFLD           SI02
     C           KEYSIB    KLIST
     C                     KFLD           DSI12
     C                     KFLD           SBGN
     C           KEYSJ     KLIST
     C                     KFLD           SI01
     C                     KFLD           SI02
     C           KEYMD     KLIST
     C                     KFLD           DSI12
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEYMA     KLIST
     C                     KFLD           SJ03
     C           KEY#B     KLIST
     C                     KFLD           SI01
     C           KEY#D     KLIST
     C                     KFLD           #D01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C           *IN12     ANDEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*                    MOVE $ADD      WA01,1
|    C*                    MOVE $UPD      WA01,2
|    C*                    MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C*
|    C                     MOVE *BLANKS   ME04
|    C                     Z-ADD0         DARTO
|    C*
|    C                     MOVE 'SCR001'  APPSCR
M001MC                     Z-ADD0         DATE    60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001MC                     PARM $EGMDY    S001I2  60
B2INF *CVR3012 sev.30 Field $EGMDY contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
M001MC           DATE      PARM           S001O1  60
     C*
M002MC                     Z-ADD123129    DBGN
B2INF *CVR3012 sev.30 Field DBGN contains more than one year
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C**         RTN110    BEGSR
|    C*
|    C*
02===C**                   ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
     C*
B2CHKC           DBGN      IFEQ 0
B2INF *CVR3012 sev.30 Field DBGN contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M002MC                     Z-ADD123129    DBGN
B2INF *CVR3012 sev.30 Field DBGN contains more than one year
     C                     END
     C*
B2???C           DBGN      IFEQ BBGN
B2INF *CVR3012 sev.30 Field DBGN contains more than one year
B2INF *CVR3012 sev.30 Field BBGN contains more than one year
|    C                     EXSR RTN171
| 01-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
| 01-C                     END
     C                     ELSE
B2???C                     Z-ADDDBGN      BBGN
B2INF *CVR3012 sev.30 Field DBGN contains more than one year
B2INF *CVR3012 sev.30 Field BBGN contains more than one year
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
     C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *57 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN180....CHECK 'SC01' SCREEN
     C*==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
05===C                     ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
     C*
B2???C           DBGN      IFNE BBGN
B2INF *CVR3012 sev.30 Field DBGN contains more than one year
B2INF *CVR3012 sev.30 Field BBGN contains more than one year
B2???C                     Z-ADDDBGN      BBGN
B2INF *CVR3012 sev.30 Field DBGN contains more than one year
B2INF *CVR3012 sev.30 Field BBGN contains more than one year
     C                     END
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C*M001M               PARM DBGN      S001I2  80
M001MC                     PARM DBGN      S001I2  60
B2INF *CVR3012 sev.30 Field DBGN contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC*M001M     SBGN      PARM           S001O1  80
M001MC           WSBGN     PARM           S001O1  60
M001AC                     MOVE WSBGN     HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    SBGN
     C*
B2000C           KEYSIB    SETLLSI0
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
|   C*          *LOVAL    SETLLSI0
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
|    C***
| 01-C           RRN1      DOWLTDSPRC1
|   C           KEYSI2    READESI0                      46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C***發票日期轉換
|    C*
M001AC                     Z-ADDSI21      WSI21   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SI21      S001I2  80
M001MC                     PARM WSI21     S001I2  60
B2???C*M001M     DSI21     PARM           S001O1  80
M001MC           DSI21     PARM           S001O1  60
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field DSI21 contains more than one year
|   C*
|   C***日期轉換
M001AC                     Z-ADDSI29      WSI29   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SI29      S001I2  80
M001MC                     PARM WSI29     S001I2  60
B2???C*M001M     DSI29     PARM           S001O1  80
M001MC           DSI29     PARM           S001O1  60
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field DSI29 contains more than one year
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     94    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C*
| 02-C           *IN50     IFEQ '1'
|   C           DSI12     CHAINME0                  40
|   C   40                MOVE *BLANKS   ME04
|   C* GET應收總額
|   C           KEYMD     CHAINMD0                  40
| 03-C           *IN40     IFEQ '0'
|   C           MD31      ADD  MD32      DARTO
| 03*C                     ELSE
|   C                     Z-ADD0         DARTO
| 03-C                     END
| 02*C                     ELSE
|   C                     MOVE *BLANKS   ME04
| 02-C                     END
|    C*
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
| 01-C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C*
|    C*          *LOVAL    SETLLSI0
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
11===C           RTN240    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C           KEYSI4    CHAINSI0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C*
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN298                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     OREQ '0'
|   C*          *LOVAL    SETLLSI0
|   C           *LOVAL    SETLLSJ0
|   C                     MOVE 'SCR001'  APPSCR
| 02-C                     END                             *IN03 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
12===CSR         RTN252    BEGSR
|    C*
|    C* GET 公司代號
|    C           KEY#B     CHAIN#B0                  40
|    C   40                MOVE *BLANKS   #B03
|    C*
|    C* GET地區／客戶代號
|    C                     MOVE SI08      ME01
|    C                     MOVE SI09      ME02
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANKS   ME07
|    C   40                MOVE *BLANKS   ME04
| 01-C           ME07      IFNE *BLANKS
|   C                     MOVE ME07      #D01
|   C           KEY#D     CHAIN#D0                  40
|   C   40                MOVE *BLANKS   #D02
| 01-C                     END
|    C* GET日期轉換
M001AC                     Z-ADDSI06      WSI06   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SI06      S001I2  80
M001MC                     PARM WSI06     S001I2  60
B2???C*M001M     DSI06     PARM           S001O1  80
M001MC           DSI06     PARM           S001O1  60
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field DSI06 contains more than one year
|    C*
12===CSR                   ENDSR
     C*==============================================================*
     C*          RTN291....INIT 'SC02' -- SFLSR2
     C*==============================================================*
13===C           RTN291    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD8         DSPRC2  40       *SFL SIZE
|    C                     Z-ADD8         WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYSJ     SETLLSJ0
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          RTN298....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
14===C           RTN298    BEGSR
|    C*
|    C           KEYSJ     READESJ0                      44*NF/EOF
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C                     EXSR RTN29B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           KEYSJ     READESJ0                      44*NF/EOF
| 01-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN29B....FILE TO SCREEN --- MOVE
     C*==============================================================*
15===C           RTN29B    BEGSR
|    C*
|    C* GET 產品名稱
|    C           KEYMA     CHAINMA0                  40
|    C   40                MOVE *BLANKS   MA03
|    C*訂購數量
     C           SJ04      SUB  SJ13      D#A
     C*發票金額
|    C           SJ06      SUB  SJ07      DATA2
     C*售價
     C           D#A       IFNE 0
|    C           DATA2     DIV  D#A       DATA1     H
     C                     ELSE
     C                     Z-ADD0         DATA1
     C                     END
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
16===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
16===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
17===C**         RTNF4     BEGSR
|    C*
|    C*
17===C**         ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
18===C*          ERRSR     BEGSR
|    C*
|    C*                    CALL 'P50'
|    C*          DMSG      PARM           P5001O 78
|    C*                    SETON                     9799
|    C*
18===C*                    ENDSR'*DETC'
B2NEWC/COPY HBP2CVTR
