     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARI0241                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    DATE WRITTEN : 81/03/31                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    PROCEDURE    :銷貨折讓查詢                              *
     A*===============================================================
     A* MODI CODE |  AUTHOR  |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M004      | MICHELLE | 00.05.18 |菸酒稅法實施
     A*================================================================
     A****************************************************************
     FSOSGPF  IF  E           K        DISK
     FARAGPF  IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
M004AFSOS2PF  IF  E           K        DISK
M004AFSOSIPF  IF  E           K        DISK
     FSOSJPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FARI0241DCF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
M004AIDA02        DS
M004AI                                        1   43DUTY1
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           I241I1 12
     C                     PARM           I241I2 12
     C                     PARM           I241I3  9
     C                     PARM *IN03     IN03    1
     C                     PARM *IN12     IN12    1
M004AC           *NAMVAR   DEFN           DA02
M004AC                     IN   DA02
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C           *LIKE     DEFN RRN       WPRCD
     C           *LIKE     DEFN RRN       DSPRCD
     C           *LIKE     DEFN I241I2    RTNNUM
     C           *LIKE     DEFN I241I3    PRDNUM
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYSG     KLIST
     C                     KFLD           SG04
     C                     KFLD           SG05
     C           KEYSH     KLIST
     C                     KFLD           RTNNUM
     C                     KFLD           PRDNUM
M004AC           KEYS2     KLIST
M004AC                     KFLD           SH02
M004AC                     KFLD           SH03
M004AC           KEYSI     KLIST
M004AC                     KFLD           AG01
M004AC                     KFLD           AG04
     C           KEYAG     KLIST
     C                     KFLD           SG09
     C                     KFLD           PRDNUM
     C           KEYSJ     KLIST
     C                     KFLD           SG01
     C                     KFLD           AG04
     C                     KFLD           PRDNUM
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *GET HEAD
     C                     EXSR RTN400
     C*
     C                     EXSR RTN500                     *EXFMTSFL
     C*
     C                     SETON                     LR
     C*=============================================================*
     C*          RTN010....GET HEADING
     C*=============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           I241I2    CHAINSG0                  39
|    C*公司簡稱
|    C           SG01      CHAIN#B0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    D#B03
| 01*C                     ELSE
|   C                     MOVEL#B03      D#B03
| 01-C                     END
|    C*
|    C*分店代號＆客戶簡稱
|    C           KEYSG     CHAINME0                  41
| 02-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    ME04
| 02-C                     END
|    C*產品代號＆產品簡稱
|    C                     MOVE I241I3    PRDN
|    C           PRDN      CHAINMA0                  42
|    C   42                MOVE *BLANK    MA03
|    C*退貨日期
M001AC                     Z-ADDSG06      XSG06   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SG06      S001I2  80
M001AC                     PARM XSG06     S001I2  60
|    C           DSG06     PARM           S001O1  60
|    C*
|    C*折讓日期
M001AC                     Z-ADDSG26      XSG26   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SG26      S001I2  80
M001AC                     PARM XSG26     S001I2  60
|    C           DSG26     PARM           S001O1  60
|    C*
|    C*退貨數量
|    C                     MOVE I241I2    RTNNUM
|    C                     MOVE I241I3    PRDNUM
|    C           KEYSH     CHAINSH0                  43
| 03-C           *IN43     IFEQ '0'
|   C           SH04      ADD  SH05      QTY
M004AC           KEYS2     CHAINS20                  45
M004AC           *IN45     IFEQ '0'
M004AC           SH07      ADD  S207      W207
M004AC                     ELSE
M004AC                     Z-ADD0         S207
M004AC                     Z-ADDSH07      W207
M004AC                     END
| 03-C                     END
|    C*
01===C                     ENDSR
     C*=============================================================*
     C*          RTN400....SFL MAIN RUTINE (START KEY)
     C*=============================================================*
02===C           RTN400    BEGSR
|    C                     EXSR RTN405                     *INIT SFL
|    C                     EXSR RTN810                     *ADD SFL DTA
02===C                     ENDSR
     C*=============================================================*
     C*          RTN405....SFL INITIAL
     C*=============================================================*
03===C           RTN405    BEGSR
|    C*
|    C                     Z-ADD1         DRRN
|    C                     Z-ADD0         RRN
|    C**                   Z-ADD8         DSPRCD
|    C**                   Z-ADD8         WPRCD            *PAG RCD
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR
|    C                     SETOF                     52
|    C                     SETON                     51    *SFLDSPCTL
|    C***
|    C           KEYAG     SETLLAG0
|    C*
03===C                     ENDSR
     C*=============================================================*
     C*          RTN500....EXFMT DSPF
     C*=============================================================*
04===C           RTN500    BEGSR
|    C*
| 01-C           RRN       IFGT 0
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NO DTA
| 01-C                     END
|    C*
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     SETOF                     50
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
04===C                     ENDSR
     C*=============================================================*
     C*          RTN810....ADD SUBFILE DATA--SOSFPF
     C*=============================================================*
05===C           RTN810    BEGSR
|    C*
|    C           KEYAG     READEAG0                      46
|    C**
| 01-C           *IN46     DOWEQ'0'
|   C                     EXSR RTN811                     DTA->SFL
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
|   C           KEYAG     READEAG0                      46
| 01-C                     END
|    C*
|    C****                 Z-ADDRRN       DRRN
05===C                     ENDSR
     C*=============================================================*
     C*          RTN811....MOVE DTA TO SFL
     C*=============================================================*
06===C           RTN811    BEGSR
|    C*
|    C           KEYSJ     CHAINSJ0                  40
| 01-C           *IN40     IFEQ '0'
|   C*訂購數量
|   C*
|   C           SJ04      SUB  SJ13      D#A
|   C*
|   C*發票金額
|   C*
|   C           SJ06      SUB  SJ07      DATA2
M004AC           KEYSI     CHAINSI0                  41
M004AC           *IN41     IFEQ '0'
M004AC           SI22      IFEQ 'D'
M004AC           DATA2     MULT DUTY1     DATA3     H
M004AC           DATA2     ADD  DATA3     DATA3     H
M004AC                     ELSE
M004AC                     Z-ADDDATA2     DATA3
M004AC                     END
M004AC                     ELSE
M004AC                     Z-ADDDATA2     DATA3
M004AC                     END
|   C*
|   C*售價
| 02-C           SJ04      IFGT 0
|   C           SJ06      SUB  SJ07      DATA1
|   C           DATA2     DIV  D#A       DATA1
| 02*C                     ELSE
|   C                     Z-ADD0         DATA1
| 02-C                     END
|   C*
| 01*C                     ELSE
|   C                     Z-ADD0         SJ04
|   C                     Z-ADD0         DATA1
|   C                     Z-ADD0         DATA2
M004AC                     Z-ADD0         DATA3
|   C*
| 01-C                     END
|    C**
06===C                     ENDSR
