      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR0791                                       *
      * AUTHER       :                                               *
      * CREATE DATE  :                                               *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :票據兌現明細表                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FARACLF05IP  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FARR079P O   E             39     PRINTER
     IAC0
     I                                              AC01  L2
     I                                              AC07  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I                                      601 602 DAC01S
     I                                      603 604 DAC01E
     I                                      605 609 DAC02S
     I                                      610 613 DAC03S
     I                                      605 613 DAC23S
     I                                      614 618 DAC02E
     I                                      619 622 DAC03E
     I                                      614 622 DAC23E
     I                                      623 6280DAC07S
     I                                      629 6340DAC07E
     I                                      635 635 DSEL
     I*(MM/DD/YY)
     I*(YY/MM/DD)
M001MI*                                     671 6760YAC07S
M001MI*                                     681 6860YAC07E
M001MI                                      671 6780YAC07S
M001MI                                      681 6880YAC07E
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
     C                     Z-ADD0         TOT2    90
  01*C                     ELSE
  02-C           *INL2     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010                     *HEADING
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900                     *OVRFLW-THE SAME CUST
     C                     EXSR RTN200                     *READE DETAIL
     C*
     CL1 10                EXSR RTN300
     CL2 10                EXSR RTN400
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         TOT1
|    C*公司名稱
|    C           AC01      CHAIN#B0                  40
|    C   40                MOVE *BLANK    D#B03
|    C  N40                MOVEL#B03      D#B03
|    C*
|    C                     WRITEPH1
|    C                     SETON                         10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....READE DETAIL
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C*預計兌現日
M001AC                     Z-ADDAC07      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM AC07      S001I2  80
M001MC                     PARM W6        S001I2  60
|    C           DAC07     PARM           S001O1  60
|    C*
|    C*
|    C*客戶代號／名稱
|    C           AC02      CHAINME0                  41
|    C   41                MOVE *BLANK    ME04
|    C*
|    C                     ADD  AC08      TOT1
|    C*
|    C                     WRITEPD1
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....SUB TOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C                     WRITEPT1
     C                     ADD  TOT1      TOT2
|    C                     Z-ADD0         TOT1
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN400....跳頁
      *==============================================================*
04===C           RTN400    BEGSR
|    C*
|    C                     WRITEPT2
|    C                     Z-ADD0         TOT2
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW--
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN999....(NO DATA)
      *==============================================================*
05===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE3
| 01-C                     END
|    C                     WRITEPE2
|    C*
05===C                     ENDSR
