      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR067                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 82/01/18                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款系統                                 *
      *  REMARK      :收款分配明細表                               *
      ****************************************************************
     FARR067D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *發票公司
     I                                      601 602 DAD10S
     I                                      603 604 DAD10E
      *收款種類
     I                                      605 606 DAD05S
     I                                      607 608 DAD05E
      *客戶別
     I                                      611 615 DAD02S
     I                                      616 620 DAD02E
      *MM/DD/YY
     I                                      650 6550DAD12S
     I                                      656 6610DAD12E
     I                                      630 6350YMDS
     I                                      636 6410YMDE
M001A *MM/DD/YY
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DAD10S
|    C                     MOVE *BLANK    DAD10E
|    C                     MOVE *BLANK    DAD05S
|    C                     MOVE *BLANK    DAD05E
|    C                     MOVE *BLANK    DAD02S
|    C                     MOVE *BLANK    DAD02E
|    C                     Z-ADD0         DAD12S
|    C                     Z-ADD0         DAD12E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司別
| 01-C           DAD10S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAD10S
| 01-C                     END
|    C*
| 02-C           DAD10E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAD10E
| 02-C                     END
|    C*
| 03-C           DAD10S    IFGT DAD10E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*種類
| 04-C           DAD05S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAD05S
| 04-C                     END
|    C*
| 05-C           DAD05E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAD05E
| 05-C                     END
|    C*
| 06-C           DAD05S    IFGT DAD05E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C*客戶別
| 07-C           DAD02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAD02S
| 07-C                     END
|    C*
| 08-C           DAD02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAD02E
| 08-C                     END
|    C*
| 09-C           DAD02S    IFGT DAD02E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 09-C                     END
|    C   99                GOTO END100
|    C*檢查日期
| 10-C           DAD12S    IFEQ 0
M001DC*                    Z-ADD010101    DAD12S
M001AC                     Z-ADD010192    DAD12S
| 10-C                     END
|    C*
| 11-C           DAD12E    IFEQ 0
M001DC*                    Z-ADD123199    DAD12E
M001AC                     Z-ADD123129    DAD12E
| 11-C                     END
|    C*收款價差日期
|    C                     CALL 'P09'
|    C                     PARM DAD12S    P0901I  60
|    C                     PARM           P0911O  1
| 12-C           P0911O    IFEQ 'N'
|   C                     SETON                     649499
| 12-C                     END
|    C   99                GOTO END100
|    C                     CALL 'P09'
|    C                     PARM DAD12E    P0901I  60
|    C                     PARM           P0911O  1
| 13-C           P0911O    IFEQ 'N'
|   C                     SETON                     659499
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C*
|    C*(CHENK STRART <= END DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAD12S    S001I2  60
|    C           YMDS      PARM           S001OI  60
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAD12E    S001I2  60
|    C           YMDE      PARM           S001OI  60
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
M001DC*          YMDS      IFGT YMDE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 14-C                     END
|    C   99                GOTO END100
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS021'
|   C                     PARM           DAD05S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS021'
|   C                     PARM           DAD05E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 9
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DAD02S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 46
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS003'
|   C                     PARM           DAD02E
|   C                     GOTO ENDF4
| 07-C                     END
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
