      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR055                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/23                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :物流點存貨成本表                             *
      ****************************************************************
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      598 5990$PRTID
     I                                      601 601 DIA01
     I                                      603 603 DIA02F
     I                                      604 608 DIA02S
     I                                      609 613 DIA02E
     I                                      614 622 DIA03S
     I                                      623 631 DIA03E
     I*
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     .INIT SCREEN
     C*
     C                     EXSR OUTLDA
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     Z-ADD1         $CPY
|    C                     MOVEL'00'      $PRTID
|    C                     MOVEL'D010048' $USER
|    C                     MOVE 'R'       DIA01
|    C                     MOVE *LOVAL    DIA02S
|    C                     MOVE *HIVAL    DIA02E
|    C                     MOVE *LOVAL    DIA03S
|    C                     MOVE *HIVAL    DIA03E
|    C*
01===C                     ENDSR
|    C*
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
