      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0453                                       *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/04/28                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款子系統                               *
      * REMARK       :銷貨收入明細表                               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FREWF70  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     F*PA#BPF  IF  E           K        DISK
     FARR045BPO   E             39     PRINTER
     IWF700
     I                                              WF7002L2
     I                                              WF7003L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 601 DSI01
     I                                      602 602 COMP
     I                                      603 6080DSI35S
     I                                      609 6140DSI35E
M001MI                                      615 6220WSI35S
M001MI                                      623 6300WSI35E
M001MI                                      631 631 DSI10
M001MI                                      632 632 DSEL
M001MI                                      633 633 COMPS
M001MI                                      634 634 COMPE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           WF7006
     C                     KFLD           WF7007
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN100
     C                     SETON                     10
     C*明細列印
     C                     EXSR RTN200
     C                     SETOF                         30
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CLR 10                EXSR RTNL3
     CLRN10                EXSR RTNLR
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
01===C           RTN100    BEGSR
|    C**
|    C**辦事處
     C           COMP      IFEQ '1'
     C                     MOVEL'台北'  #B03
     C                     ELSE
     C           COMP      IFEQ '2'
     C                     MOVEL'台中'  #B03
     C                     ELSE
     C           COMP      IFEQ '3'
     C                     MOVEL'高雄'  #B03
     C                     ELSE
     C                     MOVEL'全部'  #B03
     C                     END
     C                     END
     C                     END
|    C*轉帳
     C           DSI10     IFEQ '1'
     C                     MOVEL'非轉帳'TEXT1
     C                     ELSE
     C           DSI10     IFEQ '2'
     C                     MOVEL'轉帳'  TEXT1
     C                     ELSE
     C           DSI10     IFEQ '3'
     C                     MOVEL'全部'  TEXT1
     C                     END
     C                     END
     C                     END
|    C*表頭列印
|    C                     EXSR RTN900
|    C*清除總計欄位
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C                     Z-ADD0         T1TOT5
|    C                     Z-ADD0         T1TOT6
|    C                     Z-ADD0         T1TOT8
|    C                     Z-ADD0         T1TOT9
|    C                     Z-ADD0         T1TOTA
|    C                     Z-ADD0         T2TOT1
|    C                     Z-ADD0         T2TOT2
|    C                     Z-ADD0         T2TOT3
|    C                     Z-ADD0         T2TOT4
|    C                     Z-ADD0         T2TOT5
|    C                     Z-ADD0         T2TOT6
|    C                     Z-ADD0         T2TOT8
|    C                     Z-ADD0         T2TOT9
|    C                     Z-ADD0         T2TOTA
|    C                     Z-ADD0         T3TOT1
|    C                     Z-ADD0         T3TOT2
|    C                     Z-ADD0         T3TOT3
|    C                     Z-ADD0         T3TOT4
|    C                     Z-ADD0         T3TOT5
|    C                     Z-ADD0         T3TOT6
|    C                     Z-ADD0         T3TOT8
|    C                     Z-ADD0         T3TOT9
|    C                     Z-ADD0         T3TOTA
     C*
     C                     SETON                     30
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200....GET DETAIL
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
M001AC                     Z-ADDWF7003    W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM WF7003    S001I2  80
M001MC                     PARM W6        S001I2  60
|    C           DATE      PARM           S001O1  60
|    C**
|    C*客戶名稱
|    C           KEYME     CHAINME0                  41
| 01-C           *IN41     IFEQ '0'
|   C                     MOVE ME04      WME04
     C                     ELSE
|   C                     MOVE *BLANK    WME04
| 01-C                     END
|    C*
|    C                     ADD  WF7008    T1TOT1
|    C                     ADD  WF7009    T1TOT2
|    C                     ADD  WF7010    T1TOT3
|    C                     ADD  WF7011    T1TOT4
|    C                     ADD  WF7019    T1TOT5
|    C                     ADD  WF7012    T1TOT6
|    C                     ADD  WF7015    T1TOT8
|    C                     ADD  WF7016    T1TOT9
|    C*
|    C                     ADD  WF7008    T2TOT1
|    C                     ADD  WF7009    T2TOT2
|    C                     ADD  WF7010    T2TOT3
|    C                     ADD  WF7011    T2TOT4
|    C                     ADD  WF7019    T2TOT5
|    C                     ADD  WF7012    T2TOT6
|    C                     ADD  WF7015    T2TOT8
|    C                     ADD  WF7016    T2TOT9
|    C*
|    C                     ADD  WF7008    T3TOT1
|    C                     ADD  WF7009    T3TOT2
|    C                     ADD  WF7010    T3TOT3
|    C                     ADD  WF7011    T3TOT4
|    C                     ADD  WF7019    T3TOT5
|    C                     ADD  WF7012    T3TOT6
|    C                     ADD  WF7015    T3TOT8
|    C                     ADD  WF7016    T3TOT9
|    C*翻頁控制
| 03-C           *IN39     IFEQ '1'
|   C                     EXSR RTN900
     C                     SETON                     30
| 03-C                     END
|    C*明細列印
|    C                     WRITEPD1
02===C                     ENDSR
      *==============================================================*
      *          RTNL1.....PRINT PD2
      *==============================================================*
03===C           RTNL1     BEGSR
     C*
     C           T1TOT4    IFNE 0
     C           T1TOT9    DIV  T1TOT4    WORK1   54H
     C           WORK1     MULT 100       T1TOTA
     C                     ELSE
     C                     Z-ADD0         T1TOTA
     C                     END
     C*
     C                     WRITEPT1
     C                     SETON                     30
     C*
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C                     Z-ADD0         T1TOT5
|    C                     Z-ADD0         T1TOT6
|    C                     Z-ADD0         T1TOT8
|    C                     Z-ADD0         T1TOT9
|    C                     Z-ADD0         T1TOTA
     C*
     C                     ENDSR
      *==============================================================*
      *          RTNL2.....PRINT PD2
      *==============================================================*
03===C           RTNL2     BEGSR
     C*
     C           T2TOT4    IFNE 0
     C           T2TOT9    DIV  T2TOT4    WORK2   54H
     C           WORK1     MULT 100       T2TOTA
     C                     ELSE
     C                     Z-ADD0         T2TOTA
     C                     END
     C*
     C                     WRITEPT2
     C*
|    C                     Z-ADD0         T2TOT1
|    C                     Z-ADD0         T2TOT2
|    C                     Z-ADD0         T2TOT3
|    C                     Z-ADD0         T2TOT4
|    C                     Z-ADD0         T2TOT5
|    C                     Z-ADD0         T2TOT6
|    C                     Z-ADD0         T2TOT8
|    C                     Z-ADD0         T2TOT9
|    C                     Z-ADD0         T2TOTA
     C*
     C                     SETON                     39
     C*
     C                     ENDSR
      *==============================================================*
      *          RTNL3.....PRINT PT3
      *==============================================================*
03===C           RTNL3     BEGSR
     C*
     C           T3TOT4    IFNE 0
     C           T3TOT9    DIV  T3TOT4    WORK3   54H
     C           WORK2     MULT 100       T3TOTA
     C                     ELSE
     C                     Z-ADD0         T3TOTA
     C                     END
     C*
     C                     WRITEPT3
     C                     WRITEPE2
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
| 01-C           *IN10     IFEQ '1'
|   C                     WRITEPE1
| 01-C                     END
|    C*
     C*專櫃名稱
     C                     MOVELWF7002    DSC04
     C           DSC04     CHAINME0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELME04      DME04
     C                     ELSE
     C                     MOVEL*BLANKS   DME04
     C                     END
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR  ...(NO DATA)
      *==============================================================*
09===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN100
|   C                     WRITEPE3
|   C                     WRITEPE2
| 01-C                     END
|    C*
09===C                     ENDSR
