      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0481                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/06                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :應收帳款明細表                               *
      ****************************************************************
     FREWF80  IP  E           K        DISK
     FSOSIPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FARR048P O   E             39     PRINTER
     IWF800
     I                                              WF8009L1
     I                                              WF8005L2
     I                                              WF8004L3
     I                                              WF8002L4
     I                                              WF8003L4
     I                                              WF8001L5
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 609 DSI89S
     I                                      610 618 DSI89E
     I*西元(YY/MM/DD)
     I                                      620 6250DSI35S
     I                                      626 6310DSI35E
     I*西元(MM/DD/YY)
     I                                      640 6450CSI35S
     I                                      646 6510CSI35E
     I                                      661 662 DSI01S
     I                                      663 664 DSI01E
     I*通路
     I                                      665 665 DSI03S
     I                                      666 666 DSI03E
     I*
     I                                      671 676 DSI31S
     I                                      677 682 DSI31E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYSI     KLIST
     C                     KFLD           WF8001
     C                     KFLD           WF8005
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900                     *PROC SKIP
     C                     EXSR RTN100                     *READE DETAIL
     C                     SETOF                     313230
     C                     SETON                     36
     C*
     CL1 10                SETOF                     30
     CL2 10                SETON                     30
     CL3 10                EXSR RTNL3
     CL4 10                EXSR RTNL4
     CL5 10                EXSR RTNL5
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*公司簡稱
|    C           WF8001    CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B03
|    C                     SETON                     303132
|    C                     SETON                     3610
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CHAIN DATA
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*客戶簡稱
|    C                     MOVELWF8002    ME01
|    C                     MOVELWF8003    ME02
|    C           KEYME     CHAINME0                  40
|    C  N40                MOVELME04      ME04A
|    C   40                MOVE *BLANK    ME04A
|    C*
|    C                     MOVELWF8014    ME01
|    C                     MOVELWF8015    ME02
|    C           KEYME     CHAINME0                  40
|    C  N40                MOVELME04      ME04B
|    C   40                MOVE *BLANK    ME04B
|    C*
|    C*發票日
|    C**
M001AC                     Z-ADDWF8004    XF8004  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF8004    S001I2  80
M001AC                     PARM XF8004    S001I2  60
|    C           WF804A    PARM           S001O1  60
|    C**
|    C*
|    C**
|    C*應收日期
|    C**
M001AC                     Z-ADDWF8013    XF8013  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF8013    S001I2  80
M001AC                     PARM XF8013    S001I2  60
|    C           WF813A    PARM           S001O1  60
|    C*
|    C*收款種類
| 01-C           WF8008    IFEQ '99'
     C                     SETON                     37
| 01*C                     ELSE
     C                     SETOF                     37
|   C                     MOVE *BLANK    #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVEL'COLLECT' #A01
|   C                     MOVELWF8008    #A02
|   C           KEY#A     CHAIN#A0                  42
| 02-C           *IN42     IFEQ '0'
|   C                     MOVEL#A03      MARK
| 02*C                     ELSE
|   C                     MOVE *BLANK    MARK
| 02-C                     END
| 01-C                     END
|    C*
|    C*沖帳日期
M001AC                     Z-ADDWF8012    XF8012  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF8012    S001I2  80
M001AC                     PARM XF8012    S001I2  60
|    C           WF812A    PARM           S001O1  60
|    C**
|    C*預兌日期
|    C                     MOVE *BLANK    WF810A
| 03-C           WF8008    IFEQ '10'
M001AC                     Z-ADDWF8010    XF8010  60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF8010    S001I2  80
M001AC                     PARM XF8010    S001I2  60
|   C           WF810A    PARM           S001O1  60
| 03-C                     END
| 04-C           WF8011    IFEQ 0
|   C                     SETOF                     36
| 04*C                     ELSE
|   C                     SETON                     36
| 04-C                     END
     C*
     C           WF8017    CHAINMC0                  43
     C           *IN43     IFEQ '1'
     C                     MOVEL*BLANKS   MC03
     C                     END
     C*
     C           KEYSI     CHAINSI0                  44
     C           *IN44     IFEQ '1'
     C                     MOVEL*BLANKS   SI10
     C                     Z-ADD0         SI21
     C                     END
|    C*發票日
M001AC                     Z-ADDSI21      XSI21   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SI21      S001I2  80
M001AC                     PARM XSI21     S001I2  60
|    C           SI21P     PARM           S001O1  60
|    C*
|    C                     WRITEPD1
| 05-C           *IN30     IFEQ '1'
|   C                     ADD  WF8006    TOT006
|   C                     ADD  WF8007    TOT007
| 05-C                     END
|    C                     ADD  WF8011    TOT011
|    C                     SETOF                     30
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL3.....SI35 LEVER BREAK
      *==============================================================*
03===C           RTNL3     BEGSR
|    C*
|    C                     WRITEPT1
|    C                     ADD  TOT006    TOT106
|    C                     ADD  TOT007    TOT107
|    C                     ADD  TOT011    TOT111
|    C                     Z-ADD0         TOT006
|    C                     Z-ADD0         TOT007
|    C                     Z-ADD0         TOT011
|    C                     SETON                     31
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL4.....SI01 LEVER BREAK
      *==============================================================*
04===C           RTNL4     BEGSR
|    C*
|    C           WF8001    CHAIN#B0                  42
|    C   42                MOVE *BLANK    #B03
|    C*
|    C                     WRITEPT2
|    C                     ADD  TOT106    TOT206
|    C                     ADD  TOT107    TOT207
|    C                     ADD  TOT111    TOT211
|    C                     Z-ADD0         TOT106
|    C                     Z-ADD0         TOT107
|    C                     Z-ADD0         TOT111
|    C                     SETON                     32
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNL5.....SI08 OR SI09  LEVER BREAK
      *==============================================================*
05===C           RTNL5     BEGSR
|    C*
|    C                     WRITEPT3
|    C                     Z-ADD0         TOT206
|    C                     Z-ADD0         TOT207
|    C                     Z-ADD0         TOT211
|    C                     SETON                     383932
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN900....PROC SKIP
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C*公司簡稱
|    C           WF8001    CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B03
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     3938
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN999....(NO DATA)
      *==============================================================*
07===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE4
|   C                     WRITEPE2
| 01*C                     ELSE
|   C                     WRITEPE2
| 01-C                     END
|    C*
07===C                     ENDSR
