      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR052                                        *
      * AUTHER       : A1118 PHILP TSAI                              *
      * CREATE DATE  : 81/04/08                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款子系統                               *
      * REMARK       :應收帳款管理表                               *
      ****************************************************************
     FARR052D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FPA#BPF  IF  E           K        DISK
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DSI01S
     I                                      603 604 DSI01E
     I                                      605 6100DSI29
     I                                      611 6160WSI29
     I                                      621 629 DSI89S
     I                                      631 639 DSI89E
M001AI                                      850 857 YMD8
     I            DS
     I                                        1   60YYMMDD
     I                                        1   20YY
     I                                        3   60MMDD
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSI01S
|    C                     MOVE *BLANK    DSI01E
|    C                     Z-ADD0         DSI29
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
| 01-C           DSI01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI01S
| 01-C                     END
| 02-C           DSI01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI01E
| 02-C                     END
|    C*公司別區間檢查
| 03-C           DSI01S    IFGT DSI01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C           DSI01S    SETLL#B0
|    C                     READ #B0                      41
| 04-C           *IN41     IFEQ '1'
|   C                     SETON                     609599
|   C                     SETON                     61
| 04*C                     ELSE
| 05-C           #B01      IFGT DSI01E
|   C                     SETON                     606188
|   C                     SETON                     99
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
| 01-C           DSI89S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI89S
| 01-C                     END
| 02-C           DSI89E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI89E
| 02-C                     END
|    C*公司別區間檢查
| 03-C           DSI89S    IFGT DSI89E
|   C                     SETON                     6364
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
| 06-C           DSI29     IFEQ 0
M001DC*                    Z-ADD123199    DSI29
M001AC                     Z-ADD123129    DSI29
| 06-C                     END
|    C*CHECK DATE
|    C                     CALL 'P09'
|    C                     PARM DSI29     P0901I  60
|    C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     629499
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C                     MOVELDSI29     MMDD
|    C                     MOVE DSI29     YY
|    C                     Z-ADDYYMMDD    WSI29
M001AC                     MOVE WSI29     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    8
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*客戶代號
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS003'
|   C                     PARM           DSI89S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS003'
|   C                     PARM           DSI89E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
