      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0671                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 82/01/19                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :收款分配明細表　　                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M004  MICHELLE   00.06.15 新增銷退稅額及銷退總金額欄   */
     /*=============================================================*/
      ****************************************************************
     FREWF81  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FARR067P O   E             39     PRINTER
     IWF810
     I                                              WF8104L1
     I                                              WF8102L2
     I                                              WF8101L3
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *發票公司
     I                                      601 602 DAD10S
     I                                      603 604 DAD10E
      *收款種類
     I                                      605 606 DAD05S
     I                                      607 608 DAD05E
      *客戶別
     I                                      611 615 DAD02S
     I                                      616 620 DAD02E
      *MM/DD/YY
     I                                      650 6550DAD12S
     I                                      656 6610DAD12E
     I                                      630 6350YMDS
     I                                      636 6410YMDE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           WF8102
     C                     KFLD           WF8103
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *SET INIT
  01*C                     ELSE
  02-C           *INL3     IFEQ '1'
    C                     EXSR RTN010
  02-C                     END
  01-C                     END
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CL3 10                EXSR RTN400
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         T18105
|    C                     Z-ADD0         T18108
M004AC                     Z-ADD0         T18112
M004AC                     Z-ADD0         T10812
M004AC                     Z-ADD0         T28112
M004AC                     Z-ADD0         T20812
M004AC                     Z-ADD0         T38112
M004AC                     Z-ADD0         T30812
|    C                     Z-ADD0         T28105
|    C                     Z-ADD0         T28108
|    C                     Z-ADD0         T38105
|    C                     Z-ADD0         T38108
|    C                     WRITEPH1
|    C                     SETON                     1031
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
M004AC           WF8108    ADD  WF8112    D0812
|    C                     ADD  WF8108    T18108
M004AC                     ADD  WF8112    T18112
M004AC                     ADD  D0812     T10812
|    C                     ADD  WF8105    T18105
|    C*日期轉換
M001AC                     Z-ADDWF8110    XF8110  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF8110    S001I2  80
M001AC                     PARM XF8110    S001I2  60
|    C           WF810A    PARM           S001OI  60
M001AC                     Z-ADDWF8107    XF8107  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF8107    S001I2  80
M001AC                     PARM XF8107    S001I2  60
|    C           WF807A    PARM           S001OI  60
M001AC                     Z-ADDWF8104    XF8104  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF8104    S001I2  80
M001AC                     PARM XF8104    S001I2  60
|    C           WF804A    PARM           S001OI  60
|    C*客戶代號／名稱
|    C           KEYME     CHAINME0                  41
|    C   41                MOVE *BLANK    ME04
|    C*收款種類
| 01-C           WF8109    IFEQ '99'
|   C                     SETON                     37
| 01*C                     ELSE
|   C                     SETOF                     37
|   C                     MOVEL'COLLECT' #A01
|   C                     MOVELWF8109    #A02
|   C           KEY#A     CHAIN#A0                  41
| 02-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    D#A03
| 02*C                     ELSE
|   C                     MOVEL#A03      D#A03
| 02-C                     END
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETON                     313233
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....PROC SKIP
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN200....AD12 LEVER BREAD
      *==============================================================*
04===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     ADD  T18105    T28105
|    C                     ADD  T18108    T28108
M004AC                     ADD  T18112    T28112
M004AC                     ADD  T10812    T20812
M004AC                     Z-ADD0         T10812
M004AC                     Z-ADD0         T18112
|    C                     Z-ADD0         T18105
|    C                     Z-ADD0         T18108
|    C*
|    C                     SETOF                     33
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN300....8108 LEVER BREAD
      *==============================================================*
05===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     ADD  T28105    T38105
|    C                     ADD  T28108    T38108
M004AC                     ADD  T28112    T38112
M004AC                     ADD  T20812    T30812
|    C                     Z-ADD0         T28105
|    C                     Z-ADD0         T28108
M004AC                     Z-ADD0         T28112
M004AC                     Z-ADD0         T20812
|    C*
|    C                     SETOF                     333231
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN400....8108 LEVER BREAD
      *==============================================================*
06===C           RTN400    BEGSR
|    C*
|    C                     WRITEPT3
|    C  NLR                WRITEPE1
|    C*
|    C                     SETOF                     3332
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN999....ENDPGM
      *==============================================================*
07===C           RTN999    BEGSR
|    C*
     C           *IN10     IFEQ '0'
|    C                     EXSR RTN010
|    C                     WRITEPE3
07===C                     END
|    C                     WRITEPE2
|    C*
07===C                     ENDSR
