      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0561                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/27                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :銷退折讓分配差異報表                         *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.22  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSOSGPF  IF  E           K        DISK
     FSOSGLF  IF  E           K        DISK
     F            SG0                               KRENAMESG0L
     FSOSHPF  IF  E           K        DISK
     FSOSHLF  IF  E           K        DISK
     F            SH0                               KRENAMESH0L
     FPA#BPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FARR056P O   E             39     PRINTER
     I*
     ISG0L
     I              SG01                            SG01L
     I              SG02                            SG02L
     I              SG03                            SG03L
     I              SG06                            SG06L
     I              SG09                            SG09L
     I              SG17                            SG17L
     ISH0L
     I              SH02                            SH02L
     I              SH03                            SH03L
     I              SH04                            SH04L
     I              SH05                            SH05L
     I              SH06                            SH06L
     I              SH12                            SH12L
     I              SH13                            SH13L
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 601 DSG01S
     I                                      603 604 DSG01E
     I*(MM/DD/YY)
     I                                      631 6360DSG06S
     I                                      637 6420DSG06E
     I*(YY/MM/DD)
     I*M001M                                650 6550YSG06S
     I*M001M                                656 6610YSG06E
M001MI                                      650 6570YSG06S
M001MI                                      658 6650YSG06E
      *==============================================================*
      *                    DEFN RTN
      *==============================================================*
     C           *LIKE     DEFN SG01      HSG01
     C           *LIKE     DEFN SG02      HSG02
     C           *LIKE     DEFN SG02L     HSG02L
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYSG     KLIST
     C                     KFLD           SG17
     C                     KFLD           SH03
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN200                     *READE DETAIL
     C*
     C                     EXSR RTN999
     C                     MOVE '1'       *INLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C****
|    C*公司名稱
|    C****
|    C           SG01      CHAIN#B0                  41
|    C   41                MOVE *BLANK    #B03
|    C*
|    C                     WRITEPH1
|    C                     SETON                     313210
|    C                     MOVE SG01      HSG01
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....READE DETAIL
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C                     READ SG0                      45
| 01-C           *IN45     DOWEQ'0'
|   C  N10                EXSR RTN010
| 02-C           SG01      IFNE HSG01
|   C                     SETON                     3839
|   C                     MOVE SG01      HSG01
| 02-C                     END
|   C***
|   C*退貨日期
|   C***
M001AC                     Z-ADDSG06      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SG06      S001I2  80
M001MC                     PARM W6        S001I2  60
|   C           DSG06     PARM           S001O1  60
|   C*
|   C           SG02      SETLLSH0
|   C           SG02      READESH0                      46
| 03-C           *IN46     DOWEQ'0'
|   C                     EXSR RTN300                     *CHAIN SOSHPF
|   C*
|   C           KEYSG     CHAINSH0L                 47
| 04-C           *IN47     IFEQ '0'
|   C                     EXSR RTN340                     *CHAIN SOSHLF
|   C*
|   C           SH02L     CHAINSG0L                 48    *CHAIN HEAD
| 05-C           *IN48     IFEQ '0'
|   C***
|   C*退貨日期
|   C***
M001AC                     Z-ADDSG06L     W6
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SG06L     S001I2  80
M001MC                     PARM W6        S001I2  60
|   C           DSG06L    PARM           S001O1  60
|   C*
| 06-C           SH06      IFNE SH06L
|   C*
| 07-C           SG02      IFNE HSG02
|   C                     SETON                         31
|   C                     MOVE SG02      HSG02
| 07-C                     END
| 08-C           SG02L     IFNE HSG02L
|   C                     SETON                         32
|   C                     MOVE SG02L     HSG02L
| 08-C                     END
|   C*
|   C                     EXSR RTN400                     *WRITE
| 06-C                     END
|   C*
| 05-C                     END                             *IN48
|   C*
| 04-C                     END                             *IN47
|   C*
|   C           SG02      READESH0                      46
| 03-C                     END                             *IN46
|   C*
|   C                     READ SG0                      45
| 01-C                     END                             *IN45
|    C**
02===C                     ENDSR
      *==============================================================*
      *          RTN300....CHAIN DATA---SOSHLF
      *==============================================================*
03===C           RTN300    BEGSR
|    C***
|    C*產品簡稱
|    C***
|    C           SH03      CHAINMA0                  40
|    C   40                MOVE *BLANK    MA03
|    C***
|    C*退貨數量
|    C***
|    C***        SH04      ADD  SH05      DQTY
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN340....CHAIN DATA---SOSHLF
      *==============================================================*
04===C           RTN340    BEGSR
|    C***
|    C*產品簡稱
|    C***
|    C           SH03L     CHAINMA0                  40
|    C   40                MOVE *BLANK    MA03L
|    C  N40                MOVELMA03      MA03L
|    C***
|    C*退貨數量
|    C***
|    C***        SH04L     ADD  SH05L     DQTYL
|    C***
|    C*差異數量
|    C***
|    C           SH12      SUB  SH12L     DTOT1
|    C           SH13      SUB  SH13L     DTOT2
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE DETAIL
      *==============================================================*
05===C           RTN400    BEGSR
|    C*
|    C   39N38             EXSR RTN900                     *OVRFLW-THE SAME SALE
|    C   39 38             EXSR RTN910                     *OVRSLW-NOT THE SAME
|    C*
|    C                     WRITEPD1
     C                     SETON                     11    *控制PE4
|    C                     SETOF                     3132
|    C                     MOVE *BLANK    MA03L
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW --同一公司
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETON                     3031
|    C                     SETOF                     39
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN910....OVERFLOW --不同公司
      *==============================================================*
07===C           RTN910    BEGSR
|    C*
|    C                     WRITEPE3
|    C****
|    C*公司名稱
|    C****
|    C           SG01      CHAIN#B0                  41
|    C   41                MOVE *BLANK    #B03
|    C*
|    C                     WRITEPH1
|    C                     SETON                     313210
|    C*
|    C                     SETOF                     3938
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN999....(NO DATA)
      *==============================================================*
08===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
     C           *IN11     OREQ '0'
|   C                     EXSR RTN010
|   C  N10                WRITEPH1
|   C                     WRITEPE4
| 01-C                     END
|   C                     WRITEPE2
|    C*
08===C                     ENDSR
