      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0801                                       *
      ***BEFORE CREAT  ARR0801  MUST CREAT REW100 KEY WF1008         *
      * AUTHER       : 910074 TINA                                   *
      * CREATE DATE  : 83/12/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :帳齡分析表                                   *
      ****************************************************************
     FSOSILF07IP  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FREW100  O   E           K        DISK
     ISI0
     I                                              SI12  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      187 1920$EGYMD
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      617 6220YDATES
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF1003    WORK1            *LE 30DAYS
     C           *LIKE     DEFN WF1004    WORK2            *30-60DAYS
     C           *LIKE     DEFN WF1005    WORK3            *61-90DAYS
     C           *LIKE     DEFN WF1006    WORK4            *91-120DAYS
     C           *LIKE     DEFN WF1007    WORK5            *GT 121DAYS
     C           *LIKE     DEFN WF1008    WORK6            *TOTAL
     C           *LIKE     DEFN YDATES    WSDATE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*          KE100     KLIST
     C*                    KFLD           WF1001
     C*                    KFLD           WF1002
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *計算帳齡
     C  N10                EXSR RTN010
     C                     EXSR RTN100
      *WRITE REWF77
      *
     CL1 10                EXSR RTN200
     C*
      *==============================================================*
      *          RTN010....INITIAL
      *==============================================================*
01===C           RTN010    BEGSR
      *
|    C                     Z-ADD0         DAY     90
|    C                     Z-ADD0         WORK1
|    C                     Z-ADD0         WORK2
|    C                     Z-ADD0         WORK3
|    C                     Z-ADD0         WORK4
|    C                     Z-ADD0         WORK5
|    C                     Z-ADD0         WORK6
     C                     SETON                     10
01===C                     ENDSR
      *==============================================================*
      *          RTN100....計算帳齡
      *==============================================================*
02===C           RTN100    BEGSR
|    C***
|    C* (UPD BY 81/05/05 --->應收日轉成中國年月日)
|    C***
B2???C           SI29      SUB  110000    DSI21   60
B2INF *CVR0001 sev.00 Field DSI21 is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code SUB
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|    C***
|    C*(確認日轉成中國年月日)
|    C***
|    C           YMD8S     SUB  110000    WSDATE
|    C***
|    C*發票日與確認日之相距天數
|    C***
|    C                     CALL 'P20'
|    C                     PARM DSI21     P2001I  60       *發票日
|    C                     PARM WSDATE    P2002I  60       *確認日
|    C           DAY       PARM           P2011O  90
|    C*(A)
|   C           DAY       IFLE 30
|   C                     ADD  SI30      WORK1
| 01-C                     END
|    C*(B)
| 02-C           DAY       IFGE 31
|   C           DAY       ANDLE60
|   C                     ADD  SI30      WORK2
| 02-C                     END
|    C*(C)
| 03-C           DAY       IFGE 61
|   C           DAY       ANDLE90
|   C                     ADD  SI30      WORK3
| 03-C                     END
|    C*(D)
| 04-C           DAY       IFGE 91
|   C           DAY       ANDLE120
|   C                     ADD  SI30      WORK4
| 04-C                     END
|    C*(E)
| 05-C           DAY       IFGT 120
|   C                     ADD  SI30      WORK5
| 05-C                     END
|    C***
|    C*(總額)---SUBTOT
|    C***
|   C                     ADD  SI30      WORK6
      *
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE OR UPDATE REWF77
      *==============================================================*
03===C           RTN200    BEGSR
      *
|    C                     MOVELSI12      WF1002
     C           SI12      CHAINMD0                  45
     C           *IN45     IFEQ '0'
     C                     MOVELMD06      WF1001
     C                     ELSE
     C                     MOVEL*BLANK    WF1001
     C                     END
     C*
|    C                     Z-ADDWORK1     WF1003
|    C                     Z-ADDWORK2     WF1004
|    C                     Z-ADDWORK3     WF1005
|    C                     Z-ADDWORK4     WF1006
|    C                     Z-ADDWORK5     WF1007
|    C                     Z-ADDWORK6     WF1008
     C           WF1008    IFNE 0
|    C                     WRITEWF100
     C                     END
|    C*
|    C                     Z-ADD0         WORK1
|    C                     Z-ADD0         WORK2
|    C                     Z-ADD0         WORK3
|    C                     Z-ADD0         WORK4
|    C                     Z-ADD0         WORK5
|    C                     Z-ADD0         WORK6
      *
03===C                     ENDSR
