      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有　    TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR073                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 03/31/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :                                               *
      * REMARK       :遞延銷退餘額明細表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FARR073D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 601 DSG01S
     I                                      602 603 DSG01E
     I                                      604 605 DSG15S
     I                                      606 607 DSG15E
     I                                      610 614 DSG04S
     I                                      615 619 DSG04E
     I                                      620 620 DMD07S
     I                                      621 621 DMD07E
     I                                      624 625 DMD08S
     I                                      626 627 DMD08E
     I*折讓日期
     I                                      640 6450DSG26S
     I                                      646 6510DSG26E
M001MI*                                     652 6570YSG26S
M001MI*                                     658 6630YSG26E
M001MI                                      652 6590YSG26S
M001MI                                      660 6670YSG26E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSG01S
|    C                     MOVE *BLANK    DSG01E
|    C                     MOVE *BLANK    DSG15S
|    C                     MOVE *BLANK    DSG15E
|    C                     MOVE *BLANK    DSG04S
|    C                     MOVE *BLANK    DSG04E
|    C                     MOVE *BLANK    DMD07S
|    C                     MOVE *BLANK    DMD07E
|    C                     MOVE *BLANK    DMD08S
|    C                     MOVE *BLANK    DMD08E
|    C                     Z-ADD0         DSG26S
|    C                     Z-ADD0         DSG26E
|    C                     Z-ADD0         YSG26S
|    C                     Z-ADD0         YSG26E
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           DSG01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG01S
     C                     END
| 01-C           DSG01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG01E
     C                     END
|    C*
| 03-C           DSG01S    IFGT DSG01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C* 地區
| 01-C           DSG15S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG15S
     C                     END
| 01-C           DSG15E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG15E
     C                     END
| 03-C           DSG15S    IFGT DSG15E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C* CHK客戶代號
| 01-C           DSG04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG04S
| 01-C                     END
|    C*
| 02-C           DSG04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG04E
| 02-C                     END
|    C*
| 03-C           DSG04S    IFGT DSG04E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*
|   C*
|    C* CHK通路
| 01-C           DMD07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMD07S
| 01-C                     END
|    C*
| 02-C           DMD07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMD07E
| 02-C                     END
|    C*
| 03-C           DMD07S    IFGT DMD07E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK型態
| 01-C           DMD08S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMD08S
| 01-C                     END
|    C*
| 02-C           DMD08E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMD08E
| 02-C                     END
|    C*
| 03-C           DMD08S    IFGT DMD08E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*CHECK折讓日期
| 07-C           DSG26S    IFEQ 0
|   C*M001M               Z-ADD010101    DSG26S
M001MC                     Z-ADD010192    DSG26S
| 07-C                     END
|    C*
| 08-C           DSG26E    IFEQ 0
|   C*M001M               Z-ADD123199    DSG26E
M001MC                     Z-ADD123129    DSG26E
| 08-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSG26S    P0901I  60
|    C                     PARM           P0901O  1
|    C*
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 05*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG26S    S001I2  60
|   C*M001M     YSG26S    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YSG26S
| 05-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSG26E    P0901I  60
|    C                     PARM           P0901O  1
|    C*
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
| 06*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG26E    S001I2  60
|   C*M001M     YSG26E    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YSG26E
| 06-C                     END
|    C*
| 07-C           YSG26S    IFGT YSG26E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 07-C                     END
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|   C*
|   C                     SETON                     99
|   C********************
|   C*  GET ROW,COL     *
|   C********************
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
|   C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*客戶代號
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C           DSG04S    PARM DSG04S    W003    9
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS003'
|   C           DSG04E    PARM DSG04E    W003    9
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C*通路
| 02-C           D#ROW     IFEQ 11
|   C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C           DMD07S    PARM DMD07S    PMD07   1
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFEQ 43
|   C                     CALL 'WDS018'
|   C           DMD07E    PARM DMD07E    PMD07
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
     C*型態
| 02-C           D#ROW     IFEQ 12
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
     C                     PARM DMD07S    PMD07
|   C           DMD08S    PARM DMD08S    PMD08   2
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS009'
     C                     PARM DMD07E    PMD07
|   C           DMD08E    PARM DMD08E    PMD08
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*地區
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS007'
|   C           DSG15S    PARM DSG15S    PSG15   2
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS007'
|   C           DSG15E    PARM DSG15E    PSG15
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|   C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|   C*
|   C                     OUT  *NAMVAR
|   C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
