      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR055                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/23                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :物流點存貨成本表                             *
      ****************************************************************
     FARR055D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      598 5990$PRTID
     I                                      601 601 DIA01
     I                                      603 603 DIA02F
     I                                      604 608 DIA02S
     I                                      609 613 DIA02E
     I                                      614 622 DIA03S
     I                                      623 631 DIA03E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C                     EXSR RTN020
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DIA01
|    C                     MOVE *BLANK    DIA02F
|    C                     MOVE *BLANK    DIA02S
|    C                     MOVE *BLANK    DIA02E
|    C                     MOVE *BLANK    DIA03S
|    C                     MOVE *BLANK    DIA03E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN020....INIT SCREEN
      *===============================================================*
01===C           RTN020    BEGSR
|    C*
     C                     SETON                     38
     C           $WRHUS    IFNE '*ALL '
     C           $WRHUS    ANDNE*BLANKS
     C                     SETOF                     38
|    C                     MOVEL$WRHUS    DIA02S
|    C                     MOVEL$WRHUS    DIA02E
     C                     END
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C****
|    C*公司代號
|    C****
| 01-C           DIA01     IFEQ *BLANK
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C****
|    C*物流點型態
|    C****
| 02-C           DIA02F    IFEQ *BLANK
|   C                     SETON                     619599
| 02-C                     END
|    C   99                GOTO END100
|    C****
|    C*物流點
|    C****
| 03-C           DIA02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DIA02S
| 03-C                     END
|    C*
| 04-C           DIA02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DIA02E
| 04-C                     END
|    C*
| 05-C           DIA02S    IFGT DIA02E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 05-C                     END
|    C   99                GOTO END100
|    C****
|    C*產品代號
|    C****
| 06-C           DIA03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DIA03S
| 06-C                     END
|    C*
| 07-C           DIA03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DIA03E
| 07-C                     END
|    C*
| 08-C           DIA03S    IFGT DIA03E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 08-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品代號
| 02-C           D#ROW     IFEQ 12
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DIA03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DIA03E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
