      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR043                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :現金收入明細表                               *
      ****************************************************************
     FARR043D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DAD01
     I*(MM/DD/YY)
     I                                      603 6080DAD04S
     I                                      609 6140DAD04E
     I*(YY/MM/DD)
     I                                      620 6250YAD04S
     I                                      626 6310YAD04E
     I*(YYYY/MM/DD)
     I                                      850 857 YMDS8
     I                                      858 865 YMDE8
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DAD01
|    C                     Z-ADD0         DAD04S
|    C                     Z-ADD0         DAD04E
|    C                     Z-ADD0         YAD04S
|    C                     Z-ADD0         YAD04E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司代號
| 01-C           DAD01     IFEQ *BLANK
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
|    C*
| 02-C           DAD04S    IFEQ 0
M001DC*                    Z-ADD010101    DAD04S
M001AC                     Z-ADD010192    DAD04S
| 02-C                     END
|    C*
| 03-C           DAD04E    IFEQ 0
M001DC*                    Z-ADD123199    DAD04E
M001AC                     Z-ADD123129    DAD04E
| 03-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DAD04S    P0901I  60
|    C                     PARM           P0911O  1
| 04-C           P0911O    IFEQ 'N'
|   C                     SETON                     619399
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DAD04E    P0901I  60
|    C                     PARM           P0911O  1
| 05-C           P0911O    IFEQ 'N'
|   C                     SETON                     629399
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHANGE DATE TO CHINESE DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAD04S    S001I2  60
|    C           YAD04S    PARM           S001O1  60
M001AC                     MOVE YAD04S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDS8   8
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAD04E    S001I2  60
|    C           YAD04E    PARM           S001O1  60
M001AC                     MOVE YAD04E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDE8   8
|    C*
|    C*(CHENK STRART <= END DATE)
|    C*
M001DC*          YAD04S    IFGT YAD04E
M001AC           YMDS8     IFGT YMDE8
|   C                     SETON                     6162
|   C                     SETON                     9199
| 06-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
