      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR072                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/11/10                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :應收帳款彙總表　　                           *
      ****************************************************************
     FARR072D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*公司別
     I                                      601 602 DSS01S
     I                                      603 604 DSS01E
     I*(MM/YY)
     I                                      605 6100DSS06S
     I                                      611 6160DSS06E
     I*(YY/MM)
     I                                      620 6250YDATES
     I                                      626 6310YDATEE
     I                                      732 732 IN20
     I*
     I*(MM/YY)
     I                                      641 6460DSS35S
     I                                      651 6560DSS35E
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I                                      858 8650YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSS01S
|    C                     MOVE *BLANK    DSS01E
|    C                     Z-ADD0         DSS06S
|    C                     Z-ADD0         DSS06E
|    C                     Z-ADD0         DSS35S
|    C                     Z-ADD0         DSS35E
|    C                     Z-ADD0         YDATES
|    C                     Z-ADD0         YDATEE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*公司代號
| 01-C           DSS01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSS01S
| 01-C                     END
|    C*
| 02-C           DSS01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSS01E
| 02-C                     END
|    C*
| 03-C           DSS01S    IFGT DSS01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*僅能輸入一日期
|    C*
| 04-C           DSS06S    IFNE 0
|   C           DSS06E    ORNE 0
| 05-C           DSS35S    IFNE 0
|   C                     SETON                     668899
| 05-C                     END
| 06-C           DSS35E    IFNE 0
|   C                     SETON                     678899
| 06-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           DSS06S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSS06S    P0901I  60
|   C                     PARM           P0901O  1
| 08-C           P0901O    IFEQ 'N'
|   C                     SETON                     649399
|    C   99                GOTO END100
| 08*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSS06S    S001I2  60
|   C           YDATES    PARM           S001O1  60
| 08-C                     END
|   C*
| 09-C           DSS06E    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSS06E    P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
|    C   99                GOTO END100
| 10*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSS06E    S001I2  60
|   C           YDATEE    PARM           S001O1  60
| 10-C                     END
| 09-C                     END
|   C*
M001AC                     MOVE YDATES    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C*
M001AC                     MOVE YDATEE    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YDATES    IFGT YDATEE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 11-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 07*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSS35S    P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 12-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSS35E    P0901I  60
|   C                     PARM           P0901O  1
| 13-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 13-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSS35S    S001I2  60
|   C           YDATES    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSS35E    S001I2  60
|   C           YDATEE    PARM           S001O1  60
|   C**
M001AC                     MOVE YDATES    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C*
M001AC                     MOVE YDATEE    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YDATES    IFGT YDATEE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 14-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 07-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
