      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR079                                        *
      * AUTHER       :                                               *
      * CREATE DATE  : 03/11/94                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款系統                                 *
      * REMARK       :票據兌現明細表                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FARR079D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*
     I                                      601 602 DAC01S
     I                                      603 604 DAC01E
     I                                      605 609 DAC02S
     I                                      610 613 DAC03S
     I                                      614 618 DAC02E
     I                                      619 622 DAC03E
     I                                      623 6280DAC07S
     I                                      629 6340DAC07E
     I                                      635 635 DSEL
     I*(MM/DD/YY)
     I*(YY/MM/DD)
M001MI*                                     671 6760YAC07S
M001MI*                                     681 6860YAC07E
M001MI                                      671 6780YAC07S
M001MI                                      681 6880YAC07E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DAC01S
|    C                     MOVE *BLANK    DAC01E
|    C                     MOVE *BLANK    DAC02S
|    C                     MOVE *BLANK    DAC02E
|    C                     MOVE *BLANK    DAC03S
|    C                     MOVE *BLANK    DAC03E
|    C                     MOVE '1'       DSEL
|    C                     Z-ADD0         DAC07S
|    C                     Z-ADD0         DAC07E
M001MC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司別
| 02-C           DAC01S    IFEQ *BLANKS
|   C                     MOVE *BLANK    DAC01S
| 02-C                     END
|    C*
| 03-C           DAC01E    IFEQ *BLANKS
|   C                     MOVE '99'      DAC01E
| 03-C                     END
|    C*
| 04-C           DAC01S    IFGT DAC01E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶
| 02-C           DAC02S    IFEQ *BLANKS
|   C                     MOVE *BLANK    DAC02S
| 02-C                     END
|    C*
| 03-C           DAC02E    IFEQ *BLANKS
|   C                     MOVE '99999'   DAC02E
| 03-C                     END
|    C*
| 02-C           DAC03S    IFEQ *BLANKS
|   C                     MOVE *BLANK    DAC03S
| 02-C                     END
|    C*
| 03-C           DAC03E    IFEQ *BLANKS
|   C                     MOVE '9999'    DAC03E
| 03-C                     END
|    C*
| 04-C           DAC02S    IFGT DAC02E
|   C                     SETON                     6364
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*預兌日期
| 11-C           DAC07S    IFEQ 0
|   C*M001M               Z-ADD010101    DAC07S
M001MC                     Z-ADD010192    DAC07S
| 11*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DAC07S    P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC07S    S001I2  60
|    C*M001M     YAC07S    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YAC07S
|    C*
| 13-C           DAC07E    IFEQ 0
|   C*M001M               Z-ADD123199    DAC07E
M001MC                     Z-ADD123129    DAC07E
| 13*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DAC07E    P0901I  60
|   C                     PARM           P0901O  1
| 14-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 14-C                     END
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC07E    S001I2  60
|    C*M001M     YAC07E    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YAC07E
|    C*
| 15-C           YAC07S    IFGT YAC07E
|   C                     SETON                     656692
|   C                     SETON                     99
|   C                     GOTO END100
| 15-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS012'
|   C                     PARM 'ADJUST'  PARMI1 10
|   C*          DIB17S    PARM DIB17S    PARMO1 10
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 50
|   C                     CALL 'WDS012'
|   C                     PARM 'ADJUST'  PARMI1 10
|   C*          DIB17E    PARM DIB17E    PARMO1 10
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*產品代號
| 05-C           D#ROW     IFEQ 10
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C*                    PARM           DIB01S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C*                    PARM           DIB01E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
| 08-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 08-C                     END
|   C*
| 01-C                     END
|    C*
|    C           ENDF4     TAG
|    C*
03===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
