      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR083                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/08                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :收款未分配明細表                             *
      ****************************************************************
     FARR083D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FARR083Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      600 601 DAC01S
     I                                      602 603 DAC01E
     I                                      604 608 DAC02S
     I                                      609 613 DAC02E
     I                                      614 619 DAC09S
     I                                      620 625 DAC09E
     I                                      626 6310WAC04S
     I                                      632 6370WAC04E
     I                                      638 6430DAC04S
     I                                      644 6490DAC04E
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I                                      858 8650YMD8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     I*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
| 04-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 04-C                     END
|    C                     MOVE *BLANK    DAC01S
|    C                     MOVE *BLANK    DAC01E
|    C                     MOVE *BLANK    DAC02S
|    C                     MOVE *BLANK    DAC02E
|    C                     MOVE *BLANK    DAC09S
|    C                     MOVE *BLANK    DAC09E
|    C                     Z-ADD0         DAC04S
|    C                     Z-ADD0         DAC04E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C***
|    C*公司別
|    C***
| 01-C           DAC01S    IFEQ *BLANK
|   C                     MOVEL*LOVAL    DAC01S
| 01-C                     END
| 02-C           DAC01E    IFEQ *BLANK
|   C                     MOVEL*HIVAL    DAC01E
| 02-C                     END
| 03-C           DAC01S    IFGT DAC01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C***
|    C*客戶
|    C***
| 04-C           DAC02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAC02S
| 04-C                     END
|    C*
| 05-C           DAC02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAC02E
| 05-C                     END
|    C*
| 06-C           DAC02S    IFGT DAC02E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C***
|    C*業務人員
|    C***
| 07-C           DAC09S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAC09S
| 07-C                     END
|    C*
| 08-C           DAC09E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAC09E
| 08-C                     END
|    C*
| 09-C           DAC09S    IFGT DAC09E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 09-C                     END
|    C   99                GOTO END100
|    C*******
|    C*收款日期
|    C*******
|    C*
| 10-C           DAC04S    IFEQ 0
|   C                     Z-ADD0         DAC04S
| 10-C                     END
| 11-C           DAC04S    IFLT 0
|   C                     SETON                     6699
| 11-C                     END
|    C*
|    C                     CALL 'P31'
|    C                     PARM DAC04S    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '1'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WAC04S    PARM           P31110  80
|    C*
| 12-C           DAC04E    IFEQ 0
|   C                     Z-ADD123129    DAC04E
| 12-C                     END
|    C*
| 13-C           DAC04E    IFLT 0
|   C                     SETON                     6799
| 13-C                     END
|    C*
|    C                     CALL 'P31'
|    C                     PARM DAC04E    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '1'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WAC04E    PARM           P31110  80
M001AC                     MOVE WAC04S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
M001AC                     MOVE WAC04E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          WAC04S    IFGT WAC04E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 14-C                     END
|    C   99                GOTO END100
|    C*
|    C*SCREEN LOG
|    C                     OPEN ARR083Z
|    C                     WRITEPH1
|    C                     CLOSEARR083Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
