      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR057                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/05/01                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :折讓單                                       *
      ****************************************************************
     FARR057D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 606 DSG11S
     I                                      607 612 DSG11E
     I                                      613 621 DSG45S
     I                                      622 630 DSG45E
     I*(MM/DD/YY)
     I                                      631 6360DSG26S
     I                                      637 6420DSG26E
     I*(YY/MM/DD)
     I                                      650 6550YSG26S
     I                                      656 6610YSG26E
     I                                      671 671 DSEL
     I                                      672 672 COMPS
     I                                      673 673 COMPE
     I                                      674 675 DSG01S
     I                                      676 677 DSG01E
     I*(YY/MM/DD)
     I                                      681 6860CHDATE
     I*
     I*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE ' '       COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSG01S
|    C                     MOVE *BLANK    DSG01E
|    C                     MOVE 'A'       DSEL
|    C                     MOVE *BLANK    DSG11S
|    C                     MOVE *BLANK    DSG11E
|    C                     MOVE *BLANK    DSG45S
|    C                     MOVE *BLANK    DSG45E
|    C                     Z-ADD0         DSG26S
|    C                     Z-ADD0         DSG26E
|    C                     Z-ADD0         YSG26S
|    C                     Z-ADD0         YSG26E
|    C                     Z-ADD$CHYMD    CHDATE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK辦事處
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
     C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK公司
| 01-C           DSG01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG01S
| 01-C                     END
| 01-C           DSG01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG01E
| 01-C                     END
| 03-C           DSG01S    IFGT DSG01E
|   C                     SETON                     6768
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C****
|    C*業務員代號
|    C****
| 01-C           DSG11S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSG11S
| 01-C                     END
|    C*
| 02-C           DSG11E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSG11E
| 02-C                     END
|    C*
| 03-C           DSG11S    IFGT DSG11E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C****
|    C*客戶代號
|    C****
| 04-C           DSG45S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSG45S
| 04-C                     END
|    C*
| 05-C           DSG45E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSG45E
| 05-C                     END
|    C*
| 06-C           DSG45S    IFGT DSG45E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 06-C                     END
|    C   99                GOTO END100
|    C****
|    C*(CHECK END-DATE)-折讓日期
|    C****
| 07-C           DSG26S    IFEQ 0
M001DC*          DSG26S    OREQ 010101
M001AC           DSG26S    OREQ 010192
M001DC*                    Z-ADD010101    DSG26S
M001DC*                    Z-ADD010101    YSG26S
M001AC                     Z-ADD010192    DSG26S
M001AC                     Z-ADD010192    YSG26S
| 07*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSG26S    P0401I  60
|   C                     PARM           P0411O  1
| 08-C           P0411O    IFEQ 'N'
|   C                     SETON                     649499
| 08-C                     END
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSG26S    S001I2  60
|    C           YSG26S    PARM           S001O1  60
|    C*
| 09-C           DSG26E    IFEQ 0
M001DC*          DSG26E    OREQ 123199
M001AC           DSG26E    OREQ 123129
M001DC*                    Z-ADD123199    DSG26E
M001DC*                    Z-ADD123199    YSG26E
M001AC                     Z-ADD123129    DSG26E
M001AC                     Z-ADD123129    YSG26E
| 09*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSG26E    P0401I  60
|   C                     PARM           P0411O  1
| 11-C           P0411O    IFEQ 'N'
|   C                     SETON                     659499
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
M001AC                     MOVE YSG26S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S   8
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSG26E    S001I2  60
|    C           YSG26E    PARM           S001O1  60
M001AC                     MOVE YSG26E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E   8
|    C*
M001DC*          YSG26S    IFGT YSG26E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 12-C                     END
|    C   99                GOTO END100
|    C*
| 12-C           CHDATE    IFEQ 0
|   C                     SETON                     669699
| 09*C                     ELSE
|   C                     CALL 'P04'
|   C                     PARM CHDATE    P0401I  60
|   C                     PARM           P0411O  1
| 11-C           P0411O    IFEQ 'N'
|   C                     SETON                     669499
| 10-C                     END
| 12-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*客戶代號
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE33
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS003'
|   C                     PARM           DSG45S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE45
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C                     PARM           DSG45E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     IFGE 33
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS015'
|   C                     PARM           DSG11S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 45
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS015'
|   C                     PARM           DSG11E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE36
|   C           D#COL     ANDLE37
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
