      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR075                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 01/13/94                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :應收帳款週轉率分析表                         *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.05.12  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FARR075D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*公司
     I                                      601 601 DCD03S
     I                                      602 602 DCD03E
     I*處事處
     I                                      603 603 COMP
     I                                      604 604 COMPS
     I                                      605 605 COMPE
     I*通路
     I                                      606 606 DCD13S
     I                                      607 607 DCD13E
     I*客戶代號
     I                                      610 614 DCD06S
     I                                      620 624 DCD06E
     I*業務員
     I                                      625 630 DCD09S
     I                                      631 636 DCD09E
     I*年月(MM/YY)
     I                                      640 6430DCD01S
     I                                      640 6410DCD1SM
     I                                      640 641 WCD1SM
     I                                      642 643 WCD1SY
     I                                      644 6470DCD01E
     I                                      644 6450DCD1EM
     I                                      644 645 WCD1EM
     I                                      646 647 WCD1EY
     I*(YY/MM)
     I                                      648 6510YCD01S
     I                                      652 6550YCD01E
M001AI                                      851 8560Y01S
M001AI                                      861 8660Y01E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DCD03S
|    C                     MOVE *BLANK    DCD03E
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DCD13S
|    C                     MOVE *BLANK    DCD13E
|    C                     MOVE *BLANK    DCD06S
|    C                     MOVE *BLANK    DCD06E
|    C                     MOVE *BLANK    DCD09S
|    C                     MOVE *BLANK    DCD09E
|    C                     Z-ADD0         DCD01S
|    C                     Z-ADD0         DCD01E
|    C                     Z-ADD0         YCD01S
|    C                     Z-ADD0         YCD01E
M001AC                     Z-ADD0         Y01S
M001AC                     Z-ADD0         Y01E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*公司
| 02-C           DCD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD03S
| 02-C                     END
|    C*
| 03-C           DCD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD03E
| 03-C                     END
|    C*
| 04-C           DCD03S    IFGT DCD03E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*辦事處
| 01-C           COMP      IFEQ *BLANK
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C*通路
| 02-C           DCD13S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD13S
| 02-C                     END
|    C*
| 03-C           DCD13E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD13E
| 03-C                     END
|    C*
| 04-C           DCD13S    IFGT DCD13E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶代號
| 05-C           DCD06S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD06S
| 05-C                     END
|    C*
| 06-C           DCD06E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD06E
| 06-C                     END
|    C*
| 07-C           DCD06S    IFGT DCD06E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*業務員
| 08-C           DCD09S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD09S
| 08-C                     END
|    C*
| 09-C           DCD09E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD09E
| 09-C                     END
|    C*
| 10-C           DCD09S    IFGT DCD09E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 10-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-日期
| 11-C           DCD01S    IFEQ 0
|   C*M001M               Z-ADD0101      DCD01S
M001MC                     Z-ADD0192      DCD01S
| 11-C                     END
| 12-C           DCD01E    IFEQ 0
|   C*M001M               Z-ADD1299      DCD01S
M001MC                     Z-ADD1229      DCD01E
| 12-C                     END
|    C*
| 13-C           DCD1SM    IFGT 12
|   C           DCD1SM    ORLT 1
|   C                     SETON                     689399
| 13-C                     END
|    C                     MOVE WCD1SM    YCD01S
|    C                     MOVELWCD1SY    YCD01S
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE YCD01S    HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD
M001AC                     MOVE HB2@T     Y01S
|    C   99                GOTO END100
|    C*
| 14-C           DCD1EM    IFGT 12
|   C           DCD1EM    ORLT 1
|   C                     SETON                     699399
| 14-C                     END
|    C                     MOVE WCD1EM    YCD01E
|    C                     MOVELWCD1EY    YCD01E
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE YCD01E    HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD
M001AC                     MOVE HB2@T     Y01E
|    C   99                GOTO END100
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 8
| 03-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C                     PARM           DCD13S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 49
|   C                     CALL 'WDS018'
|   C                     PARM           DCD13E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 9
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DCD06S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C                     PARM           DCD06E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
| 08-C           D#ROW     IFEQ 10
| 09-C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C                     PARM           DCD09S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS015'
|   C                     PARM           DCD09E
|   C                     GOTO ENDF4
| 10-C                     END
| 08-C                     END
|   C*
| 11-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
