      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0611                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/10/21                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :                                               *
      * REMARK       :跨月折讓明細表                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M004  MICHELLE   00.06.12 新增稅額欄－菸酒稅法         */
     /*=============================================================*/
      ****************************************************************
     FREWF43  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FARAGPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FSOSIPF  IF  E           K        DISK
     FSOSJPF  IF  E           K        DISK
M004AFSOS2PF  IF  E           K        DISK
     FARR061APO   E             39     PRINTER
     I*
     ISG0
     I                                              SG01  L4
     I                                              SH11  L3
     I                                              SH03  L2
     I                                              SG04  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      611 619 DSH03S
     I                                      621 629 DSH03E
     I                                      631 639 DSG45S
     I                                      641 649 DSG45E
     I                                      651 651 DSEL
     I*(MM/YY)
     I                                      661 6640DSG26
     I                                      661 6620DSG261
     I                                      663 6640DSG262
     I*
     I            DS
     I                                        1   2 SG01
     I                                        1   1 WSG01
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           SG04
     C                     KFLD           SG05
     C           KEYAG     KLIST
     C                     KFLD           SG09             *折讓單號
     C                     KFLD           SH03             *產品代號
     C           KEYSI     KLIST
     C                     KFLD           AG01             *公司別
     C                     KFLD           AG04             *發票號碼
     C           KEYSD     KLIST
     C                     KFLD           SI10             *訂單號碼
     C                     KFLD           SJ03             *產品代號
     C           KEYSJ     KLIST
     C                     KFLD           AG01             *公司別
     C                     KFLD           AG04             *發票號碼
     C                     KFLD           AG03             *產品代號
M004AC           KEYS2     KLIST
M004AC                     KFLD           SH02             *退貨單號
M004AC                     KFLD           SH03             *產品代號
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'                        *SET INIT
    C                     EXSR RTN010
  01-C                     END
     C                     EXSR RTN100                     *GET HEADING
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CL3 10                EXSR RTNL3
     C*
     CL4 10                EXSR RTNL4
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*公司別
|    C           SG01      CHAIN#B0                  44
|    C   44                MOVE *BLANK    #B03
|    C*
|    C*客戶小計
|    C                     Z-ADD0         PAMT
|    C                     Z-ADD0         SH12S
|    C                     Z-ADD0         SH13S
|    C                     Z-ADD0         SH07S
M004AC                     Z-ADD0         S207S
M004AC                     Z-ADD0         W0707S
|    C                     Z-ADD0         SH08S
|    C                     Z-ADD0         CSH12S
|    C                     Z-ADD0         CSH13N
|    C                     Z-ADD0         CSH13O
|    C*產品小計
|    C                     Z-ADD0         SH12P
|    C                     Z-ADD0         SH13P
|    C                     Z-ADD0         SH07P
M004AC                     Z-ADD0         S207P
M004AC                     Z-ADD0         W0707P
|    C                     Z-ADD0         SH08P
|    C                     Z-ADD0         CSH12P
|    C                     Z-ADD0         N1SH13
|    C                     Z-ADD0         O1SH13
|    C*歸屬小計
|    C                     Z-ADD0         SH12B
|    C                     Z-ADD0         SH13B
|    C                     Z-ADD0         SH07B
M004AC                     Z-ADD0         S207B
M004AC                     Z-ADD0         W0707B
|    C                     Z-ADD0         SH08B
|    C                     Z-ADD0         CSH12B
|    C                     Z-ADD0         N2SH13
|    C                     Z-ADD0         O2SH13
|    C*
|    C*公司小計
|    C                     Z-ADD0         SH12C
|    C                     Z-ADD0         SH13C
|    C                     Z-ADD0         SH07C
M004AC                     Z-ADD0         S207C
M004AC                     Z-ADD0         W0707C
|    C                     Z-ADD0         SH08C
|    C                     Z-ADD0         CSH12C
|    C                     Z-ADD0         N3SH13
|    C                     Z-ADD0         O3SH13
|    C                     EXSR RTN900
|    C*
|    C                     SETON                     30
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....PROCESS DATA
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* GET公司名稱
|    C*          SG01      CHAIN#B0                  44
|    C*  44                MOVE *BLANK    #B03
      *
|    C* GET單價
| 01-C           SH12      IFNE 0
|   C           SH07      DIV  SH12      PAMT      H
| 01*C                     ELSE
|   C                     Z-ADD0         PAMT
| 01-C                     END
|    C*
M004AC           KEYS2     CHAINS20                  45
M004AC           *IN45     IFEQ '0'
M004AC           SH07      ADD  S207      W0707
M004AC                     ELSE
M004AC                     Z-ADDSH07      W0707
M004AC                     END
|    C* GET產品名稱
|    C           SH03      CHAINMA0                  44
|    C   44                MOVE *BLANK    MA03
|    C*
|    C* GET客戶名稱
|    C           KEYME     CHAINME0                  44
|    C   44                MOVE *BLANK    ME04
|    C*拆出成本
| 02-C           SH06      IFNE 0
    C           SH08      DIV  SH06      WORK01 112H
|   C           WORK01    MULT SH12      CSH12     H
|   C           WORK01    MULT SH13      CSH13N    H
|   C                     Z-ADD0         CSH13O
| 03-C           SG03      IFEQ 'R1'
|   C           SH11      ANDNEWSG01
|   C           KEYAG     SETLLAG0
|   C           KEYAG     READEAG0                      49
| 04-C           *IN49     DOWEQ'0'
      *
| 05-C           AG13      IFNE 0
|   C           KEYSJ     CHAINSJ0                  40
| 06-C           *IN40     IFEQ '0'
|   C           KEYSI     CHAINSI0                  40
| 07-C           *IN40     IFEQ '0'
|   C           KEYSD     CHAINSD0                  40
| 08-C           *IN40     IFEQ '0'
|   C*判斷新舊列印方式
|   C           SJ05      SUB  SD06      CHKFLD 150
|   C                     MULT SD04      CHKFLD
| 09-C           CHKFLD    IFNE SJ07
      *舊發票
|   C           AG08      DIV  AG05      WORK   132H
|   C                     MULT AG13      WORK
|   C                     ADD  WORK      CSH13O
|   C                     SUB  WORK      CSH13N
| 09-C                     END
      *
| 08-C                     END
| 07-C                     END
| 06-C                     END
| 05-C                     END
      *
|   C           KEYAG     READEAG0                      49
| 04-C                     END
      *
| 03-C                     END
| 02*C                     ELSE
|   C                     Z-ADD0         CSH12
|   C                     Z-ADD0         CSH13O
|   C                     Z-ADD0         CSH13N
| 02-C                     END
|    C*
|    C                     EXSR RTN900                     *PROC SKIP
|    C                     WRITEPD1
|    C                     SETON                     32
|    C*客戶小計
|    C                     ADD  SH12      SH12S
|    C                     ADD  SH13      SH13S
|    C                     ADD  SH07      SH07S
M004AC                     ADD  S207      S207S
M004AC                     ADD  W0707     W0707S
|    C                     ADD  SH08      SH08S
|    C                     ADD  CSH12     CSH12S
|    C                     ADD  CSH13N    N1SH13
|    C                     ADD  CSH13O    O1SH13
|    C*產品小計
|    C                     ADD  SH12      SH12P
|    C                     ADD  SH13      SH13P
|    C                     ADD  SH07      SH07P
M004AC                     ADD  S207      S207P
M004AC                     ADD  W0707     W0707P
|    C                     ADD  SH08      SH08P
|    C                     ADD  CSH12     CSH12P
|    C                     ADD  CSH13N    N2SH13
|    C                     ADD  CSH13O    O2SH13
|    C*歸屬小計
|    C                     ADD  SH12      SH12B
|    C                     ADD  SH13      SH13B
|    C                     ADD  SH07      SH07B
M004AC                     ADD  S207      S207B
M004AC                     ADD  W0707     W0707B
|    C                     ADD  SH08      SH08B
|    C                     ADD  CSH12     CSH12B
|    C                     ADD  CSH13N    N3SH13
|    C                     ADD  CSH13O    O3SH13
|    C*公司小計
|    C                     ADD  SH12      SH12C
|    C                     ADD  SH13      SH13C
|    C                     ADD  SH07      SH07C
M004AC                     ADD  S207      S207C
M004AC                     ADD  W0707     W0707C
|    C                     ADD  SH08      SH08C
|    C                     ADD  CSH12     CSH12C
|    C                     ADD  CSH13N    N4SH13
|    C                     ADD  CSH13O    O4SH13
|    C                     SETOF                     3031
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTNL1.....PROCESS L1
     C*==============================================================*
03===C           RTNL1     BEGSR
|    C*
|    C  N10                WRITEPD2
|    C*
|    C                     Z-ADD0         SH12S
|    C                     Z-ADD0         SH13S
|    C                     Z-ADD0         SH07S
M004AC                     Z-ADD0         S207S
M004AC                     Z-ADD0         W0707S
|    C                     Z-ADD0         SH08S
|    C                     Z-ADD0         CSH12S
|    C                     Z-ADD0         N1SH13
|    C                     Z-ADD0         O1SH13
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTNL2.....PROCESS L2
     C*==============================================================*
04===C           RTNL2     BEGSR
|    C*
|    C                     EXSR RTN900
|    C                     WRITEPD3
|    C                     SETON                     30
|    C                     SETON                     31
|    C                     SETOF                     32
|    C*
|    C                     Z-ADD0         SH12P
|    C                     Z-ADD0         SH13P
|    C                     Z-ADD0         SH07P
M004AC                     Z-ADD0         S207P
M004AC                     Z-ADD0         W0707P
|    C                     Z-ADD0         SH08P
|    C                     Z-ADD0         CSH12P
|    C                     Z-ADD0         N2SH13
|    C                     Z-ADD0         O2SH13
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTNL3.....PROCESS L3
     C*==============================================================*
05===C           RTNL3     BEGSR
|    C*
|    C                     EXSR RTN900
|    C                     WRITEPD31
|    C                     SETON                     3031
|    C*
|    C                     Z-ADD0         SH12B
|    C                     Z-ADD0         SH13B
|    C                     Z-ADD0         SH07B
M004AC                     Z-ADD0         S207B
M004AC                     Z-ADD0         W0707B
|    C                     Z-ADD0         SH08B
|    C                     Z-ADD0         CSH12B
|    C                     Z-ADD0         N3SH13
|    C                     Z-ADD0         O3SH13
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTNL4.....PROCESS L4
     C*==============================================================*
06===C           RTNL4     BEGSR
|    C*
|    C                     EXSR RTN900
|    C                     WRITEPD4
|    C                     SETON                     303139
|    C*
|    C                     Z-ADD0         SH12C
|    C                     Z-ADD0         SH13C
|    C                     Z-ADD0         SH07C
M004AC                     Z-ADD0         S207C
M004AC                     Z-ADD0         W0707C
|    C                     Z-ADD0         SH08C
|    C                     Z-ADD0         CSH12C
|    C                     Z-ADD0         N4SH13
|    C                     Z-ADD0         O4SH13
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     SETON                     10
|   C                     SETOF                     39
| 01-C                     END
|    C*
|    C* GET公司名稱
| 02-C           *IN39     IFEQ '1'
|   C           SG01      CHAIN#B0                  44
|   C   44                MOVE *BLANK    #B03
|   C*
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTNLR.....ENDPGM
      *==============================================================*
08===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE5
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
08===C                     ENDSR
