      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR068                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 82/03/25                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :出貨統一發票核對表                           *
      ****************************************************************
     FARR068D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      523 5240PRINT
     I                                      523 524 PRINTC
     I                                      598 5990$PRTID
     I*物流點，送貨日期，公司別
     I                                      601 605 DSI05S
     I                                      606 610 DSI05E
     I                                      611 6160DSI06S
     I                                      617 6220DSI06E
     I                                      623 624 DSI01S
     I                                      625 626 DSI01E
     I*(YY/MM/DD)
     I                                      630 6350DATES
     I                                      636 6410DATEE
M001AI*(YY/MM/DD)
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
      *
  02-C                     END
  01-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSI01S
|    C                     MOVE *BLANK    DSI01E
|    C                     MOVE *BLANK    DSI05S
|    C                     MOVE *BLANK    DSI05E
|    C                     Z-ADD0         DSI06S
|    C                     Z-ADD0         DSI06E
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
     C*
|    C*公司
| 01-C           DSI01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI01S
| 01-C                     END
|    C*
| 02-C           DSI01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI01E
| 02-C                     END
|    C*
| 03-C           DSI01S    IFGT DSI01E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*物流點
| 01-C           DSI05S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI05S
| 01-C                     END
|    C*
| 02-C           DSI05E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI05E
| 02-C                     END
|    C*
| 03-C           DSI05S    IFGT DSI05E
|   C                     SETON                     6063
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-送貨日期
| 07-C           DSI06S    IFEQ 0
M001DC*                    Z-ADD010101    DSI06S
M001AC                     Z-ADD010192    DSI06S
| 07-C                     END
|    C*
| 08-C           DSI06E    IFEQ 0
M001DC*                    Z-ADD123199    DSI06E
M001AC                     Z-ADD123129    DSI06E
| 08-C                     END
|    C*
|    C*(CHECK START DATE)-送貨日期
|    C                     CALL 'P09'
|    C                     PARM DSI06S    P0901I  60
|    C                     PARM           P0911O  1
| 09-C           P0911O    IFEQ 'N'
|   C                     SETON                     619499
| 09-C                     END
|    C   99                GOTO END100
|    C*(CHECK END DATE)-送貨日期
|    C                     CALL 'P09'
|    C                     PARM DSI06E    P0901I  60
|    C                     PARM           P0911O  1
| 10-C           P0911O    IFEQ 'N'
|   C                     SETON                     629499
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C*
|    C*(CHENK STRART <= END DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSI06S    S001I2  60
|    C           DATES     PARM           S001OI  60
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSI06E    S001I2  60
|    C           DATEE     PARM           S001OI  60
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
M001DC*          DATES     IFGT DATEE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6162
|   C                     SETON                     9399
| 11-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
