      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR076                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 01/24/94                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :應收票據明細表                               *
      ****************************************************************
     FARR076D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DAC01S
     I                                      603 604 DAC01E
     I*(MM/DD/YY)
     I                                      610 6150DAC04
     I*(YY/MM/DD)
     I                                      620 6250YAC04
     I*
     I                                      641 649 DAC23S
     I                                      651 659 DAC23E
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DAC01S
|    C                     MOVE *BLANK    DAC01E
|    C                     MOVE *BLANK    DAC23S
|    C                     MOVE *BLANK    DAC23E
|    C                     Z-ADD0         DAC04
|    C                     Z-ADD0         YAC04
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*公司代號
| 01-C           DAC01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAC01S
| 01-C                     END
|    C*
| 02-C           DAC01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAC01E
| 02-C                     END
|    C*
| 03-C           DAC01S    IFGT DAC01E
|   C                     SETON                     6061
|   C                     SETON                     9199
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶代號
| 04-C           DAC23S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAC23S
| 04-C                     END
|    C*
| 05-C           DAC23E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAC23E
| 05-C                     END
|    C*
| 06-C           DAC23S    IFGT DAC23E
|   C                     SETON                     6465
|   C                     SETON                     9199
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-收款日
| 07-C           DAC04     IFEQ 0
|   C                     SETON                     629599
| 07-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DAC04     P0901I  60
|    C                     PARM           P0911O  1
| 08-C           P0911O    IFEQ 'N'
|   C                     SETON                     629399
| 08-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHANGE DATE TO CHINESE DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC04     S001I2  60
|    C           YAC04     PARM           S001O1  60
M001AC                     MOVE YAC04     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*客戶代號
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS003'
|   C                     PARM           DAC23S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS003'
|   C                     PARM           DAC23E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
