      ****************************************************************
      * PROGRAM NAME : ARR0691                                       *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/04/24                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款子系統                               *
      * REMARK       :產品銷貨成本明細表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREWF69  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     F*PA#BPF  IF  E           K        DISK
     FARR069APO   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 601 DSI01
     I                                      603 6080DSI35S
     I                                      609 6140DSI35E
M001MI*                                     615 6200WSI35S
M001MI*                                     621 6260WSI35E
M001MI                                      641 6480WSI35S
M001MI                                      651 6580WSI35E
     I                                      627 627 DSI10
     I                                      628 628 DSEL
     I                                      629 629 COMPS
     I                                      630 630 COMPE
     I                                      631 631 DSEL1
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C**         KEYMA     KLIST
     C**                   KFLD           MA01
     C*
     C***        *LIKE     DEFN SDISC     WDISC
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN100
     C                     SETON                     10
     C*明細列印
     C                     EXSR RTN200
     C*
     CLR                   EXSR RTN300
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
01===C           RTN100    BEGSR
|    C**
|    C*轉帳
| 01-C           DSI10     IFEQ '1'
|   C                     MOVEL'非轉帳'TEXT1
| 01*C                     ELSE
| 02-C           DSI10     IFEQ '2'
|   C                     MOVEL'轉帳'  TEXT1
| 02*C                     ELSE
| 02-C           DSI10     IFEQ '3'
|   C                     MOVEL'全部'  TEXT1
| 02-C                     END
| 01-C                     END
| 01-C                     END
|    C*選項
| 03-C           DSEL      IFEQ 'A'
|   C                     MOVEL'一般'  TEXT2
| 03*C                     ELSE
| 04-C           DSEL      IFEQ 'B'
|   C                     MOVEL'專櫃'  TEXT2
| 04*C                     ELSE
| 04-C           DSEL      IFEQ 'C'
|   C                     MOVEL'寄賣'  TEXT2
| 04-C                     END
| 03-C                     END
| 03-C                     END
|    C*禮盒
|   C                     SETOF                     21
| 03-C           DSEL1     IFEQ 'A'
|   C                     SETOF                     21
| 03*C                     ELSE
|   C                     SETON                     21
| 03-C                     END
|    C*表頭列印
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200....GET DETAIL
     C*==============================================================*
02===C           RTN200    BEGSR
|    C**
|    C*產品名稱
|    C           WF6903    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA03
| 01-C                     END
     C*計算成本合計
     C                     Z-ADDWF6906    SUM1
     C                     ADD  WF6907    SUM1
     C                     ADD  WF6908    SUM1
     C                     Z-ADDWF6909    SUM2
     C                     ADD  WF6910    SUM2
     C                     ADD  WF6911    SUM2
|    C*計算總額
|    C                     ADD  WF6904    T1TOT1
|    C                     ADD  WF6905    T1TOT2
|    C                     ADD  WF6906    T1TOT3
|    C                     ADD  WF6907    T1TOT4
|    C                     ADD  WF6908    T1TOT5
|    C                     ADD  WF6909    T1TOT6
|    C                     ADD  WF6910    T1TOT7
|    C                     ADD  WF6911    T1TOT8
|    C                     ADD  SUM1      SUM11
|    C                     ADD  SUM2      SUM21
|    C*
|    C*翻頁控制
| 02-C           *IN39     IFEQ '1'
|   C                     EXSR RTN900
| 02-C                     END
|    C*明細列印
|    C                     WRITEPD1
     C                     Z-ADD0         SUM1
     C                     Z-ADD0         SUM2
     C                     Z-ADD0         SUM1
02===C                     ENDSR
      *==============================================================*
      *          RTN300....TOTAL
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
     C           *IN10     IFEQ '0'
|    C                     EXSR RTN100
|    C                     WRITEPE3
| 01-C                     END
|    C*
|    C                     WRITEPE2
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
| 01-C           *IN10     IFEQ '1'
|   C                     WRITEPE1
| 01-C                     END
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
