      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR058                                        *
      * AUTHER       : ANDY
      * CREATE DATE  : 81/08/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :客戶收款未分配餘額表                         *
      ****************************************************************
     FARR058D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 609 DAC23S
     I                                      611 619 DAC23E
     I                                      661 662 DAC01S
     I                                      663 664 DAC01E
     I                                      665 666 DAC05S
     I                                      667 668 DAC05E
     I*MM/DD/YY
     I                                      621 6260DAC04S
     I                                      631 6360DAC04E
     I*YY/MM/DD
     I                                      641 6460WAC04S
     I                                      651 6560WAC04E
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I                                      858 8650YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DAC23S
|    C                     MOVE *BLANK    DAC23E
|    C                     MOVE *BLANK    DAC05S
|    C                     MOVE *BLANK    DAC05E
|    C                     Z-ADD0         DAC04S  60
|    C                     Z-ADD0         DAC04E  60
|    C                     Z-ADD0         WAC04S  60
|    C                     Z-ADD0         WAC04E  60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C***********
|    C*公司別
|    C***********
| 01-C           DAC01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DAC01S
| 01-C                     END
|    C*
| 02-C           DAC01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DAC01E
| 02-C                     END
|    C*
| 03-C           DAC01S    IFGT DAC01E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C***********
|    C*客戶代號
|    C***********
| 01-C           DAC23S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DAC23S
| 01-C                     END
|    C*
| 02-C           DAC23E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DAC23E
| 02-C                     END
|    C*
| 03-C           DAC23S    IFGT DAC23E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
| 04-C           DAC04S    IFEQ 0
M001DC*                    Z-ADD010101    DAC04S
M001AC                     Z-ADD010192    DAC04S
     C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DAC04S    P0901I  60
|   C                     PARM           P0901O  1
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     629499
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
| 06-C           DAC04E    IFEQ 0
M001DC*                    Z-ADD123199    DAC04E
M001AC                     Z-ADD123129    DAC04E
     C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DAC04E    P0901I  60
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     639499
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC04S    S001I2  60
|    C           WAC04S    PARM           S001O1  60
M001AC                     MOVE WAC04S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC04E    S001I2  60
|    C           WAC04E    PARM           S001O1  60
M001AC                     MOVE WAC04E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
M001DC*          WAC04S    IFGT WAC04E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 09-C                     END
|    C   99                GOTO END100
|    C*收款種類
| 01-C           DAC05S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DAC05S
| 01-C                     END
|    C*
| 02-C           DAC05E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DAC05E
| 02-C                     END
|    C*
| 03-C           DAC05S    IFGT DAC05E
|   C                     SETON                     6667
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*客戶代號
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE47
|   C                     CALL 'WDS003'
|   C                     PARM           DAC23S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE51
|   C           D#COL     ANDLE59
|   C                     CALL 'WDS003'
|   C                     PARM           DAC23E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C** GET收款種類
| 03-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS021'
|   C           DAC05S    PARM DAC05S    S021O1  2
|   C                     GOTO ENDF4
| 02-C                     END
| 03-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE51
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS021'
|   C           DAC05E    PARM DAC05E    S021O1  2
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
