      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR0701                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 05/06/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款子系統                               *
      * REMARK       :寄賣產品成本明細表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSOSEPF  IF  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FSOSELF  IF  E           K        DISK
     F            SE0                               KRENAMESE0L
     FSOSPLF01IF  E           K        DISK
     FRES18WF IF  E           K        DISK                           UC
     FMTMAPF  IF  E           K        DISK
     FREWF71  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I*
     I                                      601 601 DSE01A
     I                                      602 602 DSE01B
     I                                      603 6080DSE24S
     I                                      609 6140DSE24E
M001MI*                                     615 6200YSE24S
M001MI*                                     621 6260YSE24E
M001MI                                      641 6480YSE24S
M001MI                                      651 6580YSE24E
     I                                      630 630 DSEL1
     I            DS
     I                                        1   2 SE01
     I                                        1   1 SE01A
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         SF10T  112
     C                     Z-ADD0         SF11T  112
     C                     Z-ADD0         SF12T  112
     C           *LIKE     DEFN WF7107    T007
     C           *LIKE     DEFN WF7108    T008
     C           *LIKE     DEFN WF7109    T009
     C           *LIKE     DEFN SE02      WSE02
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*
     C           KEYWF     KLIST
     C                     KFLD           WF7101
     C                     KFLD           WF7103
     C                     KFLD           WF7104
     C                     KFLD           WF7105
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *分析方式－禮盒(A)
  01-C           DSEL1     IFEQ 'A'
    C                     EXSR RTN100
  01-C                     END
      *
      *分析方式－單瓶(B)需拆解禮盒為單瓶
  02-C           DSEL1     IFEQ 'B'
    C                     EXSR RTN400
  02-C                     END
      *
     C                     SETON                     LR
     C*
     C*==============================================================*
     C*          RTN100....GET DETAIL
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*送貨單明細檔讀取
|    C                     READ SE0                      45
|    C*
| 03-C           *IN45     DOWEQ'0'
|   C                     EXSR RTN110
|   C                     EXSR RTN120
|   C                     READ SE0                      45
| 03-C                     END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN110....
     C*==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVE SE01A     WF7101
|    C                     MOVE SE02      WSE02
|    C*GET原始客戶代號
| 01-C           SE03      IFLT 'D2'
|   C           SE02      CHAINSP0                  40
| 02-C           *IN40     IFEQ '0'                          新增
|   C           SP01      CHAINSE0L                 41
|   C                     MOVE SE04      WF7103
|   C                     MOVE SE05      WF7104
| 02-C                     END
| 01-C                     END
|    C                     MOVE SE04      WF7103
|    C                     MOVE SE05      WF7104
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN120....GET DETAIL
     C*==============================================================*
03===C           RTN120    BEGSR
|    C*
|    C           WSE02     SETLLSF0
|    C           WSE02     READESF0                      41
| 01-C           *IN41     DOWEQ'0'
|   C**CHAIN KEY
|   C                     MOVE SF03      WF7105
|   C           KEYWF     CHAINWF710                40
| 02-C           *IN40     IFEQ '1'                          新增
|   C                     EXSR RTN200
| 02*C                     ELSE                              修改
|   C                     EXSR RTN300
| 02-C                     END
|   C*
|   C           WSE02     READESF0                      41
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE WORK FILE
      *==============================================================*
04===C           RTN200    BEGSR
|    C                     Z-ADD0         WF7106
|    C                     Z-ADD0         WF7107
|    C                     Z-ADD0         WF7108
|    C                     Z-ADD0         WF7109
|    C*
|    C                     Z-ADDSF19      WF7106
|    C           SF10      MULT SF19      WF7107
|    C           SF11      MULT SF19      WF7108
|    C           SF12      MULT SF19      WF7109
|    C*WRITE WORK FILE
|    C                     WRITEWF710
|    C***
04===C                     ENDSR
      *==============================================================*
      *          RTN300....UPDATE WORK FILE
      *==============================================================*
05===C           RTN300    BEGSR
|    C*
|    C                     ADD  SF19      WF7106
|    C           SF10      MULT SF19      T007
|    C           SF11      MULT SF19      T008
|    C           SF12      MULT SF19      T009
|    C                     ADD  T007      WF7107
|    C                     ADD  T008      WF7108
|    C                     ADD  T009      WF7109
|    C*WRITE WORK FILE
|    C                     UPDATWF710
|    C***
05===C                     ENDSR
      *==============================================================*
      *          RTN400....禮盒單瓶售價計算數量及金額
      *==============================================================*
06===C           RTN400    BEGSR
|    C*送貨單明細檔讀取
|    C                     READ SE0                      45
|    C*
| 01-C           *IN45     DOWEQ'0'
|   C                     MOVE SE01A     WF7101
|   C                     MOVE SE02      WSE02
|   C*GET原始客戶代號
| 02-C           SE03      IFLT 'D2'
|   C           SE02      CHAINSP0                  40
| 03-C           *IN40     IFEQ '0'                          新增
|   C           SP01      CHAINSE0L                 41
|   C                     MOVE SE04      WF7103
|   C                     MOVE SE05      WF7104
| 03-C                     END
| 02-C                     END
|   C                     MOVE SE04      WF7103
|   C                     MOVE SE05      WF7104
|   C*
|   C           WSE02     SETLLSF0
|   C           WSE02     READESF0                      41
| 04-C           *IN41     DOWEQ'0'
|   C           SF03      CHAINMA0                  42
| 05-C           MA54      IFEQ 'Y'
      *禮盒單瓶成本
|   C                     EXSR RTN500
|   C                     OPEN RES18WF
|   C                     EXSR RTN600
|   C                     CLOSERES18WF
      *ELSE非禮盒處理同禮盒處禮DSEL1='A'
| 05*C                     ELSE
|   C                     MOVELSF03      WF7105
|   C           KEYWF     CHAINWF710                40
| 06-C           *IN40     IFEQ '1'                          新增
|   C                     EXSR RTN200
| 06*C                     ELSE
|   C                     EXSR RTN300
| 06-C                     END
| 05-C                     END
|   C           WSE02     READESF0                      41
| 04-C                     END
|   C                     READ SE0                      45
| 01-C                     END
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN500....禮盒單瓶成本
      *==============================================================*
07===C           RTN500    BEGSR
      *禮盒拆解為產品
|    C                     CALL 'RES018'
|    C                     PARM SF03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM SF02      S08I2  12        訂單號碼
|    C                     PARM 0         S08I3   60       牌價判斷日
|    C                     PARM SF19      S08I4   60       禮盒訂購數量
|    C                     PARM SF20      S08I5   60       禮盒搭贈數量
|    C                     PARM 0         S08I6   92       禮盒金額
      *部份－單位成本
|    C                     PARM SF10      S08I7   92       禮盒成本FOB
|    C                     PARM SF11      S08I8   92       禮盒成本FHI
|    C                     PARM SF12      S08I9   92       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM SF28      S08IA   92       禮盒轉帳成本FOB
|    C                     PARM SF29      S08IB   92       禮盒轉帳成本FHI
|    C                     PARM SF30      S08IC   92       禮盒轉帳成本DUTY
|    C*
|    C*
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN600....WRITE OR UPDATE REWF71
      *==============================================================*
08===C           RTN600    BEGSR
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    46
| 01-C           *IN46     DOWEQ'0'
|   C                     MOVELR181      WF7105
|   C*TOTAL FOB,FHI,DUTY
|   C           KEYWF     CHAINWF710                40
| 02-C           *IN40     IFEQ '1'                          新增
|   C                     EXSR RTN700
| 02*C                     ELSE                              修改
|   C                     EXSR RTN800
| 02-C                     END
|   C                     READ RE18R                    46
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN700....WRITE OR UPDATE REWF71
      *==============================================================*
09===C           RTN700    BEGSR
      *
|    C                     Z-ADDR182      WF7106
|    C                     ADD  R183      WF7106
|    C                     Z-ADDR185      WF7107
|    C                     ADD  R188      WF7107
|    C                     Z-ADDR186      WF7108
|    C                     ADD  R189      WF7108
|    C                     Z-ADDR187      WF7109
|    C                     ADD  R18A      WF7109
|    C*
|    C                     WRITEWF710
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN800....WRITE OR UPDATE REWF71
      *==============================================================*
10===C           RTN800    BEGSR
|    C*
|    C*
|    C                     ADD  R182      WF7106
|    C                     ADD  R183      WF7106
|    C                     ADD  R185      WF7107
|    C                     ADD  R188      WF7107
|    C                     ADD  R186      WF7108
|    C                     ADD  R189      WF7108
|    C                     ADD  R187      WF7109
|    C                     ADD  R18A      WF7109
|    C*
|    C                     UPDATWF710
|    C*
10===C                     ENDSR
