     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 83/02/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR077                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :進銷存系統                                *
     A*    REMARK       :折讓單簽收明細表                          *
     A****************************************************************
     FARR077D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
 @   I                                      139 139 $RMK01
     I                                      598 5990$PRTID
     I                                      601 601 DSG01
     I                                      651 651 DSG01S
     I                                      652 652 DSG01E
     I                                      602 602 COMPS
     I                                      603 603 COMPE
     I                                      604 6090DSG26S
     I                                      610 6150DSG26E
     I                                      616 621 DSG11S
     I                                      622 627 DSG11E
     I                                      628 6330DATES
     I                                      634 6390DATEE
     I                                      640 640 COMP
     I                                      641 645 DSG04S
     I                                      646 650 DSG04E
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I                                      858 8650YMD8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSG01
|    C                     MOVE *BLANK    DSG01S
|    C                     MOVE *BLANK    DSG01E
|    C                     MOVE *BLANK    #SG01   4
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    #COMP   4
|    C                     Z-ADD0         DSG26S
|    C                     Z-ADD0         DSG26E
|    C                     Z-ADD0         DATES   60
|    C                     Z-ADD0         DATEE   60
|    C                     MOVE *BLANK    DSG11S
|    C                     MOVE *BLANK    DSG11E
|    C                     MOVE *BLANK    DSG04S
|    C                     MOVE *BLANK    DSG04E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK公司
| 02-C           DSG01     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG01S
|   C                     MOVE *HIVAL    DSG01E
| 02*C                     ELSE
|   C                     MOVE DSG01     DSG01S
|   C                     MOVE DSG01     DSG01E
| 02-C                     END
|    C*
|    C* CHK辦事處
| 02-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 02*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 02-C                     END
|    C*
|    C* CHK日期
| 07-C           DSG26S    IFEQ 0
M001DC*                    Z-ADD010101    DSG26S
M001AC                     Z-ADD010192    DSG26S
| 07*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSG26S    P0901I  60
|   C                     PARM           P0901O  1
| 08-C           P0901O    IFEQ 'N'
|   C                     SETON                     609499
| 08-C                     END
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSG26S    S001I2  60
|    C           DATES     PARM           S001O1  60
|    C*
| 09-C           DSG26E    IFEQ 0
M001DC*                    Z-ADD123199    DSG26E
M001AC                     Z-ADD123129    DSG26E
| 09*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSG26E    P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     619499
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSG26E    S001I2  60
|    C           DATEE     PARM           S001O1  60
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          DATES     IFGT DATEE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     606193
|   C                     SETON                     99
|   C                     GOTO END100
| 11-C                     END
|    C* CHK業務員
|    C*
| 12-C           DSG11S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG11S
| 12-C                     END
|    C*
| 13-C           DSG11E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG11E
| 13-C                     END
|    C*
| 14-C           DSG11S    IFGT DSG11E
|   C                     SETON                     686993
|   C                     SETON                     99
|   C                     GOTO END100
| 14-C                     END
|    C* CHK客戶
|    C*
| 12-C           DSG04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG04S
| 12-C                     END
|    C*
| 13-C           DSG04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG04E
| 13-C                     END
|    C*
| 14-C           DSG04S    IFGT DSG04E
|   C                     SETON                     666793
|   C                     SETON                     99
|   C                     GOTO END100
| 14-C                     END
|    C*
|    C   99                GOTO END100
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 11
| 03-C           D#COL     IFGE 37
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS015'
|   C                     PARM           DSG11S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 49
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS015'
|   C                     PARM           DSG11E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 13
| 06-C           D#COL     IFGE 37
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS003'
|   C                     PARM           DSG04S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C                     PARM           DSG04E
|   C                     GOTO ENDF4
| 07-C                     END
| 05-C                     END
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE37
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
