      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR042                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/08                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :帳齡分析表                                   *
      ****************************************************************
     FARR042D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FARR042Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DSI01S
     I                                      603 604 DSI01E
     I                                      605 605 DSI03S
     I                                      606 606 DSI03E
     I                                      607 608 DSI04S
     I                                      609 610 DSI04E
     I                                      650 654 DSI12S
     I                                      655 659 DSI12E
     I                                      611 6160DSI35
     I                                      617 6220YDATES
     I                                      631 636 DSI31S
     I                                      637 642 DSI31E
     I                                      643 643 DSEL
M001AI                                      850 857 YMD8
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     I*
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSI01S
|    C                     MOVE *BLANK    DSI01E
|    C                     MOVE *BLANK    DSI03S
|    C                     MOVE *BLANK    DSI03E
|    C                     MOVE *BLANK    DSI04S
|    C                     MOVE *BLANK    DSI04E
|    C                     MOVE *BLANK    DSI12S
|    C                     MOVE *BLANK    DSI12E
|    C                     MOVE *BLANK    DSI31S
|    C                     MOVE *BLANK    DSI31E
|    C                     MOVE 'A'       DSEL
|    C                     Z-ADD0         DSI35
|    C                     Z-ADD0         YDATES
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C***
|    C*公司代號
|    C***
| 01-C           DSI01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI01S
| 01-C                     END
|    C*
| 02-C           DSI01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI01E
| 02-C                     END
|    C*
| 03-C           DSI01S    IFGT DSI01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C***
|    C*通路
|    C***
| 04-C           DSI03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI03S
| 04-C                     END
|    C*
| 05-C           DSI03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI03E
| 05-C                     END
|    C*
| 06-C           DSI03S    IFGT DSI03E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C***
|    C*型態
|    C***
| 07-C           DSI04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI04S
| 07-C                     END
|    C*
| 08-C           DSI04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI04E
| 08-C                     END
|    C*
| 09-C           DSI04S    IFGT DSI04E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 09-C                     END
|    C   99                GOTO END100
|    C***
|    C*客戶
|    C***
| 07-C           DSI12S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI12S
| 07-C                     END
|    C*
| 08-C           DSI12E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI12E
| 08-C                     END
|    C*
| 09-C           DSI12S    IFGT DSI12E
|   C                     SETON                     6970
|   C                     SETON                     9299
| 09-C                     END
|    C   99                GOTO END100
|    C*******
|    C*日期
|    C*******
|    C*
| 10-C           DSI35     IFEQ 0
M001DC*                    Z-ADD010101    DSI35
M001AC                     Z-ADD010192    DSI35
| 10-C                     END
|    C*
|    C*
|    C*(CHECK START DATE)
|    C                     CALL 'P09'
|    C                     PARM DSI35     P0901I  60
|    C                     PARM           P0911O  1
| 11-C           P0911O    IFEQ 'N'
|   C                     SETON                     649499
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHENK STRART <= END DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSI35     S001I2  60
|    C           YDATES    PARM           S001OI  60
|    C*
M001AC                     MOVE YDATES    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    8
|    C***
|    C*選擇
|    C***
|    C*
| 12-C           DSEL      IFEQ 'A'
|   C           DSI31S    IFNE *BLANKS
|   C           DSI31E    ORNE *BLANKS
|   C                     SETON                     6768
|   C                     SETON                     9099
| 12-C                     END
| 12-C                     END
|    C   99                GOTO END100
|    C*
|    C***
|    C*業務員
|    C***
| 13-C           DSEL      IFEQ 'B'
| 14-C           DSI31S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSI31S
| 14-C                     END
|   C*
| 15-C           DSI31E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSI31E
| 15-C                     END
|   C*
| 16-C           DSI31S    IFGT DSI31E
|   C                     SETON                     6768
|   C                     SETON                     9299
| 16-C                     END
|   C   99                GOTO END100
| 13-C                     END
      *SCREEN LOG
     C                     OPEN ARR042Z
     C                     WRITEPH1
     C                     CLOSEARR042Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 6
| 03-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C                     PARM           DSI03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 43
|   C                     CALL 'WDS018'
|   C                     PARM           DSI03E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 7
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSI03S    PSI03S  1
|   C                     PARM           DSI04S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS009'
|   C                     PARM DSI03E    PSI03E  1
|   C                     PARM           DSI04E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
| 08-C           D#ROW     IFEQ 8
| 09-C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS005'
|   C                     PARM           DSI31S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 47
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS005'
|   C                     PARM           DSI31E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
     C*客戶
| 02-C           D#ROW     IFEQ 9
| 03-C           D#COL     IFGE 38
| 03-C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DSI12S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 47
| 03-C           D#COL     ANDLE52
|   C                     CALL 'WDS003'
|   C                     PARM           DSI12E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 11-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
