      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR064                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/11/23                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款系統                                 *
      *  REMARK      :收款沖帳明細表                               *
      ****************************************************************
     FARR064D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *公司別
     I                                      601 602 DAC01S
     I                                      603 604 DAC01E
      *收款種類
     I                                      605 606 DAC05S
     I                                      607 608 DAC05E
      *客戶別
     I                                      641 645 DAC02S
     I                                      646 650 DAC02E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      611 6160YMDS
     I                                      617 6220YMDE
     I                                      623 6280DAC04S
     I                                      629 6340DAC04E
M001A *YY/MM/DD
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DAC01S
|    C                     MOVE *BLANK    DAC01S
|    C                     MOVE *BLANK    DAC05S
|    C                     MOVE *BLANK    DAC05S
|    C                     Z-ADD0         DAC04S
|    C                     Z-ADD0         DAC04E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司別
| 01-C           DAC01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAC01S
| 01-C                     END
|    C*
| 02-C           DAC01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAC01E
| 02-C                     END
|    C*
| 03-C           DAC01S    IFGT DAC01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*種類
| 04-C           DAC05S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAC05S
| 04-C                     END
|    C*
| 05-C           DAC05E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAC05E
| 05-C                     END
|    C*
| 06-C           DAC05S    IFGT DAC05E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C*客戶別
| 01-C           DAC02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAC02S
| 01-C                     END
|    C*
| 02-C           DAC02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAC02E
| 02-C                     END
|    C*
| 03-C           DAC02S    IFGT DAC02E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*檢查日期
| 07-C           DAC04S    IFEQ 0
M001DC*                    Z-ADD010101    DAC04S
M001AC                     Z-ADD010192    DAC04S
| 07-C                     END
|    C*
| 08-C           DAC04E    IFEQ 0
M001DC*                    Z-ADD123199    DAC04E
M001AC                     Z-ADD123129    DAC04E
| 08-C                     END
|    C*收款價差日期
|    C                     CALL 'P09'
|    C                     PARM DAC04S    P0901I  60
|    C                     PARM           P0911O  1
| 09-C           P0911O    IFEQ 'N'
|   C                     SETON                     649499
| 09-C                     END
|    C   99                GOTO END100
|    C                     CALL 'P09'
|    C                     PARM DAC04E    P0901I  60
|    C                     PARM           P0911O  1
| 10-C           P0911O    IFEQ 'N'
|   C                     SETON                     659499
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C*
|    C*(CHENK STRART <= END DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC04S    S001I2  60
|    C           YMDS      PARM           S001OI  60
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC04E    S001I2  60
|    C           YMDE      PARM           S001OI  60
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
M001DC*          YMDS      IFGT YMDE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 11-C                     END
|    C   99                GOTO END100
|   C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|   C*
|   C                     SETON                     99
|   C********************
|   C*  GET ROW,COL     *
|   C********************
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
|   C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*客戶代號
| 02-C           D#ROW     IFEQ 9
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C           DAC02S    PARM *BLANKS   W003    9
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 46
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS003'
|   C           DAC02E    PARM *BLANKS   W003    9
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS021'
|   C                     PARM           DAC05S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS021'
|   C                     PARM           DAC05E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 01-C                     END
|   C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|   C*
|   C                     OUT  *NAMVAR
|   C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
