      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0581                                       *
      * AUTHER       : ANDY
      * CREATE DATE  : 81/08/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :客戶收款未分配餘額表                         *
      ****************************************************************
     FARACPF  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FARR058P O   E             39     PRINTER
     IAC0
     I                                              AC02  L1
     I                                              AC03  L1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 609 DAC23S
     I                                      611 619 DAC23E
     I*MM/DD/YY
     I                                      621 6260DAC04S
     I                                      631 6360DAC04E
     I*YY/MM/DD
     I                                      641 6460WAC04S
     I                                      651 6560WAC04E
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           MEKEY     KLIST
     C                     KFLD           AC02
     C                     KFLD           AC03
     C*
     C           #AKEY     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *SET INIT
     C*
     C                     EXSR RTN100                     *PROC DATA
     C*
     CL1                   EXSR RTNL1                      AC02 & AC03
     CLR                   EXSR RTNLR                      ENDPGM
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         AC08C
|    C                     Z-ADD0         AC08C
|    C                     Z-ADD0         AC10T
|    C                     Z-ADD0         AC10T
     C                     MOVE *BLANK    AC06
     C*
     C                     SETON                     30
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....PROC DATA
      *===============================================================*
02===C           RTN100    BEGSR
     C*
     C***********
     C*客戶簡稱
     C***********
     C           MEKEY     CHAINME0                  40
     C*
     C   40                MOVE *BLANK    ME04
|    C*
|    C***********
|    C*收款日期
|    C***********
M001AC                     Z-ADDAC04      XAC04   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AC04      S001I2  80
M001AC                     PARM XAC04     S001I2  60
|    C           PAC04     PARM           S001O1  60
     C*
     C***********
     C*收款種類
     C***********
     C                     MOVE *BLANK    #A01
     C                     MOVE *BLANK    #A02
     C                     MOVEL'COLLECT' #A01
     C                     MOVELAC05      #A02
     C*
     C           #AKEY     CHAIN#A0                  41
     C*
     C           *IN41     IFEQ '0'
     C                     MOVEL#A03      MARK
     C                     ELSE
     C                     MOVE *BLANK    MARK
     C                     END
     C*
     C                     EXSR RTN900                     *PROC SKIP
     C                     WRITEPD1
     C*
     C*************
     C*計算累計值
     C*************
     C                     ADD  AC08      AC08C
     C                     ADD  AC08      AC08T
     C                     ADD  AC10      AC10C
     C                     ADD  AC10      AC10T
     C*
     C                     SETOF                     30
     C*
02===C                     ENDSR
      *===============================================================*
      *          RTNL1 ....AC02 AC03 LEVER BREAK
      *===============================================================*
03===C           RTNL1     BEGSR
     C*
     C                     WRITEPD2
     C  NLR                WRITEPD3
     C*
     C                     Z-ADD0         AC08C
     C                     Z-ADD0         AC10C
     C*
     C                     SETON                     30
     C*
03===C                     ENDSR
      *===============================================================*
      *          RTNLR ....END PGM
      *===============================================================*
03===C           RTNLR     BEGSR
     C*
     C           *IN10     IFEQ '1'
     C                     WRITEPE2
     C                     ELSE
     C                     WRITEPH1
     C                     WRITEPE2
     C                     END
     C*
     C                     ENDSR
      *===============================================================*
      *          RTN900....PROC SKIP
      *===============================================================*
03===C           RTN900    BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     SETON                     10
     C                     SETOF                     39
     C                     END
     C*
     C           *IN39     IFEQ '1'
     C                     WRITEPE1
     C                     WRITEPH1
     C                     SETOF                     39
     C                     END
     C*
     C                     ENDSR
