      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR09012                                      *
      ***BEFORE CREAT  ARR09012  MUST CREAT REW100 KEY WF1002        *
      * AUTHER       : 910074 JANET                                  *
      * CREATE DATE  : 86/10/15                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :帳齡分析表                                   *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FARACPF  IP  E           K        DISK
     FARADLF04IF  E           K        DISK
     F            AD0                               KRENAMEAD0L
     FMTMDPF  IF  E           K        DISK
     FSOSIPF  IF  E           K        DISK
     FREW200  UF  E           K        DISK                      A
     IAC0
     I                                              AC02  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
B2MODI                                      617 6240YDATES
     I                                      600 600 COMPS
     I                                      604 604 COMPE
     I                                      601 601 DSI01
     I                                      602 602 DSI01S
     I                                      603 603 DSI01E
     I                                      605 605 DSI03S
     I                                      606 606 DSI03E
     I                                      607 608 DSI04S
     I                                      609 610 DSI04E
     I                                      611 6160DSI35
     I                                      625 6280DSORT
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF1031    WORK11           *CURRENT
     C           *LIKE     DEFN WF1032    WORK12           *LE 30DAYS
     C           *LIKE     DEFN WF1004    WORK2            *30-60DAYS
     C           *LIKE     DEFN WF1005    WORK3            *61-90DAYS
     C           *LIKE     DEFN WF1006    WORK4            *91-120DAYS
     C           *LIKE     DEFN WF1007    WORK5            *GT 121DAYS
     C           *LIKE     DEFN WF1008    WORK6            *TOTAL
     C           *LIKE     DEFN WF1081    WORK61           *DEUTOTAL
B2MODC           *LIKE     DEFN YDATES    WSDATE- 2
     C           *LIKE     DEFN WF1009    WORK7            *UNDUECHECK
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYAD     KLIST
     C                     KFLD           AC01
     C                     KFLD           AC02
     C                     KFLD           AC03
     C                     KFLD           AC04
     C                     KFLD           AC05
     C                     KFLD           AC06
     C           KEYSI     KLIST
     C                     KFLD           AD10
     C                     KFLD           AD07
     C           KE100     KLIST
     C                     KFLD           WF1001
     C                     KFLD           WF1002
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *計算帳齡
     C  N10                EXSR RTN010
     C                     EXSR RTN100
      *WRITE REW100
      *
     CL1 10                EXSR RTN200
     C*
      *==============================================================*
      *          RTN010....INITIAL
      *==============================================================*
01===C           RTN010    BEGSR
      *
|    C                     Z-ADD0         DAY     90
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK12
|    C                     Z-ADD0         WORK2
|    C                     Z-ADD0         WORK3
|    C                     Z-ADD0         WORK4
|    C                     Z-ADD0         WORK5
|    C                     Z-ADD0         WORK6
|    C                     Z-ADD0         WORK61
     C                     Z-ADD0         WORK7
|    C                     SETON                     10
01===C                     ENDSR
      *==============================================================*
      *          RTN100....計算帳齡
      *==============================================================*
02===C           RTN100    BEGSR
|    C***
     C                     ADD  AC08      WORK7
|    C           AC02      CHAINMD0                  45
| 01-C           *IN45     IFEQ '0'
|   C                     MOVELMD06      WF1001
| 01*C                     ELSE
|   C                     MOVEL*BLANK    WF1001
| 01-C                     END
  02-C           MD08      IFGE DSI04S
    C           MD08      ANDLEDSI04E
    C                     MOVELAC02      WF1002
B2000C           KEYAD     SETLLAD0L
B2000C           KEYAD     READEAD0L                     46
     C           *IN46     DOWEQ'0'
B2000C           AD11      IFLE YDATES
| 04-C           AD12      ANDLEYDATES
     C           KEYSI     CHAINSI0                  44
B2000C           *IN44     IFEQ '0'
|   C           SI35      ANDLEYDATES
B2???C*M001M     SI29      SUB  110000    DSI21   60
M001MC           SI29      SUB  19110000  DSI21   60
B2INF *CVR0001 sev.00 Field DSI21 is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code SUB
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C***
|   C*(螢幕上輸入之確認日轉成中國年月日)
|   C***
B2???C*M001M     YDATES    SUB  110000    WSDATE
M001MC           YDATES    SUB  19110000  WSDATE
B2INF *CVR0001 sev.00 Field WSDATE is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code SUB
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C***
|   C*發票日與確認日之相距天數
|   C***
|   C                     CALL 'P20'
|   C                     PARM DSI21     P2001I  60       *發票日
|   C                     PARM WSDATE    P2002I  60       *確認日
|   C           DAY       PARM           P2011O  90
|   C*(A)
|   C           DAY       IFLT 1
|   C                     ADD  AD08      WORK11
  01-C                     END
     C*
|   C           DAY       IFLE 30
     C           DAY       ANDGE1
|   C                     ADD  AD08      WORK12
| 01-C                     END
|   C*(B)
| 06-C           DAY       IFGE 31
|   C           DAY       ANDLE60
|   C                     ADD  AD08      WORK2
| 06-C                     END
|   C*(C)
| 07-C           DAY       IFGE 61
|   C           DAY       ANDLE90
|   C                     ADD  AD08      WORK3
| 07-C                     END
|   C*(D)
| 08-C           DAY       IFGE 91
|   C           DAY       ANDLE120
|   C                     ADD  AD08      WORK4
| 08-C                     END
|   C*(E)
| 09-C           DAY       IFGT 120
|   C                     ADD  AD08      WORK5
| 09-C                     END
|   C***
|   C*(總額)---SUBTOT
|   C***
|   C                     ADD  AD08      WORK6
     C           DAY       IFGE 1
     C                     ADD  AD08      WORK61
     C                     END
| 04-C                     END
     C                     END
B2000C           KEYAD     READEAD0L                     46
| 04-C                     END
|   C***
| 02-C                     END
      *
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE OR UPDATE REW100
      *==============================================================*
03===C           RTN200    BEGSR
      *
|    C           KE100     CHAINWF100                45
| 01-C           *IN45     IFEQ '0'
|   C                     ADD  WORK11    WF1031
|   C                     ADD  WORK12    WF1032
|   C                     ADD  WORK2     WF1004
|   C                     ADD  WORK3     WF1005
|   C                     ADD  WORK4     WF1006
|   C                     ADD  WORK5     WF1007
|   C                     ADD  WORK6     WF1008
|   C                     ADD  WORK61    WF1081
     C                     Z-ADDWORK7     WF1009
|   C                     UPDATWF100
| 01*C                     ELSE
|   C                     Z-ADDWORK11    WF1031
|   C                     Z-ADDWORK12    WF1032
|   C                     Z-ADDWORK2     WF1004
|   C                     Z-ADDWORK3     WF1005
|   C                     Z-ADDWORK4     WF1006
|   C                     Z-ADDWORK5     WF1007
|   C                     Z-ADDWORK6     WF1008
|   C                     Z-ADDWORK61    WF1081
     C                     Z-ADDWORK7     WF1009
| 02-C           WF1008    IFNE 0
|   C                     WRITEWF100
| 02-C                     END
| 01-C                     END
|    C*
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK12
|    C                     Z-ADD0         WORK2
|    C                     Z-ADD0         WORK3
|    C                     Z-ADD0         WORK4
|    C                     Z-ADD0         WORK5
|    C                     Z-ADD0         WORK6
|    C                     Z-ADD0         WORK61
|    C                     Z-ADD0         WORK7
      *
03===C                     ENDSR
      *==============================================================*
      *          RTN300....換票
      *==============================================================*
03===C*          RTN300    BEGSR
      *
     C*                    MOVEL'Y'       LOOP
     C*          LOOP      DOWEQ'Y'
     C*          KEYHA1    CHAINHA0                  40
     C*          *IN40     IFEQ '0'
     C*          HA17      ANDEQ'6'
     C*          KEYHA2    CHAINHA1                  40
      *
03===C*                    ENDSR
