      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR045                                        *
      * AUTHER       : A1118 PHILP TSAI                              *
      * CREATE DATE  : 81/04/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款子系統                               *
      * REMARK       :銷貨收入明細表                               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FARR045D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F*PA#BPF  IF  E           K        DISK
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 601 DSI01
     I                                      602 602 COMP
     I                                      603 6080DSI35S
     I                                      609 6140DSI35E
M001MI*                                     615 6200WSI35S
     I*                                     621 6260WSI35E
     I*                                     627 627 DSI10
     I*                                     628 628 DSEL
     I*                                     629 629 COMPS
M001MI*                                     630 630 COMPE
M001MI                                      615 6220WSI35S
     I                                      623 6300WSI35E
     I                                      631 631 DSI10
     I                                      632 632 DSEL
     I                                      633 633 COMPS
M001MI                                      634 634 COMPE
     I            DS
     I                                        1   60YYMMDD
     I                                        1   20YY
     I                                        3   60MMDD
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSI01
|    C                     Z-ADD0         DSI35S
|    C                     Z-ADD0         DSI35E
|    C                     MOVE '1'       DSI10
|    C                     MOVE *BLANK    DSEL
|    C                     MOVE *BLANK    COMP
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*公司
| 01-C           DSI01     IFEQ *BLANKS
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
     C*
| 04-C           DSI01     IFEQ 'W'
|   C           DSI10     ANDEQ'2'
|   C                     SETON                     619199
| 04-C                     END
|    C   99                GOTO END100
|    C* CHK辦事處
| 02-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 02*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 02-C                     END
|    C*轉帳
| 03-C           DSI10     IFEQ *BLANK
|   C                     SETON                     619699
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C*
| 05-C           DSI35S    IFEQ 0
|   C*M001M               Z-ADD010101    DSI35S
M001MC                     Z-ADD010192    DSI35S
| 05-C                     END
|    C*
| 06-C           DSI35E    IFEQ 0
|   C*M001M               Z-ADD123199    DSI35E
M001MC                     Z-ADD123129    DSI35E
| 06-C                     END
|    C*CHECK DATE
|    C                     CALL 'P09'
|    C                     PARM DSI35S    P0901I  60
|    C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     629499
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSI35E    P0901I  60
|    C                     PARM           P0901O  1
| 08-C           P0901O    IFEQ 'N'
|   C                     SETON                     639499
| 08-C                     END
|    C*
|    C   99                GOTO END100
|    C                     MOVELDSI35S    MMDD
|    C                     MOVE DSI35S    YY
|    C*M001M               Z-ADDYYMMDD    WSI35S
M001AC                     MOVE YYMMDD    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    W8      80
M001AC                     Z-ADDW8        WSI35S
|    C*
|    C                     MOVELDSI35E    MMDD
|    C                     MOVE DSI35E    YY
     C*M001M               Z-ADDYYMMDD    WSI35E
M001AC                     MOVE YYMMDD    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    W8      80
M001AC                     Z-ADDW8        WSI35E
|    C*
| 09-C           WSI35S    IFGT WSI35E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 09-C                     END
|    C   99                GOTO END100
|    C*
|    C*專櫃碼
| 10-C           DSEL      IFEQ ' '
|   C                     SETON                     649599
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
