      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR047                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/04/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :應收帳款作業                                 *
     A* REMARK       :銷退折讓明細表                               *
      ****************************************************************
     FARR047D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 602 DSG01S
     I                                      603 604 DSG01E
     I                                      605 6100DSG26S
     I                                      611 6160DSG26E
     I                                      617 617 DATA
     I                                      620 620 DMD07S
     I                                      621 621 DMD07E
     I                                      622 630 DSG04S
     I                                      631 639 DSG04E
M001AI                                      850 857 YMDS8
M001AI                                      858 865 YMDE8
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSG01S
|    C                     MOVE *BLANK    DSG01E
|    C                     Z-ADD0         DSG26S
|    C                     Z-ADD0         DSG26E
|    C                     Z-ADD0         DATES   60
|    C                     Z-ADD0         DATEE   60
|    C                     MOVE *BLANK    DMD07S
|    C                     MOVE *BLANK    DMD07E
|    C                     MOVE *BLANK    DSG04S
|    C                     MOVE *BLANK    DSG04E
|    C                     MOVE *BLANK    DATA
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           DSG01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG01S
| 01-C                     END
| 02-C           DSG01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG01E
| 02-C                     END
|    C* CHK日期
| 03-C           DSG26S    IFEQ 0
M001DC*                    Z-ADD010101    DSG26S
M001AC                     Z-ADD010192    DSG26S
| 03*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSG26S    P0901I  60
|   C                     PARM           P0901O  1
| 04-C           P0901O    IFEQ 'N'
|   C                     SETON                     629499
| 04-C                     END
| 03-C                     END
|    C   99                GOTO END100
|    C*
| 05-C           DSG26E    IFEQ 0
M001DC*                    Z-ADD123199    DSG26E
M001AC                     Z-ADD123129    DSG26E
| 05*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSG26E    P0901I  60
|   C                     PARM           P0901O  1
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     639499
| 06-C                     END
| 05-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSG26S    S001I2  60
|    C           DATES     PARM           S001O1  60
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDS8   8
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSG26E    S001I2  60
|    C           DATEE     PARM           S001O1  60
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDE8   8
|    C*
M001DC*          DATES     IFGT DATEE
M001AC           YMDS8     IFGT YMDE8
|   C                     SETON                     6263
|   C                     SETON                     9399
| 07-C                     END
|    C   99                GOTO END100
|    C*通路
| 02-C           DMD07S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DMD07S
| 02-C                     END
|    C*
| 03-C           DMD07E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DMD07E
| 03-C                     END
|    C*
| 04-C           DMD07S    IFGT DMD07E
|   C                     SETON                     6566
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶代號
| 02-C           DSG04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSG04S
| 02-C                     END
|    C*
| 03-C           DSG04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSG04E
| 03-C                     END
|    C*
| 04-C           DSG04S    IFGT DSG04E
|   C                     SETON                     6768
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C**選擇內容
| 08-C           DATA      IFEQ *BLANKS
|   C                     SETON                     64
|   C                     SETON                     9699
| 08-C                     END
|    C   99                GOTO END100
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*通路
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     ANDEQ38
|   C                     CALL 'WDS018'
|   C                     PARM           DMD07S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 6
|   C           D#COL     ANDEQ50
|   C                     CALL 'WDS018'
|   C                     PARM           DMD07E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*客戶代號
| 02-C           D#ROW     IFEQ 8
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS003'
|   C                     PARM           DSG04S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 51
|   C           D#COL     ANDLE59
|   C                     CALL 'WDS003'
|   C                     PARM           DSG04E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
