      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0801                                       *
      ***BEFORE CREAT  ARR0801  MUST CREAT REW100 KEY WF1008         *
      * AUTHER       : 910074 TINA                                   *
      * CREATE DATE  : 83/12/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :帳齡分析表                                   *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSOSILF07IP  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FREW200  O   E           K        DISK
     ISI0
     I                                              SI12  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      187 1920$EGYMD
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
M001MI*                                     617 6220YDATES
M001MI                                      617 6240YDATES
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF1031    WORK11           *CURRENT
     C           *LIKE     DEFN WF1032    WORK12           *LE 30DAYS
     C           *LIKE     DEFN WF1004    WORK2            *30-60DAYS
     C           *LIKE     DEFN WF1005    WORK3            *61-90DAYS
     C           *LIKE     DEFN WF1006    WORK4            *91-120DAYS
     C           *LIKE     DEFN WF1007    WORK5            *GT 121DAYS
     C           *LIKE     DEFN WF1008    WORK6            *TOTAL
     C           *LIKE     DEFN WF1081    WORK61           *DUETOTAL
     C*          *LIKE     DEFN WF1009    WORK7            *UNDUECHECK
     C           *LIKE     DEFN YDATES    WSDATE- 2
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*          KE100     KLIST
     C*                    KFLD           WF1001
     C*                    KFLD           WF1002
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *計算帳齡
     C  N10                EXSR RTN010
     C                     EXSR RTN100
      *WRITE REWF77
      *
     CL1 10                EXSR RTN200
     C*
      *==============================================================*
      *          RTN010....INITIAL
      *==============================================================*
01===C           RTN010    BEGSR
      *
|    C                     Z-ADD0         DAY     90
     C                     Z-ADD0         WF1000
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK12
|    C                     Z-ADD0         WORK2
|    C                     Z-ADD0         WORK3
|    C                     Z-ADD0         WORK4
|    C                     Z-ADD0         WORK5
|    C                     Z-ADD0         WORK6
|    C                     Z-ADD0         WORK61
|    C*                    Z-ADD0         WORK7
     C                     SETON                     10
01===C                     ENDSR
      *==============================================================*
      *          RTN100....計算帳齡
      *==============================================================*
02===C           RTN100    BEGSR
|    C***
|    C* (UPD BY 81/05/05 --->發票日轉成中國年月日)
|    C***
B2???C*M001M     SI29      SUB  110000    DSI21   60
M001MC           SI29      SUB  19110000  DSI21   60
B2INF *CVR0001 sev.00 Field DSI21 is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code SUB
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|    C***
|    C*(確認日轉成中國年月日)
|    C***
|    C*M001M     YDATES    SUB  110000    WSDATE
M001MC           YDATES    SUB  19110000  WSDATE
|    C***
|    C*發票日與確認日之相距天數
|    C***
|    C                     CALL 'P20'
|    C                     PARM DSI21     P2001I  60       *發票日
|    C                     PARM WSDATE    P2002I  60       *確認日
|    C           DAY       PARM           P2011O  90
|    C*(A)
|   C           DAY       IFLT 1
|   C                     ADD  SI30      WORK11
| 01-C                     END
     C*
|   C           DAY       IFLE 30
     C           DAY       ANDGE1
|   C                     ADD  SI30      WORK12
| 01-C                     END
     C*
|    C*(B)
| 02-C           DAY       IFGE 31
|   C           DAY       ANDLE60
|   C                     ADD  SI30      WORK2
| 02-C                     END
|    C*(C)
| 03-C           DAY       IFGE 61
|   C           DAY       ANDLE90
|   C                     ADD  SI30      WORK3
| 03-C                     END
|    C*(D)
| 04-C           DAY       IFGE 91
|   C           DAY       ANDLE120
|   C                     ADD  SI30      WORK4
| 04-C                     END
|    C*(E)
| 05-C           DAY       IFGT 120
|   C                     ADD  SI30      WORK5
| 05-C                     END
|    C***
|    C*(總額)---SUBTOT
|    C***
|   C                     ADD  SI30      WORK6
     C*
B2000C           SI21      IFGT WF1000                     LAST TRAN D.
B2000C                     Z-ADDSI21      WF1000
     C                     END
      *
     C           DAY       IFGE 1
     C                     ADD  SI30      WORK61
     C                     END
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE OR UPDATE REWF77
      *==============================================================*
03===C           RTN200    BEGSR
      *
|    C                     MOVELSI12      WF1002
     C           SI12      CHAINMD0                  45
     C           *IN45     IFEQ '0'
     C                     MOVELMD06      WF1001
     C                     ELSE
     C                     MOVEL*BLANK    WF1001
     C                     END
     C*
|    C                     Z-ADDWORK11    WF1031
|    C                     Z-ADDWORK12    WF1032
|    C                     Z-ADDWORK2     WF1004
|    C                     Z-ADDWORK3     WF1005
|    C                     Z-ADDWORK4     WF1006
|    C                     Z-ADDWORK5     WF1007
|    C                     Z-ADDWORK6     WF1008
|    C                     Z-ADDWORK61    WF1081
     C           WF1008    IFNE 0
|    C                     WRITEWF100
     C                     END
|    C*
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK12
|    C                     Z-ADD0         WORK2
|    C                     Z-ADD0         WORK3
|    C                     Z-ADD0         WORK4
|    C                     Z-ADD0         WORK5
|    C                     Z-ADD0         WORK6
|    C                     Z-ADD0         WORK61
     C                     Z-ADD0         WF1000
      *
03===C                     ENDSR
