      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR078                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 03/11/94                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款系統                                 *
      * REMARK       :調整原因分析表                               *
      ****************************************************************
     FARR078D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*公司，辦事處，調整原因，物流點，產品代號，調整日期
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      603 603 COMP
     I                                      604 604 DIB02S
     I                                      605 605 DIB02E
     I                                      606 607 DIB17S
     I                                      608 609 DIB17E
     I                                      610 614 DIB03S
     I                                      615 619 DIB03E
     I                                      621 629 DIB01S
     I                                      631 639 DIB01E
     I                                      640 640 DSEL
     I*(MM/DD/YY)
     I                                      651 6560DIB04S
     I                                      661 6660DIB04E
     I*(YY/MM/DD)
     I                                      671 6760YIB04S
     I                                      681 6860YIB04E
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I                                      858 8650YMD8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE ' '       COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DIB01S
|    C                     MOVE *BLANK    DIB01E
|    C                     MOVE *BLANK    DIB02S
|    C                     MOVE *BLANK    DIB02E
|    C                     MOVE *BLANK    DIB03S
|    C                     MOVE *BLANK    DIB03E
|    C                     MOVE *BLANK    DIB17E
|    C                     MOVE *BLANK    DIB17E
|    C                     MOVE 'A'       DSEL
|    C                     Z-ADD0         DIB04S
|    C                     Z-ADD0         DIB04E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司別
| 02-C           DIB02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIB02S
| 02-C                     END
|    C*
| 03-C           DIB02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIB02E
| 03-C                     END
|    C*
| 04-C           DIB02S    IFGT DIB02E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*辦事處
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C*調整原因
| 02-C           DIB17S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIB17S
| 02-C                     END
|    C*
| 03-C           DIB17E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIB17E
| 03-C                     END
|    C*
| 04-C           DIB17S    IFGT DIB17E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*物流點
| 05-C           DIB03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIB03S
| 05-C                     END
|    C*
| 06-C           DIB03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIB03E
| 06-C                     END
|    C*
| 07-C           DIB03S    IFGT DIB03E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 08-C           DIB01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIB01S
| 08-C                     END
|    C*
| 09-C           DIB01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIB01E
| 09-C                     END
|    C*
| 10-C           DIB01S    IFGT DIB01E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C*調整日期
| 11-C           DIB04S    IFEQ 0
M001DC*                    Z-ADD010101    DIB04S
M001AC                     Z-ADD010192    DIB04S
| 11*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DIB04S    P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DIB04S    S001I2  60
|    C           YIB04S    PARM           S001O1  60
|    C*
| 13-C           DIB04E    IFEQ 0
M001DC*                    Z-ADD123199    DIB04E
M001AC                     Z-ADD123129    DIB04E
| 13*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DIB04E    P0901I  60
|   C                     PARM           P0901O  1
| 14-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 14-C                     END
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DIB04E    S001I2  60
|    C           YIB04E    PARM           S001O1  60
M001AC                     MOVE YIB04S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
M001AC                     MOVE YIB04E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YIB04S    IFGT YIB04E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     666792
|   C                     SETON                     99
|   C                     GOTO END100
| 15-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS012'
|   C                     PARM 'ADJUST'  PARMI1 10
|   C           DIB17S    PARM DIB17S    PARMO1 10
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 50
|   C                     CALL 'WDS012'
|   C                     PARM 'ADJUST'  PARMI1 10
|   C           DIB17E    PARM DIB17E    PARMO1 10
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*產品代號
| 05-C           D#ROW     IFEQ 10
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DIB01S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DIB01E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
| 08-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 08-C                     END
|   C*
| 01-C                     END
|    C*
|    C           ENDF4     TAG
|    C*
03===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
