      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0671                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 82/01/19                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :收款分配明細表　　                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M004  MICHELLE   00.06.15 新增銷退稅額及銷退總金額欄   */
     /*=============================================================*/
      ****************************************************************
     FARADPF  IF  E           K        DISK
     FARAFPF  IF  E           K        DISK
     FREWF81  O   E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *收款種類
     I                                      605 606 DAD05S
     I                                      607 608 DAD05E
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     READ AD0                      45
  01-C           *IN45     DOWEQ'0'
    C                     EXSR RTN100
    C                     READ AD0                      45
  01-C                     END
     C*
  02-C           DAD05S    IFLE '99'
    C           DAD05E    ANDGE'99'
    C           DAD05E    OREQ *HIVAL
    C                     READ AF0                      45
  03-C           *IN45     DOWEQ'0'
    C                     EXSR RTN200
    C                     READ AF0                      45
  03-C                     END
  02-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     MOVE AD10      WF8101
|    C                     MOVE AD02      WF8102
|    C                     MOVE AD03      WF8103
B2000C                     MOVE AD12      WF8104
|    C                     MOVE AD07      WF8106
B2000C                     MOVE AD11      WF8107
|    C                     MOVE AD05      WF8109
B2000C                     MOVE AD04      WF8110
|    C                     MOVE AD01      WF8111
| 04-C           AD05      IFEQ '50'
|   C                     Z-ADDAD08      WF8108
|   C                     Z-ADD0         WF8105
| 04*C                     ELSE
|   C                     Z-ADDAD08      WF8105
|   C                     Z-ADD0         WF8108
|   C                     ENDIF
|   C*
|   C                     WRITEWF810
|   C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....
      *==============================================================*
02===C           RTN200    BEGSR
|   C*
|   C                     MOVE AF01      WF8101
|   C                     MOVE AF03      WF8102
|   C                     MOVE AF04      WF8103
B2000C                     MOVE AF05      WF8104
|   C                     MOVE AF06      WF8106
B2000C                     MOVE *BLANK    WF8107
|   C                     MOVE '99'      WF8109
B2000C                     MOVE AF05      WF8110
|   C                     Z-ADDAF07      WF8108
M004AC                     Z-ADDAF09      WF8112
|   C                     Z-ADD0         WF8105
|   C*
|   C                     WRITEWF810
|   C*
02===C                     ENDSR
