      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR0472                                       *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/04/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款作業                                 *
      * REMARK       :銷退折讓明細表                               *
     A*===============================================================
     A* CODE |  AUTHOR  |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M004 | MICHELLE | 00.06.08 |新增稅額欄
     A*================================================================
      ****************************************************************
     FARAFPF  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
B2CHKFARR047BPO   E             39     PRINTER
     IAF0
     I                                              AF01  L2
     I                                              AF05  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DSG01S
     I                                      603 604 DSG01E
     I                                      605 6100DSG26S
     I                                      611 6160DSG26E
     I                                      617 617 DATA
     I                                      620 620 DMD07S
     I                                      621 621 DMD07E
     I                                      622 630 DSG04S
     I                                      631 639 DSG04E
     I            DS
     I                                        1   5 AF03
     I                                        1   1 AF03A
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#B     KLIST
     C                     KFLD           AF01
     C           KEYME     KLIST
     C                     KFLD           AF03
     C                     KFLD           AF04
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C  N10                EXSR RTN100
     C*
     C   39N38             EXSR RTN900
     C   39 38             EXSR RTN910                     *換下頁
     C                     EXSR RTN200                     *FILE TO SCR
     C*
     CL1 10N38             SETON                     30
     CL2 10                SETON                     3938
     CLR                   EXSR RTN999
     C*==============================================================*
     C*          RTN010....INIT ENVIRMENT
     C*==============================================================*
01===C           RTN010    BEGSR
|    C* 合計
|    C                     Z-ADD0         TOTAL
M004AC                     Z-ADD0         TAF09
M004AC                     Z-ADD0         TAF10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C* GET公司別
|    C           KEY#B     CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B03
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     1030
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....MOVE DATA TO SCREEN
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
     C           AF03A     IFGE DMD07S
     C           AF03A     ANDLEDMD07E
|    C* GET轉換日期
M001AC                     Z-ADDAF05      XAF05   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM AF05      S001I2  80
M001AC                     PARM XAF05     S001I2  60
M001DC*          AF05      PARM           S001O1  80
M001AC           DAF05     PARM           S001O1  60
|    C* GET 客戶名稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANK    ME04
|    C***
M004AC           AF10      IFEQ 0
M004AC           AF07      ADD  AF09      AF10
M004AC                     END
|    C* GET合計
|    C                     ADD  AF07      TOTAL
M004AC                     ADD  AF09      TAF09
M004AC                     ADD  AF10      TAF10
|    C*
|    C                     WRITEPD1
|    C                     SETOF                     30
     C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETON                     30
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN910....換下頁
      *==============================================================*
05===C           RTN910    BEGSR
|    C*
|    C                     WRITEPD2
|    C                     WRITEPE3
|    C                     EXSR RTN010
|    C                     EXSR RTN100
|    C*
|    C                     SETON                     30
|    C                     SETOF                     3938
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN999....(NO DATA)
      *==============================================================*
06===C           RTN999    BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     EXSR RTN100
     C                     WRITEPE4
| 01*C                     ELSE
|   C                     WRITEPD2
| 01-C                     END
|    C                     WRITEPE2
06===C                     ENDSR
