      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      * PROGRAM NAME : ARR0662                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/12/28                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :發票作廢排行榜                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREWF60  IP  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FARR066P O   E             39     PRINTER
     E*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*辦事處，業務員，客戶，發票日期
     I                                      601 601 COMP
     I                                      602 602 COMPS
     I                                      603 603 COMPE
     I                                      604 608 DSI08S
     I                                      609 613 DSI08E
      *MM/DD/YY
     I                                      615 6200DSI21S
     I                                      621 6260DSI21E
      *YY/MM/DD
     I*M001M                                627 6320YMDS
     I*M001M                                633 6380YMDE
M001MI                                      661 6680YMDS
M001MI                                      671 6780YMDE
      *
     I                                      652 652 DSEL
     I                                      653 6560DSORT
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF6001    WF6011
     C           *LIKE     DEFN DSORT     SORT1
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *HEADING
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         SORT
|    C                     Z-ADD0         SORT1
|    C                     Z-ADD0         WF6011
|    C                     Z-ADD0         T6001
|    C                     Z-ADD0         T6004
|    C                     Z-ADD0         T6005
|    C*
| 01-C           DSEL      IFEQ 'A'
|   C                     SETOF                     20
| 01*C                     ELSE
|   C                     SETON                     20
| 01-C                     END
|    C                     WRITEPH1
|    C                     SETON                     10
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*業務員
|    C           WF6002    CHAINMC0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MC02
| 01-C                     END
|    C*客戶
|    C           WF6003    CHAINME0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    ME04
| 02-C                     END
|    C*
| 03-C           SORT1     IFLT DSORT
|   C                     ADD  1         SORT1
|   C                     ADD  WF6001    T6001
|   C                     ADD  WF6004    T6004
|   C                     ADD  WF6005    T6005
|   C   39                EXSR RTN900
| 04-C           WF6011    IFNE WF6001
|   C                     Z-ADDSORT1     SORT
|   C                     Z-ADDWF6001    WF6011
| 04-C                     END
|   C                     WRITEPD1
| 03*C                     ELSE
|   C                     GOTO END100
| 03-C                     END
|    C*
02===C           END100    ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....OVERFLOW
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
     C           *IN10     IFEQ '0'
|    C                     EXSR RTN010
|    C                     WRITEPE3
|    C                     END
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
