      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR066                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/12/24                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :發票作廢排行榜                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FARR066D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*辦事處，業務員，客戶，發票日期
     I                                      601 601 COMP
     I                                      602 602 COMPS
     I                                      603 603 COMPE
     I                                      604 608 DSI08S
     I                                      609 613 DSI08E
     I                                      640 645 DSI31S
     I                                      646 651 DSI31E
      *MM/DD/YY
     I                                      615 6200DSI21S
     I                                      621 6260DSI21E
      *YY/MM/DD
     I*M001M                                627 6320YMDS
     I*M001M                                633 6380YMDE
M001MI                                      661 6680YMDS
M001MI                                      671 6780YMDE
      *
     I                                      652 652 DSEL
     I                                      653 6560DSORT
      *
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE 'A'       DSEL
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSI08S
|    C                     MOVE *BLANK    DSI08E
|    C                     MOVE *BLANK    DSI31S
|    C                     MOVE *BLANK    DSI31E
|    C                     Z-ADD0         DSI21S
|    C                     Z-ADD0         DSI21E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         DSORT
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK辦事處
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C*客戶代號
| 02-C           DSI08S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI08S
| 02-C                     END
|    C*
| 03-C           DSI08E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI08E
| 03-C                     END
|    C*
| 04-C           DSI08S    IFGT DSI08E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*業務員
| 05-C           DSI31S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI31S
| 05-C                     END
|    C*
| 06-C           DSI31E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI31E
| 06-C                     END
|    C*
| 07-C           DSI31S    IFGT DSI31E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*CHECK發票日期
| 08-C           DSI21S    IFEQ 0
|   C*M001M               Z-ADD010101    DSI21S
M001MC                     Z-ADD010192    DSI21S
| 08-C                     END
|    C*
| 09-C           DSI21E    IFEQ 0
|   C*M001M               Z-ADD123199    DSI21E
M001MC                     Z-ADD123129    DSI21E
| 09-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSI21S    P0901I  60
|    C                     PARM           P0901O  1
|    C*
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     649399
| 10*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSI21S    S001I2  60
|   C*M001M     YMDS      PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YMDS
| 10-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSI21E    P0901I  60
|    C                     PARM           P0901O  1
|    C*
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 11*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSI21E    S001I2  60
|   C*M001M     YMDE      PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YMDE
| 11-C                     END
|    C*
| 12-C           YMDS      IFGT YMDE
|   C                     SETON                     6465
|   C                     SETON                     9299
| 12-C                     END
|    C*
|    C*前幾名內
| 13-C           DSORT     IFEQ 0
|   C                     MOVE 9999      DSORT
| 13-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*客戶代號
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 40
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS003'
|   C           DSI08S    PARM DSI08S    PSI08   5
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 48
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C           DSI08E    PARM DSI08E    PSI08
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 8
| 06-C           D#COL     IFGE 40
|   C           D#COL     ANDLE45
|   C                     CALL 'WDS015'
|   C           DSI31S    PARM DSI31S    PSI31   6
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 50
|   C           D#COL     ANDLE55
|   C                     CALL 'WDS015'
|   C           DSI31E    PARM DSI31E    PSI31
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
| 08-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 08-C                     END
|   C*
| 01-C                     END
|    C*
|    C           ENDF4     TAG
03===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
