      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR053                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/04/06                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :應收帳款作業                                 *
     A* REMARK       :票據兌現明細表                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.22  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FARR053D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*
     I                                      601 602 DAC01S
     I                                      670 671 DAC01E
     I                                      603 616 DAC12S
     I                                      611 616 DAC121
     I                                      617 630 DAC12E
     I                                      625 630 DAC122
     I                                      631 6360DAC11S
     I                                      637 6420DAC11E
     I                                      643 651 DAC23S
     I                                      652 660 DAC23E
M001AI                                      681 6880DATES
M001AI                                      691 6980DATEE
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DAC01S
|    C                     MOVE *BLANK    DAC01E
|    C                     MOVE *BLANK    DAC12S
|    C                     MOVE *BLANK    DAC12E
|    C                     MOVE *BLANK    DAC23S
|    C                     MOVE *BLANK    DAC23E
|    C                     Z-ADD0         DAC11S
|    C                     Z-ADD0         DAC11E
|    C*M001D               Z-ADD0         DATES   60
|    C*M001D               Z-ADD0         DATEE   60
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           DAC01S    IFEQ *BLANKS
|   C                     MOVEL*LOVAL    DAC01S
| 01-C                     END
| 01-C           DAC01E    IFEQ *BLANKS
|   C                     MOVEL*HIVAL    DAC01E
| 01-C                     END
| 04-C           DAC01S    IFGT DAC01E
|   C                     SETON                     6067
|   C                     SETON                     9399
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK帳戶號碼起迄
| 02-C           DAC12S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DAC12S
| 02-C                     END
| 03-C           DAC12E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DAC12E
| 03-C                     END
|    C*
| 04-C           DAC12S    IFGT DAC12E
|   C                     SETON                     6162
|   C                     SETON                     9399
| 04-C                     END
|    C   99                GOTO END100
|    C***********
|    C*客戶代號
     C***********
     C           DAC23S    IFEQ *BLANK
     C                     MOVE *LOVAL    DAC23S
     C                     END
     C*
     C           DAC23E    IFEQ *BLANK
     C                     MOVE *HIVAL    DAC23E
     C                     END
     C*
| 06-C           DAC23S    IFGT DAC23E
|   C                     SETON                     6566
|   C                     SETON                     9199
| 06-C                     END
|    C   99                GOTO END100
     C*
|    C* CHK日期
| 05-C           DAC11S    IFEQ 0
|   C*M001M               Z-ADD010101    DAC11S
M001MC                     Z-ADD010192    DAC11S
| 05*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DAC11S    P0901I  60
|   C                     PARM           P0901O  1
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     639499
| 06-C                     END
| 05-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           DAC11E    IFEQ 0
|   C*M001M               Z-ADD123199    DAC11E
M001MC                     Z-ADD123129    DAC11E
| 07*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DAC11E    P0901I  60
|   C                     PARM           P0901O  1
| 08-C           P0901O    IFEQ 'N'
|   C                     SETON                     649499
| 08-C                     END
| 07-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC11S    S001I2  60
|    C*M001M     DATES     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    DATES
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DAC11E    S001I2  60
|    C*M001M     DATEE     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    DATEE
|    C*
| 09-C           DATES     IFGT DATEE
|   C                     SETON                     6364
|   C                     SETON                     9399
| 09-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS0141'
|   C           DAC121    PARM DAC121    PAC12S  6
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS0141'
|   C           DAC122    PARM DAC122    PAC12E  6
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C*客戶代號
| 02-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS003'
|   C                     PARM           DAC23S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS003'
|   C                     PARM           DAC23E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     TAG
     C                     Z-ADD0         D#ROW
     C                     Z-ADD0         D#COL
03===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
