      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : ARR0752                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 01/13/94                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :應收帳款週轉率分析表                         *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.05.12  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSOCDLF2 IP  E           K        DISK
     FARAKPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FARR075P O   E             39     PRINTER
     E*
     E                    WFA2   12  12  2 0
     ICD0
     I                                              CD06  L1
     I                                              CD03  L2
     I                                              CD03A L3
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*公司
     I                                      601 601 DCD03S
     I                                      602 602 DCD03E
     I*處事處
     I                                      603 603 COMP
     I                                      604 604 COMPS
     I                                      605 605 COMPE
     I*通路
     I                                      606 606 DCD13S
     I                                      607 607 DCD13E
     I*客戶代號
     I                                      610 614 DCD06S
     I                                      620 624 DCD06E
     I*業務員
     I                                      625 630 DCD09S
     I                                      631 636 DCD09E
     I*年月(MM/YY)
     I                                      640 6430MCD01S
     I                                      640 6430DCD01S
     I                                      640 6410DCD1SM
     I                                      640 641 WCD1SM
     I                                      642 643 WCD1SY
     I                                      644 6470MCD01E
     I                                      644 6470DCD01E
     I                                      644 6450DCD1EM
     I                                      644 645 WCD1EM
     I                                      646 647 WCD1EY
     I*(YY/MM)
     I                                      648 6510YCD01S
     I                                      652 6550YCD01E
M001AI                                      851 8560Y01S
M001AI                                      861 8660Y01E
     I            DS
     I                                        1   2 CD03
     I                                        1   1 CD03A
     I            DS
B2MODI                                        1   60WCD01S
B2MODI                                        1   40WCD1Y
B2MODI                                        5   60WCD1M
B2MODI                                        5   60I
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C*                    Z-ADD0         T2T0    90
     C*                    Z-ADD0         T2T3    90
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYAKS    KLIST
M001MC*                    KFLD           YCD01S
M001MC                     KFLD           Y01S
     C                     KFLD           CD03A
     C                     KFLD           CD03
     C                     KFLD           CD06
     C           KEYAKE    KLIST
M001MC*                    KFLD           YCD01E
M001MC                     KFLD           Y01E
     C                     KFLD           CD03A
     C                     KFLD           CD03
     C                     KFLD           CD06
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
|    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL2     IFEQ '1'
    C                     EXSR RTN010                     *HEADING
    C   11                WRITEPE1
    C                     SETOF                     1139
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CL3 10                EXSR RTN400
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*計算確認天數
M001MC*                    Z-ADDYCD01S    WCD01S
M001MC                     Z-ADDY01S      WCD01S
|    C                     Z-ADD0         TOTD    30
|    C*
M001MC*          WCD01S    DOWLEYCD01E
M001MC           WCD01S    DOWLEY01E
|   C                     ADD  WFA2,I    TOTD
B2000C                     ADD  1         WCD01S
| 04-C           WCD1M     IFEQ 13
|   C                     Z-ADD1         WCD1M
B2000C                     ADD  1         WCD1Y
| 04-C                     END
| 03-C                     END
|    C*
|    C           CD03      CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B03
|    C*
|    C                     Z-ADD0         CD46    90
|    C                     Z-ADD0         T1T0    90
|    C                     Z-ADD0         T1T3    90
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     ADD  CD24      CD46
|    C                     ADD  CD25      CD46
|    C                     SUB  CD26      CD46
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....READE DETAIL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C*期初應收，期末應收
|    C                     Z-ADD0         MAK05   90
|    C                     Z-ADD0         MAK10   90
B2000C           KEYAKS    CHAINAK0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDAK05      MAK05
| 01-C                     END
B2000C           KEYAKE    CHAINAK0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     Z-ADDAK10      MAK10
| 02-C                     END
|    C           MAK05     ADD  MAK10     TOT0    90
|    C*
|    C*期初加期末為零或銷售總額則週轉率及收款天數為零
| 03-C           TOT0      IFNE 0
|   C           CD46      ANDNE0
|   C                     DIV  2         TOT0
|   C           CD46      DIV  TOT0      TOT1       52
| 04-C           TOT1      IFNE 0
|   C           TOTD      DIV  TOT1      TOT2       50
| 04*C                     ELSE
|   C                     Z-ADD0         TOT2
| 04-C                     END
| 03*C                     ELSE
|   C                     Z-ADD0         TOT0
|   C                     Z-ADD0         TOT1
|   C                     Z-ADD0         TOT2
| 03-C                     END
|    C*客戶簡稱
|    C           CD06      CHAINME0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   ME04
| 05-C                     END
|    C*
     C*期初期末淨收入皆為零不列印
     C           MAK05     IFNE 0
     C           MAK10     ORNE 0
     C           CD46      ORNE 0
|    C  N11                WRITEPH1
|    C                     SETON                     11
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     ADD  TOT0      T1T0
|    C                     ADD  CD46      T1T3
|    C                     ADD  MAK05     T1T4
|    C                     ADD  MAK10     T1T5
|    C                     Z-ADD0         CD46
     C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT1   SUBTOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C           T1T4      ADD  T1T5      T1T0
|    C           T1T0      DIV  2         T1T0
| 01-C           T1T0      IFEQ 0
|   C                     Z-ADD0         T1T1       52
|   C                     Z-ADD0         T1T2       50
| 01*C                     ELSE
|   C           T1T3      DIV  T1T0      T1T1       52
| 02-C           T1T1      IFEQ 0
|   C                     Z-ADD0         T1T2
| 02*C                     ELSE
|   C           TOTD      DIV  T1T1      T1T2       50
| 02-C                     END
| 01-C                     END
|    C   39                EXSR RTN900
|    C   11                WRITEPT1
|    C                     ADD  T1T3      T2T3
|    C                     ADD  T1T4      T2T4
|    C                     ADD  T1T5      T2T5
|    C                     Z-ADD0         T1T0
|    C                     Z-ADD0         T1T3
|    C                     Z-ADD0         T1T4
|    C                     Z-ADD0         T1T5
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT2   SUBTOTAL
      *==============================================================*
05===C           RTN400    BEGSR
|    C*
|    C           T2T4      ADD  T2T5      T2T0    90
|    C           T2T0      DIV  2         T2T0
| 01-C           T2T0      IFEQ 0
|   C                     Z-ADD0         T2T1       52
|   C                     Z-ADD0         T2T2       50
| 01*C                     ELSE
|   C           T2T3      DIV  T2T0      T2T1       52
| 02-C           T2T1      IFEQ 0
|   C                     Z-ADD0         T2T2
| 02*C                     ELSE
|   C           TOTD      DIV  T2T1      T2T2       50
| 02-C                     END
| 01-C                     END
|    C   39                EXSR RTN900
|    C   11                WRITEPT2
|    C                     Z-ADD0         T2T0
|    C                     Z-ADD0         T2T3
|    C                     Z-ADD0         T2T4
|    C                     Z-ADD0         T2T5
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN999
      *==============================================================*
07===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPE2
|    C*
07===C                     ENDSR
**
312831303130313130313031
