      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : ARR046                                        *
      * AUTHER       : A1118 PHILP TSAI                              *
      * CREATE DATE  : 81/04/15                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款子系統                               *
      * REMARK       :銷貨成本明細表                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.22  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FARR046D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F*PA#BPF  IF  E           K        DISK
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 601 DSI01
     I                                      602 602 COMP
     I                                      603 6080DSI35S
     I                                      609 6140DSI35E
     I*M001M                                615 6200WSI35S
     I*M001M                                621 6260WSI35E
M001MI                                      661 6680WSI35S
M001MI                                      671 6780WSI35E
     I                                      629 629 COMPS
     I                                      630 630 COMPE
     I                                      631 635 DSI12S
     I                                      636 640 DSI12E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSI01
|    C                     MOVE *BLANK    COMP
|    C                     Z-ADD0         DSI35S
|    C                     Z-ADD0         DSI35E
M001AC                     Z-ADD0         W6      60
|    C                     MOVE *BLANK    DSI12S
|    C                     MOVE *BLANK    DSI12E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*公司
| 01-C           DSI01     IFEQ *BLANKS
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C* CHK辦事處
| 02-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 02*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 02-C                     END
|    C*
| 02-C           DSI35S    IFEQ 0
|   C*M001M               Z-ADD010101    DSI35S
M001MC                     Z-ADD010192    DSI35S
| 02-C                     END
|    C*
| 03-C           DSI35E    IFEQ 0
|   C*M001M               Z-ADD123199    DSI35E
M001MC                     Z-ADD123129    DSI35E
| 03-C                     END
|    C*CHECK DATE
|    C                     CALL 'P09'
|    C                     PARM DSI35S    P0401I  60
|    C                     PARM           P0401O  1
| 04-C           P0401O    IFEQ 'N'
|   C                     SETON                     619499
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSI35E    P0401I  60
|    C                     PARM           P0401O  1
| 05-C           P0401O    IFEQ 'N'
|   C                     SETON                     629499
| 05-C                     END
|    C*
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSI35S    S001I2  60
|    C*M001M     WSI35S    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    WSI35S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSI35E    S001I2  60
|    C*M001M     WSI35E    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    WSI35E
|    C*
| 06-C           WSI35S    IFGT WSI35E
|   C                     SETON                     6162
|   C                     SETON                     9399
| 06-C                     END
|    C*
|    C   99                GOTO END100
|    C* CHK客戶　
| 02-C           DSI12S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSI12S
| 02-C                     END
| 02-C           DSI12E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSI12E
| 02-C                     END
| 06-C           DSI12S    IFGT DSI12E
|   C                     SETON                     6364
|   C                     SETON                     9399
| 06-C                     END
|    C*
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*客戶代號
| 14-C           D#ROW     IFEQ 11
| 15-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS024'
|   C                     PARM           DSI12S
|   C                     GOTO ENDF4
| 15-C                     END
|   C*
| 16-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS024'
|   C                     PARM           DSI12E
|   C                     GOTO ENDF4
| 16-C                     END
|   C*
| 14-C                     END
|   C*
|   C*
| 01-C                     END
|    C*
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
