     FP68     IF  E           K        DISK
     FATN04D  CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
     C                     ELSE
     C                     EXSR RTN100
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
     C                     MOVE *BLANKS   PRTNAM 10
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....GET PRINTER NAME
      *===============================================================*
01===C           RTN100    BEGSR
|    C*
     C                     MOVEL*BLANK    PRTNAM
|    C           $PRTID    CHAINP68R                 40
     C           *IN40     IFEQ '0'
     C                     MOVELP6803     PRTNAM
     C                     END
      *
     C           PRTNAM    IFEQ *BLANK
     C                     SETON                     609199
     C                     END
     C   99                GOTO END100
|    C*
     C                     CALL 'ATN04C'
     C                     PARM           PRTNAM
|    C*
01===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE42
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
