      ****************************************************************
      *                                                              *
      * PROGRAM NAME : CHK001                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 06/08/94                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
      * REMARK       :檢核月檔沖帳檔　　                           *
      ****************************************************************
     FCHK001D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*公司別
     I                                      601 602 DAK03S
     I                                      603 604 DAK03E
     I*客戶別
     I                                      631 635 DAK04S
     I                                      641 645 DAK04E
     I*(MM/YY)
     I                                      611 6140DAK01S
     I                                      611 6120DA011S
     I                                      613 6140DA012S
     I*(YY/MM)
     I                                      621 6240YAK01S
     I                                      621 6220YA011S
     I                                      623 6240YA012S
     I*(MM/YY)
     I                                      615 6180DAK01E
     I                                      615 6160DA011E
     I                                      617 6180DA012E
     I*(YY/MM)
     I                                      625 6280YAK01E
     I                                      625 6260YA011E
     I                                      627 6280YA012E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DAK03S
|    C                     MOVE *BLANK    DAK03E
|    C                     MOVE *BLANK    DAK04S
|    C                     MOVE *BLANK    DAK04E
|    C                     Z-ADD0         DAK01S
|    C                     Z-ADD0         YAK01S
|    C                     Z-ADD0         DAK01E
|    C                     Z-ADD0         YAK01E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C***********
|    C*公司代號
|    C***********
| 01-C           DAK03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAK03S
| 01-C                     END
|    C*
| 02-C           DAK03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAK03E
| 02-C                     END
|    C*
| 03-C           DAK03S    IFGT DAK03E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C***********
|    C*客戶代號
|    C***********
| 04-C           DAK04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DAK04S
| 04-C                     END
|    C*
| 05-C           DAK04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DAK04E
| 05-C                     END
|    C*
| 06-C           DAK04S    IFGT DAK04E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C************************
|    C*(CHECK DATE)-年月
|    C************************
|    C*
| 07-C           DAK01S    IFEQ 0
|   C                     Z-ADD0101      DAK01S
| 07*C                     ELSE
| 08-C           DA011S    IFLT 1
|   C           DA011S    ORGT 12
|   C                     SETON                     629399
| 08-C                     END
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C                     Z-ADDDA011S    YA012S
|    C                     Z-ADDDA012S    YA011S
|    C*
| 09-C           DAK01E    IFEQ 0
|   C                     Z-ADD1299      DAK01E
| 09*C                     ELSE
| 10-C           DA011E    IFLT 1
|   C           DA011E    ORGT 12
|   C                     SETON                     639399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
|    C                     Z-ADDDA011E    YA012E
|    C                     Z-ADDDA012E    YA011E
|    C*
| 11-C           YAK01S    IFGT YAK01E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 11-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*客戶代號
| 02-C           D#ROW     IFEQ 9
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C           DAK04S    PARM *BLANKS   W003    9
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 46
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS003'
|   C           DAK04E    PARM *BLANKS   W003    9
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
