      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : CHKSIAD                                       *
      * AUTHER       : A1118 PHILIP TSAI                             *
      * CREATE DATE  : 81/04/15                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款子系統                               *
      * REMARK       :銷貨成本明細表                               *
      ****************************************************************
     FSOSIPF  IP  E           K        DISK
     FARADLF01IF  E           K        DISK
B2CHKFCHKSIADPO   E             39     PRINTER
B2INF *CVR3010 sev.30 PRINTER file CHKSIADP must be converted, because
B2INF *   file SI21 (and more) are shared by name with other database
B2INF *   fields which require to be expanded. Please convert CHKSIADP,
B2INF *   enlarging all involved fields prior to compilation, or manually
B2INF *   insert in this source the proper RENAME and MOVE statements to
B2INF *   avoid name sharing
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYAD     KLIST
     C                     KFLD           SI01
     C                     KFLD           SI02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN100
     C                     SETON                     10
     C*
     C                     EXSR RTN200
     C*
     CLR                   EXSR RTN300
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     EXSR RTN900
|   C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200....GET DETAIL
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C                     Z-ADDSI26      TOT01   90
|    C*
|    C                     EXSR RTN210
     C           SI26      ADD  SI30      TOT02   90
     C                     ADD  SI27      TOT02
|    C*
| 01-C           TOT01     IFNE 0
     C           TOT02     ORNE SI25
|   C   39                EXSR RTN900                                 SAME COP.
|   C                     WRITEPD1
|   C                     SETOF                     20
|   C                     EXSR RTN220
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN210
      *==============================================================*
03===C           RTN210    BEGSR
|    C*
|    C           KEYAD     SETLLAD0
|    C           KEYAD     READEAD0                      41
| 01-C           *IN41     DOWEQ'0'
|   C           TOT01     SUB  AD08      TOT01
|   C           KEYAD     READEAD0                      41
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN220
      *==============================================================*
04===C           RTN220    BEGSR
|    C*
|    C           KEYAD     SETLLAD0
|    C           KEYAD     READEAD0                      41
| 01-C           *IN41     DOWEQ'0'
|   C   39                EXSR RTN900                                 SAME COP.
|   C                     WRITEPD2
|   C           KEYAD     READEAD0                      41
| 01-C                     END
|    C                     SETON                     20
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
| 01-C                     ELSE
|    C                     WRITEPE1
|   C                     WRITEPH1
| 01-C                     END
|    C*
|    C                     SETOF                     39
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN300....TOTAL
      *==============================================================*
06===C           RTN300    BEGSR
|    C*
| 01-C           *IN10     IFEQ '1'
|   C                     WRITEPE1
| 01-C                     END
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
06===C                     ENDSR
