     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME :票據兌現作業                              *
     H*    AUTHOR       : A1150                                      *
     H*    CREATE DATE  : 92/09/29                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     F****************************************************************
     FCKHELF01O   E                    DISK
     FCKHALF02UF  E           K        DISK
     F            HA0                               KRENAMEHAL2
     FCKHBLF01IF  E           K        DISK
     FCKHFLF04IF  E           K        DISK
     FCKHDLF01UF  E           K        DISK
     FARACLF08UF  E           K        DISK
     FCKHALF08IF  E           K        DISK
     F            HA0                               KRENAMEHAL8
     FCKHALF05IF  E           K        DISK
     F            HA0                               KRENAMEHAL5
     FPT#XPF  IF  E           K        DISK
     FLY#SPF  UF  E           K        DISK
     FMTMDPF  UF  E           K        DISK
     FCKA150D CF  E                    WORKSTN      KINFDS DSPFDS
     F                                        RRN   KSFILE SFLSR
     I*DATA AREA
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
B2MODI                                      211 2180$C8YMD
B2MODI                                      201 2100$A8YMD
     I                                      152 161 $USERN
     I                                      173 176 $COR
B2MODI                                      221 221 $ENV
B2MODI                                      503 504 DHA02S
B2MODI                                      507 508 DHA02E
B2MODI                                      511 511 DHA01S
B2MODI                                      512 512 DHA01E
B2MODI                                      513 518 DHA16S
B2MODI                                      519 524 DHA16E
B2MODI                                      525 5320DHA15F
B2MODI                                      533 5400DHA15T
B2MODI                                      541 541 DHA27S
B2MODI                                      542 542 DHA27E
B2MODI                                      543 543 STS
B2MODI                                      544 5510DHA11S
B2MODI                                      552 5590DHA11E
B2MODI                                      563 5710DHA15S
B2MODI                                      575 5830DHA15E
B2MODI                                      586 5930SHA15
B2MODI                                      594 6010EHA15
     I*DEFINE ARACPF AC01
     I*           DS
     I*                                       1   2 WAC01
     I*                                       1   1 WAC011
     I*                                       2   2 WAC012
     I            DS
     I                                        1  10 HA14
     I                                        4   4 HA14B
     I            DS
     I                                        1  10 HA04
     I                                        1   5 HA04A
B2CHKI/COPY QRPGSRC,PT#XDS01
B2INF *CVR2018 sev.20 Found explicit reference to file QRPGSRC; manual
B2INF *   handling may be required
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *LIKE     DEFN RRN       WRRN1
     C           *LIKE     DEFN RRN       WRRN2
     C           *LIKE     DEFN HA11      WHA11
     C           *LIKE     DEFN HA17      WHA17            KEY票況
     C           *LIKE     DEFN #X01      W#X01            KEY #X01
     C           *LIKE     DEFN HA07      WHA07            KEY到期日
     C*
     C           *LIKE     DEFN HA02      #B001I
     C           *LIKE     DEFN HA02      #C001I
     C           *LIKE     DEFN HA04      #C002I
     C           *LIKE     DEFN HA02      #D001I
     C           *LIKE     DEFN HA04      #D002I
     C           *LIKE     DEFN HA02      #F001I
     C           *LIKE     DEFN HA04      #F002I
     C           *LIKE     DEFN HA02      #G001I
     C           *LIKE     DEFN HA04      #G002I
     C*
     C*          *LIKE     DEFN AC02      WAC02
     C*          *LIKE     DEFN AC03      WAC03
     C*          *LIKE     DEFN AC04      WAC04
     C*          *LIKE     DEFN AC05      WAC05
     C*          *LIKE     DEFN AC06      WAC06
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYHF     KLIST
     C                     KFLD           HA03
     C                     KFLD           DHA02
     C           KEY01     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C                     KFLD           HD02N
     C           KEY02     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C                     KFLD           HD02N
     C           KEY03     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C                     KFLD           WHA17
     C           KEY04     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C           KEYHB     KLIST
     C                     KFLD           HD03
     C           KEY#X     KLIST
     C                     KFLD           W#X01
     C                     KFLD           DHA02
     C           KEYHDA    KLIST
     C                     KFLD           DHA02
     C                     KFLD           DHA16
     C           KEYHDB    KLIST
     C                     KFLD           DHA02
     C                     KFLD           HA16N
     C           KEYH2     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C                     KFLD           HA06
     C                     KFLD           WHA07
     C                     KFLD           HA03
     C           KEYH3     KLIST
     C                     KFLD           HA01
     C                     KFLD           HA02
     C                     KFLD           HA57
     C           KEY#F     KLIST
     C                     KFLD           DHA02
     C                     KFLD           HA04
     C           KEY#G     KLIST
     C                     KFLD           DHA02
     C                     KFLD           HA04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
     C           *IN03     DOWEQ'0'
     C           SCID      CASEQ'SC01'    R1000
     C           SCID      CASEQ'SC02'    R2000
     C                     END
     C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
     C           R0100     BEGSR
     C*
     C                     IN   PTDA01
     C*
     C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
     C                     MOVEL'2'       WHA17
     C*
     C                     CALL 'P31'
B2MODC                     PARM $A8YMD    P3101I 100
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM $PFMT     P3104I  1
     C                     PARM $PTYPE    P3105I  1
     C           DDATE     PARM           P3101O  80
     C*
     C                     MOVEL'SC01'    SCID    4
     C* FUN AUT
     C*
     C* SC01 FIELD INITIALIZE *--------------------------------------*
     C*公司檔
     C                     MOVEL$COR      DHA02
     C                     CALL 'CKS#B0'
     C                     PARM DHA02     #B001I
     C           DHA02N    PARM           #B002O 16
     C                     PARM           #B003O 34
     C                     PARM           #B098O 50
     C                     PARM           #B099O  1
     C*
     C                     MOVEL*BLANK    DHA01
     C                     MOVEL*BLANK    DHA16
     C                     MOVEL*BLANK    HD02N
     C                     Z-ADD0         DHA11
     C*
     C                     MOVEL'CK'      W#X01
     C           KEY#X     CHAIN#X0                  40
     C                     CALL 'P31'
B2MODC                     PARM $A8YMD    P3101I 100
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM #X101     P3104I  1
     C                     PARM #X102     P3105I  1
     C           DHA15     PARM           P3101O  80
B2???C                     Z-ADDDHA15     DHA15S
B2INF *CVR3013 sev.30 Field DHA15S contains a year, but has no standard
B2INF *   date type
B2???C                     Z-ADDDHA15     DHA15E
B2INF *CVR3013 sev.30 Field DHA15E contains a year, but has no standard
B2INF *   date type
     C*
     C                     MOVE 'Y'       DHA27
     C*--------------------------------------------------------------*
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
     C           R1000     BEGSR
     C*
     C* N99                SETON                     88
     C*
     C                     EXFMTDSPD1
     C                     MOVEA*ALL'0'   *IN,60
     C                     Z-ADD*ZERO     #LIN
     C                     Z-ADD*ZERO     #COL
     C*
     C           *IN03     IFEQ '1'                        *END
     C                     GOTO E1000
     C                     END
     C*
     C           *IN04     IFEQ '1'
     C                     EXSR R1E00                      .PROMPT
     C                     GOTO E1000
     C                     END
     C*
     C                     EXSR R1B00                      *SCR CHK
     C*
     C           *IN09     IFEQ '1'                        *列印作業
     C           *IN99     ANDEQ'0'                        * NO ERROR
     C                     EXSR R1A00
     C                     GOTO E1000
     C                     END
     C*
     C           *IN99     IFEQ '0'                        *SCR CHK OK
     C                     MOVEL'SC02'    SCID
     C                     END
     C*
     C           E1000     ENDSR
     C*==============================================================*
     C*          R1A00 ....列印作業 ( PF09 --ON )
     C*==============================================================*
     C           R1A00     BEGSR
     C*
     C                     MOVELDHA02     DHA02S
     C                     MOVELDHA02     DHA02E
     C                     MOVELDHA01     DHA01S
     C                     MOVELDHA01     DHA01E
     C                     MOVEL'2'       STS
     C           DHA16     IFEQ *BLANK
     C                     MOVE *LOVAL    DHA16S
     C                     MOVE *HIVAL    DHA16E
     C                     ELSE
     C                     MOVELDHA16     DHA16S
     C                     MOVELDHA16     DHA16E
     C                     END
     C*
     C                     MOVEL'CK'      W#X01
     C           KEY#X     CHAIN#X0                  40
     C                     CALL 'P31'
B2???C                     PARM DHA11     P3101I 100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C                     PARM #X101     P3102I  1
     C                     PARM #X102     P3103I  1
     C                     PARM '2'       P3104I  1
     C                     PARM '1'       P3105I  1
     C           DHA11E    PARM           P3101O  80
     C*
     C                     Z-ADD0         DHA11S
     C                     Z-ADD0         DHA15F
     C                     Z-ADD99999999  DHA15T
     C*
     C           DHA27     IFNE *BLANK
     C                     MOVELDHA27     DHA27S
     C                     MOVELDHA27     DHA27E
     C                     ELSE
     C                     MOVEL*LOVAL    DHA27S
     C                     MOVEL*HIVAL    DHA27E
     C                     END
     C*
     C                     MOVE '2'       $ENV
     C           *NAMVAR   DEFN *LDA      LDA
     C                     OUT  LDA
     C* CALL SUB-PROGRAM
     C                     CALL 'CKR4502C'
     C*
     C                     MOVEL'UPT2140' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     99
     C*
     C           E1A00     ENDSR
     C*==============================================================*
     C*          R1B00 .... 'SC01' SCREEN CHECK
     C*==============================================================*
     C           R1B00     BEGSR
     C*
     C* CHK FUN AUT
     C*
     C* DATA CHECK *--------------------------------------------------*
     C                     MOVEL'CK'      W#X01
     C           KEY#X     CHAIN#X0                  40
     C*公司別
     C                     MOVEL*BLANK    DHA02N
     C           DHA02     IFEQ *BLANK
     C                     MOVEL'UPT0010' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6099
     C                     END
     C   99                GOTO E1B00
     C*
     C                     CALL 'CKS#B0'
     C                     PARM DHA02     #B001I
     C           DHA02N    PARM           #B002O 16
     C                     PARM           #B003O 34
     C                     PARM           #B098O 50
     C                     PARM           #B099O  1
     C           #B099O    IFNE 'Y'
     C                     MOVEL'UPT2010' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                       6099
     C                     END
     C   99                GOTO E1B00
     C*類別
     C           DHA01     IFNE '1'
     C           DHA01     ANDNE'2'
     C                     MOVEL'UPT0030' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                       6199
     C                     END
     C   99                GOTO E1B00
     C*---銀行帳號
     C                     MOVEL*BLANK    HD02N
     C           DHA16     IFNE *BLANK
     C           KEYHDA    CHAINHD0                  40
     C           *LOVAL    SETLLHD0
     C           *IN40     IFEQ '1'
     C                     MOVEL'UPT2010' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                       6299
     C                     ELSE
     C                     MOVE HD02      HD02N
     C                     END
     C                     END
     C   99                GOTO E1B00
     C*---託收日期
     C                     Z-ADD0         SHA15   80
     C                     Z-ADD99999999  EHA15   80
     C*
B2CHKC           DHA15S    IFNE 0
B2INF *CVR3013 sev.30 Field DHA15S contains a year, but has no standard
B2INF *   date type
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2MODC                     Z-ADDDHA15S    WA01   100
     C                     CALL 'P30'
B2MODC                     PARM WA01      P3001I 100
     C                     PARM #X101     P3002I  1
     C                     PARM #X102     P3003I  1
     C                     PARM           P3011O  1
     C*
     C           P3011O    IFNE 'Y'
     C                     MOVEL'UPT0040' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6599
     C                     END
     C   99                GOTO E1B00
     C*
     C                     CALL 'P31'
B2MODC                     PARM DHA15S    P3101I 100
     C                     PARM #X101     P3102I  1
     C                     PARM #X102     P3103I  1
     C                     PARM '2'       P3104I  1
     C                     PARM '1'       P3105I  1
     C           SHA15     PARM           P3101O  80
     C*
     C                     END
     C*
B2CHKC           DHA15E    IFEQ 0
B2INF *CVR3013 sev.30 Field DHA15E contains a year, but has no standard
B2INF *   date type
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD999999    DHA15E
B2VFYC                     Z-ADD99999999  DHA15E
B2INF *CVR3013 sev.30 Field DHA15E contains a year, but has no standard
B2INF *   date type
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     ELSE
     C*
B2MODC                     Z-ADDDHA15E    WA01   100
     C                     CALL 'P30'
B2MODC                     PARM WA01      P3001I 100
     C                     PARM #X101     P3002I  1
     C                     PARM #X102     P3003I  1
     C                     PARM           P3011O  1
     C           P3011O    IFNE 'Y'
     C                     MOVEL'UPT0040' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6699
     C                     END
     C   99                GOTO E1B00
     C*
     C                     CALL 'P31'
B2MODC                     PARM DHA15E    P3101I 100
     C                     PARM #X101     P3102I  1
     C                     PARM #X102     P3103I  1
     C                     PARM '2'       P3104I  1
     C                     PARM '1'       P3105I  1
     C           EHA15     PARM           P3101O  80
     C*
     C                     END
     C*
B2000C           DHA15S    IFGT DHA15E
     C                     MOVEL'UPT0041' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     656699
     C                     END
     C   99                GOTO E1B00
     C*
     C*
     C*---預兌日期
     C           DHA11     IFEQ 0
     C                     Z-ADD9999999   PHA11
     C                     Z-ADD99999999  WHA11
     C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDHA11     WA01    80
B2CHKC                     MOVE '000 U'   HB2@FA
B2CHKC                     MOVE DHA11     HB2@F
B2CHKC                     MOVE '010P2'   HB2@TA
B2CHKC                     EXSR HB@ADD                     ADD CENTURY
B2MODC                     MOVE HB2@T     WA01   100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     CALL 'P30'
B2MODC                     PARM WA01      P3001I 100
     C                     PARM #X101     P3002I  1
     C                     PARM #X102     P3003I  1
     C                     PARM           P3011O  1
     C           P3011O    IFNE 'Y'
     C                     MOVEL'UPT0040' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6399
     C                     ELSE
     C*
     C                     Z-ADDDHA11     PHA11
     C                     CALL 'P31'
B2???C                     PARM DHA11     P3101I 100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C                     PARM #X101     P3102I  1
     C                     PARM #X102     P3103I  1
     C                     PARM '2'       P3104I  1
     C                     PARM '1'       P3105I  1
     C           WHA11     PARM           P3101O  80
     C                     Z-ADD0         DHA11S
     C                     Z-ADDWHA11     DHA11E
     C                     END
     C*
     C                     END
     C   99                GOTO E1B00
     C*---兌現日期
     C           DHA15     IFEQ 0
     C                     MOVEL'UPT0012' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6499
     C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDHA15     WA02    80
B2CHKC                     MOVE '000 U'   HB2@FA
B2CHKC                     MOVE DHA15     HB2@F
B2CHKC                     MOVE '010P2'   HB2@TA
B2CHKC                     EXSR HB@ADD                     ADD CENTURY
B2MODC                     MOVE HB2@T     WA02   100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     CALL 'P30'
B2MODC                     PARM WA02      P3001I 100
     C                     PARM #X101     P3002I  1
     C                     PARM #X102     P3003I  1
     C                     PARM           P3011O  1
     C           P3011O    IFNE 'Y'
     C                     MOVEL'UPT0040' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     6499
     C                     END
     C                     END
     C   99                GOTO E1B00
     C*
     C           DHA27     IFNE *BLANK
     C                     MOVELDHA27     DHA27S
     C                     MOVELDHA27     DHA27E
     C                     ELSE
     C                     MOVEL*LOVAL    DHA27S
     C                     MOVEL*HIVAL    DHA27E
     C                     END
     C*
     C           E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
     C           R1E00     BEGSR
     C*
     C           #CSR      DIV  256       #LIN             *LINE
     C                     MVR            #COL             *COLUMN
     C*銀行帳號
     C           #LIN      IFEQ 7
     C           #COL      ANDGE36
     C           #COL      ANDLE41
     C                     CALL 'CKI1D0'
     C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C                     PARM DHA02     P130I1  2
     C           DHA16     PARM DHA16     P130I2  6
     C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     C                     PARM           @RTNC   2
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2000 .... 'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
     C           R2000     BEGSR
     C*
     C                     EXSR R2A00                      *INIT SCR2
     C*
     C           *IN03     DOWEQ'0'
     C           SCID      ANDEQ'SC02'
     C*
     C                     WRITEDSPC1
     C                     EXFMTSFLCR
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'
     C           *IN12     ANDEQ'0'
     C*
     C           *IN14     IFEQ '1'
     C*
     C                     EXSR R2B00                      *SELECT & SAVE
     C                     MOVE 'SC01'    SCID                         VE
     C*
     C                     END
     C* *IN03 OR *IN12 ON
     C                     ELSE
     C* RELEAS FILE --------------------------------------------------*
     C           *LOVAL    SETLLHAL2
     C           *LOVAL    SETLLHD0
     C                     MOVE 'SC01'    SCID
     C                     END                             *IN12 ENDIF
     C*
     C                     END                             *ENDDO
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2A00 ....INIT 'SC02'
     C*==============================================================*
     C           R2A00     BEGSR
     C*
     C* HEAD-銀行名稱-----------------------------------------------*
     C                     MOVEL*BLANK    HB03N1
     C           DHA16     IFNE *BLANK
     C           KEYHB     CHAINHB0                  40
     C  N40                MOVELHB03      HB03N1
     C                     END
     C*
     C*合計
     C                     Z-ADD0         DSUM
     C*---------------------------------------------------------------*
     C                     EXSR R2A10                      *SFL INIT
     C                     EXSR R2A20                      *MOVE SFL
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2A10 ....SFL INIT
     C*==============================================================*
     C           R2A10     BEGSR
     C*
     C                     Z-ADD1         DRRN
     C                     Z-ADD0         RRN
     C                     Z-ADD0         WRRN1
     C                     SETON                     52    *SFLCLR
     C                     WRITESFLCR
     C                     SETOF                     525053
     C                     SETON                     51    *SFLDSPCTL
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2A20 ....MOVE DATA TO SFLSR
     C*==============================================================*
     C           R2A20     BEGSR
     C*
     C                     MOVEL*BLANK    DOPT
     C           DHA16     IFNE *BLANK                     區分帳號
     C           KEY01     SETLLHAL8
     C                     EXSR R2A21
     C                     ELSE                            全部帳號
     C           KEY03     SETLLHAL5
     C                     EXSR R2A22
     C                     END
     C*
     C                     SETON                     53
     C*
     C           RRN       IFGT 0
     C                     SETON                     50
     C                     ELSE
     C                     MOVEL'UPT2050' ERRID
     C                     MOVEL'PTMF'    ERRF
     C                     SETON                     99
     C                     END
     C                     Z-ADDRRN       WRRN1
     C**
     C                     ENDSR
     C*
     C*==============================================================*
     C*          R2A21 ....SETLL & READE CKHALF04
     C*==============================================================*
     C           R2A21     BEGSR
     C*
     C           KEY02     READEHAL8                     44
     C           *IN44     DOWEQ'0'
     C           HA17      ANDLE'3'
     C*
     C           HA11      IFLE WHA11
     C           HA27      ANDGEDHA27S
     C           HA27      ANDLEDHA27E
     C           HA15      ANDGESHA15
     C           HA15      ANDLEEHA15
     C           HA55      ANDEQ0
     C*
     C                     MOVE HA16      HA16N
     C*                    MOVEL*BLANK    HB02N
     C           KEYHDB    CHAINHD0                  40
     C           *LOVAL    SETLLHD0
     C  N40      KEYHB     CHAINHB0                  40
     C* N40                MOVELHB02      HB02N
     C*客戶
     C           HA01      IFEQ '1'
     C                     CALL 'CKS#C0'
     C                     PARM DHA02     #C001I
     C                     PARM HA04      #C002I
     C           HA04N     PARM           #C003O 10
     C                     PARM           #C004O 42
     C                     PARM           #C005O 10
     C                     PARM           #C098O 50
     C                     PARM           #C099O  1
     C*
     C                     ELSE
     C*廠商
     C           KEYHF     CHAINCKHFLF04             40
     C           *IN40     IFEQ '0'
     C                     MOVELHF77      #D003O
     C                     ELSE
     C                     CALL 'CKS#D0'
     C                     PARM DHA02     #D001I
     C                     PARM HA04      #D002I
     C                     PARM           #D003O 18
     C                     PARM           #D004O 42
     C                     PARM           #D005O 62
     C                     PARM           #D098O 50
     C                     PARM           #D099O  1
     C                     END
     C*
     C                     CALL 'P65'
     C                     PARM #D003O    P6501I 80
     C                     PARM 10        P6502I  30
     C           HA04N     PARM           P6511O 80
     C                     PARM           P6512O 80
     C*
     C                     END
     C*
     C                     CALL 'P31'
B2???C                     PARM HA06      P3101I 100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM #X101     P3104I  1
     C                     PARM #X102     P3105I  1
     C           HA06N     PARM           P3101O  80
     C*
     C                     CALL 'P31'
B2???C                     PARM HA07      P3101I 100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM #X101     P3104I  1
     C                     PARM #X102     P3105I  1
     C           HA07N     PARM           P3101O  80
     C*
     C                     CALL 'P31'
B2???C                     PARM HA15      P3101I 100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM #X101     P3104I  1
     C                     PARM #X102     P3105I  1
     C           HA15N     PARM           P3101O  80
     C*
     C                     ADD  HA10      DSUM
     C*
     C                     ADD  1         RRN
     C                     WRITESFLSR
     C                     END
     C           KEY02     READEHAL8                     44
     C                     END
     C                     ENDSR
     C*==============================================================*
     C*          R2A22 ....SETLL & READE CKHALF05
     C*==============================================================*
     C           R2A22     BEGSR
     C*
     C           KEY04     READEHAL5                     44
     C           *IN44     DOWEQ'0'
     C           HA17      ANDLE'3'
     C*
     C           HA11      IFLE WHA11
     C           HA27      ANDGEDHA27S
     C           HA27      ANDLEDHA27E
     C*
     C                     MOVE HA16      HA16N
     C*                    MOVEL*BLANK    HB02N
     C           KEYHDB    CHAINHD0                  40
     C           *LOVAL    SETLLHD0
     C  N40      KEYHB     CHAINHB0                  40
     C* N40                MOVELHB02      HB02N
     C*客戶
     C           HA01      IFEQ '1'
     C                     CALL 'CKS#C0'
     C                     PARM DHA02     #C001I
     C                     PARM HA04      #C002I
     C           HA04N     PARM           #C003O 10
     C                     PARM           #C004O 42
     C                     PARM           #C005O 10
     C                     PARM           #C098O 50
     C                     PARM           #C099O  1
     C*
     C                     ELSE
     C*廠商
     C           HA03      CHAINCKHFLF04             40
     C           *IN40     IFEQ '0'
     C                     MOVELHF77      #D003O
     C                     ELSE
     C                     CALL 'CKS#D0'
     C                     PARM DHA02     #D001I
     C                     PARM HA04      #D002I
     C                     PARM           #D003O 18
     C                     PARM           #D004O 42
     C                     PARM           #D005O 62
     C                     PARM           #D098O 50
     C                     PARM           #D099O  1
     C                     END
     C*
     C                     CALL 'P65'
     C                     PARM #D003O    P6501I 80
     C                     PARM 10        P6502I  30
     C           HA04N     PARM           P6511O 80
     C                     PARM           P6512O 80
     C*
     C                     END
     C*
     C                     CALL 'P31'
B2???C                     PARM HA06      P3101I 100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM #X101     P3104I  1
     C                     PARM #X102     P3105I  1
     C           HA06N     PARM           P3101O  80
     C*
     C                     CALL 'P31'
B2???C                     PARM HA07      P3101I 100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM #X101     P3104I  1
     C                     PARM #X102     P3105I  1
     C           HA07N     PARM           P3101O  80
     C*
     C                     ADD  HA10      DSUM
     C*
     C                     CALL 'P31'
B2???C                     PARM HA15      P3101I 100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C                     PARM '2'       P3102I  1
     C                     PARM '1'       P3103I  1
     C                     PARM #X101     P3104I  1
     C                     PARM #X102     P3105I  1
     C           HA15N     PARM           P3101O  80
     C*
     C                     ADD  1         RRN
     C                     WRITESFLSR
     C                     END
     C           KEY04     READEHAL5                     44
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2B00 .... SELECT
     C*==============================================================*
     C           R2B00     BEGSR
     C*
     C                     Z-ADD1         WRRN2
     C           WRRN2     DOUGTWRRN1
     C*
     C           WRRN2     CHAINSFLSR                40
     C           *IN40     IFEQ '0'
     C           DOPT      ANDEQ*BLANK
     C                     EXSR R2C00                      *SAVE FILE
     C                     END
     C*
     C                     ADD  1         WRRN2
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2C00 .... SAVE FILE
     C*==============================================================*
     C           R2C00     BEGSR
     C*新增CKHELF01
     C                     MOVELHA01      HE01
     C                     MOVELHA02      HE02
     C                     MOVELHA03      HE03
     C                     MOVELHD02      HE04
     C*
     C                     MOVEL'CK'      W#X01
     C           KEY#X     CHAIN#X0                  40
     C                     CALL 'P31'
B2???C                     PARM DHA15     P3101I 100
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C                     PARM #X101     P3102I  1
     C                     PARM #X102     P3103I  1
     C                     PARM '2'       P3104I  1
     C                     PARM '1'       P3105I  1
     C           HE05      PARM           P3101O  80
     C*
     C                     MOVEL'4'       HE06
     C                     MOVELHA17      HE08
B2000C                     TIME           HE97
B2???C                     Z-ADD$A8YMD    HE98
B2INF *CVR3013 sev.30 Field $A8YMD contains a year, but has no standard
B2INF *   date type
     C                     MOVEL$USER     HE99
     C                     WRITEHE0
     C*
     C                     Z-ADDHA07      WHA07
     C           KEYH2     CHAINHAL2                 41
     C*更新CKHALF02
     C           *IN41     IFEQ '0'
     C                     Z-ADDHE05      HA15
     C                     MOVELHE04      HA16
     C                     MOVELHE06      HA17
B2000C                     TIME           HA97
B2???C                     Z-ADD$A8YMD    HA98
B2INF *CVR3013 sev.30 Field $A8YMD contains a year, but has no standard
B2INF *   date type
     C                     MOVEL$USER     HA99
     C                     UPDATHAL2
     C                     END
     C*應收票據
     C           DHA01     IFEQ '1'
     C* --UPDATE CKHDPF
     C           KEYHDB    CHAINHD0                  40
     C           *IN40     IFEQ '0'
     C                     ADD  HA10      HD07
B2000C                     TIME           HD97
B2???C                     Z-ADD$A8YMD    HD98
B2INF *CVR3013 sev.30 Field $A8YMD contains a year, but has no standard
B2INF *   date type
     C                     MOVEL$USER     HD99
     C                     UPDATHD0
     C                     END
     C                     EXSR R2Y00
     C*
     C                     END
     C*應付票據
     C           DHA01     IFEQ '2'
     C* --UPDATE廠商檔
     C           HA04      CHAIN#S0                  40
     C           *IN40     IFEQ '0'
     C                     SUB  HA10      #S35
     C                     UPDAT#S0
     C                     END
     C* --UPDATE CKHDPF
     C           KEYHDB    CHAINHD0                  40
     C           *IN40     IFEQ '0'
     C                     SUB  HA10      HD07
B2000C                     TIME           HD97
B2???C                     Z-ADD$A8YMD    HD98
B2INF *CVR3013 sev.30 Field $A8YMD contains a year, but has no standard
B2INF *   date type
     C                     MOVEL$USER     HD99
     C                     UPDATHD0
     C                     END
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2Y00 ....
     C*==============================================================*
     C           R2Y00     BEGSR
     C* --UPDATE ARACPF
     C           HA58      IFEQ 'N'
     C                     EXSR R2Z00
     C                     ELSE
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2Z00 .... UPDATE ARACPF
     C*==============================================================*
     C           R2Z00     BEGSR
     C* --UPDATE ARACPF
     C                     MOVELHA03      AC06
     C           AC06      SETLLAC0                  40
     C           AC06      READEAC0                      42
     C           *IN42     DOWEQ'0'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDHE05      AC11
B2CHKC                     MOVE '000 U'   HB2@FA
B2CHKC                     MOVE HE05      HB2@F
B2CHKC                     MOVE '008N2'   HB2@TA
B2CHKC                     EXSR HB@ADD                     ADD CENTURY
B2CHKC                     MOVE HB2@T     AC11
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     MOVE HD02      AC12
B2000C                     Z-ADD$A8YMD    ACXX
B2000C                     TIME           ACYY
     C                     MOVEL$USER     ACZZ
     C                     UPDATAC0
     C*UPDAT MD0
|   C           AC02      CHAINMD0                  40
| 02-C           *IN40     IFEQ '0'
     C*客戶代號第一碼不為Ｂ專櫃時方更新使用額度(MD29)
     C                     MOVELMD01      WMD01T  1
|   C                     SUB  AC08      MD32
     C           MD31      ADD  MD32      MD29
|   C                     UPDATMD0
| 02-C                     END
     C           AC06      READEAC0                      42
     C                     END
     C*
     C                     ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
