     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : CKR3D1                                     *
     H*    PROCEDURE    : CKR3D0                                     *
     H*    AUTHOR       : A1092   TAYLOR                             *
     H*    CREATE DATE  : 79/12/17                                   *
     H*    UPDATE DATE  :                                            *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :票據系統                                  *
     A*    REMARK       :收現記錄列印                              *
     H****************************************************************
     FPT#BPF  IF  E           K        DISK
     FCKR3D0D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      138 138 $INQ
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      501 502 DBG01
     I                                      503 5080DBG02S
     I                                      509 5140DBG02E
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
     C*==============================================================*
     C*          MAIN ROUTINE
     C*==============================================================*
     C*
     C  N98N97             EXSR RTN010
     C*
     C           *IN03     DOUEQ'1'
     C           *IN99     OREQ '0'
     C                     EXFMTDSPD1
     C                     MOVEA*ALL'0'   *IN,60
     C           *IN03     IFEQ '0'
     C                     EXSR RTN110                     *CHK FIELD  N
     C                     END
     C                     END
     C*
     C           *NAMVAR   DEFN *LDA      LDA
     C                     OUT  *NAMVAR
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
     CSR         RTN010    BEGSR
     C                     MOVE *BLANKS   DBG01
     C                     Z-ADD0         DBG02S
     C                     Z-ADD991231    DBG02E
     C                     ENDSR
     C*==============================================================*
     C*          RTN110....CHECK SCREEN FIELDS
     C*==============================================================*
     CSR         RTN110    BEGSR
     C*
     C           DBG01     IFEQ *BLANKS
     C                     SETON                     619699
     C                     ELSE
     C           DBG01     SETLL#B0                      42
     C           *IN42     IFEQ '0'
     C                     SETON                     619599
     C                     END
     C                     END
     C   99                GOTO END110
     C*
     C           DBG02S    IFNE 0
     C                     CALL 'P04'
     C                     PARM DBG02S    P0401I  60
     C                     PARM           P0401O  1
     C           P0401O    IFEQ 'N'
     C                     SETON                     629499
     C                     END
     C                     END
     C   99                GOTO END110
     C*
     C           DBG02E    IFEQ 0
     C                     SETON                     639699
     C                     ELSE
     C                     CALL 'P04'
     C                     PARM DBG02E    P0401I  60
     C                     PARM           P0401O  1
     C           P0401O    IFEQ 'N'
     C                     SETON                     639499
     C                     END
     C                     END
     C   99                GOTO END110
     C*
     C           DBG02S    IFGT DBG02E
     C                     SETON                     626393
     C                     SETON                     99
     C                     END
     C   99                GOTO END110
     C*
     C           $INQ      IFNE 'Y'
     C           $EVR      ANDEQ1
     C                     SETON                     609099
     C                     END
     C   99                GOTO END110
     C*
     C                     MOVE DBG01     S002I1
     C                     MOVE DBG01     S002I2
     C/COPY PTSRC1
     CSR         END110    ENDSR
