      ****************************************************************
      *                                                              *
      * PROGRAM NAME : CLR0011                                       *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 09/26/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :寰盛洋酒                                     *
      * SUBSYSTEM    :檔案整理                                     *
      * REMARK       :進銷項系統檔案整理作業                       *
     A*===============================================================
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*      |        |        |
     A*---------------------------------------------------------------
      ****************************************************************
     FARADPF  UF  E           K        DISK
     FARACPF  UF  E           K        DISK
     FBKARAD  O   E           K        DISK
     F            AD0                               KRENAMEAD0L
     FBKARAC  O   E           K        DISK
     F            AC0                               KRENAMEAC0L
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080DATE
     I                                      203 2040$A8Y
     I                                      205 2060$A8M
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      800 8070YMD8S
     I                                      800 8050YYMM
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           KEYAC     KLIST
     C                     KFLD           AD01
     C                     KFLD           AD02
     C                     KFLD           AD03
     C                     KFLD           AD04
     C                     KFLD           AD05
     C                     KFLD           AD06
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     READ AD0                      49
     C           *IN49     DOWEQ'0'
     C           KEYAC     CHAINAC0                  45
  01-C           *IN45     DOWEQ'0'
    C                     WRITEAC0L
     C                     DELETAC0
    C           KEYAC     READEAC0                      45
  |  C                     END
    C*
     C                     WRITEAD0L
     C*
     C                     DELETAD0
     C                     READ AD0                      49
     C                     END
      *
     C                     SETON                     LR
      *===============================================================*
