     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 99.01.28 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     C*==============================================================*
     C*                    PLIST    PARAMETER  GET
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           PARMI1  60
     C                     PARM YMD       PARMO1  60
     C                     PARM MDY       PARMO2  60
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     Z-ADD0         CHYMD   60
      *CHYMD中國年YYMMDD
M001AC                     MOVE PARMI1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    W8      80
M001MC*          PARMI1    SUB  110000    CHYMD
M001MC           W8        SUB  19110000  CHYMD
     C                     Z-ADD0         YMD     60
     C                     CALL 'P62'
     C                     PARM CHYMD     P6201I  60
     C                     PARM -1        P6202I  40
     C           YMD       PARM           P6201O  60
      *YMD西元年YYMMDD
     C                     ADD  110000    YMD
|    C                     Z-ADD0         MDY     60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
|    C                     PARM YMD       S001I2  60
      *MDY西元年MMDDYY
|    C           MDY       PARM           S001O1  60
|    C*
     C                     SETON                     LR
M001AC/COPY HBP2CVTR
