      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : DPA042                                        *
      * AUTHER       : A1034 STEPHANIE                               *
      * CREATE DATE  : 81/05/08                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :電腦室子系統                                 *
      * REMARK       :歷史檔案整理                                 *
      ****************************************************************
     FDPA042D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      601 6020DYS
     I                                      603 6040DMS
     I                                      605 6060DDS
     I                                      607 6080DYE
     I                                      609 6100DME
     I                                      611 6120DDE
     I                                      621 630 DTDEV
     IDA05       UDS
     I                                        1   40DMYS
     I                                        5   80DMYE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN010                     INIT
     C           *IN03     DOWEQ'0'
     C                     EXFMTDSPD1
     C                     MOVEA*ALL'0'   *IN,60
     C           *IN03     IFEQ '0'
     C                     EXSR RTN100                     CHECK
     C*
     C           *IN99     IFEQ '0'
     C           *IN14     ANDEQ'1'
     C                     EXSR RTN200                     SUBPGM
     C                     END
     C*
     C                     END
     C*
     C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INIT
     C*==============================================================*
01===C           RTN010    BEGSR
     C*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           DA05
     C                     IN   LDA
     C           *LOCK     IN   DA05
     C*
     C                     ADD  1         DMYS
     C                     ADD  1         DMYE
     C*
     C**MM/YY --> YY/MM
     C                     MOVE DMYS      DYS
     C                     MOVELDMYS      DMS
     C                     Z-ADD1         DDS
     C                     MOVE DMYE      DYE
     C                     MOVELDMYE      DME
     C                     Z-ADD31        DDE
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING  FILE
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*
     C           DTDEV     IFNE *BLANKS
     C                     SETON                     609899
     C                     END
     C*
01===C           END100    ENDSR
      *==============================================================*
      *          RTN200....CALL SUB PGM
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
     C                     SETON                     97
     C                     WRITEDSPD1
     C*
     C                     OUT  LDA
     C                     CALL 'DPA042C1'                 CPYF->QTEMP
     C                     OUT  DA05
     C*
02===C                     ENDSR
