     FDPA043D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      601 6060DYMDS
     I                                      601 6020DYS
     I                                      603 6040DMS
     I                                      605 6060DDS
     I                                      607 6120DYMDE
     I                                      607 6080DYE
     I                                      609 6100DME
     I                                      611 6120DDE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN010                     INIT
     C           *IN03     DOWEQ'0'
     C                     EXFMTDSPD1
     C                     MOVEA*ALL'0'   *IN,60
     C           *IN03     IFEQ '0'
     C                     EXSR RTN100                     CHECK
     C*
     C           *IN99     IFEQ '0'
     C           *IN14     ANDEQ'1'
     C                     EXSR RTN200                     SUBPGM
     C                     END
     C*
     C                     END
     C*
     C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INIT
     C*==============================================================*
01===C           RTN010    BEGSR
     C*
     C           *NAMVAR   DEFN *LDA      LDA
     C                     IN   LDA
     C*
     C                     Z-ADD0         DMYS
     C                     Z-ADD0         DMYE
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING  FILE
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*
     C**MM/YY --> YY/MM
     C                     MOVE DMYS      DYS
     C                     MOVELDMYS      DMS
     C                     Z-ADD1         DDS
     C                     MOVE DMYE      DYE
     C                     MOVELDMYE      DME
     C                     Z-ADD31        DDE
     C*
     C           DMS       IFGT 12
     C           DMS       ORLT 1
     C                     SETON                     609699
     C                     END
     C   99                GOTO END100
     C*
     C           DME       IFGT 12
     C           DME       ORLT 1
     C                     SETON                     619699
     C                     END
     C   99                GOTO END100
     C*
     C           DYMDS     IFGT DYMDE
     C                     SETON                     6162
     C                     SETON                     9599
     C                     END
     C   99                GOTO END100
     C*
01===C           END100    ENDSR
      *==============================================================*
      *          RTN200....CALL SUB PGM
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
     C                     SETON                     97
     C                     WRITEDSPD1
     C*
     C                     OUT  LDA
     C                     CALL 'DPA043C1'                 CPYF->QTEMP
     C                     SETOF                     97
     C                     SETON                     94
     C*
02===C                     ENDSR
