      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : DPB002                                        *
      * AUTHER       : D910070 JUDY LEE                              *
      * CREATE DATE  : 1993.09.13                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :年度整檔系統                                 *
      * REMARK       :採購檔年度整檔批次                           *
      ****************************************************************
     FDPB002D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      119 1200$EGMM
     I                                      121 1220$EGDD
     I                                      123 1240$EGYY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      601 6020DYS
     I                                      603 6040DMS
     I                                      605 6060DDS
     I                                      607 6080DYE
     I                                      609 6100DME
     I                                      611 6120DDE
     I                                      613 622 DTDEV
     I                                      623 628 DVOL
     I                                      626 6270DVYY
     I                                      631 6340DMYS
     I                                      631 6320DMMS
     I                                      633 6340DYYS
     I                                      635 6380DMYE
     I                                      635 6360DMME
     I                                      637 6380DYYE
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN98     PARM *IN98     IN98    1
     C                     Z-ADD0         DMMS
     C                     Z-ADD0         DYYS
     C                     Z-ADD0         DMME
     C                     Z-ADD0         DYYE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN010                     INIT
  01-C           *IN03     DOWEQ'0'
    C           *IN14     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     CHECK
  02-C                     END
    C*
  01-C                     END
     C                     EXSR RTN200                     OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          RTN010....INIT
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*設定整檔年月日起訖
| 03-C           $EGMM     IFGE 4
|   C           $EGYY     SUB  2         DYE
|   C           $EGYY     SUB  2         DMYE
|   C           $EGYY     SUB  3         DYS
|   C           $EGYY     SUB  3         DMYS
| 03*C                     ELSE
|   C           $EGYY     SUB  3         DYE
|   C           $EGYY     SUB  3         DMYE
|   C           $EGYY     SUB  4         DYS
|   C           $EGYY     SUB  4         DMYS
| 03-C                     END
|    C                     Z-ADD4         DMS
|    C                     Z-ADD3         DME
|    C                     Z-ADD1         DDS
|    C                     Z-ADD31        DDE
|    C                     Z-ADDDYS       DVYY
|    C*
|    C**YY/MM --> MM/YY
|    C                     Z-ADDDYS       DYYS
|    C                     Z-ADDDMS       DMMS
|    C                     Z-ADDDYE       DYYE
|    C                     Z-ADDDME       DMME
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING  FILE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C*          DTDEV     IFNE *BLANKS
|   C*                    SETON                     609899
| 01-C*                    END
|    C*
02===C           END100    ENDSR
      *==============================================================*
      *          RTN200....OUTLDA
      *==============================================================*
03===C           RTN200    BEGSR
|    C                     OUT  LDA
03===C                     ENDSR
