      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : DWPC031                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/08/26                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶簡明表                                   *
      ****************************************************************
     FMTMEPF  IP  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FDWPC03P O   E                    DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DME01S
     I                                      606 610 DME01E
     I                                      611 612 DME07S
     I                                      613 614 DME07E
     I                                      615 616 DMD08S
     I                                      617 618 DMD08E
     I                                      621 621 DMD07S
     I                                      622 622 DMD07E
     I                                      623 624 DME08S
     I                                      625 626 DME08E
     I                                      631 636 DME15S
     I                                      641 646 DME15E
     I                                      655 658 DMC03S
     I                                      659 662 DMC03E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100                     *CHK MD0
     C*
  02-C           *IN99     IFEQ '0'
    C                     EXSR RTN200                     *CHAIN OTHPF
    C                     WRITEPD1
  02-C                     END
     C*
      *==============================================================*
      *          RTN100....CHECK DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*通路＆型態
|    C           ME01      CHAINMD0                  40
| 01-C           *IN40     IFEQ '1'
|   C           MD07      ORLT DMD07S
|   C           MD07      ORGT DMD07E
|   C           MD08      ORLT DMD08S
|   C           MD08      ORGT DMD08E
|   C                     MOVE *BLANK    MD07
|   C                     MOVE *BLANK    MD08
|   C                     SETON                     99
| 01*C                     ELSE
|   C           ME15      CHAINMC0                  44
| 02-C           MC03      IFLT DMC03S
|   C           MC03      ORGT DMC03E
|   C                     SETON                     99
| 01*C                     ELSE
|   C                     SETOF                     99
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....CHAIN PF
      *==============================================================*
03===C           RTN200    BEGSR
|    C*********
|    C*業務員
|    C*********
|    C           ME15      CHAINMC0                  44
|    C*
|    C   44                MOVE *BLANK    MC02
|    C*
03===C                     ENDSR
