      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
      *                                                              *
      * PROGRAM NAME : MSOR0461                                      *
      * AUTHER       : MERCURY                                       *
      * CREATE DATE  : 83/06/09                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :月產品銷售（退）退計表                       *
      ****************************************************************
     FSOCDPF  IP  E           K        DISK
     FREWF17  UF  E           K        DISK                      A
     ICD0
     I                                              CD13  L2
     I                                              CD14  L2
     I                                              CD04  L2
     I                                              CD01  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*辦事處
     I                                      600 600 COMP
     I                                      601 601 CD02S
     I                                      602 602 CD02E
B2MODI                                      649 649 DCD13S
B2MODI                                      650 650 DCD13E
B2MODI                                      655 656 DCD14S
B2MODI                                      657 658 DCD14E
B2MODI                                      665 668 DCD10S
B2MODI                                      669 672 DCD10E
      *MM//YY
     I                                      611 6140DCD01
     I                                      611 6120DCD01M
     I                                      613 6140DCD01Y
      *YY/MM--------------------------------------------------------
      *本年月
B2MODI                                      615 6200CD01E
B2MODI                                      615 6180CD01EY
B2MODI                                      619 6200CD01EM
      *螢幕上年下月
B2MODI                                      621 6260CD01S
B2MODI                                      621 6240CD01SY
B2MODI                                      625 6260CD01SM
      *
B2MODI                                      627 627 DSEL
B2MODI                                      628 636 DCD04S
B2MODI                                      637 645 DCD04E
B2MODI                                      674 682 DCD06S
B2MODI                                      683 691 DCD06E
B2MODI                                      709 709 DSEL1
B2MODI                                      754 754 IN20
     I*           DS
     I*                                       1   60CD01
     I*                                       3   40MCD01
     I            DS
B2MODI                                        1   60YM01
B2MODI                                        1   40YY01
B2MODI                                        5   60MM01
     I            DS
B2MODI                                        1   60YM02
B2MODI                                        1   40YY02
B2MODI                                        5   60MM02
     I            DS
B2MODI                                        1   60YM03
B2MODI                                        1   40YY03
B2MODI                                        5   60MM03
     I            DS
B2MODI                                        1   60YM04
B2MODI                                        1   40YY04
B2MODI                                        5   60MM04
     I            DS
B2MODI                                        1   60YM05
B2MODI                                        1   40YY05
B2MODI                                        5   60MM05
     I            DS
B2MODI                                        1   60YM06
B2MODI                                        1   40YY06
B2MODI                                        5   60MM06
     I            DS
B2MODI                                        1   60YM07
B2MODI                                        1   40YY07
B2MODI                                        5   60MM07
     I            DS
B2MODI                                        1   60YM08
B2MODI                                        1   40YY08
B2MODI                                        5   60MM08
     I            DS
B2MODI                                        1   60YM09
B2MODI                                        1   40YY09
B2MODI                                        5   60MM09
     I            DS
B2MODI                                        1   60YM10
B2MODI                                        1   40YY10
B2MODI                                        5   60MM10
     I            DS
B2MODI                                        1   60YM11
B2MODI                                        1   40YY11
B2MODI                                        5   60MM11
     I            DS
B2MODI                                        1   60YM12
B2MODI                                        1   40YY12
B2MODI                                        5   60MM12
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF1706    WORK06
     C           *LIKE     DEFN WF1707    WORK07
     C           *LIKE     DEFN WF1708    WORK08
     C           *LIKE     DEFN WF1709    WORK09
     C           *LIKE     DEFN WF1710    WORK10
     C           *LIKE     DEFN WF1711    WORK11
     C           *LIKE     DEFN WF1712    WORK12
     C           *LIKE     DEFN WF1713    WORK13
     C           *LIKE     DEFN WF1714    WORK14
     C           *LIKE     DEFN WF1715    WORK15
     C           *LIKE     DEFN WF1716    WORK16
     C           *LIKE     DEFN WF1717    WORK17
     C           *LIKE     DEFN WF1718    WORK18
     C           *LIKE     DEFN WF1719    WORK19
     C           *LIKE     DEFN WF1720    WORK20
     C           *LIKE     DEFN WF1721    WORK21
     C           *LIKE     DEFN WF1722    WORK22
     C           *LIKE     DEFN WF1723    WORK23
     C           *LIKE     DEFN WF1724    WORK24
     C           *LIKE     DEFN WF1725    WORK25
     C           *LIKE     DEFN WF1726    WORK26
     C           *LIKE     DEFN WF1727    WORK27
     C           *LIKE     DEFN WF1728    WORK28
     C           *LIKE     DEFN WF1729    WORK29
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF1702
     C                     KFLD           WF1703
     C                     KFLD           WF1704
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C  N10                EXSR RTN010                     *HEADING
     C*
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CLR                   SETON                     LR
      *==============================================================*
      *          RTN010....INIT
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         WORQTY  70
|    C                     Z-ADD0         WORAMT  80
|    C*GET一年之區間月份
B2000C                     Z-ADDCD01SY    YY01
|    C                     Z-ADDCD01SM    MM01
B2000C                     Z-ADDCD01EY    YY12
|    C                     Z-ADDCD01EM    MM12
|    C                     Z-ADD0         YM02
|    C                     Z-ADD0         YM03
|    C                     Z-ADD0         YM04
|    C                     Z-ADD0         YM05
|    C                     Z-ADD0         YM06
|    C                     Z-ADD0         YM07
|    C                     Z-ADD0         YM08
|    C                     Z-ADD0         YM09
|    C                     Z-ADD0         YM10
|    C                     Z-ADD0         YM11
|    C*
|    C           MM01      ADD  1         MM02
| 01-C           MM02      IFGT 12
|   C                     SUB  12        MM02
B2CHKC           YY01      ADD  1         YY02
| 01*C                     ELSE
B2000C                     Z-ADDYY01      YY02
| 01-C                     END
|    C*
|    C           MM01      ADD  2         MM03
| 02-C           MM03      IFGT 12
|   C                     SUB  12        MM03
B2CHKC           YY01      ADD  1         YY03
| 02*C                     ELSE
B2000C                     Z-ADDYY01      YY03
| 02-C                     END
|    C*
|    C           MM01      ADD  3         MM04
| 03-C           MM04      IFGT 12
|   C                     SUB  12        MM04
B2CHKC           YY01      ADD  1         YY04
| 03*C                     ELSE
B2000C                     Z-ADDYY01      YY04
| 03-C                     END
|    C*
|    C           MM01      ADD  4         MM05
| 04-C           MM05      IFGT 12
|   C                     SUB  12        MM05
B2CHKC           YY01      ADD  1         YY05
| 04*C                     ELSE
B2000C                     Z-ADDYY01      YY05
| 04-C                     END
|    C*
|    C           MM01      ADD  5         MM06
| 05-C           MM06      IFGT 12
|   C                     SUB  12        MM06
B2CHKC           YY01      ADD  1         YY06
| 05*C                     ELSE
B2000C                     Z-ADDYY01      YY06
| 05-C                     END
|    C*
|    C           MM01      ADD  6         MM07
| 06-C           MM07      IFGT 12
|   C                     SUB  12        MM07
B2CHKC           YY01      ADD  1         YY07
| 06*C                     ELSE
B2000C                     Z-ADDYY01      YY07
| 06-C                     END
|    C*
|    C           MM01      ADD  7         MM08
| 07-C           MM08      IFGT 12
|   C                     SUB  12        MM08
B2CHKC           YY01      ADD  1         YY08
| 07*C                     ELSE
B2000C                     Z-ADDYY01      YY08
| 07-C                     END
|    C*
|    C           MM01      ADD  8         MM09
| 08-C           MM09      IFGT 12
|   C                     SUB  12        MM09
B2CHKC           YY01      ADD  1         YY09
| 08*C                     ELSE
B2000C                     Z-ADDYY01      YY09
| 08-C                     END
|    C*
|    C           MM01      ADD  9         MM10
| 09-C           MM10      IFGT 12
|   C                     SUB  12        MM10
B2CHKC           YY01      ADD  1         YY10
| 09*C                     ELSE
B2000C                     Z-ADDYY01      YY10
| 09-C                     END
|    C*
|    C           MM01      ADD  10        MM11
| 10-C           MM11      IFGT 12
|   C                     SUB  12        MM11
B2CHKC           YY01      ADD  1         YY11
| 10*C                     ELSE
B2000C                     Z-ADDYY01      YY11
| 10-C                     END
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....SOCDPF 計算數量及金額
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*訂貨及銷退
|    C                     ADD  CD16      WORQTY
|    C                     ADD  CD19      WORQTY
|    C                     SUB  CD20      WORQTY
|    C*
|    C                     ADD  CD24      WORAMT
|    C                     ADD  CD25      WORAMT
|    C                     SUB  CD26      WORAMT
|    C*含搭贈
| 01-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  CD17      WORQTY
|   C                     SUB  CD21      WORQTY
| 01-C                     END
|    C*含試飲
| 02-C           DSEL1     IFEQ '3'
|   C           DSEL1     OREQ '4'
|   C                     ADD  CD18      WORQTY
|   C                     SUB  CD23      WORQTY
| 02-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....將各月份數量金額填入
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
B2000C           CD01      IFEQ YM01
|   C                     Z-ADDWORQTY    WORK06
|   C                     Z-ADDWORAMT    WORK07
| 01-C                     END
|    C*
B2000C           CD01      IFEQ YM02
|   C                     Z-ADDWORQTY    WORK08
|   C                     Z-ADDWORAMT    WORK09
| 02-C                     END
|    C*
B2000C           CD01      IFEQ YM03
|   C                     Z-ADDWORQTY    WORK10
|   C                     Z-ADDWORAMT    WORK11
| 03-C                     END
|    C*
B2000C           CD01      IFEQ YM04
|   C                     Z-ADDWORQTY    WORK12
|   C                     Z-ADDWORAMT    WORK13
| 04-C                     END
|    C*
B2000C           CD01      IFEQ YM05
|   C                     Z-ADDWORQTY    WORK14
|   C                     Z-ADDWORAMT    WORK15
| 05-C                     END
|    C*
B2000C           CD01      IFEQ YM06
|   C                     Z-ADDWORQTY    WORK16
|   C                     Z-ADDWORAMT    WORK17
| 06-C                     END
|    C*
B2000C           CD01      IFEQ YM07
|   C                     Z-ADDWORQTY    WORK18
|   C                     Z-ADDWORAMT    WORK19
| 07-C                     END
|    C*
B2000C           CD01      IFEQ YM08
|   C                     Z-ADDWORQTY    WORK20
|   C                     Z-ADDWORAMT    WORK21
| 08-C                     END
|    C*
B2000C           CD01      IFEQ YM09
|   C                     Z-ADDWORQTY    WORK22
|   C                     Z-ADDWORAMT    WORK23
| 09-C                     END
|    C*
B2000C           CD01      IFEQ YM10
|   C                     Z-ADDWORQTY    WORK24
|   C                     Z-ADDWORAMT    WORK25
| 10-C                     END
|    C*
B2000C           CD01      IFEQ YM11
|   C                     Z-ADDWORQTY    WORK26
|   C                     Z-ADDWORAMT    WORK27
| 11-C                     END
|    C*
B2000C           CD01      IFEQ YM12
|   C                     Z-ADDWORQTY    WORK28
|   C                     Z-ADDWORAMT    WORK29
| 12-C                     END
|    C*
|    C                     Z-ADD0         WORQTY
|    C                     Z-ADD0         WORAMT
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWF17
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
      *統計全年數量
|    C           WORK06    ADD  WORK08    WFTOT1  90
|    C                     ADD  WORK10    WFTOT1
|    C                     ADD  WORK12    WFTOT1
|    C                     ADD  WORK14    WFTOT1
|    C                     ADD  WORK16    WFTOT1
|    C                     ADD  WORK18    WFTOT1
|    C                     ADD  WORK20    WFTOT1
|    C                     ADD  WORK22    WFTOT1
|    C                     ADD  WORK24    WFTOT1
|    C                     ADD  WORK26    WFTOT1
|    C                     ADD  WORK28    WFTOT1
      *統計全年金額
|    C           WF1707    ADD  WF1709    WFTOT2  90
|    C                     ADD  WF1711    WFTOT2
|    C                     ADD  WF1713    WFTOT2
|    C                     ADD  WF1715    WFTOT2
|    C                     ADD  WF1717    WFTOT2
|    C                     ADD  WF1719    WFTOT2
|    C                     ADD  WF1721    WFTOT2
|    C                     ADD  WF1723    WFTOT2
|    C                     ADD  WF1725    WFTOT2
|    C                     ADD  WF1727    WFTOT2
|    C                     ADD  WF1729    WFTOT2
     C*
|    C                     MOVELCD04      WF1701
|    C                     MOVE CD04      WF1702
|    C                     MOVE CD13      WF1703
|    C                     MOVE CD14      WF1704
|    C*
|    C           KEYWF     CHAINWF170                40
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  WORK06    WF1706
|   C                     ADD  WORK07    WF1707
|   C                     ADD  WORK08    WF1708
|   C                     ADD  WORK09    WF1709
|   C                     ADD  WORK10    WF1710
|   C                     ADD  WORK11    WF1711
|   C                     ADD  WORK12    WF1712
|   C                     ADD  WORK13    WF1713
|   C                     ADD  WORK14    WF1714
|   C                     ADD  WORK15    WF1715
|   C                     ADD  WORK16    WF1716
|   C                     ADD  WORK17    WF1717
|   C                     ADD  WORK18    WF1718
|   C                     ADD  WORK19    WF1719
|   C                     ADD  WORK20    WF1720
|   C                     ADD  WORK21    WF1721
|   C                     ADD  WORK22    WF1722
|   C                     ADD  WORK23    WF1723
|   C                     ADD  WORK24    WF1724
|   C                     ADD  WORK25    WF1725
|   C                     ADD  WORK26    WF1726
|   C                     ADD  WORK27    WF1727
|   C                     ADD  WORK28    WF1728
|   C                     ADD  WORK29    WF1729
|   C                     UPDATWF170
|   C*
| 01*C                     ELSE
|   C*
|   C                     Z-ADDWORK06    WF1706
|   C                     Z-ADDWORK07    WF1707
|   C                     Z-ADDWORK08    WF1708
|   C                     Z-ADDWORK09    WF1709
|   C                     Z-ADDWORK10    WF1710
|   C                     Z-ADDWORK11    WF1711
|   C                     Z-ADDWORK12    WF1712
|   C                     Z-ADDWORK13    WF1713
|   C                     Z-ADDWORK14    WF1714
|   C                     Z-ADDWORK15    WF1715
|   C                     Z-ADDWORK16    WF1716
|   C                     Z-ADDWORK17    WF1717
|   C                     Z-ADDWORK18    WF1718
|   C                     Z-ADDWORK19    WF1719
|   C                     Z-ADDWORK20    WF1720
|   C                     Z-ADDWORK21    WF1721
|   C                     Z-ADDWORK22    WF1722
|   C                     Z-ADDWORK23    WF1723
|   C                     Z-ADDWORK24    WF1724
|   C                     Z-ADDWORK25    WF1725
|   C                     Z-ADDWORK26    WF1726
|   C                     Z-ADDWORK27    WF1727
|   C                     Z-ADDWORK28    WF1728
|   C                     Z-ADDWORK29    WF1729
|   C                     WRITEWF170
|   C*
| 01-C                     END
     C*
|   C                     Z-ADD0         WORK06
|   C                     Z-ADD0         WORK07
|   C                     Z-ADD0         WORK08
|   C                     Z-ADD0         WORK09
|   C                     Z-ADD0         WORK10
|   C                     Z-ADD0         WORK11
|   C                     Z-ADD0         WORK12
|   C                     Z-ADD0         WORK13
|   C                     Z-ADD0         WORK14
|   C                     Z-ADD0         WORK15
|   C                     Z-ADD0         WORK16
|   C                     Z-ADD0         WORK17
|   C                     Z-ADD0         WORK18
|   C                     Z-ADD0         WORK19
|   C                     Z-ADD0         WORK20
|   C                     Z-ADD0         WORK21
|   C                     Z-ADD0         WORK22
|   C                     Z-ADD0         WORK23
|   C                     Z-ADD0         WORK24
|   C                     Z-ADD0         WORK25
|   C                     Z-ADD0         WORK26
|   C                     Z-ADD0         WORK27
|   C                     Z-ADD0         WORK28
|   C                     Z-ADD0         WORK29
|    C*
04===C                     ENDSR
