      * ------------------------------------------------------------------------
      *      BYPASS2000 ROUTINES FOR 100.01 MULTIPLY SUBSTITUTION
      * ------------------------------------------------------------------------
     C           HB@FYB    BEGSR                           FLIP YEAR TO BACK
      *
     C                     MOVELHB2@F6    HB2@Y4  4        CCYYMM  INPUT
     C                     MOVE HB2@F6    HB2@MM  2
     C                     MOVE HB2@Y4    HB2@B6  6        MMCCYY  OUTPUT
     C                     MOVELHB2@MM    HB2@B6
     C                     MOVE HB2@Y4    HB2@B4  4        MMYY    OUTPUT
     C                     MOVELHB2@MM    HB2@B4
     C                     ENDSR
      * ------------------------------------------------------------------------
     C           HB@FYF    BEGSR                           FLIP YEAR TO FRONT
      *
     C                     MOVE HB2@B6    HB2@Y4           MMCCYY INPUT
     C                     MOVELHB2@B6    HB2@MM
     C                     MOVE HB2@MM    HB2@F6  6        CCYYMM OUTPUT
     C                     MOVELHB2@Y4    HB2@F6
     C                     ENDSR
      * ------------------------------------------------------------------------
