M001MC*===============================================================
M001MC* MODI CODE | AUTHOR. |   DATE   | DESCRIPTION
M001MC*---------------------------------------------------------------
M001MC* M001      | MICHELLE| 99.04.26 | CHANGE BREAK LEVEL
M001MC*===============================================================
      * ------------------------------------------------------------------------
      *        BYPASS-2000: ADD, REMOVE CENTURY AND SHIFT DATE
      * ------------------------------------------------------------------------
     E                    F          10  1
     E                    T          10  1
     E                    Y           4  1
     E                    D          10  1
     IHB2@FA      DS
     I                                        1   30HB2@FL
     I                                        4   4 HB2@FT
     I                                        5   5 HB2@FF
     IHB2@F       DS
     I                                        1  10 F
     IHB2@TA      DS
     I                                        1   30HB2@TL
     I                                        4   4 HB2@TT
     I                                        5   5 HB2@TF
     IHB2@T       DS
     I                                        1  10 T
     IHB2@W       DS
     I                                        1   4 Y
     I                                        1   4 WY
     I                                        1   40LONGY
     I                                        1   20CENTRY
     I                                        3   40SHORTY
     I                                        5  14 D
     I                                        5  14 WD
LL209I                                       13  14 WD1
V1025I                                        9  14 WD2
LL209I                                        7  14 WD4
LL209I                                       10  14 WD5
V1025I                                       11  14 WD7
     I                                       15  160WSHIFT
V0122I                                       15  16 YSHIFT
      * ------------------------------------------------------------------------
     C           *ENTRY    PLIST
     C                     PARM           HB2@OP  1        OPERATION TO DO
     C                     PARM           HB2@FA           FR-AREA FORMAT
     C                     PARM           HB2@F            FROM AREA
     C                     PARM           HB2@TA           TO-AREA FORMAT
     C                     PARM           HB2@T            TO AREA
     C  N02                DO
V0102 *  year-shift is only for test purposes
V0102 *  it simulates future operations by increasing system dates (like UDATE)
V0102 *  user can select one of the following equivalent ways:
V0102 *
V0102 *  first sample - retrive value from *DTAARA named HBP2SHFY (*CHAR len 2)
V0102C*          *NAMVAR   DEFN HBP2SHFY  YSHIFT
V0102C*                    IN   YSHIFT                 04
V0102 *  second sample - fixed value
V0102C*                    Z-ADD3         WSHIFT
V0102 *  Bypass2000 standard way - external call
V0102C                     CALL 'HBP2DTS'                  RTV Y-SHIFT
V0102C                     PARM           WSHIFT
V0102 *
     C                     SETON                     02
     C                     ENDDO
V1018C           HB2@FT    COMP '0'                  03  03 *ON->SYSTEM
V0137C           HB2@TF    IFNE '5'
V0137C           HB2@TL    IFEQ 3
V0137C           HB2@TL    OREQ 5
V0137C           HB2@TL    OREQ 7
V0137C           HB2@TL    OREQ 9                           FINAL LENGHT
V0137C                     SUB  1         HB2@TL            ADJUSTMENT
V0137C                     ENDIF
V0137C                     ENDIF
V0137C           HB2@FF    IFNE '5'
V0137C           HB2@FL    IFEQ 3
V0137C           HB2@FL    OREQ 5
V0137C           HB2@FL    OREQ 7
V0137C           HB2@FL    OREQ 9                           FROM  LENGHT
V0137C                     SUB  1         HB2@FL            ADJUSTMENT
V0137C                     ENDIF
V0137C                     ENDIF
      *  operations to be performed
     C           HB2@OP    CASEQ'A'       ADDCEN           ADD    CENTURY
     C           HB2@OP    CASEQ'R'       RMVCEN           REMOVE CENTURY
     C           HB2@OP    CASEQ'S'       SHIFTY           SHIFT  YEAR
     C                     END
     C                     RETRN
      * ------------------------------------------------------------------------
     C           ADDCEN    BEGSR                           ADD    CENTURY
     C           11        SUB  HB2@FL    FS      30
     C           11        SUB  HB2@TL    TS      30
     C                     MOVE *ZERO     WD
     C                     MOVE *ZERO     HB2@T
     C                     MOVEAF,FS      D,FS
      * -if spaces no conversion -----------------------               ---------
LL209C           HB2@FF    IFEQ '1'
LL209C           WD1       ANDEQ'  '
LL209C           HB2@FF    OREQ '2'
LL209C           WD2       ANDEQ'      '
LL209C           HB2@FF    OREQ '3'
LL209C           WD2       ANDEQ'      '
LL209C           HB2@FF    OREQ '4'
LL209C           WD4       ANDEQ'        '
LL209C           HB2@FF    OREQ '5'
LL209C           WD5       ANDEQ'     '
LL209C           HB2@FF    OREQ '6'
LL209C           WD7       ANDEQ'    '
LL209C           HB2@FF    OREQ '7'
LL209C           WD7       ANDEQ'    '
LL209C                     MOVE *BLANK    HB2@T
LL209C                     GOTO ADDEND
LL209C                     ENDIF
LC218C*          HB2@TT    IFNE 'X'
LC218C*                    TESTN          WD         01
LC218C*          *IN01     CABEQ*OFF      ADDEND
LC218C*                    ENDIF
V1205C           HB2@FF    IFEQ '2'
LL209C           HB2@FF    OREQ '3'
LL209C           HB2@FF    OREQ '4'
LL209C           HB2@FF    OREQ '5'
LL209C           HB2@FF    OREQ '6'
LL209C           HB2@FF    OREQ '7'
V1025C           WD        CABEQ*ZEROS    ADDEND
V1025C                     ENDIF
     C                     SELEC
     C           HB2@FF    WHEQ '1'
     C           HB2@FF    OREQ '2'
     C           HB2@FF    OREQ '5'
     C           HB2@FF    OREQ '7'
     C                     MOVEAF,FS      Y,3
     C           HB2@FF    WHEQ '3'
     C           HB2@FF    OREQ '4'
     C           HB2@FF    OREQ '6'
     C                     MOVEAF,9       Y,3
     C                     ENDSL
VM290C*  03                ADD  WSHIFT    SHORTY
CCISDC*          SHORTY    IFGT 50
CCISAC*M001M     SHORTY    IFGE 40
M001MC           SHORTY    IFGE 30
     C                     Z-ADD19        CENTRY
     C                     ELSE
     C                     Z-ADD20        CENTRY
     C                     ENDIF
V1025C           HB2@FF    IFEQ '2'
V1025C           WD2       ANDEQ'999999'
LL209C           HB2@FF    OREQ '3'
LL209C           WD2       ANDEQ'999999'
LL209C           HB2@FF    OREQ '4'
LL209C           WD4       ANDEQ'99999999'
LL209C           HB2@FF    OREQ '5'
LL209C           WD5       ANDEQ'99999'
LL209C           HB2@FF    OREQ '6'
LL209C           WD7       ANDEQ'9999'
V1025C           HB2@FF    OREQ '7'
V1025C           WD7       ANDEQ'9999'
V1025C                     Z-ADD99        CENTRY
VM290C                     ELSE
VM290C   03                ADD  WSHIFT    LONGY
V1025C                     ENDIF
     C                     SELEC
     C           HB2@FF    WHEQ '1'
     C                     MOVEAY,1       T,TS
     C           HB2@FF    WHEQ '2'
     C           HB2@FF    OREQ '5'
     C           HB2@FF    OREQ '7'
     C                     MOVEAY,1       T,TS
     C                     ADD  2         FS
     C                     ADD  4         TS
LC218C           TS        CABGT10        ADDEND
     C                     MOVEAF,FS      T,TS
LC218C           HB2@FF    WHEQ '3'
LC218C           HB2@FL    ANDEQ6
LC218C           HB2@TF    ANDEQ'6'
LC218C           HB2@TL    ANDEQ6
LC218C                     ADD  2         FS
LC218C                     MOVEAF,FS      T,TS
LC218C                     MOVEAWY        T,7
     C           HB2@FF    WHEQ '3'
     C           HB2@FF    OREQ '4'
     C           HB2@FF    OREQ '6'
     C                     MOVEAF,FS      T,TS
     C                     MOVEAWY        T,7
     C                     ENDSL
     C           ADDEND    ENDSR
      * ------------------------------------------------------------------------
     C           RMVCEN    BEGSR                           REMOVE CENTURY
     C           11        SUB  HB2@FL    FS      30
     C           11        SUB  HB2@TL    TS      30
     C                     MOVE *ZERO     WD
     C                     MOVE *ZERO     HB2@T
     C                     MOVEAF,FS      D,FS
     C           HB2@TT    IFNE 'X'
     C                     TESTN          WD         01
     C           *IN01     CABEQ*OFF      RMVEND
     C                     ENDIF
     C                     SELEC
     C           HB2@FF    WHEQ '1'
     C           HB2@FF    OREQ '2'
     C           HB2@FF    OREQ '5'
     C           HB2@FF    OREQ '7'
     C                     ADD  2         FS
     C                     MOVEAF,FS      T,TS
LC218C           HB2@FF    WHEQ '3'
LC218C           HB2@FL    ANDEQ8
LC218C           HB2@TF    ANDEQ'6'
LC218C           HB2@TL    ANDEQ4
LC218C                     ADD  2         FS
LC218C                     MOVEAF,FS      T,TS
LC218C                     MOVEAF,9       T,9
     C           HB2@FF    WHEQ '3'
     C           HB2@FF    OREQ '4'
     C           HB2@FF    OREQ '6'
     C                     MOVEAF,FS      T,TS
     C                     MOVEAF,9       T,9
     C                     ENDSL
     C           RMVEND    ENDSR
      * ------------------------------------------------------------------------
     C           SHIFTY    BEGSR                           SHIFT  YEAR
     C           11        SUB  HB2@FL    FS      30
     C           11        SUB  HB2@TL    TS      30
     C                     MOVE *ZERO     WD
     C                     MOVE *ZERO     HB2@T
     C                     MOVEAF,FS      D,FS
     C           HB2@TT    IFNE 'X'
     C                     TESTN          WD         01
     C           *IN01     CABEQ*OFF      SHFEND
     C                     ENDIF
VM290C           WD        IFEQ *ZERO
VM290C           HB2@FF    OREQ '2'
VM290C           WD2       ANDEQ'999999'
VM290C           HB2@FF    OREQ '3'
VM290C           WD2       ANDEQ'999999'
VM290C           HB2@FF    OREQ '4'
VM290C           WD4       ANDEQ'99999999'
VM290C           HB2@FF    OREQ '5'
VM290C           WD5       ANDEQ'99999'
VM290C           HB2@FF    OREQ '6'
VM290C           WD7       ANDEQ'9999'
VM290C           HB2@FF    OREQ '7'
VM290C           WD7       ANDEQ'9999'
VM290C                     MOVEAF,FS      T,TS
VM290C                     GOTO SHFEND
VM290C                     ENDIF
     C                     SELEC
LC256C           HB2@FF    WHEQ '1'
LC256C           HB2@FL    ANDEQ4
LC256C           HB2@TF    ANDEQ'1'
LC256C           HB2@TL    ANDEQ2
LC256C                     MOVEAF,FS      Y,1
LC256C                     ADD  WSHIFT    LONGY
LC256C                     MOVEAY,1       F,FS
LC256C                     ADD  2         FS
V1202C           HB2@FF    WHEQ '1'
V1202C           HB2@FL    ANDEQ4
V1202C           HB2@FF    OREQ '2'
V1202C           HB2@FL    ANDEQ8
V1202C           HB2@FF    OREQ '5'
V1202C           HB2@FL    ANDEQ7
V1202C           HB2@FF    OREQ '7'
V1202C           HB2@FL    ANDEQ6
V1202C                     MOVEAF,FS      Y,1
V1202C                     ADD  WSHIFT    LONGY
V1202C                     MOVEAY,1       F,FS
     C           HB2@FF    WHEQ '1'
     C           HB2@FF    OREQ '2'
     C           HB2@FF    OREQ '5'
     C           HB2@FF    OREQ '7'
     C                     MOVEAF,FS      Y,3
     C                     ADD  WSHIFT    SHORTY
     C                     MOVEAY,3       F,FS
LC256C           HB2@FF    WHEQ '3'
LC256C           HB2@FL    ANDEQ8
LC256C           HB2@TF    ANDEQ'1'
LC256C           HB2@TL    ANDEQ2
LC256C                     MOVEAF,7       Y,1
LC256C                     ADD  WSHIFT    LONGY
LC256C                     MOVEAY,1       F,7
LC256C                     ADD  6         FS
V1202C           HB2@FF    WHEQ '3'
V1202C           HB2@FL    ANDEQ8
V1202C           HB2@FF    OREQ '4'
V1202C           HB2@FL    ANDEQ10
V1202C           HB2@FF    OREQ '6'
V1202C           HB2@FL    ANDEQ6
V1202C                     MOVEAF,7       Y,1
V1202C                     ADD  WSHIFT    LONGY
V1202C                     MOVEAY,1       F,7
LC256C           HB2@FF    WHEQ '3'
LC256C           HB2@FL    ANDEQ6
LC256C           HB2@TF    ANDEQ'1'
LC256C           HB2@TL    ANDEQ2
LC256C                     MOVEAF,9       Y,3
LC256C                     ADD  WSHIFT    SHORTY
LC256C                     MOVEAY,3       F,9
LC256C                     ADD  4         FS
     C           HB2@FF    WHEQ '3'
     C           HB2@FF    OREQ '4'
     C           HB2@FF    OREQ '6'
     C                     MOVEAF,9       Y,3
     C                     ADD  WSHIFT    SHORTY
     C                     MOVEAY,3       F,9
     C                     ENDSL
     C                     MOVEAF,FS      T,TS
     C           SHFEND    ENDSR
