     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : IMA010                                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/04/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :禮盒組拆作業處理 (A/U/D/I)                *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.16 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 123199 = 123129
     A*---------------------------------------------------------------
     A*   M003     | 99.1.20  | MICHELLE | DELETE IMILPF
     A*===============================================================
     A****************************************************************
     FIMIMPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FIMIAPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMAPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FIMILPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FIMIMLF1 IF  E           K        DISK
     F            IM0                               KRENAMEIM0L
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FMTMFPF  UF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
B2CHKFIMA010D CF  E                    WORKSTN
B2INF *CVR3009 sev.30 DISPLAY file IMA010D must be converted, because
B2INF *   field IM10 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert IMA010D, enlarging IM10
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     F                                              KINFDS DSPFDS
     F                                        RRN   KSFILE SFLSR
     E*: FUNCTION DATA :
     E                    WFUN    6   6  6
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
M001AI                                      201 2080DATE
M001AI                                      201 2060WDATE
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I*                                     514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I            DS
     I                                        1   2 DIM01
     I                                        1   1 DIM01L
     I            DS
     I                                        1   60DIM10
     I* FOR UPDATE 調整日期年份不能修改
     I                                        5   60IM105N
     I* FOR UPDATE 調整日期年月須＞結案年月
     I                                        1   20IM10M
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN    40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
      *  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY1
     C           *LIKE     DEFN DBGN2     OBGN2            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BUTTOM
      *MM/DD/YY--->YY/MM/DD
     C           *LIKE     DEFN DBGN1     DBGN1D+ 2        *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN1     BBGN1D+ 2        *SUBFIL BUTTOM
     C*
     C           *LIKE     DEFN IA10      WIA10
     C*
     C                     MOVE *BLANK    WBOTOM  1
     C           *LIKE     DEFN RRN       WRRN
     C           *LIKE     DEFN RRN       WPRCD
     C           *LIKE     DEFN RRN       DSPRCD
      *
     C           *LIKE     DEFN MA26      TMA26
     C           *LIKE     DEFN MA27      TMA27
     C           *LIKE     DEFN MA28      TMA28
     C           *LIKE     DEFN MA31      KMA31
     C           *LIKE     DEFN MA32      KMA32
     C           *LIKE     DEFN MA33      KMA33
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYIM2    KLIST
     C                     KFLD           DBGN1D
     C                     KFLD           DBGN2
     C           KEYIM4    KLIST
     C                     KFLD           IM02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#B     KLIST
     C                     KFLD           DIM01
     C           KEYMA     KLIST
     C                     KFLD           DIM05
     C           KEYIA     KLIST
     C                     KFLD           IA01
     C                     KFLD           IA02
     C                     KFLD           IA03
     C           KEYIL     KLIST
     C                     KFLD           IL02
     C                     KFLD           IL05
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
M002MC                     Z-ADD123129    OBGN1
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     MOVE *ALL'0'   *IN,60
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN110
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $RMK01    WA01,6
|    C                     MOVE 'SCR001'  APPSCR
|    C*
|    C*M001D               Z-ADD0         DATE    60
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
|    C*                    PARM $EGMDY    S001I2  60
|    C*M001D     DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9699
| 01*C                     ELSE
|   C                     EXSR RTN200
| 02-C           DRRN      IFGT 0
|   C           DRRN      SUB  1         HRRN
| 02-C                     END
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 01-C                     END
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*
      *
| 01-C           DBGN1     IFEQ 0
|   C                     Z-ADD0         HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
| 01*C                     ELSE
| 02-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C                     Z-ADD0         HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
| 02*C                     ELSE
|   C                     EXSR RTN171
| 03-C           *IN99     IFEQ '0'
| 04-C           RRN       IFGT 1
|   C           RRN       SUB  1         HRRN
| 04*C                     ELSE
|   C                     Z-ADDRRN       HRRN
| 04-C                     END
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR                  5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANKS
|   C           *IN12     ANDEQ'0'
|   C                     EXSR RTN180                     *CHK
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN       DRRN
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C                     UPDATSFLSR
|   C                     READCSFLSR                    57*NF
|   C*
| 01-C                     END                             *57 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
|   C**                   Z-ADDRRN       DRRN
| 01-C                     END
|    C   99                GOTO END180
|    C*
| 02-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
|   C           DOPT1     OREQ '6'
      *IM07 '*'=待確認  ' '=已確認
| 03-C           IM07      IFEQ *BLANKS
|   C                     SETON                     608899
| 03-C                     END
      *IM09 'V'=已結帳
| 04-C           IM09      IFEQ 'V'
|   C                     SETON                     608799
| 04-C                     END
| 02-C                     END
|    C   99                GOTO END180
|    C*
| 05-C           DOPT1     IFEQ '6'
      *
|   C           IM01      CHAIN#B0                  40
B2???C           WDATE     IFLE #B16
B2INF *CVR5011 sev.50 Field WDATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C                     SETON                     608699
| 06-C                     END
| 05-C                     END
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN       DRRN
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         WRRN
|    C                     Z-ADD10        WPRCD
|    C*                    Z-ADD0         DSPRCD
|    C           HRRN      DIV  WPRCD     DSPRCD
|    C                     MULT WPRCD     DSPRCD
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR
|    C                     SETOF                     52
      *
| 01-C           DBGN1     IFEQ 0
M002MC                     Z-ADD123129    DBGN1
| 01-C                     END
      *
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DBGN1     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    DBGN1D
|    C*
B2???C           KEYIM2    SETLLIM0L
B2INF *CVR5011 sev.50 Field DBGN1D is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR0001 sev.00 Field DBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field IM02 is not a date or year
|    C                     MOVE DBGN1     BBGN1
|    C                     MOVE DBGN2     BBGN2
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
|   C                     EXSR RTN193
|   C                     Z-ADD0         WIM101  60
M001AC                     Z-ADDIM10      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C           WIM101    PARM           S001O1  60
      *
B2000C                     Z-ADDIM10      BBGN1D
|   C                     Z-ADDWIM101    BBGN1
|   C                     MOVE IM02      BBGN2
|   C**         *LOVAL    SETLLIM0L
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANK    DOPT1
|    C                     Z-ADDWRRN      RRN
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN       DOWLTDSPRCD
|   C                     READ IM0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
      *
|   C                     SETOF                     45
| 03-C           $WRHUS    IFNE '*ALL'
| 04-C           $WRHUS    IFNE *BLANKS
| 05-C           $WRHUS    IFNE IM03
|   C                     SETON                     45
| 05-C                     END
| 04*C                     ELSE
|   C                     MOVELIM03      WQUERY  1
| 06-C           WQUERY    IFNE $WRHTY
|   C                     SETON                     45
| 06-C                     END
| 04-C                     END
| 03-C                     END
      *
| 07-C           *IN45     IFEQ '0'
|   C                     ADD  1         RRN
|   C                     EXSR RTN194
|   C                     WRITESFLSR
| 07-C                     END
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN       DRRN
|    C                     Z-ADDRRN       WRRN
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN194... DATA MOVE                                 *
      *==============================================================*
09===C           RTN194    BEGSR
|    C*
|    C* GET型態
|    C                     SELEC
|    C           IM04      WHEQ '0'
|    C                     MOVE '組裝'  TYPE
|    C           IM04      WHEQ '1'
|    C                     MOVE '拆解'  TYPE
|    C                     ENDSL
|    C* GET禮盒簡稱
|    C           IM05      CHAINMA0                  40
|    C   40                MOVE *BLANKS   MA03
|    C           *LOVAL    SETLLMA0
|    C*
|    C* GET日期轉換
M001AC                     Z-ADDIM10      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DIM10     PARM           S001O1  60
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
10===C           RTN195    BEGSR
|    C*
| 01-C           RRN       IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
11===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
|   C           DOPT1     CASEQ'6'       RTN250           *CHK
| 01-C                     END
|    C           *LOVAL    SETLLIM0
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
12===C           RTN210    BEGSR
|    C*
|    C                     SETON                     3031  *ADD MSG
|    C                     SETOF                     32
|    C                     EXSR RTN251                     *CLR FIELD
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR RTN253
|   C                     EXSR RTN254
|   C                     EXSR RTN25A
|   C                     WRITEIM0
|   C                     MOVE 'SCR001'  APPSCR
|   C                     SETON                     70
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
13===C           RTN220    BEGSR
|    C*
|    C           KEYIM4    CHAINIM0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     Z-ADDIM105N    IM105O  20
|    C*
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     3032
|   C                     SETON                     31    *CAN INPUT
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C*          KEYIM4    CHAINIM0                  41
|   C                     EXSR RTN253
|   C                     EXSR RTN254
|   C                     EXSR RTN25A
|   C                     UPDATIM0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
14===C           RTN230    BEGSR
|    C*
|    C           KEYIM4    CHAINIM0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     303132*NO INPUT
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C*
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 03-C           DLTFLG    IFEQ 'Y'
|   C*M003M               EXSR RTN254
M003MC                     EXSR RTNDLT                     DLT IMILPF
|   C                     EXSR RTN25A
|   C                     DELETIM0
| 03-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 02-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
15===C           RTN240    BEGSR
|    C*
|    C           KEYIM4    CHAINIM0                  40
|    C           *LOVAL    SETLLIM0
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     303132*NO INPUT
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     Z-ADDRRN       DRRN
| 02-C                     END
|   C*
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN250....CHK DATA
      *==============================================================*
16===C           RTN250    BEGSR
|    C*
|    C           KEYIM4    CHAINIM0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     3031
|    C                     SETON                     32
|    C*
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     EXSR RTN280
|   C*
| 03-C           *IN99     IFEQ '0'
|   C           *IN04     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C                     EXSR RTN253
|   C                     UPDATIM0
|   C                     EXSR RTN29F
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
16===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
17===CSR         RTN251    BEGSR
|    C*
|    C                     MOVE *BLANKS   DIM01
|    C                     MOVE *BLANKS   #B03
|    C                     MOVE *BLANKS   DIM02
|    C                     MOVE '0'       DIM04
|    C                     MOVE *BLANKS   DIM05
|    C                     MOVE *BLANKS   HIM05
|    C                     MOVE *BLANKS   MA03
|    C                     MOVE *BLANKS   DIM03
|    C                     MOVE *BLANKS   HIM03
|    C                     MOVE *BLANKS   D#A03
|    C                     Z-ADD0         DIM06
|    C                     Z-ADD0         HIM06
|    C                     Z-ADD0         DIM08
|    C                     MOVE *BLANKS   IM09
|    C                     Z-ADD$EGMDY    DIM10
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
18===CSR         RTN252    BEGSR
|    C*
|    C                     MOVE IM01      DIM01
|    C* GET公司簡稱
|    C           KEY#B     CHAIN#B0                  40
|    C   40                MOVE *BLANKS   #B03
|    C*
|    C                     MOVE IM02      DIM02
|    C                     MOVE IM04      DIM04
|    C                     MOVE IM05      HIM05
|    C                     MOVE IM05      DIM05
|    C                     Z-ADDIM06      DIM06
|    C                     Z-ADDIM06      HIM06
|    C*
|    C* GET日期轉換
M001AC                     Z-ADDIM10      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DIM10     PARM           S001O1  60
|    C*
|    C* GET禮盒簡稱
|    C           KEYMA     CHAINMA0                  40
|    C   40                MOVE *BLANKS   MA03
|    C           *LOVAL    SETLLMA0
|    C* GET物流點
|    C                     MOVE *BLANKS   D#A03
|    C                     MOVE IM03      DIM03
|    C                     MOVE IM03      HIM03
|    C                     MOVE *BLANKS   #A01
|    C                     MOVEL'STORAGE '#A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVELIM03      #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 01*C                     ELSE
|   C           IM03      CHAINME0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELME04      D#A03
| 02-C                     END
| 01-C                     END
|    C* GET轉換日期
B2CHKC           DOPT1     IFEQ '6'
B2INF *CVR0001 sev.00 Field DOPT1 is not a date or year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C           IM08      ANDEQ0
|   C                     Z-ADD$EGMDY    DIM08
| 03*C                     ELSE
M001AC                     Z-ADDIM08      W6
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C           DIM08     PARM           S001O1  60
| 03-C                     END
|    C*
18===CSR                   ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
19===CSR         RTN253    BEGSR
|    C*
|    C* GET日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DIM10     S001I2  60
B2???C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    IM10
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C**
| 01-C           DOPT1     IFEQ '1'
|   C                     MOVE '*'       IM07
|   C                     MOVE *BLANKS   IM09
|   C                     MOVE *BLANKS   WMODE   2
| 02-C           DIM04     IFEQ '0'
|   C                     MOVE 'G1'      WMODE
| 02-C                     END
| 03-C           DIM04     IFEQ '1'
|   C                     MOVE 'G2'      WMODE
| 03-C                     END
|   C* GET 組拆單號採番
|   C                     CALL 'RES013'
|   C                     PARM DIM01     S013I1  2
|   C                     PARM WMODE     S013I2  2
|   C                     PARM IM105N    S013I3  20
|   C           DIM02     PARM           S013O1 12
| 01-C                     END
|    C*
| 04-C           DOPT1     IFEQ '6'
|   C                     MOVE *BLANKS   IM07
|   C* GET轉換日期
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DIM08     S001I2  60
B2???C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    IM08
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C*
| 04*C                     ELSE
|   C                     MOVE DIM01     IM01
|   C                     MOVE DIM02     IM02
|   C                     MOVE DIM03     IM03
|   C                     MOVE DIM04     IM04
|   C                     MOVE DIM05     IM05
|   C                     Z-ADDDIM06     IM06
|   C* GET轉換日期
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DIM08     S001I2  60
B2???C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    IM08
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
| 04-C                     END
|    C**
B2???C                     Z-ADDDATE      IMXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IMYY
|    C                     MOVE $USER     IMZZ
|    C*
19===CSR                   ENDSR
      *==============================================================*
      *          RTN254....MOVE SCREEN DATA TO FILE
      *==============================================================*
20===CSR         RTN254    BEGSR
      ****************
|    C* DELETE IMILPF
      ****************
|    C           DIM02     SETLLIL0
|    C           DIM02     READEIL0                      44
| 01-C           *IN44     DOWEQ'0'
|   C                     DELETIL0
|   C           DIM02     READEIL0                      44
| 01-C                     END
      ****************
|    C* WRITE  IMILPF
      ****************
| 02-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '2'
      *
|   C           DIM05     SETLLMF0
|   C           DIM05     READEMF0                      44
| 03-C           *IN44     DOWEQ'0'
      *副屬品
| 04-C           MF07      IFNE 'Y'
B2???C                     Z-ADDDATE      ILXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           ILYY
|   C                     MOVE $USER     ILZZ
|   C*
|   C                     MOVE DIM02     IL02
|   C                     MOVE MF02      IL05
|   C                     MOVE DIM03     IL03
|   C                     MOVE DIM01     IL01
|   C           DIM06     MULT MF04      IL06
| 05-C           DIM04     IFEQ '0'
|   C                     Z-ADD-1        IL07
| 05-C                     END
| 06-C           DIM04     IFEQ '1'
|   C                     Z-ADD1         IL07
| 06-C                     END
|   C*
B2000C                     Z-ADDIM10      IL04
|   C                     Z-ADD0         IL08
|   C                     Z-ADD0         IL09
|   C                     Z-ADD0         IL10
|   C                     WRITEIL0
      *
| 04-C                     END
|   C           DIM05     READEMF0                      44
| 03-C                     END
| 02-C                     END
|    C           *LOVAL    SETLLMF0
|    C*
|    C                     MOVE DIM02     IL02
|    C                     MOVE DIM05     IL05
|    C           KEYIL     CHAINIL0                  44
B2000C                     Z-ADDIM10      IL04
|    C                     Z-ADD0         IL08
|    C                     Z-ADD0         IL09
|    C                     Z-ADD0         IL10
|    C*
B2???C                     Z-ADDDATE      ILXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           ILYY
|    C                     MOVE $USER     ILZZ
|    C*
| 07-C           *IN44     IFEQ '1'
|   C                     MOVE DIM01     IL01
|   C                     MOVE DIM03     IL03
|   C                     Z-ADDDIM06     IL06
| 08-C           DIM04     IFEQ '0'
|   C                     Z-ADD1         IL07
| 08-C                     END
| 09-C           DIM04     IFEQ '1'
|   C                     Z-ADD-1        IL07
| 09-C                     END
|   C                     WRITEIL0
| 07*C                     ELSE
|   C                     UPDATIL0
| 07-C                     END
|    C*
20===CSR                   ENDSR
      *==============================================================*
M003A *          RTNDLT....DLT IMILPF
      *==============================================================*
     CSR         RTNDLT    BEGSR
      ****************
     C* DELETE IMILPF
      ****************
M003AC           DIM02     SETLLIL0
M003AC           DIM02     READEIL0                      44
  01-C           *IN44     DOWEQ'0'
    C                     DELETIL0
    C           DIM02     READEIL0                      44
  01-C                     END
M0013CSR                   ENDSR
      *==============================================================*
      *          RTN25A....UPDATE IMIAPF
      *==============================================================*
21===CSR         RTN25A    BEGSR
      *----------------------------------------------------------------
      *保留量 A,U,D
| 01-C           DOPT1     IFNE '6'
| 02-C           DIM04     IFEQ '0'
      *組------------------------------------------------------------
|   C           DIM05     SETLLMF0
|   C           DIM05     READEMF0                      45
| 03-C           *IN45     DOWEQ'0'
| 04-C           MF07      IFNE 'Y'
|   C                     Z-ADD0         WORK
| 05-C           DOPT1     IFEQ '4'
|   C                     SUB  HIM06     WORK
| 05*C                     ELSE
| 06-C           DOPT1     IFEQ '2'
| 07-C           DIM03     IFEQ HIM03
|   C           DIM05     ANDEQHIM05
|   C                     SUB  HIM06     WORK
| 07-C                     END
| 06-C                     END
|   C                     ADD  DIM06     WORK
| 05-C                     END
|   C                     MULT MF04      WORK
      *
|   C                     MOVELDIM01     IA01
|   C                     MOVELDIM03     IA02
|   C                     MOVELMF02      IA03
|   C           KEYIA     CHAINIA0                  40
| 08-C           *IN40     IFEQ '0'
|   C                     ADD  WORK      IA09
|   C                     SUB  WORK      IA10
|   C                     UPDATIA0
| 08-C                     END
| 04-C                     END
|   C           DIM05     READEMF0                      45
| 03-C                     END
|   C           *LOVAL    SETLLMF0
      *組------------------------------------------------------------
| 02*C                     ELSE
      *拆------------------------------------------------------------
      *異動保留量
|   C                     Z-ADD0         WORK
| 09-C           DOPT1     IFEQ '4'
|   C                     SUB  HIM06     WORK
| 09*C                     ELSE
| 10-C           DOPT1     IFEQ '2'
|   C           DIM03     ANDEQHIM03
|   C           DIM05     ANDEQHIM05
|   C                     SUB  HIM06     WORK
| 10-C                     END
|   C                     ADD  DIM06     WORK
| 09-C                     END
|   C                     MOVELDIM01     IA01
|   C                     MOVELDIM03     IA02
|   C                     MOVELDIM05     IA03
|   C           KEYIA     CHAINIA0                  40
| 11-C           *IN40     IFEQ '0'
|   C                     ADD  WORK      IA09
|   C                     SUB  WORK      IA10
|   C                     UPDATIA0
| 11-C                     END
      *
      *拆------------------------------------------------------------
| 02-C                     END
| 01-C                     END                             DOPT1='6'
      *----------------------------------------------------------------
      *保留量－－－＞物留點或產品不同
| 12-C           DOPT1     IFEQ '2'
| 13-C           DIM03     IFNE HIM03
|   C           DIM05     ORNE HIM05
| 14-C           DIM04     IFEQ '0'
      *組------------------------------------------------------------
|   C           HIM05     SETLLMF0
|   C           HIM05     READEMF0                      45
| 15-C           *IN45     DOWEQ'0'
| 16-C           MF07      IFNE 'Y'
|   C                     Z-ADD0         WORK
|   C                     ADD  HIM06     WORK
|   C                     MULT MF04      WORK
      *
|   C                     MOVELDIM01     IA01
|   C                     MOVELHIM03     IA02
|   C                     MOVELMF02      IA03
|   C           KEYIA     CHAINIA0                  40
| 17-C           *IN40     IFEQ '0'
|   C                     SUB  WORK      IA09
|   C                     ADD  WORK      IA10
|   C                     UPDATIA0
| 17-C                     END
| 16-C                     END
|   C           HIM05     READEMF0                      45
| 15-C                     END
|   C           *LOVAL    SETLLMF0
      *組------------------------------------------------------------
| 14*C                     ELSE
      *拆------------------------------------------------------------
      *異動保留量
|   C                     Z-ADD0         WORK
|   C                     ADD  HIM06     WORK
|   C                     MOVELDIM01     IA01
|   C                     MOVELHIM03     IA02
|   C                     MOVELHIM05     IA03
|   C           KEYIA     CHAINIA0                  40
| 18-C           *IN40     IFEQ '0'
|   C                     SUB  WORK      IA09
|   C                     ADD  WORK      IA10
|   C                     UPDATIA0
| 18-C                     END
      *
      *拆------------------------------------------------------------
| 14-C                     END
      *----------------------------------------------------------------
| 13-C                     END
| 12-C                     END
|    C           *LOVAL    SETLLMF0
|    C*
21===CSR                   ENDSR
      *==============================================================*
      *          RTN270....F5 -- 參考資料
      *==============================================================*
22===CSR         RTN270    BEGSR
|    C*
|    C                     EXSR RTN280
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 01-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 01-C                     END
|    C                     SETON                     99
|    C*
22===C                     ENDSR
      *==============================================================*
      *          RTN280....CHECK 'SC02' SCREEN
      *==============================================================*
23===CSR         RTN280    BEGSR
|    C* CHK公司別
| 01-C           DIM01     IFEQ *BLANKS
|   C                     MOVE *BLANKS   #B03
|   C                     SETON                     609399
| 01*C                     ELSE
|   C           KEY#B     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C           DIM01L    OREQ 'C'
|   C                     SETON                     608999
|   C                     MOVE *BLANK    #B03
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END280
|    C* CHK型態
| 03-C           DIM04     IFEQ *BLANKS
|   C                     SETON                     619399
| 03-C                     END
|    C   99                GOTO END280
|    C*
|    C* CHK調整日期
| 04-C           DIM10     IFEQ *ZEROS
|   C                     SETON                     659399
| 04*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DIM10     P0901I  60
|   C                     PARM           P0901O  1
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     659099
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END280
|    C*年份不得修改
| 06-C           DOPT1     IFEQ '2'
|   C           IM105N    ANDNEIM105O
|   C                     SETON                     658899
| 06-C                     END
|    C   99                GOTO END280
|    C* UPDATE -- 年月須＞結案年月
| 07-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '2'
|   C*M001D               MOVELIM105N    IM10MO  40       * 結案年月
|   C*M001D               MOVE IM10M     IM10MO  40       * 結案年月
M001AC                     MOVE IM105N    HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    FYY4    40
M001MC                     MOVELFYY4      IM10MO  60       * 結案年月
M001MC                     MOVE IM10M     IM10MO  60       * 結案年月
|   C           DIM01     CHAIN#B0                  40
B2???C           *IN40     IFEQ '0'
B2INF *CVR5011 sev.50 Field IM10MO is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C           IM10MO    ANDLE#B16
|   C                     SETON                     658699
| 08-C                     END
| 07-C                     END
|    C   99                GOTO END280
|    C* CHK禮盒代號
| 09-C           DIM05     IFEQ *BLANKS
|   C                     SETON                     629399
|   C                     MOVE *BLANKS   MA03
| 09*C                     ELSE
      *禮盒結購是否確認
|   C           DIM05     CHAINMF0                  40
|   C           *LOVAL    SETLLMF0
| 10-C           *IN40     IFEQ '0'
| 11-C           MF10      IFNE 'V'
|   C                     SETON                     628399
| 11-C                     END
| 10*C                     ELSE
|   C                     SETON                     628399
| 10-C                     END
|   C   99                GOTO END280
      *是否為禮盒碼
|   C           KEYMA     CHAINMA0                  40
| 12-C           *IN40     IFEQ '0'
|   C           *LOVAL    SETLLMA0
| 13-C           MA54      IFNE 'Y'
|   C                     SETON                     628999
|   C                     MOVE *BLANKS   MA03
| 13-C                     END
| 12*C                     ELSE
|   C                     SETON                     628999
|   C                     MOVE *BLANKS   MA03
| 12-C                     END
| 09-C                     END
|    C   99                GOTO END280
|    C* CHK物流點
|    C                     MOVE *BLANKS   D#A03
| 14-C           DIM03     IFEQ *BLANKS
|   C                     SETON                     639399
| 14*C                     ELSE
|   C* CHK物流點第一碼是否＝Ｗ，Ｂ
|   C                     MOVELDIM03     WFIRW   1
| 15-C           WFIRW     IFEQ 'W'
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELDIM03     #A02
|   C           KEY#A     CHAIN#A0                  40
| 16-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 16*C                     ELSE
|   C                     SETON                     638999
|   C                     MOVE *BLANKS   D#A03
| 16-C                     END
| 15*C                     ELSE
|   C           DIM03     CHAINME0                  40
| 17-C           *IN40     IFEQ '0'
|   C                     MOVELME04      D#A03
| 17*C                     ELSE
|   C                     SETON                     638499
| 17-C                     END
| 15-C                     END
| 14-C                     END
|    C   99                GOTO END280
|    C* CHK數量
| 18-C           DIM06     IFEQ *ZEROS
|   C                     SETON                     649399
| 18*C                     ELSE
      *----------------------------------------------------------------
| 19-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '2'
|   C                     Z-ADD0         WORK
| 20-C           DOPT1     IFEQ '2'
|   C           HIM03     ANDEQDIM03
|   C           HIM05     ANDEQDIM05
|   C                     SUB  HIM06     WORK
| 20-C                     END
|   C                     ADD  DIM06     WORK
      *組
| 21-C           DIM04     IFEQ '0'
|   C           DIM05     SETLLMF0
|   C           DIM05     READEMF0                      44
| 22-C           *IN44     DOWEQ'0'
| 23-C           MF07      IFNE 'Y'
|   C                     MOVELDIM01     IA01
|   C                     MOVE DIM03     IA02
|   C                     MOVE MF02      IA03
|   C           KEYIA     CHAINIA0                  40
|   C           *LOVAL    SETLLIA0
| 24-C           *IN40     IFEQ '0'
|   C           WORK      MULT MF04      WIA10
|   C           IA10      SUB  WIA10     WIA10
| 25-C           WIA10     IFLT 0
|   C                     SETON                     648599
|   C           *LOVAL    SETLLMF0
|   C   99                GOTO END280
| 25-C                     END
| 24*C                     ELSE
|   C                     SETON                     648599
|   C           *LOVAL    SETLLMF0
|   C   99                GOTO END280
| 24-C                     END
| 23-C                     END
|   C           DIM05     READEMF0                      44
| 22-C                     END
|   C           *LOVAL    SETLLMF0
| 21-C                     END
      *拆
| 26-C           DIM04     IFEQ '1'
|   C                     MOVELDIM01     IA01
|   C                     MOVE DIM03     IA02
|   C                     MOVE DIM05     IA03
|   C           KEYIA     CHAINIA0                  40
|   C           *LOVAL    SETLLIA0
| 27-C           *IN40     IFEQ '0'
|   C           IA10      SUB  WORK      WIA10
| 28-C           WIA10     IFLT 0
|   C                     SETON                     648599
| 28-C                     END
| 27*C                     ELSE
|   C                     SETON                     648599
| 27-C                     END
| 26-C                     END
| 19-C                     END
      *----------------------------------------------------------------
| 18-C                     END
|    C   99                GOTO END280
      *CHECK 確認日期
| 29-C           DOPT1     IFEQ '6'
| 30-C           DIM08     IFEQ 0
|   C                     SETON                     669399
| 30*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DIM08     P0901I  60
|   C                     PARM           P0901O  1
| 31-C           P0901O    IFEQ 'N'
|   C                     SETON                     669099
| 31-C                     END
| 30-C                     END
| 29-C                     END
|    C   99                GOTO END280
|    C*
23===CSR         END280    ENDSR
     C*==============================================================*
     C*          RTN29F....UPDATE  IMIAPF, MTMAPF, IMILPF
     C*==============================================================*
24===C           RTN29F    BEGSR
      ****************
|    C* DELETE IMILPF
      ****************
|    C           DIM02     SETLLIL0
|    C           DIM02     READEIL0                      44
| 01-C           *IN44     DOWEQ'0'
|   C                     DELETIL0
|   C           DIM02     READEIL0                      44
| 01-C                     END
      *FOR WRITE 禮盒 IMILPF
|    C                     Z-ADD0         TIL08  134
|    C                     Z-ADD0         TIL09  134
|    C                     Z-ADD0         TIL10  134
      *累計各單位成本も禮盒數FOB-TMA26   FHI-TMA27   DUTY-TMA28
|    C                     Z-ADD0         TMA26
|    C                     Z-ADD0         TMA27
|    C                     Z-ADD0         TMA28
      *計算此禮盒總成本FOB-TMF06   FHI-TMF08   DUTY-TMF09
|    C                     Z-ADD0         TMF06   92
|    C                     Z-ADD0         TMF08   92
|    C                     Z-ADD0         TMF09   92
      *FOR計算比率
      *IN21 22 23 CONTROL有無結構成本
|    C                     SETOF                     212223
|    C           DIM05     SETLLMF0
|    C           DIM05     READEMF0                      44
| 02-C           *IN44     DOWEQ'0'
|   C           MF06      MULT MF04      WORK   235
|   C                     ADD  WORK      TMF06
|   C           MF08      MULT MF04      WORK
|   C                     ADD  WORK      TMF08
|   C           MF09      MULT MF04      WORK
|   C                     ADD  WORK      TMF09
|   C           DIM05     READEMF0                      44
| 02-C                     END
|    C           *LOVAL    SETLLMF0
      *FOR計算比率和計為０以結構數量分配
| 03-C           TMF06     IFEQ 0
|   C                     SETON                     21
| 03-C                     END
| 04-C           TMF08     IFEQ 0
|   C                     SETON                     22
| 04-C                     END
| 05-C           TMF09     IFEQ 0
|   C                     SETON                     23
| 05-C                     END
      *
| 06-C           *IN21     IFEQ '1'
|   C           *IN22     OREQ '1'
|   C           *IN23     OREQ '1'
|   C           DIM05     SETLLMF0
|   C           DIM05     READEMF0                      44
| 07-C           *IN44     DOWEQ'0'
      *以結構數量計算比例
| 08-C           *IN21     IFEQ '1'
|   C                     ADD  MF04      TMF06
| 08-C                     END
| 09-C           *IN22     IFEQ '1'
|   C                     ADD  MF04      TMF08
| 09-C                     END
| 10-C           *IN23     IFEQ '1'
|   C                     ADD  MF04      TMF09
| 10-C                     END
|   C           DIM05     READEMF0                      44
| 07-C                     END
|   C           *LOVAL    SETLLMF0
| 06-C                     END
      *KEEP禮盒單位成本
|    C                     Z-ADD0         KMA31
|    C                     Z-ADD0         KMA32
|    C                     Z-ADD0         KMA33
|    C           DIM05     CHAINMA0                  40
| 11-C           *IN40     IFEQ '0'
|   C                     Z-ADDMA31      KMA31
|   C                     Z-ADDMA32      KMA32
|   C                     Z-ADDMA33      KMA33
      *KEEP原禮盒完稅庫存量 KQTY
|   C                     Z-ADDMA30      KQTY   134
|   C           *LOVAL    SETLLMA0
| 11-C                     END
      *TQTY禮盒總數量＝禮盒原庫存＋禮盒組合數
|    C           KQTY      ADD  DIM06     TQTY   134
|    C           *LOVAL    SETLLMF0
      *----------------------------------------------------------------
|    C* UPD禮盒代號所屬之各產品
|    C*****************
|    C* UPDATE IMIAPF *
|    C*****************
|    C           DIM05     SETLLMF0
|    C           DIM05     READEMF0                      44
| 12-C           *IN44     DOWEQ'0'
      *副屬品
| 13-C           MF07      IFNE 'Y'
|   C                     MOVELDIM01     IA01
|   C                     MOVE DIM03     IA02
|   C                     MOVE MF02      IA03
|   C*
|   C           KEYIA     CHAINIA0                  40
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
|   C           DIM06     MULT MF04      WIA10
| 14-C           *IN40     IFEQ '0'
|   C*
|   C           DIM06     MULT MF04      WIA10
      *
| 15-C           DIM04     IFEQ '0'
|   C                     SUB  WIA10     IA06
|   C                     SUB  WIA10     IA07
|   C                     SUB  WIA10     IA09
| 15-C                     END
| 16-C           DIM04     IFEQ '1'
|   C                     ADD  WIA10     IA06
|   C                     ADD  WIA10     IA07
|   C                     ADD  WIA10     IA10
| 16-C                     END
|   C                     UPDATIA0
| 14*C                     ELSE
| 17-C           DIM04     IFEQ '1'
|   C           IA03      CHAINMA0                  40
|   C           *LOVAL    SETLLMA0
|   C  N40                MOVE MA09      IA04
|   C  N40                MOVE MA08      IA05
|   C   40                MOVE *BLANKS   IA04
|   C   40                MOVE *BLANKS   IA05
|   C                     Z-ADDWIA10     IA06
|   C                     Z-ADDWIA10     IA07
|   C                     Z-ADDWIA10     IA10
|   C                     Z-ADD0         IA08
|   C                     Z-ADD0         IA09
|   C                     WRITEIA0
| 17-C                     END
| 14-C                     END
      *
|   C*****************
|   C* UPDATE MTMAPF *
|   C*****************
      *WQTY產品異動量
|   C                     Z-ADD0         WQTY   134
|   C           MF02      CHAINMA0                  40
| 18-C           *IN40     IFEQ '0'
B2???C                     Z-ADDDATE      MAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           MAYY
|   C                     MOVE $USER     MAZZ
|   C*
|   C           DIM06     MULT MF04      WIA10
| 19-C           DIM04     IFEQ '0'
|   C                     SUB  WIA10     MA30
|   C                     SUB  WIA10     WQTY
| 19-C                     END
| 20-C           DIM04     IFEQ '1'
|   C                     ADD  WIA10     MA30
|   C                     ADD  WIA10     WQTY
| 20-C                     END
      *TOTAL異動金額
| 21-C           DIM04     IFEQ '0'
      *組------------------------------------------------------------
|   C           MA31      MULT MF04      IL08
|   C                     MULT DIM06     IL08
|   C                     ADD  IL08      TIL08
|   C           MA32      MULT MF04      IL09
|   C                     MULT DIM06     IL09
|   C                     ADD  IL09      TIL09
|   C           MA33      MULT MF04      IL10
|   C                     MULT DIM06     IL10
|   C                     ADD  IL10      TIL10
      *
|   C           WQTY      MULT MA31      FOB    174
|   C                     ADD  FOB       MA26      H
|   C           WQTY      MULT MA32      FHI    174
|   C                     ADD  FHI       MA27      H
|   C           WQTY      MULT MA33      DUTY   174
|   C                     ADD  DUTY      MA28      H
      *累計各產品單位成本も數量 *負負得正
|   C                     SUB  FOB       TMA26
|   C                     SUB  FHI       TMA27
|   C                     SUB  DUTY      TMA28
      *組------------------------------------------------------------
| 21*C                     ELSE
      *拆------------------------------------------------------------
      *各禮盒產品之成本比率
      *CA--FOB------------
      *成本為０以結構數量計算
| 22-C           *IN21     IFEQ '0'
|   C           MF06      MULT MF04      WORK
| 22*C                     ELSE
|   C                     Z-ADDMF04      WORK
| 22-C                     END
|   C                     MULT KMA31     WORK
|   C                     MULT DIM06     WORK
      *
| 23-C           TMF06     IFNE 0
|   C           WORK      DIV  TMF06     FOB       H
| 23*C                     ELSE
|   C                     Z-ADD0         FOB
| 23-C                     END
      *
|   C                     ADD  FOB       MA26      H
|   C                     Z-ADDFOB       IL08      H
      *CA--FOB------------
      *CA--FHI------------
      *成本為０以結構數量計算
| 24-C           *IN22     IFEQ '0'
|   C           MF08      MULT MF04      WORK
| 24*C                     ELSE
|   C                     Z-ADDMF04      WORK
| 24-C                     END
|   C                     MULT KMA32     WORK
|   C                     MULT DIM06     WORK
      *
| 25-C           TMF08     IFNE 0
|   C           WORK      DIV  TMF08     FHI       H
| 25*C                     ELSE
|   C                     Z-ADD0         FHI
| 25-C                     END
      *
|   C                     ADD  FHI       MA27      H
|   C                     Z-ADDFHI       IL09      H
      *CA--FHI------------
      *CA--DUTY-----------
      *成本為０以結構數量計算
| 26-C           *IN23     IFEQ '0'
|   C           MF09      MULT MF04      WORK
| 26*C                     ELSE
|   C                     Z-ADDMF04      WORK
| 26-C                     END
|   C                     MULT KMA33     WORK
|   C                     MULT DIM06     WORK
      *
| 27-C           TMF09     IFNE 0
|   C           WORK      DIV  TMF09     DUTY      H
| 27*C                     ELSE
|   C                     Z-ADD0         DUTY
| 27-C                     END
      *
|   C                     Z-ADDDUTY      IL10      H
|   C                     ADD  DUTY      MA28      H
      *CA--DUTY-----------
      *拆時重算單位成本
|   C           MA29      ADD  MA30      WORK
| 28-C           WORK      IFNE 0
|   C           MA26      DIV  WORK      MA31      H
|   C           MA27      DIV  WORK      MA32      H
| 28*C*                    ELSE
|   C*                    Z-ADD0         MA31
|   C*                    Z-ADD0         MA32
| 28-C                     END
| 29-C           MA30      IFNE 0
|   C           MA28      DIV  MA30      MA33      H
| 29*C*                    ELSE
|   C*                    Z-ADD0         MA33
| 29-C                     END
      *單位成本
|   C           MA31      ADD  MA32      MA34
|   C                     ADD  MA33      MA34
      *拆------------------------------------------------------------
| 21-C                     END
|   C*
|   C                     UPDATMA0
| 18-C                     END
|   C*****************
|   C* UPDATE MTMFPF *
|   C*****************
| 30-C           DIM04     IFEQ '0'
      *若原禮盒之成本為０則以ＭＡ之單位成本計算
| 31-C           MF06      IFNE 0
|   C           KQTY      MULT MF06      WAMT1  174
| 31*C                     ELSE
|   C           KQTY      MULT MA31      WAMT1  174
| 31-C                     END
|   C           DIM06     MULT MA31      FOB
|   C                     ADD  WAMT1     FOB
|   C           FOB       DIV  TQTY      MF06      H
      *若原禮盒之成本為０則以ＭＡ之單位成本計算
| 32-C           MF08      IFNE 0
|   C           KQTY      MULT MF08      WAMT1  174
| 32*C                     ELSE
|   C           KQTY      MULT MA32      WAMT1  174
| 32-C                     END
|   C           DIM06     MULT MA32      FHI
|   C                     ADD  WAMT1     FHI
|   C           FHI       DIV  TQTY      MF08      H
      *若原禮盒之成本為０則以ＭＡ之單位成本計算
| 33-C           MF09      IFNE 0
|   C           KQTY      MULT MF09      WAMT1  174
| 33*C                     ELSE
|   C           KQTY      MULT MA33      WAMT1  174
| 33-C                     END
|   C           DIM06     MULT MA33      DUTY
|   C                     ADD  WAMT1     DUTY
|   C           DUTY      DIV  TQTY      MF09      H
      *
|   C                     UPDATMF0
| 30-C                     END
|   C*****************
|   C* WRITE  IMILPF *
|   C*****************
B2???C                     Z-ADDDATE      ILXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           ILYY
|   C                     MOVE $USER     ILZZ
|   C*
|   C                     MOVE DIM02     IL02
|   C                     MOVE MF02      IL05
|   C                     MOVE DIM01     IL01
|   C                     MOVE DIM03     IL03
|   C           DIM06     MULT MF04      IL06
| 34-C           DIM04     IFEQ '0'
|   C                     Z-ADD-1        IL07
| 34-C                     END
| 35-C           DIM04     IFEQ '1'
|   C                     Z-ADD1         IL07
| 35-C                     END
|   C*
B2000C                     Z-ADDIM10      IL04
|   C                     WRITEIL0
|   C*
| 13-C                     END
|   C           DIM05     READEMF0                      44
| 12-C                     END
|    C           *LOVAL    SETLLMF0
|    C*----------------------------------------------------------------
|    C* UPD禮盒代號
|    C*****************
|    C* UPDATE IMIAPF *
|    C*****************
|    C                     MOVELDIM01     IA01
|    C                     MOVE DIM03     IA02
|    C                     MOVE DIM05     IA03
|    C*
|    C           KEYIA     CHAINIA0                  40
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|    C                     MOVE $USER     IAZZ
|    C*
| 36-C           *IN40     IFEQ '0'
| 37-C           DIM04     IFEQ '0'
|   C                     ADD  DIM06     IA06
|   C                     ADD  DIM06     IA07
|   C                     ADD  DIM06     IA10
| 37-C                     END
| 38-C           DIM04     IFEQ '1'
|   C                     SUB  DIM06     IA06
|   C                     SUB  DIM06     IA07
|   C                     SUB  DIM06     IA09
| 38-C                     END
|   C                     UPDATIA0
| 36*C                     ELSE
|   C****
|   C* 新增禮盒代號至產品庫存檔
|   C****
| 39-C           DIM04     IFEQ '0'
|   C                     MOVELDIM01     IA01
|   C                     MOVE DIM03     IA02
|   C                     MOVE DIM05     IA03
|   C           DIM05     CHAINMA0                  40
|   C           *LOVAL    SETLLMA0
|   C  N40                MOVE MA09      IA04
|   C  N40                MOVE MA08      IA05
|   C   40                MOVE *BLANKS   IA04
|   C   40                MOVE *BLANKS   IA05
|   C                     Z-ADDDIM06     IA06
|   C                     Z-ADDDIM06     IA07
|   C                     Z-ADD0         IA08
|   C                     Z-ADD0         IA09
|   C                     Z-ADDDIM06     IA10
|   C                     WRITEIA0
| 39-C                     END
| 36-C                     END
      *
|    C*****************
|    C* UPDATE MTMAPF *
|    C*****************
|    C           DIM05     CHAINMA0                  40
| 40-C           *IN40     IFEQ '0'
|   C                     Z-ADD0         WQTY
B2???C                     Z-ADDDATE      MAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           MAYY
|   C                     MOVE $USER     MAZZ
|   C*
| 41-C           DIM04     IFEQ '0'
|   C                     ADD  DIM06     MA30
|   C                     ADD  DIM06     WQTY
| 41-C                     END
| 42-C           DIM04     IFEQ '1'
|   C           MA31      MULT DIM06     TIL08
|   C           MA32      MULT DIM06     TIL09
|   C           MA33      MULT DIM06     TIL10
|   C                     SUB  DIM06     MA30
|   C                     SUB  DIM06     WQTY
| 42-C                     END
      *TOTAL異動金額
      *拆
| 43-C           DIM04     IFEQ '1'
|   C           DIM06     MULT MA31      FOB    174
|   C                     SUB  FOB       MA26      H
|   C           DIM06     MULT MA32      FHI    174
|   C                     SUB  FHI       MA27      H
|   C           DIM06     MULT MA33      DUTY   174
|   C                     SUB  DUTY      MA28      H
| 43*C                     ELSE
      *組
      *禮盒單位成本及總成本
      *計算TOTAL各成本 AND DIV總數量計算UNIT各成本
|   C                     ADD  TMA26     MA26
| 44-C           MA30      IFNE 0
|   C           MA26      DIV  MA30      MA31      H
|   C                     ADD  TMA27     MA27
|   C           MA27      DIV  MA30      MA32      H
|   C                     ADD  TMA28     MA28
|   C           MA28      DIV  MA30      MA33      H
| 44-C                     END
      *MA34單位成本
|   C           MA31      ADD  MA32      MA34
|   C                     ADD  MA33      MA34
| 43-C                     END
|   C*
|   C                     UPDATMA0
| 40-C                     END
|    C*****************
|    C* WRITE  IMILPF *
|    C*****************
|    C                     MOVE DIM02     IL02
|    C                     MOVE DIM05     IL05
|    C           KEYIL     CHAINIL0                  40
B2000C                     Z-ADDIM10      IL04
|    C                     Z-ADDTIL08     IL08
|    C                     Z-ADDTIL09     IL09
|    C                     Z-ADDTIL10     IL10
|    C*
B2???C                     Z-ADDDATE      ILXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           ILYY
|    C                     MOVE $USER     ILZZ
|    C*
| 45-C           *IN40     IFEQ '1'
|   C                     MOVE DIM01     IL01
|   C                     MOVE DIM03     IL03
|   C                     Z-ADDDIM06     IL06
| 46-C           DIM04     IFEQ '0'
|   C                     Z-ADD1         IL07
| 46-C                     END
| 47-C           DIM04     IFEQ '1'
|   C                     Z-ADD-1        IL07
| 47-C                     END
|   C                     WRITEIL0
| 45*C                     ELSE
|   C                     UPDATIL0
| 45-C                     END
|    C*
24===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
25===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
25===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
26===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           APPSCR    IFEQ 'SCR002'
|   C**
| 02-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE15
|   C           D#COL     ANDLE23
|   C                     CALL 'WDS001'
|   C           DIM05     PARM DIM05     WPARM1  9
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 13
|   C           D#COL     ANDGE15
|   C           D#COL     ANDLE19
|   C                     CALL 'WDS012'
|   C                     PARM 'STORAGE 'S012I1  8
|   C           DIM03     PARM DIM03     S012O1 10
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 01-C                     END
|    C*
26===C           ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
27===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
27===C                     ENDSR'*DETC'
M001AC/COPY HBP2CVTR
**
新增修改      刪除查詢確認
