      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMA009                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/04/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :月結處理                                     *
      ****************************************************************
     FSOSNLF02UF  E           K        DISK
     FIMIELF02UF  E           K        DISK
     FIMIGLF02UF  E           K        DISK
     FPOPDLF02UF  E           K        DISK
     FPOPFLF02UF  E           K        DISK
     FPOPHLF02UF  E           K        DISK
     FIMIILF02UF  E           K        DISK
     FIMIMLF02UF  E           K        DISK
     FIMIBLF03UF  E           K        DISK
     FIMICLF02UF  E           K        DISK
     FSOSCLF03UF  E           K        DISK
     FSOSELF06UF  E           K        DISK
     FSOSGLF05UF  E           K        DISK
     FPA#BPF  UF  E           K        DISK
     FIMINLF02UF  E           K        DISK
     FIMA009XDCF  E                    WORKSTN
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I            DS
B2MODI                                        1   60#B16
B2MODI                                        1   40YY
B2MODI                                        5   60MM
     I            DS
B2MODI                                        1   60W#B16
B2MODI                                        1   40WYY
B2MODI                                        5   60WMM
     I            DS
     I                                        1   40D#B16
     I                                        1   20DMM
     I                                        3   40DYY
     I            DS
B2MODI                                        1   80SETLL
B2MODI                                        1   60SETYM
B2MODI                                        7   80SETD
     I            DS
     I                                        1   60WDATE
     I                                        1   40WYYMM
     I            DS
     I                                        1  12 SN02
     I                                        3   4 SN02L
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
B2MODC           *LIKE     DEFN IN02      WIN02 - 2
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRM
     C*
  01-C           *IN03     DOWEQ'0'
    C*
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C*
    C                     EXSR RTN100                     *CHECK SCR01?
  02-C           *IN14     IFEQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXSR RTN200                     *PROCESS    ?
    C                     SETON                     98                ?
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         D#B16
|    C                     Z-ADD0         SETLL
|    C*
B2MODC                     Z-ADD0         DATE    80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM $EGMDY    S001I2  80
B2INF *CVR3012 sev.30 Field $EGMDY contains more than one year
B2INF *CVR3012 sev.30 Field S001I2 contains more than one year
B2MODC           DATE      PARM           S001O1  80
|    C*
|    C                     Z-ADD0         WORK   234
|    C                     Z-ADD0         WORK1  234
      *
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *
B2CHKC           D#B16     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     609599
| 01*C                     ELSE
| 02-C           DMM       IFGT 12
|   C           DMM       ORLT 1
|   C                     SETON                     609399
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END100
      *
|    C                     Z-ADDDMM       WMM
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDYY       WYY
B2NEWC                     MOVE DYY       HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    WYY
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          W#B16     IFLE 9203
B2NEWC           W#B16     IFLE 199203
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     SETON                     609299
| 03-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTN200....DATA PROCESS
      *===============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     EXSR RTN310
|    C                     EXSR RTN320
|    C                     EXSR RTN330
|    C                     EXSR RTN340
|    C                     EXSR RTN350
|    C                     EXSR RTN360
|    C                     EXSR RTN370
|    C                     EXSR RTN380
|    C                     EXSR RTN390
|    C                     EXSR RTN400
|    C                     EXSR RTN410
|    C                     EXSR RTN420
|    C                     EXSR RTN430
|    C                     EXSR RTN440
|    C                     EXSR RTN500
|    C*
03===C                     ENDSR
      *===============================================================*
      *          RTN310....月結資料檔
      *===============================================================*
04===C           RTN310    BEGSR
|    C*
B2000C           W#B16     SETLLIN0
|    C                     READ IN0                      44
| 01-C           *IN44     DOWEQ'0'
|   C                     DELETIN0
|   C                     READ IN0                      44
| 01-C                     END
|    C*
B2000C                     Z-ADDW#B16     SETYM
|    C                     Z-ADD0         SETD
|    C*
04===C                     ENDSR
      *===============================================================*
      *          RTN320....國外採購驗收主檔
      *===============================================================*
05===C           RTN320    BEGSR
|    C*
B2000C           SETLL     SETLLPD0
|    C                     READ PD0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   PD24
B2000C                     Z-ADDDATE      PDXX
B2000C                     TIME           PDYY
|   C                     MOVE $USER     PDZZ
|   C**
|   C                     UPDATPD0
|   C*
|   C                     READ PD0                      44
|   C*
| 01-C                     END
|    C*
05===C                     ENDSR
      *===============================================================*
      *          RTN330....國外採購完稅主檔
      *===============================================================*
06===C           RTN330    BEGSR
|    C*
B2000C           SETLL     SETLLPF0
|    C                     READ PF0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   PF13
B2000C                     Z-ADDDATE      PFXX
B2000C                     TIME           PFYY
|   C                     MOVE $USER     PFZZ
|   C                     UPDATPF0
|   C                     READ PF0                      44
| 01-C                     END
|    C*
06===C                     ENDSR
      *===============================================================*
      *          RTN340....國內採購驗收主檔
      *===============================================================*
07===C           RTN340    BEGSR
|    C*
B2000C           SETLL     SETLLPH0
|    C                     READ PH0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   PH10
B2000C                     Z-ADDDATE      PHXX
B2000C                     TIME           PHYY
|   C                     MOVE $USER     PHZZ
|   C**
|   C                     UPDATPH0
|   C                     READ PH0                      44
|    C*
| ERRC                     END
|    C*
07===C                     ENDSR
      *===============================================================*
      *          RTN350....銷售訂單主檔
      *===============================================================*
08===C           RTN350    BEGSR
|    C*
B2000C           SETLL     SETLLSC0
|    C                     READ SC0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   SC38
B2000C                     Z-ADDDATE      SCXX
B2000C                     TIME           SCYY
|   C                     MOVE $USER     SCZZ
|   C**
|   C                     UPDATSC0
|   C                     READ SC0                      44
|   C*
| 01-C                     END
|    C*
08===C                     ENDSR
      *===============================================================*
      *          RTN360....送貨單主檔
      *===============================================================*
09===C           RTN360    BEGSR
|    C*
B2000C           SETLL     SETLLSE0
|    C                     READ SE0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   SE40
B2000C                     Z-ADDDATE      SEXX
B2000C                     TIME           SEYY
|   C                     MOVE $USER     SEZZ
|   C**
|   C                     UPDATSE0
|   C                     READ SE0                      44
|   C*
| 01-C                     END
|    C*
09===C                     ENDSR
      *===============================================================*
      *          RTN370....銷貨退回主檔
      *===============================================================*
10===C           RTN370    BEGSR
|    C*
B2000C           SETLL     SETLLSG0
|    C                     READ SG0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   SG16
B2000C                     Z-ADDDATE      SGXX
B2000C                     TIME           SGYY
|   C                     MOVE $USER     SGZZ
|   C**
|   C                     UPDATSG0
|   C                     READ SG0                      44
|   C*
| 01-C                     END
|    C*
10===C                     ENDSR
      *===============================================================*
      *          RTN380....產品收回主檔
      *===============================================================*
11===C           RTN380    BEGSR
|    C*
B2000C           SETLL     SETLLSN0
|    C                     READ SN0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   SN09
B2000C                     Z-ADDDATE      SNXX
B2000C                     TIME           SNYY
|   C                     MOVE $USER     SNZZ
|   C**
|   C                     UPDATSN0
|   C                     READ SN0                      44
|   C*
| 01-C                     END
|    C*
11===C                     ENDSR
      *===============================================================*
      *          RTN390....產品成本調整檔
      *===============================================================*
12===C           RTN390    BEGSR
|    C*
B2000C           SETLL     SETLLIB0
|    C                     READ IB0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   IB18
|   C                     UPDATIB0
|   C*
|   C                     READ IB0                      44
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *===============================================================*
      *          RTN400....產品報廢主檔
      *===============================================================*
13===C           RTN400    BEGSR
|    C*
B2000C           SETLL     SETLLIE0
|    C                     READ IE0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   IE06
B2000C                     Z-ADDDATE      IEXX
B2000C                     TIME           IEYY
|   C                     MOVE $USER     IEZZ
|   C**
|   C                     UPDATIE0
|   C*
|   C                     READ IE0                      44
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *===============================================================*
      *          RTN410....存貨調整主檔
      *===============================================================*
14===C           RTN410    BEGSR
|    C*
B2000C           SETLL     SETLLIG0
|    C                     READ IG0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   IG07
B2000C                     Z-ADDDATE      IGXX
B2000C                     TIME           IGYY
|   C                     MOVE $USER     IGZZ
|   C**
|   C                     UPDATIG0
|   C*
|   C*
|   C                     READ IG0                      44
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *===============================================================*
      *          RTN420....產品調撥主檔
      *===============================================================*
15===C           RTN420    BEGSR
|    C*
B2000C           SETLL     SETLLII0
|    C                     READ II0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   II07
B2000C                     Z-ADDDATE      IIXX
B2000C                     TIME           IIYY
|   C                     MOVE $USER     IIZZ
|   C**
|   C                     UPDATII0
|   C***
|   C                     READ II0                      44
|   C*
| 01-C                     END
|    C*
15===C                     ENDSR
      *===============================================================*
      *          RTN430....禮盒組拆主檔
      *===============================================================*
16===C           RTN430    BEGSR
|    C*
B2000C           SETLL     SETLLIM0
|    C                     READ IM0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   IM09
B2000C                     Z-ADDDATE      IMXX
B2000C                     TIME           IMYY
|   C                     MOVE $USER     IMZZ
|   C**
|   C                     UPDATIM0
|   C*
|   C                     READ IM0                      44
|   C*
| 01-C                     END
|    C*
16===C                     ENDSR
      *===============================================================*
      *          RTN440....良壞轉換主檔
      *===============================================================*
17===C           RTN440    BEGSR
|    C*
B2000C           SETLL     SETLLIC0
|    C                     READ IC0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C                     MOVE *BLANKS   IC06
B2000C                     Z-ADDDATE      ICXX
B2000C                     TIME           ICYY
|   C                     MOVE $USER     ICZZ
|   C**
|   C                     UPDATIC0
|   C*
|   C                     READ IC0                      44
|   C*
| 01-C                     END
|    C*
17===C                     ENDSR
      *===============================================================*
      *          RTN500....公司主檔
      *===============================================================*
18===C           RTN500    BEGSR
|    C*
|    C                     SUB  1         WMM
| 01-C           WMM       IFEQ 0
|   C                     Z-ADD12        WMM
B2000C                     SUB  1         WYY
| 01-C                     END
      *
|    C           *LOVAL    SETLL#B0
|    C                     READ #B0                      40
| 02-C           *IN40     DOWEQ'0'
|   C*
B2000C                     Z-ADDW#B16     #B16
B2000C                     Z-ADDDATE      #BXX
B2000C                     TIME           #BYY
|   C                     MOVE $USER     #BZZ
|   C*
|   C                     UPDAT#B0
|   C                     READ #B0                      40
| 02-C                     END
|    C*
18===C                     ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
