     FPA#BPF  IF  E           K        DISK
     FIMA009D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
B2MODI                                      601 6060#B16
B2MODI                                      601 6040YY
B2MODI                                      605 6060MM
B2MODI                                      607 6120W#B16
B2MODI                                      607 6100WYY
B2MODI                                      611 6120WMM
B2MODI                                      613 6160D#B16
B2MODI                                      613 6140DMM
B2MODI                                      615 6160DYY
B2MODI                                      617 6240SETLL
B2MODI                                      617 6220SETYM
B2MODI                                      623 6240SETD
     I            DS
B2MODI                                        1   60CHKYM
B2MODI                                        1   40CHKYY
B2MODI                                        5   60CHKMM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN96     PARM *IN98     IN98    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N96             EXSR RTN010                     .INIT SCREEN
     C                     EXSR RTN100                     *CHECK SCR01?
     C*
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C*
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
    C*
  02-C           *IN04     IFEQ '0'
  03-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02*C                     ELSE
    C                     EXSR RTNF4                                  ?
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         D#B16
|    C*
|    C                     Z-ADD0         DATE    60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM $EGMDY    S001I2  60
|    C           DATE      PARM           S001O1  60
|    C*
|    C                     Z-ADD0         WORK   234
|    C                     Z-ADD0         WORK1  234
|    C*計算應結帳月份
|    C           *LOVAL    SETLL#B0
|    C                     READ #B0                      40
| 01-C           *IN40     IFEQ '0'
      *
|   C           MM        ADD  1         DMM
| 02-C           DMM       IFGT 12
      *SCREEN
|   C                     Z-ADD1         DMM
B2???C           YY        ADD  1         DYY
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code ADD
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
      *DATE YY/MM
|   C                     Z-ADD1         WMM
B2CHKC           YY        ADD  1         WYY
| 02*C                     ELSE
      *SCREEN
B2TRCC                     Z-ADDYY        DYY
      *DATE YY/MM
|   C                     Z-ADDDMM       WMM
B2000C                     Z-ADDYY        WYY
| 02-C                     END
| 01-C                     END
|    C*
B2000C                     Z-ADDW#B16     SETYM
|    C                     Z-ADD1         SETD
|    C*
      *
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK
      *===============================================================*
02===C           RTN100    BEGSR
|    C*結帳月份檢查
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDYY       CHKYY
B2NEWC                     MOVE DYY       HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    CHKYY
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     Z-ADDDMM       CHKMM
|    C*計算應結帳月份
|    C           *LOVAL    SETLL#B0
|    C                     READ #B0                      40
| 01-C           *IN40     IFEQ '0'
B2000C           #B16      IFEQ CHKYM
|   C                     SETON                     609699
| 01-C                     END
     C   99                GOTO END100
      *
|   C           MM        ADD  1         DMM
| 02-C           DMM       IFGT 12
      *SCREEN
|   C                     Z-ADD1         DMM
B2???C           YY        ADD  1         DYY
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code ADD
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
      *DATE YY/MM
|   C                     Z-ADD1         WMM
B2CHKC           YY        ADD  1         WYY
| 02*C                     ELSE
      *SCREEN
B2TRCC                     Z-ADDYY        DYY
      *DATE YY/MM
|   C                     Z-ADDDMM       WMM
B2000C                     Z-ADDYY        WYY
| 02-C                     END
| 01-C                     END
|    C*
B2000C                     Z-ADDW#B16     SETYM
|    C                     Z-ADD1         SETD
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
