     FIMIALF01IF  E           K        DISK
     FIMIRLF09IF  E           K        DISK
     F                                              KINFSR ERRSR
     F                                              KINFDS IRRCDN
     FIMISLF01IF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMAPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FPA#APF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMEPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FPA#2PF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FIMI026D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E*                   WFUN    6   6  6
     E*: FUNCTION DATA :
     E**                  WTYPE   5   9 10
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     I*SDS        SDS
     I*                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 507 $TRNID
     I*                                     508 512 $APAU1
     I*                                     513 513 $WRHTY
     I*                                     514 521 $#101
     I*                                     522 522 $APAU2
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I*
     I            DS
     I                                        1   2 IR05
     I                                        1   1 IR05F
     I*
     I            DS
     I                                        1  32 #A03
     I                                        1   1 #A03F
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     IIRRCDN      DS
     I                                     *RECORD  RCDR
      *==============================================================*
      *                    INITIAL RTN
      *==============================================================*
     C                     MOVE *BLANKS   APPSCR  6
     C                     Z-ADD0         HRRN1   40
     C                     Z-ADD0         HRRN2   40
     C                     MOVE *BLANK    WBOTOM  1
     C                     MOVE *BLANK    WBOTM2  1
      *==============================================================*
      *                    DEFN RTN
      *==============================================================*
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C           *LIKE     DEFN DBGN3     OBGN3            *START KEY
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BOTTOM
     C           *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BOTTOM
     C           *LIKE     DEFN DBGN3     BBGN3            *SUBFIL BOTTOM
     C**
B2MODC           *LIKE     DEFN DBGN21    OBGN21
     C           *LIKE     DEFN DBGN21    BBGN21+ 2
B2MODC           *LIKE     DEFN DBGN21    WBGN21+ 2
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYR12    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C                     KFLD           DBGN3
     C*
     C           KEYR13    KLIST
     C                     KFLD           BBGN1
     C                     KFLD           BBGN2
     C                     KFLD           BBGN3
     C*
     C           KEYR14    KLIST
     C                     KFLD           IA03
     C                     KFLD           IA02
     C                     KFLD           IA01
     C*
     C*
     C           KEYR22    KLIST
     C                     KFLD           IA03
     C                     KFLD           IA02
     C                     KFLD           IA01
     C                     KFLD           WBGN21           *(YY/MM/DD)
     C*
     C           KEYR23    KLIST
     C                     KFLD           BBGN21
     C*
     C           KEYR24    KLIST
     C                     KFLD           IA03
     C                     KFLD           IA02
     C                     KFLD           IA01
     C*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C*
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C*
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
     C*
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C**                   MOVE $ADD      WA01,1
|    C**                   MOVE $UPD      WA01,2
|    C**                   MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C**                   MOVE $RMK01    WA01,6
|    C*
|    C                     MOVE 'SCR001'  APPSCR
|    C*
M001DC*                    Z-ADD0         DATE    80
M001AC                     Z-ADD0         DATE    60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001AC                     PARM $EGMDY    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          DATE      PARM           S001O1  80
M001AC           DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C           DBGN3     ORNE OBGN3
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
|   C                     MOVE DBGN3     OBGN3
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
| 02-C           *IN03     ANDEQ'0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN03     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END
|    C*
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN180....CHECK 'SC01' SCREEN
     C*==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
04===C                     ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTOM
|    C**                   SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C           KEYR12    SETLLIA0
|    C                     MOVE DBGN1     BBGN1
|    C                     MOVE DBGN2     BBGN2
|    C                     MOVE DBGN3     BBGN3
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
| 02-C           BBGN1     IFNE DBGN1
|   C           BBGN2     ORNE DBGN2
|   C           KEYR13    SETGTIA0
| 02-C                     END
|   C                     EXSR RTN193
|   C                     MOVE IA03      BBGN1
|   C                     MOVE IA02      BBGN2
|   C                     MOVE IA01      BBGN3
|   C           *LOVAL    SETLLIA0
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
|    C***
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ IA0                      46
|   C**
| 02-C           *IN46     IFEQ '0'
     C           IA09      IFNE 0
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
     C                     END
|   C           KEYR14    SETGTIA0
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTOM
|   C**                   SETON                     53
| 02-C                     END
|   C***
| 01-C                     END
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
09===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C**                   MOVE WFUN,WNUM DFUN
      *產品名稱
|    C           IA03      CHAINMA0                  46
     C           *IN46     IFEQ '0'
|    C                     MOVE MA03      MA031
     C                     ELSE
|    C                     MOVE *BLANK    MA031
     C                     END
      *物流點
|    C                     MOVEL*BLANKS   IA02C
     C                     MOVEL*BLANKS   #A01
     C                     MOVEL*BLANKS   #A02
|    C                     MOVEL'STORAGE' #A01
     C                     MOVELIA02      #A02
|    C           KEY#A     CHAIN#A0                  46
     C           *IN46     IFEQ '0'
|    C                     MOVEL#A03      IA02C
     C                     ELSE
|    C                     MOVELIA02      ME01
     C                     MOVEL*BLANKS   ME02
|    C           KEYME     CHAINME0                  46
     C           *IN46     IFEQ '0'
     C                     MOVELME04      IA02C
     C                     END
     C                     END
      *
      *公司
|    C                     MOVEL*BLANKS   IA01C
     C                     MOVEL*BLANKS   #A01
     C                     MOVEL*BLANKS   #A02
|    C                     MOVEL'COMPANY' #A01
     C                     MOVELIA01      #A02
|    C           KEY#A     CHAIN#A0                  46
     C           *IN46     IFEQ '0'
|    C                     MOVEL#A03      IA01C
     C                     END
      *
     C                     Z-ADD0         TQTY
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C           *LOVAL    SETLLIMIRLF09
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
10===C           RTN240    BEGSR
|    C*
     C                     SETOF                     12
M001DC*                    Z-ADD123199    DBGN21           *日期MDY
M001AC                     Z-ADD123129    DBGN21           *日期MDY
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD991231    WBGN21           *日期YMD
M001DC*                    Z-ADD99991231  WBGN21           *日期YMD
M001AC                     Z-ADD20291231  WBGN21           *日期YMD
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C*
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN292                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
| 02-C           RRN2      IFGT 0
|   C                     SETON                     50    *SFLDSP
| 02*C                     ELSE
|   C                     SETON                     94    *NO DTA
| 02-C                     END
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     SETOF                     50
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 04-C           *IN25     CASEQ'1'       RTN292
|   C                     CAS            RTN270
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
|   C*
| 01-C                     END                             *IN12 ENDIF
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR FIELD --WHEN PROCESS
      *==============================================================*
11===CSR         RTN251    BEGSR
|    C****
|    C*(CLR FIELD)
|    C****
|    C                     MOVE *BLANK    IR03
|    C                     MOVE *BLANK    IR06
|    C                     Z-ADD0         IR09
|    C                     Z-ADD0         IR071
|    C                     Z-ADD0         IR072
|    C                     Z-ADD0         IR121
|    C                     Z-ADD0         IR122
|    C****
11===CSR                   ENDSR
      *==============================================================*
      *          RTN253....MOVE DATA TO SFLSR2
      *==============================================================*
12===CSR         RTN253    BEGSR
|    C******
|    C*(異動日期-CHANGE TO MM/DD/YY)
|    C******
M001AC                     Z-ADDIR04      XIR04   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM IR04      S001I2  80
M001DC*          DIR04     PARM           S001O1  80
M001AC                     PARM XIR04     S001I2  60
M001AC           DIR04     PARM           S001O1  60
|   C***
|   C*(CHAIN單別說明)
|   C***
|   C                     MOVE *BLANK    #201
|   C                     MOVE *BLANK    #202
|   C                     MOVELIR05F     #201
|   C                     MOVELIR05      #202
|   C           KEY#2     CHAIN#20                  47
|   C   47                MOVE *BLANK    D#203
|   C  N47                MOVEL#203      D#203
|   C*
|    C******
|    C*(發出物流點＆收到物流點)
|    C******
      *
|    C*                    MOVE *BLANK    #A02
|    C*                    MOVEL'IMIRLF ' #A01
|    C*                    MOVELRCDR      #A02
      ****
|    C                     MOVELRCDR      RCDRCK  3
|   C           IR071     ADD  IR072     DQTY
     C           RCDRCK    IFNE 'SD0'
     C           RCDRCK    ANDNE'IL0'
     C           RCDRCK    ANDNE'IH0'
     C                     SUB  IR121     DQTY
     C                     SUB  IR122     DQTY
     C                     END
|    C******
|    C*(數量＆確認)
|    C******
|   C                     Z-ADD0         IR071
|   C                     Z-ADD0         IR072
     C*
|    C******
|    C*(單位)
|    C******
|    C           IR03      CHAINMA0                  46
|    C   46                MOVE *BLANK    MA13
|    C*
12===CSR                   ENDSR
      *==============================================================*
      *          RTN270....ENTER
      *==============================================================*
17===C           RTN270    BEGSR
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC           DBGN21    IFNE OBGN21
B2NEWC*                    MOVE DBGN21    HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    H@8N01  80
B2NEWC*          H@8N01    IFNE OBGN21
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
      *
B2CHKC           DBGN21    IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001DC*                    Z-ADD123199    DBGN21
M001AC                     Z-ADD123129    DBGN21
     C                     END
|    C*
|   C                     Z-ADD0         HRRN2
|   C                     EXSR RTN291
|   C                     EXSR RTN292
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC                     MOVE DBGN21    OBGN21
B2NEWC*                    MOVE DBGN21    HB2@F6  6
B2NEWC*                    EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC*                    MOVE HB2@T8    OBGN21
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
| 01-C                     END
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          RTN291....INIT 'SC02' -- SFLSR2
     C*==============================================================*
18===C           RTN291    BEGSR
|    C**
|    C                     Z-ADD0         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD0         DSPRC2  40       *SFL SIZE
|    C                     Z-ADD10        WPRCD2  40       *PAG RCD
|    C           HRRN2     DIV  WPRCD2    DSPRC2
|    C                     MULT WPRCD2    DSPRC2
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C                     SETOF                     53
|    C*
|    C                     SETON                     5254  *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
B2CHKC           DBGN21    IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001DC*                    Z-ADD123199    DBGN21
M001AC                     Z-ADD123129    DBGN21
     C                     END
|    C*
|    C*(CHANGE TO YY/MM/DD FOR SETLL FILE)
M001AC                     Z-ADD0         XBGN21  60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM DBGN21    S001I2  80
M001AC                     PARM DBGN21    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          WBGN21    PARM           S001O1  80
M001AC           XBGN21    PARM           S001O1  60
M001AC                     MOVE XBGN21    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WBGN21
B2000C           KEYR22    SETLLIMIRLF09
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          RTN292....ROLLUP SCREEN2
     C*==============================================================*
19===C           RTN292    BEGSR
|    C*
| 01-C           WBOTM2    IFEQ 'Y'
|   C                     SETON                         98
|   C                     Z-ADDRRN2      DRRN2
| 01*C                     ELSE
|   C                     EXSR RTN293
| 01-C                     END
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          RTN293....ADD SUBFILE DATA -- SRCREEN2
     C*==============================================================*
20===C           RTN293    BEGSR
|    C*
|    C                     SETOF                         54
|    C****                 MOVE *BLANKS   DOPT2
|    C                     Z-ADDWRRN2     RRN2
|    C                     ADD  WPRCD2    DSPRC2
|    C*
|    C*
| 01-C           RRN2      DOWLTDSPRC2
|   C*
     C                     Z-ADD0         IR071
     C                     Z-ADD0         IR072
     C                     Z-ADD0         IR121
     C                     Z-ADD0         IR122
|   C*
|   C           KEYR24    READEIMIRLF09                 44*NF/EOF
| 02-C           *IN44     IFEQ '0'
     C                     MOVEL*BLANKS   IS071
     C                     MOVEL*BLANKS   IS072
|    C           IR06      CHAINIMISLF01             49
      *
     C                     MOVELRCDR      CHKRCD  3
     C           CHKRCD    IFEQ 'IL0'
     C           IR03      CHAINMA0                  40
     C           *IN40     IFEQ '0'
     C           MA54      IFEQ 'Y'
     C           IR05      ANDEQ'G1'
     C           MA54      ORNE 'Y'
     C           IR05      ANDEQ'G2'
     C                     SETON                     49
     C                     END
     C                     END
     C                     END
      *
| 03-C           *IN49     IFEQ '0'
|   C*
|   C                     EXSR RTN253                     *MOVE->SCRN
     C                     ADD  DQTY      TQTY
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
     C                     END
| 02*C                     ELSE
|   C                     Z-ADDRRN2      DSPRC2
|   C                     MOVE 'Y'       WBOTM2
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C*
|    C                     Z-ADDRRN2      DRRN2      50
|    C                     Z-ADDRRN2      WRRN2
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
21===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
22===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
22===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
