     FIMIALF02IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FIMI028D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I            DS
     I                                        1   9 DBGN1
     I                                        1   7 DBGN11
     I                                        8   9 DBGN12
     I            DS
     I                                        1   9 IA03
     I                                        1   7 IA031
     I                                        8   9 IA032
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           WIA02
     C                     PARM           WIA03   9
     C                     PARM *IN03     I021O1  1
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C           *LIKE     DEFN RRN       WPRCD
     C           *LIKE     DEFN RRN       DSPRCD
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYIA     KLIST
     C                     KFLD           WIA02
     C                     KFLD           DBGN1
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                      *GET HEADING
     C*
  01-C           *IN03     DOWEQ'0'
    C           *IN12     ANDEQ'0'
    C*
  02-C           *IN25     CASEQ'1'       RTN100           下一頁
    C                     CAS            RTN400            START KEY
  02-C                     END
    C*
    C                     EXSR RTN500                     EXFMTSFL
  01-C                     END
     C*
     C                     SETON                     LR
     C*=============================================================*
     C*          RTN010....GET HEADING
     C*=============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELWIA02     #A02
|    C                     MOVE *BLANK    #A03
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '1'
     C           WIA02     CHAINME0                  40
     C  N40                MOVELME04      #A03
| 03-C                     END
     C                     MOVELWIA03     DBGN11
|    C*
01===C                     ENDSR
     C*=============================================================*
     C*          RTN100....ROLLUP MAIN ROUTINE
     C*=============================================================*
02===C           RTN100    BEGSR
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                         98*LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
|   C                     EXSR RTN810                     *ADD SFL DTA
| 01-C                     END
02===C                     ENDSR
     C*=============================================================*
     C*          RTN400....SFL MAIN RUTINE (START KEY)
     C*=============================================================*
03===C           RTN400    BEGSR
|    C                     EXSR RTN405                     *INIT SFL
|    C                     EXSR RTN810                     *ADD SFL DTA
03===C                     ENDSR
     C*=============================================================*
     C*          RTN405....SFL INITIAL
     C*=============================================================*
04===C           RTN405    BEGSR
|    C*
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         DSPRCD
|    C                     Z-ADD12        WPRCD            *PAG RCD
|    C                     MOVE 'N'       WBOTOM  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR
|    C                     SETOF                     52
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYIA     SETLLIA0
04===C                     ENDSR
     C*=============================================================*
     C*          RTN500....EXFMT DSPF
     C*=============================================================*
05===C           RTN500    BEGSR
|    C*
| 01-C           RRN       IFGT 0
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     95    *NO DTA
| 01-C                     END
|    C*
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     SETOF                     50
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
05===C                     ENDSR
     C*=============================================================*
     C*          RTN810....ADD SUBFILE DATA
     C*=============================================================*
06===C           RTN810    BEGSR
|    C*
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN       DOWLTDSPRCD
|   C           WIA02     READEIA0                      44*NF/EOF
|   C*
| 02-C           *IN44     IFEQ '0'
     C           IA031     ANDEQDBGN11
     C           IA06      IFNE 0
     C           IA09      ORNE 0
     C           IA10      ORNE 0
|   C                     EXSR RTN811                     DTA->SFL
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
     C                     END
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRCD
|   C                     MOVE 'Y'       WBOTOM
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN       DRRN
06===C                     ENDSR
     C*=============================================================*
     C*          RTN811....MOVE DTA TO SFL
     C*=============================================================*
07===C           RTN811    BEGSR
|    C* GET 產品代號
|    C                     MOVE *BLANK    MA03
|    C                     MOVELIA02      #A02
|    C           IA03      CHAINMA0                  40
|    C*
07===C                     ENDSR
