     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : IMI022                                     *
     A*    AUTHOR       : A1092  TAYLOR                              *
     A*    DATE WRITTEN : 81/02/17                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存子系統                                *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :物流點存貨狀況                            *
     A*                                                              *
     A****************************************************************
     FMTMAPF  IF  E           K        DISK
     FIMIAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     F*PA#BPF  IF  E           K        DISK
     FIMI022D CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I*                                     135 135 $ADD
 @   I*                                     136 136 $UPD
 @   I*                                     137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I*                                     514 521 $#101
     I            DS
     I                                        1   5 IA02
     I                                        1   1 IA02T
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C           *LIKE     DEFN DBGN11    OBGN11           *START KEY
     C           *LIKE     DEFN DBGN12    OBGN12           *START KEY
     C           *LIKE     DEFN DBGN11    BBGN11           *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN12    BBGN12           *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C           *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BUTTOM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYIA2    KLIST
     C                     KFLD           DBGN11
     C                     KFLD           DBGN12
     C           KEYIA3    KLIST
     C                     KFLD           BBGN11
     C                     KFLD           BBGN12
     C           KEYIA4    KLIST
     C                     KFLD           IA01
     C                     KFLD           IA02
     C           KEYIA5    KLIST
     C                     KFLD           IA01
     C                     KFLD           IA02
     C                     KFLD           DBGN2
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         DATE    60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM $EGMDY    S001I2  60
|    C           DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN11    IFNE OBGN11
|   C           DBGN12    ORNE OBGN12
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN11    OBGN11
|   C                     MOVE DBGN12    OBGN12
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C*          UPD       TAG
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     97
| 05-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           $INQ      IFNE 'Y'
|   C                     SETON                     609099
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C*
| 01-C           IA02T     IFEQ 'T'
| 01-C           $RMK01    ANDNE'Y'
|   C                     SETON                     609099
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C*
04===C           END180    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C           KEYIA2    SETLLIA0
|    C                     MOVE DBGN11    BBGN11
|    C                     MOVE DBGN12    BBGN12
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
| 02-C           BBGN11    IFNE DBGN11
|   C           BBGN12    ORNE DBGN12
|   C           KEYIA3    SETGTIA0
| 02-C                     END
|   C                     EXSR RTN193
|   C                     MOVE IA01      BBGN11
|   C                     MOVE IA02      BBGN12
|   C           *LOVAL    SETLLIA0
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ IA0                      46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     EXSR RTN194
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
|   C           KEYIA4    SETGTIA0
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN194... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN194    BEGSR
|    C*
|    C* GET 公司
|   C                     MOVEL*BLANKS   COMPNY
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'COMPANY' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELIA01      #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      COMPNY
| 01-C                     END
|    C* GET 物流點
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELIA02      #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DFLD
| 01*C                     ELSE
|   C           IA02      CHAINME0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELME04      DFLD
| 02*C                     ELSE
|   C                     MOVE *BLANK    DFLD
| 02-C                     END
| 01-C                     END
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     96    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200...
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C*
| 02-C           *IN25     CASEQ'1'       RTN300           下一頁
|   C                     CAS            RTN400            START KEY
| 02-C                     END
|   C*
|   C                     EXSR RTN500                     EXFMTSFL
| 01-C                     END
|    C*
10===C                     ENDSR
     C*=============================================================*
     C*          RTN300....ROLLUP MAIN ROUTINE
     C*=============================================================*
11===C           RTN300    BEGSR
| 01-C           WBOTM2    IFEQ 'Y'
|   C                     SETON                         98*LST PAG
|   C                     Z-ADDRRN2      DRRN2
| 01*C                     ELSE
|   C                     EXSR RTN810                     *ADD SFL DTA
| 01-C                     END
11===C                     ENDSR
     C*=============================================================*
     C*          RTN400....SFL MAIN RUTINE (START KEY)
     C*=============================================================*
12===C           RTN400    BEGSR
|    C                     EXSR RTN405                     *INIT SFL
|    C                     EXSR RTN810                     *ADD SFL DTA
12===C                     ENDSR
     C*=============================================================*
     C*          RTN405....SFL INITIAL
     C*=============================================================*
13===C           RTN405    BEGSR
|    C*
|    C                     Z-ADD0         DRRN2
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD0         DSPR2   40
|    C                     Z-ADD10        WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C                     SETOF                     53    *EOF
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     52
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYIA5    SETLLIA0
13===C                     ENDSR
     C*=============================================================*
     C*          RTN500....EXFMT DSPF
     C*=============================================================*
14===C           RTN500    BEGSR
|    C*
| 01-C           RRN2      IFGT 0
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     95    *NO DTA
| 01-C                     END
|    C*
|    C                     WRITEDSPC2
|    C                     EXFMTSFLCR2
|    C                     SETOF                     50
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
14===C                     ENDSR
     C*=============================================================*
     C*          RTN810....ADD SUBFILE DATA
     C*=============================================================*
15===C           RTN810    BEGSR
|    C*
|    C                     ADD  WPRCD2    DSPR2
| 01-C           RRN2      DOWLTDSPR2
|   C           KEYIA4    READEIA0                      44*NF/EOF
|   C*
| 02-C           *IN44     IFEQ '0'
     C           IA06      IFNE 0
     C           IA09      ORNE 0
     C           IA10      ORNE 0
|    C           IA03      CHAINMA0                  40
     C           MA58      IFNE 'I'
|   C                     EXSR RTN811                     DTA->SFL
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
     C                     END
     C                     END
| 02*C                     ELSE
|   C                     Z-ADDRRN2      DSPR2
|   C                     MOVE 'Y'       WBOTM2
|   C                     SETON                         53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN2      DRRN2
15===C                     ENDSR
     C*=============================================================*
     C*          RTN811....MOVE DTA TO SFL
     C*=============================================================*
16===C           RTN811    BEGSR
|    C* GET 名稱，單位
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELMA03      DMA03
| 01*C                     ELSE
|   C                     MOVE *BLANKS   DMA03
|   C                     MOVE *BLANKS   DMA03
| 01-C                     END
|    C* GET 數量
|    C                     Z-ADDIA06      DIA06
|    C                     Z-ADDIA07      DIA07
|    C                     Z-ADDIA08      DIA08
|    C                     Z-ADDIA09      DIA09
|    C                     Z-ADDIA10      DIA10
|    C*
16===C                     ENDSR
