      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : IMR0731                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/25                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :送貨揀料彙總表                               *
      ****************************************************************
     FSOSEPF  IF  E           K        DISK
     FSOSCPF  IF  E           K        DISK
     FSOSCLF  IF  E           K        DISK
     F            SC0                               KRENAMESC0L
     FSOSFPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FREWF68  O   E           K        DISK
     E*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*                                     601 602 DSE01
     I                                      603 603 DSEL
     I                                      609 613 DSE07S
     I                                      614 618 DSE07E
     I*(MM/DD/YY)
     I                                      621 6260DSE06
     I*(YY/MM/DD)
     I                                      640 6450YSE06
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C           *LOVAL    SETLLSE0
     C                     READ SE0                      45
  01-C           *IN45     DOWEQ'0'
    C                     EXSR RTN010
    C*
    C           SE02      SETLLSF0
    C           SE02      READESF0                      46
  02-C           *IN46     DOWEQ'0'
    C                     EXSR RTN100
    C           SE02      READESF0                      46
  02-C                     END
    C*
    C                     READ SE0                      45
  01-C                     END
     C*----------------------------------------------------------------
     C*
     C           *LOVAL    SETLLSC0
     C                     READ SC0                      45
  03-C           *IN45     DOWEQ'0'
    C                     EXSR RTN020
    C*
    C           SC02      SETLLSD0
    C           SC02      READESD0                      46
  04-C           *IN46     DOWEQ'0'
    C                     EXSR RTN200
    C           SC02      READESD0                      46
  04-C                     END
    C*
    C                     READ SC0                      45
  03-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN010....READE HAD
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVELSE01      WF6801
|    C                     MOVELSE03      WF6802
|    C                     MOVELSE04      WF6803
|    C                     MOVELSE05      WF6804
B2000C                     Z-ADDSE06      WF6805
|    C                     MOVELSE07      WF6807
B2000C                     Z-ADDSE21      WF6808
|    C                     MOVELSE22      WF6809
|    C                     MOVELSE23      WF6810
|    C                     MOVELSE27      WF6811
|    C                     MOVELSE28      WF6812
|    C                     MOVELSE29      WF6813
|    C                     MOVELSE30      WF6814
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN020....READE HAD
      *==============================================================*
02===C           RTN020    BEGSR
|    C*
|    C                     MOVELSC01      WF6801
|    C                     MOVELSC03      WF6802
|    C                     MOVELSC04      WF6803
|    C                     MOVELSC05      WF6804
|    C                     MOVE SC06      WF6820                       L
B2000C                     Z-ADDSC08      WF6805
|    C                     MOVELSC11      WF6807
|    C                     MOVELSC33      WF6811
|    C                     MOVELSC34      WF6812
|    C                     MOVELSC02      WF6813
|    C                     MOVE *BLANK    WF6815                       L
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
03===C           RTN100    BEGSR
|    C*
|    C                     MOVELSF02      WF6815                       L
|    C                     MOVELSF03      WF6816                       L
|    C                     MOVELSF03      WF6817                       L
|    C                     Z-ADDSF04      WF6818
|    C                     Z-ADDSF05      WF6819
|    C*客戶訂單號碼
|    C           SE29      CHAINSC0L                 40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVE SC06      WF6820                       L
| 01*C                     ELSE                                        L
|   C                     MOVE *BLANK    WF6820                       L
| 01-C                     END
|    C*
|    C                     WRITEWF680
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN200....READE DETAIL
      *==============================================================*
04===C           RTN200    BEGSR
|    C*
|    C                     MOVELSD03      WF6816                       L
|    C                     MOVELSD03      WF6817                       L
|    C                     Z-ADDSD04      WF6818
|    C                     Z-ADDSD05      WF6819
|    C*
|    C                     WRITEWF680
|    C*
04===C                     ENDSR
