      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0441                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/10                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售系統                                     *
      * REMARK       :產品牌價價格表                               *
      ****************************************************************
     FIMIAPF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FIMR065P O   E             39     PRINTER
     IIA0
     I                                              IA03  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I*公司
     I                                      601 601 DIA01S
     I                                      602 602 DIA01E
     I*產品
     I                                      613 621 DIA03S
     I                                      622 630 DIA03E
     I            DS
     I                                        1   5 IA02
     I                                        1   1 IA02L
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    DEFN
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN100
     C   39                EXSR RTN900                     *OVRFLW
     C                     EXSR RTN200
     C*
     CL1                   EXSR RTN300
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
     C                     Z-ADD0         IA06A
     C                     Z-ADD0         IA06B
|    C                     WRITEPH1
|    C                     SETON                     10
01===C                     ENDSR
      *==============================================================*
      *          RTN200....CHECK DETAIL
      *==============================================================*
02===C           RTN200    BEGSR
     C*
|    C           IA02L     IFEQ 'T'
     C                     ADD  IA06      IA06A
     C                     ELSE
     C                     ADD  IA06      IA06B
     C                     END
     C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....CHECK DETAIL
      *==============================================================*
02===C           RTN300    BEGSR
     C*
     C           IA03      CHAINMA0                  41
     C           *IN41     IFEQ '0'
     C           IA06A     SUB  MA29      QTYA
     C           IA06B     SUB  MA30      QTYB
     C                     ELSE
     C           IA06A     SUB  0         QTYA
     C           IA06B     SUB  0         QTYB
     C                     END
     C           QTYA      IFNE 0
     C           QTYB      ORNE 0
     C                     WRITEPD1
     C                     END
     C                     Z-ADD0         IA06A
     C                     Z-ADD0         IA06B
     C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
04===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|    C                     WRITEPH1
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
04===C                     ENDSR
