      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMR0571                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/07/24                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :物流點存貨明細表                             *
      ****************************************************************
     FIMIAPF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FREW507  UF  E           K        DISK                      A
     FPA#APF  IF  E           K        DISK
     FPA#FLF  IF  E           K        DISK
     F            #A0                               KRENAME#A0L
     F                                              KINFDS #FRCDF
     FIMR057P O   E             39     PRINTER
     IIA0
     I                                              IA02  L1
     I#FRCDF      DS
     I                                     *RECORD  RCDF
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      598 5990$PRTID
     I                                      601 601 DIA01
     I                                      603 603 DIA02F
     I                                      604 608 DIA02S
     I                                      609 613 DIA02E
     I                                      614 622 DIA03S
     I                                      623 631 DIA03E
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11A
     C*================================================================
     C*                    KLIST
     C*================================================================
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C*================================================================
     C*                    MAIN ROUTINE
     C*================================================================
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *SET INIT
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL1     IFEQ '1'
    C                     EXSR RTN010                     *SET INIT
  02-C                     END
  01-C                     END
     C*
     C                     EXSR RTN100                     *PROC DATA
     C*
     CL1 10                EXSR RTNL1
     CLR                   EXSR RTNLR
     C*================================================================
     C*          RTN010....SET INIT
     C*== =============================================================
01===C           RTN010    BEGSR
|    C*種類
|    C                     MOVEL*BLANKS   GROUP
| 03-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'GROUP
| 03*C                     ELSE
| 04-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'GROUP
| 04*C                     ELSE
| 05-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'GROUP
| 05*C                     ELSE
|   C                     MOVEL'全部'  GROUP
| 05-C                     END
| 04-C                     END
| 03-C                     END
|    C*****
|    C*公司
|    C*****
|    C                     MOVE *BLANK    #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVEL'COMPANY '#A01
|    C                     MOVELDIA01     #A02
|    C           KEY#A     CHAIN#A0                  43
|    C   43                MOVE *BLANK    D#A03
|    C  N43                MOVEL#A03      D#A03
|    C*****
|    C*物流點
|    C*****
|    C           IA02      CHAINPA#FLF               41
| 06-C           *IN41     IFEQ '0'
|   C*
| 07-C           RCDF      IFEQ 'MD0'
|   C           IA02      CHAINME0                  42
|   C   42                MOVE *BLANK    NAME
|   C  N42                MOVELME04      NAME
| 07*C                     ELSE
|   C                     MOVE *BLANK    #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVELIA02      #A02
|   C           KEY#A     CHAIN#A0                  43
|   C   43                MOVE *BLANK    NAME
|   C  N43                MOVEL#A03      NAME
| 07-C                     END
|   C*
| 06-C                     END
|    C*
|    C  N10                Z-ADD0         IA06T
|    C  N10                Z-ADD0         IA07T
|    C  N10                Z-ADD0         IA08T
|    C  N10                Z-ADD0         IA09T
|    C  N10                Z-ADD0         IA10T
|    C*
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
     C*================================================================
     C*          RTN100....PROC DATA
     C*================================================================
02===C           RTN100    BEGSR
|    C*
|    C           IA03      CHAINMA0                  40
| 01-C           MA11A     IFGE DMA11S
|   C           MA11A     ANDLEDMA11E
|   C   40                MOVE *BLANK    MA03
|   C   40                MOVE *BLANK    MA13
|   C*
|   C                     ADD  IA06      IA06T
|   C                     ADD  IA07      IA07T
|   C                     ADD  IA08      IA08T
|   C                     ADD  IA09      IA09T
|   C                     ADD  IA10      IA10T
|   C*
| 02-C           IA03      IFGE DIA03S
|   C           IA03      ANDLEDIA03E
|   C*
|   C                     EXSR RTN900                     *PROC SKIP
|   C                     WRITEPD1
|   C                     EXSR EXCEL                      *PROC SKIP
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
     C*================================================================
     C*          RTNL1.....PROC L1
     C*================================================================
03===C           RTNL1     BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD2
|    C  NLR                WRITEPE1
|    C*
|    C                     Z-ADD0         IA06T
|    C                     Z-ADD0         IA07T
|    C                     Z-ADD0         IA08T
|    C                     Z-ADD0         IA09T
|    C                     Z-ADD0         IA10T
|    C*
03===C                     ENDSR
     C*================================================================
     C*          RTNLR.....PROC LR
     C*================================================================
04===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
     C*================================================================
     C*          RTN900....PROC SKIP
     C*================================================================
05===C           RTN900    BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
05===C                     ENDSR
     C*================================================================
     C*          EXCEL ....WRITE DOWNLOAD
     C*================================================================
05===C           EXCEL     BEGSR
      *
     C                     MOVELIA03      WF01
     C           WF01      CHAINWF0                  40
     C                     MOVELMA03      WF02
     C                     MOVELMA13      WF03
     C                     Z-ADDIA06      WF04
     C                     Z-ADDIA07      WF05
     C                     Z-ADDIA08      WF06
     C                     Z-ADDIA09      WF07
     C                     Z-ADDIA10      WF08
     C                     WRITEWF0
      *
05===C                     ENDSR
