      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : IMR076                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 08/28/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :產品存量分佈明細表                           *
      ****************************************************************
     FIMR081D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      139 139 $RMK01
     I                                      598 5990$PRTID
     I*
     I                                      631 631 DIA01S
     I                                      632 632 DIA01E
     I                                      601 609 DIA03S
     I                                      611 619 DIA03E
     I                                      621 625 DIA02S
     I                                      626 630 DIA02E
     I                                      631 632 DBRAND
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DIA01S
|    C                     MOVE *BLANK    DIA01E
|    C                     MOVE *BLANK    DIA03S
|    C                     MOVE *BLANK    DIA03E
|    C                     MOVE *BLANK    DIA02S
|    C                     MOVE *BLANK    DIA02E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*產品
| 01-C           DIA03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DIA03S
| 01-C                     END
|    C*
| 02-C           DIA03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DIA03E
| 02-C                     END
|    C*
| 03-C           DIA03S    IFGT DIA03E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C**
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品代號
| 02-C           D#ROW     IFEQ 12
| 03-C           D#COL     IFGE 36
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS001'
|   C                     PARM           DIA03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 49
|   C           D#COL     ANDLE47
|   C                     CALL 'WDS001'
|   C                     PARM           DIA03E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*ＢＲＡＮＤ
| 05-C           D#ROW     IFEQ 8
| 06-C           D#COL     IFGE 36
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS026'
|   C                     PARM           DIA02S
|   C                     GOTO ENDF4
| 06-C                     END
| 05-C                     END
|   C*
| 01-C                     END
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
