      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0471                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/14                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :送貨未確認明細表                             *
      ****************************************************************
     FIMIRLF15IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FREW502  UF  E           K        DISK                      A
     FIMIAPF  IF  E           K        DISK
     FPOPDPF  IF  E           K        DISK
     FREW500  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I                                      601 605 DSE07S
     I                                      606 610 DSE07E
     I*          　　　　
     I                                      611 6160DSE06S
     I                                      617 6220DSE06E
     I*(YY/MM/DD)
M001AI                                      630 6350YSE06S
M001AI                                      636 6410YSE06E
M001AI                                      651 652 DSE08S
M001AI                                      653 654 DSE08E
M001AI                                      655 663 DSE09S
M001AI                                      664 672 DSE09E
M001AI                                      673 6730DSE10S
M001AI*(YYYY/MM/DD)
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I            DS
     I                                        1   9 IR03
     I                                        1   2 IR031
     I                                        3   4 IR032
     I*
     I            DS
     I                                        1   9 IA03
     I                                        1   2 IA031
     I                                        3   4 IA032
     I            DS
     I                                        1  10 PD19
     I                                       10  10 PD191
     I*
B2000C           *LIKE     DEFN YSE06S    DSE6SB
B2000C           *LIKE     DEFN YSE06S    DSE6SA
B2MODC           *LIKE     DEFN YSE06S    DSE6EB
B2MODC           *LIKE     DEFN YSE06S    DSE6EA
B2000C           *LIKE     DEFN YSE06S    WSE6SB
B2000C           *LIKE     DEFN YSE06S    WSE6SA
B2000C           *LIKE     DEFN YSE06S    WSE6EB
B2000C           *LIKE     DEFN YSE06S    WSE6EA
M001DC*          *LIKE     DEFN YSE06S    BEGIND
B2MODC           *LIKE     DEFN YSE06S    ENDD
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           R500K     KLIST
     C                     KFLD           WF5000
     C                     KFLD           WF5002
     C           KEYIA     KLIST
     C                     KFLD           IAKEY1  1
     C                     KFLD           DSE07S
     C           KEYRE     KLIST
     C                     KFLD           BEGIND
     C                     KFLD           DSE07S
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                      RTV DATE
     C                     EXSR RTN100                      CREATE TRM L
     C                     EXSR RTN200                      CAL. INVAT
     C                     RETRN
      *==============================================================*
      *          RTN010....RTV DATE  & INITIALIZE
      *==============================================================*
02===C           RTN010    BEGSR
     C*
M001DC*          YSE06S    SUB  110000    WSE06S  60
M001AC           YMD8S     SUB  110000    WSE06S  60
M001AC           WSE06S    IFLT 0
M001AC                     Z-SUB0         WSE06S
M001AC                     END
B2INF *CVR0001 sev.00 Field WSE06S is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code SUB
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          YSE06E    SUB  110000    WSE06E  60
M001AC           YMD8E     SUB  110000    WSE06E  60
     C                     CALL 'P62'
|   C                     PARM           WSE06S  60
|   C                     PARM -1        P6202I  40
M001DC*          WSE6SB    PARM           P6211O  80
M001AC           WSE6SB    PARM           P6211O  60
B2CHKC           WSE6SB    ADD  110000    DSE6SB
     C*
     C                     CALL 'P62'
|   C                     PARM           WSE06S  60
|   C                     PARM +1        P6202I  40
M001DC*          WSE6SA    PARM           P6211O  80
M001AC           WSE6SA    PARM           P6211O  60
B2CHKC           WSE6SA    ADD  110000    DSE6SA
     C*
     C*
     C                     CALL 'P62'
|   C                     PARM           WSE06E  60
|   C                     PARM -1        P6202I  40
M001DC*          WSE6EB    PARM           P6211O  80
M001AC           WSE6EB    PARM           P6211O  60
B2???C           WSE6EB    ADD  110000    DSE6EB
B2INF *CVR0001 sev.00 Field DSE6EB is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code ADD
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
     C*
     C                     CALL 'P62'
|   C                     PARM           WSE06E  60
|   C                     PARM +1        P6202I  40
M001DC*          WSE6EA    PARM           P6211O  80
M001AC           WSE6EA    PARM           P6211O  60
B2???C           WSE6EA    ADD  110000    DSE6EA
B2INF *CVR0001 sev.00 Field DSE6EA is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code ADD
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CREATE TRANSACTION
      *==============================================================*
02===C           RTN100    BEGSR
M001DC*                    Z-ADDYSE06S    BEGIND
M001AC                     Z-ADDYMD8S     BEGIND  80
     C*
B2000C           KEYRE     SETLLPE0
     C                     MOVE '01'      FILFLG  2
|   C                     READ PE0                      46
  01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ PE0                      46
     C                     END
     C*
B2000C           KEYRE     SETLLPG0
     C                     MOVE '02'      FILFLG
|   C                     READ PG0                      46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ PG0                      46
     C                     END
     C*
B2000C           KEYRE     SETLLPG0#
     C                     MOVE '03'      FILFLG
|   C                     READ PG0#                     46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ PG0#                     46
     C                     END
     C*
     C*
B2000C           KEYRE     SETLLSO0#
     C                     MOVE '10'      FILFLG
|   C                     READ SO0#                     46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ SO0#                     46
     C                     END
     C*
B2000C           KEYRE     SETLLIF0
     C                     MOVE '11'      FILFLG
|   C                     READ IF0                      46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ IF0                      46
     C                     END
     C*
B2000C           KEYRE     SETLLIH0
     C                     MOVE '12'      FILFLG
|   C                     READ IH0                      46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ IH0                      46
     C                     END
     C*
B2000C           KEYRE     SETLLIH0#
     C                     MOVE '13'      FILFLG
|   C                     READ IH0#                     46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ IH0#                     46
     C                     END
     C*
B2000C           KEYRE     SETLLIJ0
     C                     MOVE '14'      FILFLG
|   C                     READ IJ0                      46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ IJ0                      46
     C                     END
     C*
B2000C           KEYRE     SETLLIL0
     C                     MOVE '16'      FILFLG
|   C                     READ IL0                      46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ IL0                      46
     C                     END
     C*
B2000C           KEYRE     SETLLIB0
     C                     MOVE '17'      FILFLG
|   C                     READ IB0                      46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ IB0                      46
     C                     END
     C*
B2000C           KEYRE     SETLLIU0
     C                     MOVE '18'      FILFLG
|   C                     READ IU0                      46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ IU0                      46
     C                     END
     C*
B2000C*                    Z-ADDDSE6SA    BEGIND
M001AC                     MOVE DSE6SA    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    BEGIND
     C*
B2000C           KEYRE     SETLLSH0
     C                     MOVE '08'      FILFLG
|   C                     READ SH0                      46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ SH0                      46
     C                     END
     C*
M001DC*                    Z-ADDDSE6SB    BEGIND
M001AC                     MOVE DSE6SB    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    BEGIND
     C*
B2000C           KEYRE     SETLLSF0
     C                     MOVE '06'      FILFLG
|   C                     READ SF0                      46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ SF0                      46
     C                     END
     C*
B2000C           KEYRE     SETLLIJ0#
     C                     MOVE '15'      FILFLG
|   C                     READ IJ0#                     46
| 01-C           *IN46     DOWEQ'0'
     C                     EXSR CRTFLD
|   C                     READ IJ0#                     46
     C                     END
02===C                     ENDSR
     C*
      *==============================================================*
      *          RTN100....RETRIEVE DATA
      *==============================================================*
     C           CRTFLD    BEGSR
B2000C           IR04      IFGE BEGIND
     C           IR02      ANDGEDSE07S
     C           IR02      ANDLEDSE07E
     C           IR032     ANDGEDSE08S
     C           IR032     ANDLEDSE08E
     C           IR03      ANDGEDSE09S
     C           IR03      ANDLEDSE09E
     C                     EXSR IWF500
     C                     MOVE IR02      WF5000
     C           FILFLG    IFEQ '08'
B2CHKC*M001M               SUB  110000    IR04
M001MC                     SUB  19110000  IR04
M001AC                     Z-ADDIR04      XIR04   60
     C                     CALL 'P62'
M001DC*                    PARM           IR04    80
M001AC                     PARM           XIR04   60
|   C                     PARM -1        P6202I  40
M001DC*          IR04      PARM           P6211O  80
M001AC           XIR04     PARM           P6211O  60
M001DC*                    ADD  110000    IR04
M001AC           XIR04     ADD  19110000  IR04
     C                     END
     C           FILFLG    IFEQ '15'
     C*          FILFLG    OREQ '06'
B2CHKC*M001M               SUB  110000    IR04
M001MC                     SUB  19110000  IR04
M001AC                     Z-ADDIR04      XIR04   60
     C                     CALL 'P62'
M001DC*                    PARM           IR04    80
M001AC                     PARM           XIR04   60
|   C                     PARM +1        P6202I  40
M001DC*          IR04      PARM           P6211O  80
M001AC           XIR04     PARM           P6211O  60
M001DC*                    ADD  110000    IR04
M001AC           XIR04     ADD  19110000  IR04
     C                     END
B2000C                     Z-ADDIR04      WF5001
     C                     MOVELIR03      WF5002
     C                     MOVELIR06      WF5003
     C           FILFLG    IFEQ '01'
     C                     MOVE '1'       WF5004
     C                     END
     C           FILFLG    IFEQ '02'
     C                     MOVE '2'       WF5004
     C                     END
     C           FILFLG    IFEQ '03'
     C                     MOVE '1'       WF5004
     C                     Z-ADDIR071     IR121
     C                     END
     C           FILFLG    IFEQ '06'
     C                     ADD  IR122     IR121
     C                     MOVE '2'       WF5004
     C                     END
     C           FILFLG    IFEQ '08'
     C                     ADD  IR122     IR121
     C                     MOVE '1'       WF5004
     C                     END
     C           FILFLG    IFEQ '10'
     C                     MOVE '1'       WF5004
     C                     END
     C           FILFLG    IFEQ '11'
     C                     MOVE '2'       WF5004
     C                     END
     C           FILFLG    IFEQ '12'
     C                     MOVE '2'       WF5004
     C                     END
     C           FILFLG    IFEQ '13'
     C                     MOVE '1'       WF5004
     C                     END
     C           FILFLG    IFEQ '14'
     C                     MOVE '2'       WF5004
     C                     END
     C           FILFLG    IFEQ '15'
     C                     MOVE '1'       WF5004
     C                     END
     C           FILFLG    IFEQ '16'
     C           IR09      IFEQ 1
     C                     MOVE '1'       WF5004
     C                     ELSE
     C                     MOVE '2'       WF5004
     C                     END
     C                     END
     C           FILFLG    IFEQ '17'
     C           IR121     IFGE 1
     C                     MOVE '1'       WF5004
     C                     ELSE
     C                     MOVE '2'       WF5004
     C           -1        MULT IR121     IR121
     C                     END
     C                     END
     C           FILFLG    IFEQ '18'
     C                     ADD  IR122     IR121
     C           IR121     IFGE 1
     C                     MOVE '1'       WF5004
     C                     ELSE
     C                     MOVE '2'       WF5004
     C           -1        MULT IR121     IR121
     C                     END
     C                     END
     C                     Z-ADDIR121     WF5005
     C           IR03      CHAINMTMAPF               55
     C           *IN55     IFEQ '0'
     C           MA35      MULT MA36      WFF506 126
     C                     MULT MA47      WFF506
     C           WFF506    DIV  1000000   WFF506
     C           WFF506    DIV  MA16      WFF506
     C           WFF506    MULT WF5005    WF5006    H
     C                     ELSE
     C                     Z-ADD0         WF5006
     C                     END
     C           FILFLG    IFEQ '01'
     C           IR06      CHAINPOPDPF               55
     C           *IN55     IFEQ '0'
     C           PD191     IFEQ '1'
     C           PD191     OREQ ' '
     C                     Z-ADDWF5006    WF5007
     C                     ELSE
     C           PD191     IFEQ '2'
     C                     Z-ADDWF5006    WF5008
     C                     ELSE
     C           PD191     IFEQ '3'
     C                     Z-ADDWF5006    WF5009
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C           FILFLG    IFNE '03'
     C           FILFLG    ANDNE'14'
     C                     Z-ADDWF5006    WF5007
     C                     ELSE
     C                     Z-ADD*ZEROS    WF5007
     C                     END
     C                     MOVE FILFLG    WF500A
     C                     WRITEWF500
     C                     END
     C                     ENDSR
      *==============================================================*
      *          RTN200....CAL INVENTORY
      *==============================================================*
     C* INITIAL WRK FIELD
     C           IWF500    BEGSR
     C                     MOVEL*BLANK    WF5000
     C                     MOVEL*BLANK    WF5002
     C                     MOVEL*BLANK    WF5003
     C                     MOVEL*BLANK    WF5004
B2000C                     Z-ADD*ZEROS    WF5001
     C                     Z-ADD*ZEROS    WF5005
     C                     Z-ADD*ZEROS    WF5006
     C                     Z-ADD*ZEROS    WF5007
     C                     Z-ADD*ZEROS    WF5008
     C                     Z-ADD*ZEROS    WF5009
     C                     ENDSR
      *==============================================================*
      *          RTN200....CAL INVENTORY
      *==============================================================*
     C* WRITE CURRENT INV QTY TO WRK FILE.
     C           RTN200    BEGSR
     C                     MOVE 'R'       IAKEY1
     C           KEYIA     SETLLIMIAPF
     C                     READ IMIAPF                   46
     C           WRI502    TAG
     C           *IN46     DOWEQ'0'
     C           IA02      IFGT DSE07E
     C                     SETON                         46
     C                     GOTO WRI502
     C                     END
     C           IA032     IFGE DSE08S
     C           IA032     ANDLEDSE08E
     C           IA03      ANDGEDSE09S
     C           IA03      ANDLEDSE09E
     C                     MOVELIA02      WF5021
     C                     MOVELIA03      WF5022
     C                     Z-ADDIA06      WF5023
     C           IA03      CHAINMTMAPF               55
     C           *IN55     IFEQ '0'
     C           MA35      MULT MA36      CBMW1  126
     C                     MULT MA47      CBMW1
     C           CBMW1     DIV  1000000   CBMW1
     C           CBMW1     DIV  MA16      CBMW1
     C           CBMW1     MULT WF5023    WF5024    H
     C                     WRITEWF502
     C                     END
     C                     END
     C                     READ IMIAPF                   46
     C                     END
     C* CAL INV QTY AT BEGIN DATE
     C*
|   C           *LOVAL    SETGTREW500
     C                     READ REW500                   46
| 01-C           *IN46     DOWEQ'0'
     C           R500K     CHAINREW502               55
     C           *IN55     IFEQ '0'
     C           WF5004    ANDEQ'1'
     C                     SUB  WF5005    WF5023
     C                     SUB  WF5006    WF5024
     C                     UPDATWF502
     C                     END
     C           *IN55     IFEQ '0'
     C           WF5004    ANDEQ'2'
     C                     ADD  WF5005    WF5023
     C                     ADD  WF5006    WF5024
     C                     UPDATWF502
     C                     END
     C           *IN55     IFEQ '1'
     C           WF5004    ANDEQ'1'
     C                     MOVE WF5000    WF5021
     C                     MOVE WF5002    WF5022
     C                     Z-ADD0         WF5023
     C                     SUB  WF5005    WF5023
     C                     SUB  WF5006    WF5024
     C                     WRITEWF502
     C                     END
     C           *IN55     IFEQ '1'
     C           WF5004    ANDEQ'2'
     C                     MOVE WF5000    WF5021
     C                     MOVE WF5002    WF5022
     C                     Z-ADD0         WF5023
     C                     ADD  WF5005    WF5023
     C                     ADD  WF5006    WF5024
     C                     WRITEWF502
     C                     END
     C                     READ REW500                   46
     C                     END
     C                     ENDSR
     C*
     C/COPY HBP2CVTR
