      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : IMR0662                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 82/03/16                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存資料子系統                               *
      * REMARK       :產品調撥明細表                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.04  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREWF65  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
B2CHKFIMR066BPO   E             39     PRINTER
B2INF *CVR3009 sev.30 PRINTER file IMR066BP must be converted, because
B2INF *   field IJ06 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert IMR066BP, enlarging IJ06
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     IWF650
     I                                              IJ07  L1
     I                                              IJ08  L2
     I                                              IJ03  L3
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I*產品代號，出貨物流點，收貨
     I                                      601 609 DIJ03S
     I                                      611 619 DIJ03E
     I                                      620 624 DIJ07S
     I                                      625 629 DIJ07E
     I                                      630 634 DIJ08S
     I                                      635 639 DIJ08E
     I*調撥日期(MM/DD/YY)
     I                                      640 6450DII05S
     I                                      646 6510DII05E
     I                                      664 6690DII06S
     I                                      670 6750DII06E
     I                                      750 750 IN20
     I                                      678 678 DYES
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
    C  N10                EXSR RTN010                     *INIT ENVIRM
     C*
     C           DYES      IFEQ 'N'
     C           DYES      OREQ 'Y'
     C           IJ04      ANDNEIJ05
     C                     EXSR RTN100                     *GET HEADING
     C                     END
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CL3 10                EXSR RTN400
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....INIT VALUE
      *==============================================================*
     C           RTN010    BEGSR
     C*
| 03-C           IN20      IFEQ '0'
|   C                     SETOF                     20
| 03*C                     ELSE
|   C                     SETON                     20
| 03-C                     END
     C*
     C                     SETON                     1021
     C*
     C                     Z-ADD0         IJ04T1
     C                     Z-ADD0         IJ05T1
     C                     Z-ADD0         IJ04T0
     C                     Z-ADD0         IJ05T0
     C                     Z-ADD0         IJ04T2
     C                     Z-ADD0         IJ05T2
     C*
     C*產品代號
     C           IJ03      CHAINMA0                  40
     C*
     C   40                MOVE *BLANK    MA03
     C*
     C                     MOVE *BLANK    #A01
     C                     MOVEL'STORAGE' #A01
     C*
    C                     WRITEPH1
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN100....CHAIN DATA
      *==============================================================*
     C           RTN100    BEGSR
     C*產品代號
     C           IJ03      CHAINMA0                  40
     C*
     C   40                MOVE *BLANK    MA03
     C*
     C*出貨物流點
     C                     MOVELIJ07      #A02
     C           KEY#A     CHAIN#A0                  40
     C           *IN40     IFEQ '0'
     C                     MOVEL#A03      D#A037
     C                     ELSE
     C                     MOVE *BLANK    D#A037
     C                     END
     C*
     C*收貨物流點
     C                     MOVELIJ08      #A02
     C           KEY#A     CHAIN#A0                  40
     C           *IN40     IFEQ '0'
     C                     MOVEL#A03      D#A038
     C                     ELSE
     C                     MOVE *BLANK    D#A038
     C                     END
     C*
     C           IJ04      SUB  IJ05      IJ0405
     C                     ADD  IJ04      IJ04T0
     C                     ADD  IJ05      IJ05T0
M001AC                     Z-ADDIJ06      PIJ06
M001AC                     Z-ADDII06      PII06
     C*
     C   39                EXSR RTN900                     *PROC SKIP
     C                     WRITEPD1
     C*
     C                     SETOF                     303132
     C                     SETOF                     21
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN200
      *==============================================================*
     C           RTN200    BEGSR
     C*
     C           DYES      IFEQ 'N'
     C   39                EXSR RTN900                     *PROC SKIP
     C                     WRITEPT0
     C*
     C                     ADD  IJ04T0    IJ04T1
     C                     ADD  IJ05T0    IJ05T1
     C                     Z-ADD0         IJ04T0
     C                     Z-ADD0         IJ05T0
     C*
     C                     SETOF                       32
     C*
     C                     END
     C                     ENDSR
      *==============================================================*
      *          RTN300
      *==============================================================*
     C           RTN300    BEGSR
     C*
     C           DYES      IFEQ 'N'
     C   39                EXSR RTN900                     *PROC SKIP
     C                     WRITEPT1
     C*
     C                     ADD  IJ04T1    IJ04T2
     C                     ADD  IJ05T1    IJ05T2
     C                     Z-ADD0         IJ04T1
     C                     Z-ADD0         IJ05T1
     C*
     C                     SETOF                     313221
     C*
     C                     END
     C                     ENDSR
      *==============================================================*
      *          RTN400
      *==============================================================*
     C           RTN400    BEGSR
     C*
     C           DYES      IFEQ 'N'
     C   39                EXSR RTN900                     *PROC SKIP
     C                     WRITEPT2
     C*
     C                     Z-ADD0         IJ04T2
     C                     Z-ADD0         IJ05T2
     C*
     C                     SETOF                     313230
     C*
     C                     END
     C                     ENDSR
      *==============================================================*
      *          RTN900....PROC SKIP
      *==============================================================*
     C           RTN900    BEGSR
     C*
     C*產品代號
     C           IJ03      CHAINMA0                  40
     C*
     C   40                MOVE *BLANK    MA03
     C*
     C                     MOVE *BLANK    #A01
     C                     MOVEL'STORAGE' #A01
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     SETOF                     39
     C                     SETON                     10
     C                     END
     C*
     C           *IN39     IFEQ '1'
     C                     WRITEPE1
     C                     WRITEPH1
     C                     SETON                     21
     C                     SETOF                     39
     C                     SETOF                     313230
     C                     END
     C*
     C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
04===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|    C                     WRITEPH1
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
04===C                     ENDSR
