     FREWF51  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FIMIAPF  IF  E           K        DISK
     FIMR063P O   E             39     PRINTER
     E*
     IWF510
     I                                              WF5101L2
     I                                              WF5102L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*公司
     I                                      601 601 DIA01S
     I                                      602 602 DIA01E
     I*物留點
     I                                      603 607 DIA02S
     I                                      603 603 IA02SL
     I                                      608 612 DIA02E
     I                                      608 608 IA02EL
     I*產品
     I                                      613 621 DIA03S
     I                                      622 630 DIA03E
     I*(MM/DD/YY)
     I                                      631 6360DATES
     I                                      637 6420DATEE
     I*
     I*(YY/MM/DD)
     I                                      651 6560YDATES
     I                                      657 6620YDATEE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYIA     KLIST
     C                     KFLD           WF5101
     C                     KFLD           WF5102
     C                     KFLD           WF5103
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL1     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010                     *HEADING
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
      *
|    C*物流點
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVELWF5102    #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #A03
| 01-C                     END
|    C                     WRITEPH1
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*產品
|    C           WF5103    CHAINMA0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 04-C                     END
|    C*保留量
     C           KEYIA     CHAINIA0                  40
     C           *IN40     IFEQ '1'
     C                     Z-ADD0         IA09
     C                     END
|    C*
|    C           WF5104    ADD  WF5105    WFTOT
|    C                     ADD  WF5106    WFTOT
|    C                     ADD  WF5107    WFTOT
     C           WFTOT     IFNE IA09
     C                     MOVE '*'       MARK
     C                     ELSE
     C                     MOVE *BLANK    MARK
     C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
      *
07===C                     ENDSR
      *==============================================================*
      *          RTN999....END
      *==============================================================*
06===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE3
     C                     END
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
