      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMR046                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/27                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :客戶送貨明細表                               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FIMR046D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      598 5990$PRTID
     I                                      601 601 COMP
     I                                      677 677 COMPS
     I                                      678 678 COMPE
     I                                      602 602 DSEL
     I                                      603 603 DSE27S
     I                                      604 604 DSE27E
     I                                      605 606 DSE28S
     I                                      607 608 DSE28E
     I                                      609 613 DSE07S
     I                                      614 618 DSE07E
     I                                      619 627 DSE04S
     I                                      628 636 DSE04E
     I*(MM/DD/YY)
     I                                      637 6420DSE21S
     I                                      643 6480DSE21E
     I*(YY/MM/DD)
M001MI*                                     650 6550YSE21S
M001MI*                                     656 6610YSE21E
M001MI                                      650 6570YSE21S
M001MI                                      658 6650YSE21E
     I*(MM/DD/YY)
     I                                      671 6760DSE24S
     I                                      681 6860DSE24E
     I*
     I                                      691 696 DSE32S
     I                                      701 706 DSE32E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C                     EXSR RTN020
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSEL
|    C                     MOVE *BLANK    DSE27S
|    C                     MOVE *BLANK    DSE27E
|    C                     MOVE *BLANK    DSE28S
|    C                     MOVE *BLANK    DSE28E
|    C                     MOVE *BLANK    DSE07S
|    C                     MOVE *BLANK    DSE07E
|    C                     MOVE *BLANK    DSE04S
|    C                     MOVE *BLANK    DSE04E
|    C                     MOVE *BLANK    DSE32S
|    C                     MOVE *BLANK    DSE32E
|    C                     Z-ADD0         DSE21S
|    C                     Z-ADD0         DSE21E
|    C                     Z-ADD0         DSE24S
|    C                     Z-ADD0         DSE24E
|    C                     Z-ADD0         YSE21S
|    C                     Z-ADD0         YSE21E
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN020....INIT SCREEN
      *===============================================================*
01===C           RTN020    BEGSR
|    C*
     C           $WRHUS    IFNE '*ALL '
     C           $WRHUS    ANDNE*BLANKS
|    C                     MOVEL$WRHUS    DSE07S
|    C                     MOVEL$WRHUS    DSE07E
     C                     END
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
     C*
     C*辦事處
     C           COMP      IFEQ *BLANK
     C                     MOVE *LOVAL    COMPS
     C                     MOVE *HIVAL    COMPE
     C                     ELSE
     C                     MOVE COMP      COMPS
     C                     MOVE COMP      COMPE
     C                     END
|    C*
|    C*通路
| 02-C           DSE27S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE27S
| 02-C                     END
|    C*
| 03-C           DSE27E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE27E
| 03-C                     END
|    C*
| 04-C           DSE27S    IFGT DSE27E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*型態
| 05-C           DSE28S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE28S
| 05-C                     END
|    C*
| 06-C           DSE28E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE28E
| 06-C                     END
|    C*
| 07-C           DSE28S    IFGT DSE28E
|   C                     SETON                     6364
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*物流點
| 08-C           DSE07S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE07S
| 08-C                     END
|    C*
| 09-C           DSE07E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE07E
| 09-C                     END
|    C*
| 10-C           DSE07S    IFGT DSE07E
|   C                     SETON                     6566
|   C                     SETON                     9299
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶代號
| 11-C           DSE04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE04S
| 11-C                     END
|    C*
| 12-C           DSE04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE04E
| 12-C                     END
|    C*
| 13-C           DSE04S    IFGT DSE04E
|   C                     SETON                     6768
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C*業務員
| 11-C           DSE32S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE32S
| 11-C                     END
|    C*
| 12-C           DSE32E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE32E
| 12-C                     END
|    C*
| 13-C           DSE32S    IFGT DSE32E
|   C                     SETON                     7374
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
|   C*
|    C*(CHECK DATE)-送貨日期＆確認日期
|    C           DSE24S    IFEQ 0
     C           DSE24E    ANDEQ0
     C           DSE21S    ANDEQ0
     C           DSE21E    ANDEQ0
     C                     SETON                     7172
     C                     SETON                     9599
     C                     END
|    C   99                GOTO END100
     C*
     C           DSE24S    IFEQ 0
     C           DSE24E    ANDEQ0
     C*
     C           DSE21S    IFEQ 0
M001MC*                    Z-ADD010101    DSE21S
M001MC                     Z-ADD010192    DSE21S
     C                     END
     C*
     C           DSE21E    IFEQ 0
M001MC*                    Z-ADD123199    DSE21S
M001MC                     Z-ADD123129    DSE21S
     C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSE21S    P0901I  60
|    C                     PARM           P0911O  1
| 16-C           P0911O    IFEQ 'N'
|   C                     SETON                     699399
| 16-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSE21E    P0901I  60
|    C                     PARM           P0911O  1
| 17-C           P0911O    IFEQ 'N'
|   C                     SETON                     709399
| 17-C                     END
|    C   99                GOTO END100
|    C*
|    C*
|    C*(CHANGE TO CHINESE DATE)--FOR CL
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSE21S    S001I2  60
|    C*M001M     YSE21S    PARM           S001OI  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSE21S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSE21E    S001I2  60
|    C*M001M     YSE21E    PARM           S001OI  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSE21E
|    C*
|    C*(START VALUE MUST BE GREATER THAN END VALUE)
|    C*
| 18-C           YSE21S    IFGT YSE21E
|   C                     SETON                     6970
|   C                     SETON                     9199
| 18-C                     END
|    C   99                GOTO END100
     C                     MOVE 'A'       DSEL
     C*
     C                     ELSE
     C*
     C           DSE21S    IFNE 0
     C                     SETON                     7172
     C                     SETON                     699399
     C                     END
     C*
     C           DSE21E    IFNE 0
     C                     SETON                     7172
     C                     SETON                     709399
     C                     END
     C*
     C           DSE24S    IFEQ 0
M001MC*                    Z-ADD010101    DSE24S
M001MC                     Z-ADD010192    DSE24S
     C                     END
     C*
     C           DSE24E    IFEQ 0
M001MC*                    Z-ADD123199    DSE24E
M001MC                     Z-ADD123129    DSE24E
     C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSE24S    P0901I  60
|    C                     PARM           P0911O  1
| 16-C           P0911O    IFEQ 'N'
|   C                     SETON                     719399
| 16-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSE24E    P0901I  60
|    C                     PARM           P0911O  1
| 17-C           P0911O    IFEQ 'N'
|   C                     SETON                     729399
| 17-C                     END
|    C   99                GOTO END100
|    C*
|    C*
|    C*(CHANGE TO CHINESE DATE)--FOR CL
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSE24S    S001I2  60
|    C*M001M     YSE21S    PARM           S001OI  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSE21S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSE24E    S001I2  60
|    C*M001M     YSE21E    PARM           S001OI  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSE21E
|    C*
|    C*(START VALUE MUST BE GREATER THAN END VALUE)
|    C*
| 18-C           YSE21S    IFGT YSE21E
|   C                     SETON                     7172
|   C                     SETON                     9199
| 18-C                     END
|    C   99                GOTO END100
     C                     MOVE 'B'       DSEL
     C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     IFEQ 41
|   C                     CALL 'WDS018'
|   C                     PARM           DSE27S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFEQ 52
|   C                     CALL 'WDS018'
|   C                     PARM           DSE27E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     IFGE 41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS009'
|   C                     PARM DSE27S    PSE27S  1
|   C                     PARM           DSE28S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 52
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS009'
|   C                     PARM DSE27E    PSE27E  1
|   C                     PARM           DSE28E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
|   C*客戶代號
| 02-C           D#ROW     IFEQ 10
|   C           D#COL     IFGE 41
|   C           D#COL     ANDLE49
|   C                     CALL 'WDS003'
|   C                     PARM           DSE04S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS003'
|   C                     PARM           DSE04E
|   C                     GOTO ENDF4
| 02-C                     END
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
