     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.04  Y2K MODIFY                    */
     /*=============================================================*/
     FIMIBPF  IF  E           K        DISK
     FIMIUPF  IF  E           K        DISK
     FPOPCPF  IF  E           K        DISK
     FPOPEPF  IF  E           K        DISK
     FPOPGPF  IF  E           K        DISK
     FPOPFPF  IF  E           K        DISK
     FPOPIPF  IF  E           K        DISK
     FIMIFPF  IF  E           K        DISK
     FIMIGPF  IF  E           K        DISK
     FIMIHPF  IF  E           K        DISK
     FIMIMPF  IF  E           K        DISK
     FIMILPF  IF  E           K        DISK
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FSOSEPF  IF  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FSOSGPF  IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FSOSNPF  IF  E           K        DISK
     FSOSOPF  IF  E           K        DISK
     FREWFB2  O   E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 601 DIN01
     I                                      608 616 DIN04S
     I                                      617 625 DIN04E
     I                                      626 6290DIN02S
     I                                      626 6270SMM
     I                                      628 6290SYY
M001MI*                                     630 6350WIN02S
M001MI                                      640 6470WIN02S
     I                                      636 6390DIN02E
     I                                      636 6370EMM
     I                                      638 6390EYY
M001MI*                                     640 6450WIN02E
M001MI                                      650 6570WIN02E
     I            DS
     I                                        1  12 SN02
     I                                        3   4 SN02L
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYIL     KLIST
     C                     KFLD           IM02
     C           KEYPC     KLIST
     C                     KFLD           PC02
     C                     KFLD           PC03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *LOVAL    SETLLIB0
     C                     READ IB0                      46
  01-C           *IN46     DOWEQ'0'
    C                     EXSR RTN100
    C                     READ IB0                      46
  01-C                     END
     C*
     C           *LOVAL    SETLLIU0
     C                     READ IU0                      46
  02-C           *IN46     DOWEQ'0'
    C                     EXSR RTN110
    C                     READ IU0                      46
  02-C                     END
     C*
     C           *LOVAL    SETLLPE0
     C                     READ PE0                      46
  03-C           *IN46     DOWEQ'0'
    C                     EXSR RTN120
    C                     READ PE0                      46
  03-C                     END
     C*
     C           *LOVAL    SETLLPF0
     C                     READ PF0                      46
  04-C           *IN46     DOWEQ'0'
    C           PF02      SETLLPG0
    C           PF02      READEPG0                      47
  05-C           *IN47     DOWEQ'0'
  06-C           PG03      IFGE DIN04S
    C           PG03      ANDLEDIN04E
    C                     EXSR RTN130
  06-C                     END
    C           PF02      READEPG0                      47
  05-C                     END
    C                     READ PF0                      46
  04-C                     END
     C*
     C           *LOVAL    SETLLPI0
     C                     READ PI0                      46
  07-C           *IN46     DOWEQ'0'
    C                     EXSR RTN140
    C                     READ PI0                      46
  07-C                     END
     C*
     C           *LOVAL    SETLLIG0
     C                     READ IG0                      46
  08-C           *IN46     DOWEQ'0'
    C           IG02      SETLLIH0
    C           IG02      READEIH0                      47
  09-C           *IN47     DOWEQ'0'
  10-C           IH03      IFGE DIN04S
    C           IH03      ANDLEDIN04E
    C           IH04      ORGE DIN04S
    C           IH04      ANDLEDIN04E
    C                     EXSR RTN150
  10-C                     END
    C           IG02      READEIH0                      47
  09-C                     END
    C                     READ IG0                      46
  08-C                     END
     C*
     C           *LOVAL    SETLLIM0
     C                     READ IM0                      46
  11-C           *IN46     DOWEQ'0'
    C           KEYIL     SETLLIL0
    C           KEYIL     READEIL0                      47
  12-C           *IN47     DOWEQ'0'
  13-C           IL05      IFGE DIN04S
    C           IL05      ANDLEDIN04E
    C                     EXSR RTN160
  13-C                     END
    C           KEYIL     READEIL0                      47
  12-C                     END
    C                     READ IM0                      46
  11-C                     END
     C*
     C           *LOVAL    SETLLSC0
     C                     READ SC0                      46
  14-C           *IN46     DOWEQ'0'
    C                     MOVELSC01      SC01L   1
    C           SC02      SETLLSD0
    C           SC02      READESD0                      47
  15-C           *IN47     DOWEQ'0'
  16-C           SD03      IFGE DIN04S
    C           SD03      ANDLEDIN04E
    C           SD16      ANDEQSC01L
    C           SD16      ANDEQDIN01
    C                     EXSR RTN170
  16-C                     END
    C           SC02      READESD0                      47
  15-C                     END
    C                     READ SC0                      46
  14-C                     END
     C*
     C           *LOVAL    SETLLSE0
     C                     READ SE0                      46
  17-C           *IN46     DOWEQ'0'
    C                     MOVELSE01      SE01L   1
    C           SE02      SETLLSF0
    C           SE02      READESF0                      47
  18-C           *IN47     DOWEQ'0'
  19-C           SF03      IFGE DIN04S
    C           SF03      ANDLEDIN04E
    C           SF16      ANDEQSE01L
    C           SF16      ANDEQDIN01
    C                     EXSR RTN180
  19-C                     END
    C           SE02      READESF0                      47
  18-C                     END
    C                     READ SE0                      46
  17-C                     END
     C*
     C           *LOVAL    SETLLSG0
     C                     READ SG0                      46
  20-C           *IN46     DOWEQ'0'
    C                     MOVELSG01      SG01L   1
    C           SG02      SETLLSH0
    C           SG02      READESH0                      47
  21-C           *IN47     DOWEQ'0'
  22-C           SH03      IFGE DIN04S
    C           SH03      ANDLEDIN04E
    C           SH11      ANDEQSG01L
    C           SH11      ANDEQDIN01
    C           SH06      ANDNE0
    C                     EXSR RTN190
  22-C                     END
    C           SG02      READESH0                      47
  21-C                     END
    C                     READ SG0                      46
  20-C                     END
     C*
     C           *LOVAL    SETLLSN0
     C                     READ SN0                      46
  23-C           *IN46     DOWEQ'0'
    C                     MOVELSN01      SN01L   1
    C           SN02      SETLLSO0
    C           SN02      READESO0                      47
  24-C           *IN47     DOWEQ'0'
  25-C           SO03      IFGE DIN04S
    C           SO03      ANDLEDIN04E
    C           SO11      ANDEQSN01L
    C           SO11      ANDEQDIN01
    C                     EXSR RTN200
  25-C                     END
    C           SN02      READESO0                      47
  24-C                     END
    C                     READ SN0                      46
  23-C                     END
     C*
     C           *LOVAL    SETLLIF0
     C                     READ IF0                      46
  26-C           *IN46     DOWEQ'0'
    C                     EXSR RTN210
    C                     READ IF0                      46
  26-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....IMIBPF
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     MOVELIB01      WFB201
B2000C                     Z-ADDIB04      WFB202
|    C                     MOVEL'A5'      WFB203
|    C                     MOVEL'4'       WFB209
|    C                     Z-ADD0         WFB204
|    C                     Z-ADDIB13      WFB205
|    C                     Z-ADDIB10      WFB206
|    C                     Z-ADDIB11      WFB207
|    C                     Z-ADDIB12      WFB208
|    C                     MOVEL'Y'       WFB210
|    C                     WRITEWFB20
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....IMIUPF
      *==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVELIU05      WFB201
B2000C                     Z-ADDIU04      WFB202
|    C                     MOVEL'A4'      WFB203
|    C                     MOVEL'4'       WFB209
|    C                     Z-ADD0         WFB204
|    C                     Z-ADD0         WFB205
|    C                     MOVELIU03      IU03L   1
| 01-C           IU03L     IFEQ 'T'
|   C                     ADD  IU06      WFB204
|   C                     ADD  IU07      WFB204
| 01*C                     ELSE
|   C                     ADD  IU06      WFB205
|   C                     ADD  IU07      WFB205
| 01-C                     END
|    C                     Z-ADDIU08      WFB206
|    C                     Z-ADDIU09      WFB207
|    C                     Z-ADDIU10      WFB208
|    C                     MOVEL*BLANKS   WFB210
|    C                     WRITEWFB20
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN120....POPEPF
      *==============================================================*
03===C           RTN120    BEGSR
|    C*
|    C                     MOVELPE04      WFB201
B2000C                     Z-ADDPE05      WFB202
|    C                     MOVEL'I1'      WFB203
|    C                     MOVEL'1'       WFB209
|    C                     MOVELPE03      PC02
|    C                     MOVELPE04      PC03
|    C           KEYPC     CHAINPC0                  40
| 01-C           *IN40     IFEQ '1'
|   C           KEYPC     CHAINPC0                  40
|   C                     Z-ADD1         PC10
| 01-C                     END
|    C           PE06      MULT PC10      WFB204
|    C                     Z-ADD0         WFB205
|    C                     Z-ADDPE07      WFB206
|    C                     Z-ADDPE08      WFB207
|    C                     ADD  PE09      WFB207
|    C                     Z-ADD0         WFB208
|    C                     MOVEL'Y'       WFB210
|    C                     WRITEWFB20
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN130....POPGPF
      *==============================================================*
04===C           RTN130    BEGSR
|    C*
|    C                     MOVELPG03      WFB201
B2000C                     Z-ADDPF11      WFB202
|    C                     MOVEL'I2'      WFB203
|    C                     MOVEL'1'       WFB209
|    C                     Z-SUBPG07      WFB204
|    C                     Z-ADDPG07      WFB205
|    C                     Z-ADD0         WFB206
|    C                     Z-ADD0         WFB207
|    C                     Z-ADDPG06      WFB208
|    C                     MOVEL'Y'       WFB210
|    C                     WRITEWFB20
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN140....POPIPF
      *==============================================================*
05===C           RTN140    BEGSR
|    C*
|    C                     MOVELPI04      WFB201
B2000C                     Z-ADDPI05      WFB202
|    C                     MOVEL'I3'      WFB203
|    C                     MOVEL'1'       WFB209
|    C                     MOVELPI03      PC02
|    C                     MOVELPI04      PC03
|    C           KEYPC     CHAINPC0                  40
| 01-C           *IN40     IFEQ '1'
|   C           KEYPC     CHAINPC0                  40
|   C                     Z-ADD1         PC10
| 01-C                     END
|    C                     Z-ADD0         WFB204
|    C           PI06      MULT PC10      WFB205
|    C           PI06      MULT PI07      WFB206
|    C                     Z-ADD0         WFB207
|    C                     Z-ADD0         WFB208
|    C                     MOVEL'Y'       WFB210
|    C                     WRITEWFB20
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN150....IMIHPF
      *==============================================================*
06===C           RTN150    BEGSR
|    C*
| 01-C           IH03      IFNE *BLANKS
|   C                     MOVELIH03      WFB201
B2000C                     Z-ADDIG05      WFB202
|   C                     MOVEL'A1'      WFB203
|   C                     MOVEL'4'       WFB209
|   C                     Z-ADD0         WFB204
|   C                     Z-SUBIH05      WFB205
|   C                     Z-SUBIH08      WFB206
|   C                     Z-SUBIH09      WFB207
|   C                     Z-SUBIH10      WFB208
|   C                     MOVEL'Y'       WFB210
|   C                     WRITEWFB20
| 01-C                     END
|    C*
| 02-C           IH04      IFNE *BLANKS
|   C                     MOVELIH04      WFB201
B2000C                     Z-ADDIG05      WFB202
|   C                     MOVEL'A1'      WFB203
|   C                     MOVEL'4'       WFB209
|   C                     Z-ADD0         WFB204
|   C                     Z-ADDIH05      WFB205
|   C                     Z-ADDIH08      WFB206
|   C                     Z-ADDIH09      WFB207
|   C                     Z-ADDIH10      WFB208
|   C                     MOVEL'Y'       WFB210
|   C                     WRITEWFB20
| 02-C                     END
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN160....IMIMPF
      *==============================================================*
07===C           RTN160    BEGSR
|    C*
|    C                     MOVELIL05      WFB201
B2000C                     Z-ADDIM08      WFB202
|    C                     MOVEL'5'       WFB209
| 01-C           IM04      IFEQ '0'
|   C                     MOVEL'G1'      WFB203
| 01*C                     ELSE
|   C                     MOVEL'G2'      WFB203
| 01-C                     END
|    C                     Z-ADD0         WFB204
|    C           IL07      MULT IL06      WFB205
|    C           IL07      MULT IL08      WFB206
|    C           IL07      MULT IL09      WFB207
|    C           IL07      MULT IL10      WFB208
| 02-C           IL07      IFGT 0
|   C                     MOVEL'Y'       WFB210
| 02*C                     ELSE
|   C                     MOVEL*BLANK    WFB210
| 02-C                     END
|    C                     WRITEWFB20
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN170....SOSCPF
      *==============================================================*
08===C           RTN170    BEGSR
|    C*
|    C                     MOVELSD03      WFB201
B2000C                     Z-ADDSC39      WFB202
|    C                     MOVEL'2'       WFB209
|    C                     MOVELSC03      WFB203
|    C                     Z-ADD0         WFB204
|    C           SD04      ADD  SD05      WQTY    70
|    C                     Z-SUBWQTY      WFB205
|    C           WQTY      MULT SD10      WFLD   152
|    C                     Z-SUBWFLD      WFB206
|    C           WQTY      MULT SD11      WFLD   152
|    C                     Z-SUBWFLD      WFB207
|    C           WQTY      MULT SD12      WFLD   152
|    C                     Z-SUBWFLD      WFB208
|    C                     MOVEL*BLANK    WFB210
|    C                     WRITEWFB20
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN180....SOSEPF
      *==============================================================*
09===C           RTN180    BEGSR
|    C*
|    C                     MOVELSF03      WFB201
B2000C                     Z-ADDSE24      WFB202
|    C                     MOVEL'2'       WFB209
|    C                     MOVELSE03      WFB203
|    C                     Z-ADD0         WFB204
|    C           SF19      ADD  SF20      WQTY    70
|    C                     Z-SUBWQTY      WFB205
|    C           WQTY      MULT SF10      WFLD   152
|    C                     Z-SUBWFLD      WFB206
|    C           WQTY      MULT SF11      WFLD   152
|    C                     Z-SUBWFLD      WFB207
|    C           WQTY      MULT SF12      WFLD   152
|    C                     Z-SUBWFLD      WFB208
|    C                     MOVEL*BLANK    WFB210
|    C                     WRITEWFB20
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN190....SOSGPF
      *==============================================================*
10===C           RTN190    BEGSR
|    C*
|    C                     MOVELSH03      WFB201
B2000C                     Z-ADDSG26      WFB202
|    C                     MOVEL'3'       WFB209
|    C                     MOVELSG03      WFB203
|    C                     Z-ADD0         WFB204
|    C                     Z-ADDSH06      WFB205
|    C                     Z-ADDSH17      WFB206
|    C                     Z-ADDSH18      WFB207
|    C                     Z-ADDSH19      WFB208
|    C                     MOVEL*BLANK    WFB210
|    C                     WRITEWFB20
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN200....SOSNPF
      *==============================================================*
11===C           RTN200    BEGSR
|    C*
|    C                     MOVELSO03      WFB201
B2000C                     Z-ADDSN06      WFB202
|    C                     MOVEL'3'       WFB209
|    C                     MOVELSN02L     WFB203
|    C                     Z-ADD0         WFB204
|    C                     Z-ADDSO05      WFB205
|    C                     Z-ADDSO13      WFB206
|    C                     Z-ADDSO14      WFB207
|    C                     Z-ADDSO15      WFB208
|    C                     MOVEL*BLANK    WFB210
|    C                     WRITEWFB20
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN210....IMIFPF
      *==============================================================*
12===C           RTN210    BEGSR
|    C*
|    C                     MOVELIF03      WFB201
B2000C                     Z-ADDIF06      WFB202
|    C                     MOVEL'B1'      WFB203
|    C                     MOVEL'6'       WFB209
|    C                     Z-ADD0         WFB204
|    C                     Z-ADDIF04      WFB205
|    C                     Z-ADDIF08      WFB206
|    C                     Z-ADDIF09      WFB207
|    C                     Z-ADDIF10      WFB208
|    C                     MOVEL*BLANK    WFB210
|    C                     WRITEWFB20
|    C*
12===C                     ENDSR
