      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : IMR074                                        *
      * AUTHER       :  AN MING HSIA                                 *
      * CREATE DATE  : 05/10/93                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :普銷淨出貨表                                 *
      ****************************************************************
     FIMIIPF  IF  E           K        DISK
     FIMR074D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      523 5240PRINT
     I                                      523 524 PRINTC
     I                                      598 5990$PRTID
     I*
     I                                      601 605 DIJ07
     I                                      601 601 DIJ071
     I                                      606 617 DIJ02S
     I                                      618 629 DIJ02E
     I                                      630 641 DIJ022
     I                                      642 653 DIJ023
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN87     PARM *IN87     IN87    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N87N97N98          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  03-C           *IN03     IFEQ '0'
  04-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  04*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  04-C                     END
  03-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DIJ07
|    C                     MOVE *BLANK    DIJ02S
|    C                     MOVE *BLANK    DIJ02E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*物流點
| 01-C           DIJ07     IFEQ *BLANK
|   C                     SETON                     609599
| 01*C                     ELSE
| 02-C           DIJ071    IFNE 'V'
|   C                     SETON                     608699
| 02-C                     END
| 01-C                     END
|    C*
|    C*領貨單號，繳貨單號
| 05-C           DIJ02S    IFEQ *BLANK
| 05-C           DIJ022    ANDEQ*BLANK
| 05-C           DIJ023    ANDEQ*BLANK
|   C                     SETON                     619599
| 05-C                     END
|    C   99                GOTO END100
|    C*
| 05-C           DIJ02S    IFNE *BLANK
     C           DIJ02S    SETLLII0                      41
     C           *IN41     IFEQ '0'
|   C                     SETON                     619499
     C                     END
     C                     END
|    C   99                GOTO END100
|    C*
| 05-C           DIJ022    IFNE *BLANK
     C           DIJ022    SETLLII0                      41
     C           *IN41     IFEQ '0'
|   C                     SETON                     629499
     C                     END
     C                     END
|    C   99                GOTO END100
|    C*
| 05-C           DIJ023    IFNE *BLANK
     C           DIJ023    SETLLII0                      41
     C           *IN41     IFEQ '0'
|   C                     SETON                     639499
     C                     END
     C                     END
|    C   99                GOTO END100
|    C*
| 05-C           DIJ02E    IFEQ *BLANK
|   C                     SETON                     649599
     C                     ELSE
     C           DIJ02E    SETLLII0                      41
     C           *IN41     IFEQ '0'
|   C                     SETON                     649499
     C                     END
| 05-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
