     FSOSEPF  IF  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FREWF56  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*(MM/DD/YY)
     I                                      613 6180DATES
     I                                      619 6240DATEE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYSE     KLIST
     C                     KFLD           SE06
     C                     KFLD           SF03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100                     *SC
     C                     SETON                     LR
     C*
      *==============================================================*
      *          RTN100....SC0
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     READ SE0                      45
| 01-C           *IN45     DOWEQ'0'
|   C                     EXSR RTN150
|   C                     READ SE0                      45
| 01-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN150....SD0
      *==============================================================*
02===C           RTN150    BEGSR
|    C*
|    C           SE02      SETLLSF0
|    C           SE02      READESF0                      46
| 01-C           *IN46     DOWEQ'0'
B2000C           KEYSE     CHAINWF560                47
| 02-C           *IN47     IFEQ '0'
|   C                     ADD  SF19      QTY
|   C                     ADD  SF20      QTY
|   C                     UPDATWF560
| 02*C                     ELSE
B2000C                     MOVELSE06      WF5601
|   C                     MOVELSF03      WF5602
     C                     Z-ADDSF15      WF5603
|   C                     Z-ADDSF19      QTY
|   C                     ADD  SF20      QTY
|   C                     WRITEWF560
     C                     END
|    C           SE02      READESF0                      46
| 01-C                     END
      *
02===C                     ENDSR
