      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMR0561                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/25                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :送貨數量差異報表                             *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.04  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSOSEPF  IP  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FIMR056P O   E             39     PRINTER
     ISE0
     I                                              SE32  L3
     I                                              SE04  L2
     I                                              SE05  L2
     I                                              SE02  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 604 DSE33S
     I                                      605 608 DSE33E
     I                                      609 614 DSE32S
     I                                      615 620 DSE32E
     I*(MM/DD/YY)
     I                                      631 6360DSE24S
     I                                      637 6420DSE24E
     I*增加產品的挑選
     I                                      673 681 DSF03S
     I                                      682 690 DSF03E
     I*(YY/MM/DD)
     I*M001M                                650 6550YSE24S
     I*M001M                                656 6610YSE24E
M001MI                                      650 6570YSE24S
M001MI                                      660 6670YSE24E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYSE     KLIST
     C                     KFLD           SE04
     C                     KFLD           SE05
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *IN10     IFEQ '0'
     C                     EXSR RTN010
|    C                     SETON                     10
     C                     END
     C*
     C   39N38             EXSR RTN900                     *OVRFLW-THE SAME SALE
     C   39 38             EXSR RTN910                     *OVRSLW-NOT THE SAME
     C                     EXSR RTN200                     *READE DETAIL
     C*
     CL1 10                EXSR RTN666
     CL2 10                SETON                       3031
     CL3 10                EXSR RTN888
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C****
|    C*業務員名稱
|    C****
|    C           SE32      CHAINMC0                  41
|    C   41                MOVE *BLANK    MC02
|    C*
|    C                     WRITEPH1
|    C                     SETON                     3031
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....READE DETAIL
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C*
|    C           SE02      SETLLSF0
|    C           SE02      READESF0                      45
| 01-C           *IN45     DOWEQ'0'
| 02-C           SF03      IFGE DSF03S
|   C           SF03      ANDLEDSF03E
|   C           SF04      ADD  SF05      TEM45   90
|   C           SF19      ADD  SF20      TEM92   90
| 03-C           TEM45     IFNE TEM92
|   C*
     C                     EXSR RTN300                     *CHAIN HEADING
|   C                     EXSR RTN340                     *CHAIN DETAIL
|   C                     EXSR RTN400                     *WRITE DETAIL
|   C*
| 03-C                     END
| 02-C                     END
|   C           SE02      READESF0                      45
| 01-C                     END
|    C   45                Z-ADD0         DQTY
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....CHAIN DATA---SOSEPF(HEAD)
      *==============================================================*
03===C           RTN300    BEGSR
|    C****
|    C*客戶簡稱
|    C****
|    C           KEYSE     CHAINME0                  42
|    C   42                MOVE *BLANK    ME04
|    C****
|    C*送貨日期
|    C****
M001AC                     Z-ADDSE06      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SE06      S001I2  80
M001MC                     PARM W6        S001I2  60
|    C           DSE06     PARM           S001O1  60
|    C****
|    C*確認日期
|    C****
M001AC                     Z-ADDSE24      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SE24      S001I2  80
M001MC                     PARM W6        S001I2  60
|    C           DSE24     PARM           S001O1  60
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN340....CHAIN DATA---SOSFPF(DETAIL)
      *==============================================================*
04===C           RTN340    BEGSR
|    C****
|    C*產品簡稱＆單位
|    C****
|    C           SF03      CHAINMA0                  43
|    C   43                MOVE *BLANK    MA03
|    C   43                MOVE *BLANK    MA13
|    C****
|    C*差異數量
|    C****
|    C           SF04      ADD  SF05      DQTY
|    C                     SUB  SF19      DQTY
|    C                     SUB  SF20      DQTY
|    C*
04===C                     ENDSR
      *==============================================================*
      ***        RTN350....ADD SUBTOT  TO  ENDTOT
      *==============================================================*
05===C***        RTN350    BEGSR
05===C***                  ENDSR
      *==============================================================*
      *          RTN400....WRITE DETAIL
      *==============================================================*
06===C           RTN400    BEGSR
|    C*
|    C                     WRITEPD1
|    C                     SETOF                     3031
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW --同一業務員
      *==============================================================*
07===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETON                     3031
|    C                     SETOF                     3938
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN910....OVERFLOW --不同業務員
      *==============================================================*
08===C           RTN910    BEGSR
|    C*
|    C                     WRITEPE1
|    C****
|    C*業務員名稱
|    C****
|    C           SE32      CHAINMC0                  41
|    C   41                MOVE *BLANK    MC02
|    C*
|    C                     WRITEPH1
|    C*
|    C                     SETON                     3031
|    C                     SETOF                     3938
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN666....(SE02---L1)
      *==============================================================*
09===C           RTN666    BEGSR
|    C*
|    C  NLR                WRITEPE4
|    C                     SETON                     30
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN888....WRITE   (SE32---L3)
      *==============================================================*
10===C           RTN888    BEGSR
|    C*
|    C                     SETON                     3839
|    C                     SETON                     3031
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN999....(NO DATA)
      *==============================================================*
11===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE31
| 01*C                     END
|   C                     WRITEPE2
|    C*
11===C                     ENDSR
