     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.04  Y2K MODIFY                    */
     /*=============================================================*/
     FIMR078D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FIMR078Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      139 139 $RMK01
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      598 5990$PRTID
     I                                      601 601 DIN01
     I                                      608 616 DIN04S
     I                                      617 625 DIN04E
     I                                      626 6290DIN02S
     I                                      626 6270SMM
     I                                      628 6290SYY
M001MI*                                     630 6350WIN02S
M001MI                                      640 6470WIN02S
     I                                      636 6390DIN02E
     I                                      636 6370EMM
     I                                      638 6390EYY
M001MI*                                     640 6450WIN02E
M001MI                                      650 6570WIN02E
     I*
     I            DS
     I                                        1   60WMDY
     I                                        1   20WMM
     I                                        3   40WDD
     I                                        5   60WYY
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DIN01
|    C                     MOVE *BLANK    DIN04S
|    C                     MOVE *BLANK    DIN04E
|    C                     Z-ADD0         DIN02S
|    C                     Z-ADD0         WIN02S
|    C                     Z-ADD0         DIN02E
|    C                     Z-ADD0         WIN02E
|    C                     Z-ADD0         WMDY
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司別
| 01-C           DIN01     IFEQ *BLANK
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C*
| 04-C           DIN04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DIN04S
| 04-C                     END
|    C*
| 05-C           DIN04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DIN04E
| 05-C                     END
|    C*
| 06-C           DIN04S    IFGT DIN04E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C*年月
| 07-C           DIN02S    IFEQ 0
|   C                     SETON                     649599
| 07-C                     END
|    C   99                GOTO END100
|    C*日期檢查
     C                     Z-ADDSYY       WYY
     C                     Z-ADDSMM       WMM
     C                     Z-ADD1         WDD
|   C                     CALL 'P09'
|   C                     PARM WMDY      P0901I  60
|   C                     PARM           P0901O  1
| 17-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 17-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM WMDY      S001I2  60
|   C*M001M     WIN02S    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    WIN02S
|   C*
|    C*年月
| 07-C           DIN02E    IFEQ 0
|   C                     SETON                     659599
| 07-C                     END
|    C   99                GOTO END100
|    C*日期檢查
     C                     Z-ADDEYY       WYY
     C                     Z-ADDEMM       WMM
|   C                     CALL 'P09'
|   C                     PARM WMDY      P0901I  60
|   C                     PARM           P0901O  1
| 17-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 17-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM WMDY      S001I2  60
|   C*M001M     WIN02E    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    WIN02E
     C                     MOVE '31'      WIN02E
|    C*
     C                     OPEN IMR078Z
     C                     WRITEPH1
     C                     CLOSEIMR078Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品代號
| 02-C           D#ROW     IFEQ 8
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DIN04S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DIN04E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
