      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : IMR0761                                       *
      * AUTHER       : TINA
      * CREATE DATE  : 07/28/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :產品存量分佈明細表                           *
      ****************************************************************
     FIMIALF  IP  E           K        DISK
     FREWF82  UF  E           K        DISK                      A
     IIA0
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
    C                     EXSR RTN100
     C*
     CLR                   SETON                     LR
      *==============================================================*
      *          RTN100....
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C           IA03      CHAINWF820                40
| 02-C           *IN40     IFEQ '0'
|   C                     EXSR RTN200
|   C                     UPDATWF820
| 02*C                     ELSE
|   C                     EXSR RTN300
|   C                     WRITEWF820
| 02-C                     END
|    C*
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....UPDATE WF820
      *==============================================================*
02===C           RTN200    BEGSR
|    C*東漢保稅
| 01-C           IA02      IFEQ 'T0001'
|   C                     ADD  IA06      WF8202
|   C                     ADD  IA10      WF8203
| 01-C                     END
|    C*東漢完稅
| 02-C           IA02      IFEQ 'W0005'
|   C                     ADD  IA06      WF8204
|   C                     ADD  IA10      WF8205
| 02-C                     END
|    C*南港
| 03-C           IA02      IFEQ 'W0001'
|   C                     ADD  IA06      WF8206
|   C                     ADD  IA10      WF8207
| 03-C                     END
|    C*田明
| 04-C           IA02      IFEQ 'W0004'
|   C                     ADD  IA06      WF8208
|   C                     ADD  IA10      WF8209
| 04-C                     END
|    C*台中
| 05-C           IA02      IFEQ 'W0002'
|   C                     ADD  IA06      WF8210
|   C                     ADD  IA10      WF8211
| 05-C                     END
|    C*高雄
| 06-C           IA02      IFEQ 'W0003'
|   C                     ADD  IA06      WF8212
|   C                     ADD  IA10      WF8213
| 06-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE  WF820
      *==============================================================*
03===C           RTN300    BEGSR
     C                     MOVELIA03      WF8201
|    C                     Z-ADD0         WF8202
|    C                     Z-ADD0         WF8203
|    C                     Z-ADD0         WF8204
|    C                     Z-ADD0         WF8205
|    C                     Z-ADD0         WF8206
|    C                     Z-ADD0         WF8207
|    C                     Z-ADD0         WF8208
|    C                     Z-ADD0         WF8209
|    C                     Z-ADD0         WF8210
|    C                     Z-ADD0         WF8211
|    C                     Z-ADD0         WF8212
|    C                     Z-ADD0         WF8213
     C*
|    C*東漢保稅
| 01-C           IA02      IFEQ 'T0001'
|   C                     Z-ADDIA06      WF8202
|   C                     Z-ADDIA10      WF8203
| 01-C                     END
|    C*東漢完稅
| 02-C           IA02      IFEQ 'W0005'
|   C                     Z-ADDIA06      WF8204
|   C                     Z-ADDIA10      WF8205
| 02-C                     END
|    C*南港
| 03-C           IA02      IFEQ 'W0001'
|   C                     Z-ADDIA06      WF8206
|   C                     Z-ADDIA10      WF8207
| 03-C                     END
|    C*田明
| 04-C           IA02      IFEQ 'W0004'
|   C                     Z-ADDIA06      WF8208
|   C                     Z-ADDIA10      WF8209
| 04-C                     END
|    C*台中
| 05-C           IA02      IFEQ 'W0002'
|   C                     Z-ADDIA06      WF8210
|   C                     Z-ADDIA10      WF8211
| 05-C                     END
|    C*高雄
| 06-C           IA02      IFEQ 'W0003'
|   C                     Z-ADDIA06      WF8212
|   C                     Z-ADDIA10      WF8213
| 06-C                     END
|    C*
03===C                     ENDSR
