     FIMIXPF  IP  E           K        DISK
     FIMINLF01IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FIMR079P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*ж~ды
     I                                      601 6040DIX11
     I                                      601 6020DIX11M
     I                                      603 6040DIX11Y
     I                                      605 6080WIX11
     I                                      605 6060WIX11Y
     I                                      607 6080WIX11M
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYIN     KLIST
     C                     KFLD           MA07
     C                     KFLD           IX11
     C                     KFLD           IX01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
      *
|    C                     WRITEPH1
     C                     SETOF                     39
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
     C                     MOVEL*BLANK    MA03
     C           IX01      CHAINMA0                  40
|    C*
     C           IX06      ADD  IX07      IX067
     C           IX08      ADD  IX09      TCOST1
     C                     ADD  IX10      TCOST1
     C*
     C                     Z-ADD0         TIN17
     C                     Z-ADD0         TIN26
     C                     Z-ADD0         TIN27
     C                     Z-ADD0         TIN28
B2000C           KEYIN     SETLLIN0
B2000C           KEYIN     READEIN0                      46
     C           *IN46     DOWEQ'0'
     C                     ADD  IN17      TIN17
     C                     ADD  IN26      TIN26
     C                     ADD  IN27      TIN27
     C                     ADD  IN28      TIN28
B2000C           KEYIN     READEIN0                      46
     C                     END
|    C*
     C           TIN26     ADD  TIN27     TCOST2
     C                     ADD  TIN28     TCOST2
      *
     C           TCOST1    IFNE TCOST2
     C           TIN17     ORNE IX067
     C           *IN10     IFEQ '0'
     C                     EXSR RTN010
     C                     SETON                     10
     C                     END
      *
     C           TCOST1    SUB  TCOST2    DIF
     C   39                EXSR RTN900
     C                     WRITEPD1
     C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
      *
06===C                     ENDSR
      *==============================================================*
      *          RTNLR ....LR ON
      *==============================================================*
05===C           RTNLR     BEGSR
      *
|    C           *IN10     IFEQ '0'
| 01-C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
|   C                     WRITEPE2
      *
05===C                     ENDSR
