      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMR062                                        *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/08/11                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :報廢明細表
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.11 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FIMR062D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 601 DIE01
     I                                      603 607 DIE03
     I                                      608 616 DIF03S
     I                                      617 625 DIF03E
     I*(MM/DD/YY)
     I                                      631 6360DIE05S
     I                                      641 6460DIE05E
     I*(YY/MM/DD)
M001MI*                                     651 6560WIE05S
M001MI*                                     661 6660WIE05E
M001MI                                      651 6580WIE05S
M001MI                                      661 6680WIE05E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DIE01
|    C                     MOVE *BLANK    DIE03
|    C                     MOVE *BLANK    DIF03S
|    C                     MOVE *BLANK    DIF03E
|    C                     Z-ADD0         DIE05S
|    C                     Z-ADD0         DIE05E
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司別
| 01-C           DIE01     IFEQ *BLANKS
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END100
|    C*物流點
| 02-C           DIE03     IFEQ *BLANKS
|   C                     SETON                     619699
| 02-C                     END
|    C   99                GOTO END100
|    C*產品代號
| 03-C           DIF03S    IFEQ *BLANK
     C                     MOVE *LOVAL    DIF03S
     C                     END
     C*
     C           DIF03E    IFEQ *BLANK
     C                     MOVE *HIVAL    DIF03E
     C                     END
|    C*
| 03-C           DIF03S    IFGT DIF03E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*報廢日期
| 06-C           DIE05S    IFEQ 0
M001MC*                    Z-ADD010101    DIE05S
M001MC                     Z-ADD010192    DIE05S
     C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DIE05S    P0901I  60
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     649299
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*
| 06-C           DIE05E    IFEQ 0
M001MC*                    Z-ADD123199    DIE05E
M001MC                     Z-ADD123129    DIE05E
     C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DIE05E    P0901I  60
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     659299
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DIE05S    S001I2  60
|    C*          WIE05S    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WIE05S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DIE05E    S001I2  60
|    C*M001M     WIE05E    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WIE05E
|    C*
| 03-C           WIE05S    IFGT WIE05E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
