     FSOSDPF  IF  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FIMIJPF  IF  E           K        DISK
     FIMILPF  IF  E           K        DISK
     FIMISLF01IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FREWF51  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*公司
     I                                      601 601 DIA01S
     I                                      602 602 DIA01E
     I*物留點
     I                                      603 607 DIA02S
     I                                      603 603 IA02SL
     I                                      608 612 DIA02E
     I                                      608 608 IA02EL
     I*產品
     I                                      613 621 DIA03S
     I                                      622 630 DIA03E
     I*(MM/DD/YY)
     I                                      631 6360DATES
     I                                      637 6420DATEE
     I*
     I*(YY/MM/DD)
     I                                      651 6560YDATES
     I                                      657 6620YDATEE
     I*
     I            DS
     I                                        1  12 IL02
     I                                        3   4 IL02L
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF5101
     C                     KFLD           WF5102
     C                     KFLD           WF5103
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     READ SD0                      45
     C           *IN45     DOWEQ'0'
|    C           SD02      SETLLIMISLF01                 40
     C           *IN40     IFEQ '1'
     C                     MOVELSD16      WF5101
     C                     MOVELSD20      WF5102
     C                     MOVELSD03      WF5103
     C           KEYWF     CHAINWF510                41
      *
     C                     EXSR RTN100
     C                     END
      *
     C                     READ SD0                      45
     C                     END
      *----------------------------------------------------------------
     C                     READ SF0                      45
     C           *IN45     DOWEQ'0'
|    C           SF02      SETLLIMISLF01                 40
     C           *IN40     IFEQ '1'
     C                     MOVELSF16      WF5101
     C                     MOVELSF26      WF5102
     C                     MOVELSF03      WF5103
     C           KEYWF     CHAINWF510                41
      *
     C                     EXSR RTN200
     C                     END
      *
     C                     READ SF0                      45
     C                     END
      *----------------------------------------------------------------
     C                     READ IJ0                      45
     C           *IN45     DOWEQ'0'
      *
|    C           IJ02      SETLLIMISLF01                 40
     C           *IN40     IFEQ '1'
     C                     MOVELIJ01      WF5101
     C                     MOVELIJ07      WF5102
     C                     MOVELIJ03      WF5103
     C           KEYWF     CHAINWF510                41
     C                     EXSR RTN300
     C                     END
      *
     C                     READ IJ0                      45
     C                     END
      *----------------------------------------------------------------
     C                     READ IL0                      45
     C           *IN45     DOWEQ'0'
      *
|    C           IL02      SETLLIMISLF01                 40
     C           IL05      CHAINMA0                  42
     C           *IN42     IFEQ '0'
     C           MA54      IFEQ 'Y'
     C           IL02L     ANDEQ'G1'
     C           MA54      ORNE 'Y'
     C           IL02L     ANDEQ'G2'
     C                     SETOF                     40
     C                     END
     C                     END
      *
     C           *IN40     IFEQ '1'
     C                     MOVELIL01      WF5101
     C                     MOVELIL03      WF5102
     C                     MOVELIL05      WF5103
     C           KEYWF     CHAINWF510                41
     C                     EXSR RTN400
     C                     END
      *
     C                     READ IL0                      45
     C                     END
      *
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....READ FILE
      *==============================================================*
     C           RTN100    BEGSR
     C*
     C           SD04      ADD  SD05      WORK    70
      *
     C           *IN41     IFEQ '0'
     C                     ADD  WORK      WF5104
     C                     UPDATWF510
     C                     ELSE
     C                     Z-ADDWORK      WF5104
     C                     Z-ADD0         WF5105
     C                     Z-ADD0         WF5106
     C                     Z-ADD0         WF5107
     C                     WRITEWF510
     C                     END
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN200....READ FILE
      *==============================================================*
     C           RTN200    BEGSR
     C*
     C           SF04      ADD  SF05      WORK
     C                     SUB  SF19      WORK
     C                     SUB  SF20      WORK
      *
     C           *IN41     IFEQ '0'
     C                     ADD  WORK      WF5105
     C                     UPDATWF510
     C                     ELSE
     C                     Z-ADD0         WF5104
     C                     Z-ADDWORK      WF5105
     C                     Z-ADD0         WF5106
     C                     Z-ADD0         WF5107
     C                     WRITEWF510
     C                     END
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN300....READ FILE
      *==============================================================*
     C           RTN300    BEGSR
     C*
     C           IJ04      SUB  IJ05      WORK
      *
     C           *IN41     IFEQ '0'
     C                     ADD  WORK      WF5106
     C                     UPDATWF510
     C                     ELSE
     C                     Z-ADD0         WF5104
     C                     Z-ADD0         WF5105
     C                     Z-ADDWORK      WF5106
     C                     Z-ADD0         WF5107
     C                     WRITEWF510
     C                     END
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN400....READ FILE
      *==============================================================*
     C           RTN400    BEGSR
     C*
     C                     Z-ADDIL06      WORK
      *
     C           *IN41     IFEQ '0'
     C                     ADD  WORK      WF5107
     C                     UPDATWF510
     C                     ELSE
     C                     Z-ADD0         WF5104
     C                     Z-ADD0         WF5105
     C                     Z-ADD0         WF5106
     C                     Z-ADDWORK      WF5107
     C                     WRITEWF510
     C                     END
     C*
     C                     ENDSR
