      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMR0711                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 83/04/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存作業                                     *
      * REMARK       :產品送貨數量差異                             *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.04  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREWF66  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FIMR071P O   E             39     PRINTER
     IWF660
     I                                              SE07  L2
     I                                              SF03  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 604 DSE33S
     I                                      605 608 DSE33E
     I                                      609 614 DSE32S
     I                                      615 620 DSE32E
     I*(MM/DD/YY)
     I                                      631 6360DSE24S
     I                                      637 6420DSE24E
     I*(YY/MM/DD)
M001MI*                                     650 6550YSE24S
M001MI*                                     656 6610YSE24E
M001MI                                      645 6520YSE24S
M001MI                                      653 6600YSE24E
     I*增加物流點的挑選
     I                                      662 666 DSE07S
     I                                      667 671 DSE07E
     I*增加產品的挑選
     I                                      673 681 DSF03S
     I                                      682 690 DSF03E
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYME     KLIST
     C                     KFLD           SE04
     C                     KFLD           SE05
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *INIT
     C*
     C                     EXSR RTN100                     *CHAIN DATA
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....INIT VALUE
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         DSE06
|    C                     Z-ADD0         DSE24
|    C                     Z-ADD0         DQTY
|    C                     Z-ADD0         TOT1
|    C                     Z-ADD0         TOT2
|    C                     Z-ADD0         TOT3
|    C                     Z-ADD0         TOT4
|    C*
|    C                     MOVE *BLANK    #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVELSE07      #A02
|    C*物流點
|    C           KEY#A     CHAIN#A0                  40
|    C   40                MOVE *BLANK    #A03
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*差異＞０者才列印
|    C*
|    C           SF04      ADD  SF05      WORK1   50
|    C           SF19      ADD  SF20      WORK2   50
|    C           WORK1     SUB  WORK2     DQTY
| 01-C           DQTY      IFGT 0
|   C                     ADD  DQTY      DQTY1
|   C                     ADD  SF04      TOT1
|   C                     ADD  SF05      TOT2
|   C                     ADD  SF19      TOT3
|   C                     ADD  SF20      TOT4
|   C*產品代號
|   C           SF03      CHAINMA0                  40
|   C   40                MOVE *BLANK    MA03
|   C*客戶代號
|   C           KEYME     CHAINME0                  41
|   C   41                MOVE *BLANK    ME04
|   C*送貨日期
M001AC                     Z-ADDSE06      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SE06      S001I2  80
M001MC                     PARM W6        S001I2  60
|   C           DSE06     PARM           S001O1  60
|   C*確認日期
M001AC                     Z-ADDSE24      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SE24      S001I2  80
M001MC                     PARM W6        S001I2  60
|   C           DSE24     PARM           S001O1  60
|   C   39                EXSR RTN900
|   C                     WRITEPD1
|   C                     SETON                     30
|   C*
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL1.....PROC L1
      *==============================================================*
03===C           RTNL1     BEGSR
|    C*
|    C   39                EXSR RTN900
|    C*差異＞０者才列印
| 01-C           DQTY1     IFGT 0
|   C   39                EXSR RTN900
|   C                     WRITEPT1
|   C                     Z-ADD0         DQTY1
|   C                     Z-ADD0         TOT1
|   C                     Z-ADD0         TOT2
|   C                     Z-ADD0         TOT3
|   C                     Z-ADD0         TOT4
| 01-C                     END
|    C*
|    C                     SETOF                     30
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL2.....PROC L2
      *==============================================================*
04===C           RTNL2     BEGSR
|    C*
|    C  NLR                WRITEPE1
|    C*
|    C                     MOVE *BLANK    #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVELSE07      #A02
|    C           KEY#A     CHAIN#A0                  40
|    C   40                MOVE *BLANK    #A03
|    C  NLR                WRITEPH1
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....PROC SKIP
      *==============================================================*
05===C           RTN900    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     SETOF                     39
|   C                     SETON                     10
| 01-C                     END
|    C*
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
04===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|    C                     WRITEPH1
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
04===C                     ENDSR
