      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMR0411                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/25                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :送貨揀料彙總表                               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.16 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FSOSEPF  UP  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FREWF36  O   E           K        DISK
     E*
     ISE0
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*                                     601 602 DSE01
     I                                      603 603 DSEL
     I                                      609 613 DSE07
     I*(MM/DD/YY)
     I                                      621 6260DSE06
     I*(YY/MM/DD)
     I                                      640 6470YSE06
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN010
     C                     EXSR RTN100                     *OVRFLW-THE SAME SALE
|    C                     MOVE 'V'       SE25
     C                     UPDATSE0
      *
     CLR                   SETON                     LR
      *==============================================================*
      *          RTN010....READE HAD
      *==============================================================*
02===C           RTN010    BEGSR
|    C*
     C                     MOVELSE01      WF3601
     C                     MOVELSE03      WF3602
     C                     MOVELSE04      WF3603
     C                     MOVELSE05      WF3604
B2000C                     Z-ADDSE06      WF3605
     C                     MOVELSE07      WF3607
B2000C                     Z-ADDSE21      WF3608
     C                     MOVELSE22      WF3609
     C                     MOVELSE23      WF3610
     C                     MOVELSE27      WF3611
     C                     MOVELSE28      WF3612
     C                     MOVELSE29      WF3613
     C                     MOVELSE30      WF3614
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
     C           SE02      SETLLSF0
     C           SE02      READESF0                      46
|    C           *IN46     DOWEQ'0'
      *
|    C                     MOVELSF02      WF3615                       L
|    C                     MOVELSF03      WF3616                       L
|    C                     MOVELSF03      WF3617                       L
     C                     Z-ADDSF04      WF3618
     C                     Z-ADDSF05      WF3619
     C                     WRITEWF360
      *
     C           SE02      READESF0                      46
|    C                     END                                         L
|    C*
02===C                     ENDSR
