     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.04  Y2K MODIFY                    */
     /*=============================================================*/
     FIMR058D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      598 5990$PRTID
     I                                      603 603 DSEL1
     I                                      609 613 DSC11
     I                                      609 609 DSC11L
     I                                      614 614 DSEL2
     I                                      621 6260DSC08
     I*M001M                                640 6450YSC08
M001MI                                      640 6470YSC08
     I                                      650 650 DSC13
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C                     EXSR RTN020
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
      *
  02-C                     END
  01-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVEL*BLANKS   DSEL1
|    C                     MOVEL*BLANKS   DSEL2
|    C                     MOVEL*BLANKS   DSC11
|    C                     MOVEL*BLANKS   DSC11L
|    C                     MOVEL*BLANKS   DSC13
|    C                     Z-ADD0         DSC08
|    C                     Z-ADD0         YSC08
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN020....INIT SCREEN
      *===============================================================*
01===C           RTN020    BEGSR
|    C*
     C                     SETON                     38
     C           $WRHUS    IFNE '*ALL '
     C           $WRHUS    ANDNE*BLANKS
     C                     SETOF                     38
|    C                     MOVEL$WRHUS    DSC11
     C                     END
|    C*通路
| 01-C           DSC11     IFEQ 'W0001'
     C                     MOVEL'1'       DSEL1
     C                     ELSE
     C                     MOVEL'3'       DSEL1
| 01-C                     END
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*通路
| 01-C*          DSEL1     IFEQ *BLANK
|   C*                    SETON                     619599
| 01-C*                    END
|    C*  99                GOTO END100
|    C*物流點
| 01-C           DSC11     IFEQ *BLANK
|   C                     SETON                     629699
| 01-C                     END
|    C   99                GOTO END100
     C*
     C           $WRHUS    IFNE '*ALL  '
     C           $WRHUS    IFNE *BLANKS
     C           DSC11     IFNE $WRHUS
     C                     SETON                     629199
     C                     END
     C                     ELSE
     C           DSC11L    IFNE $WRHTY
     C                     SETON                     629199
     C                     END
     C                     END
     C                     END
|    C   99                GOTO END100
|    C*(CHECK WHEN DATE EQUAL 0)
| 07-C           DSC08     IFEQ 0
|   C                     SETON                     639499
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK START DATE)-送貨日期
|    C                     CALL 'P09'
|    C                     PARM DSC08     P0901I  60
|    C                     PARM           P0911O  1
| 09-C           P0911O    IFEQ 'N'
|   C                     SETON                     639499
| 09-C                     END
|    C   99                GOTO END100
|    C*(CHANGE TO CHINESE DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC08     S001I2  60
|    C*M001M     YSC08     PARM           S001OI  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YSC08
|    C*
     C           DSEL2     IFEQ *BLANKS
     C                     MOVEL'A'       DSEL2
     C                     END
     C   99                GOTO END100
     C*
|    C*核准
| 01-C           DSC13     IFEQ *BLANKS
     C                     SETON                     659699
| 01-C                     END
     C   99                GOTO END100
     C*
     C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
