      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMR047                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/28                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :產品送貨明細表                               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FIMR047D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      598 5990$PRTID
     I                                      601 602 DSE01
     I                                      603 607 DSE07S
     I                                      608 612 DSE07E
     I                                      613 621 DSF03S
     I                                      622 630 DSF03E
     I*(MM/DD/YY)送貨日期
     I                                      637 6420DSE21S
     I                                      643 6480DSE21E
     I*(MM/DD/YY)確認日期
     I                                      650 6550DSE24S
     I                                      656 6610DSE24E
     I*(YY/MM/DD)
M001MI*                                     670 6750YMDS
M001MI*                                     676 6810YMDE
M001MI                                      670 6770YMDS
M001MI                                      678 6850YMDE
     I*送貨日期及確認日期控制碼
     I                                      750 750 IN20
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C                     EXSR RTN020
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSE01
|    C                     MOVE *BLANK    DSE07S
|    C                     MOVE *BLANK    DSE07E
|    C                     MOVE *BLANK    DSF03S
|    C                     MOVE *BLANK    DSF03E
|    C                     Z-ADD0         DSE21S
|    C                     Z-ADD0         DSE21E
|    C                     Z-ADD0         DSE24S
|    C                     Z-ADD0         DSE24E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN020....INIT SCREEN
      *===============================================================*
01===C           RTN020    BEGSR
|    C*
     C                     SETON                     38
     C           $WRHUS    IFNE '*ALL '
     C           $WRHUS    ANDNE*BLANKS
     C                     SETOF                     38
|    C                     MOVEL$WRHUS    DSE07S
|    C                     MOVEL$WRHUS    DSE07E
     C                     END
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司別
| 01-C           DSE01     IFEQ *BLANK
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C*物流點
| 02-C           DSE07S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE07S
| 02-C                     END
|    C*
| 03-C           DSE07E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE07E
| 03-C                     END
|    C*
| 04-C           DSE07S    IFGT DSE07E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 05-C           DSF03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSF03S
| 05-C                     END
|    C*
| 06-C           DSF03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSF03E
| 06-C                     END
|    C*
| 07-C           DSF03S    IFGT DSF03E
|   C                     SETON                     6364
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*送貨日期或確認日期只輸入一項
| 04-C           DSE21S    IFNE 0
|   C           DSE21E    ORNE 0
| 05-C           DSE24S    IFNE 0
|   C                     SETON                     708999
| 05-C                     END
| 06-C           DSE24E    IFNE 0
|   C                     SETON                     718999
| 06-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 07-C           DSE21S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSE21S    P0901I  60
|   C                     PARM           P0901O  1
| 08-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 08-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSE21E    P0901I  60
|   C                     PARM           P0901O  1
| 09-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
     C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSE21S    S001I2  60
    C*M001M     YMDS      PARM           S001O1  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDS
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSE21E    S001I2  60
|   C*M001M     YMDE      PARM           S001O1  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDE
|   C**
| 10-C           YMDS      IFGT YMDE
|   C                     SETON                     6566
|   C                     SETON                     9299
| 10-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 09*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSE24S    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 11-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSE24E    P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
     C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSE24S    S001I2  60
|   C*M001M     YMDS      PARM           S001O1  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDS
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSE24E    S001I2  60
|   C*M001M     YMDE      PARM           S001O1  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDE
|   C**
| 13-C           YMDS      IFGT YMDE
|   C                     SETON                     7071
|   C                     SETON                     9299
| 13-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 12-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品代號
| 02-C           D#ROW     IFEQ 9
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSF03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSF03E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
