     FIMR064D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      598 5990$PRTID
     I                                      601 6060DSE06S
     I                                      607 6120DSE06E
B2MODI                                      613 6260DATES
B2MODI                                      627 6400DATEE
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
      *
  02-C                     END
  01-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     Z-ADD0         DSE06S
|    C                     Z-ADD0         DSE06E
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
|    C*(CHECK WHEN DATE EQUAL 0)
01===C           RTN100    BEGSR
B2CHKC           DSE06S    IFEQ 0
B2INF *CVR3012 sev.30 Field DSE06S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     Z-ADD010192    DSE06S
B2INF *CVR3012 sev.30 Field DSE06S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
| 07-C                     END
B2CHKC           DSE06E    IFEQ 0
B2INF *CVR3012 sev.30 Field DSE06E contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     Z-ADD123199    DSE06E
B2INF *CVR3012 sev.30 Field DSE06E contains more than one year
| 02-C                     END
|    C*(CHECK START DATE)-送貨日期
|    C                     CALL 'P09'
B2???C                     PARM DSE06S    P0901I  80
B2INF *CVR3012 sev.30 Field DSE06S contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0911O  1
| 03-C           P0911O    IFEQ 'N'
|   C                     SETON                     609499
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK END DATE)
|    C                     CALL 'P09'
B2???C                     PARM DSE06E    P0901I  80
B2INF *CVR3012 sev.30 Field DSE06E contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0911O  1
| 04-C           P0911O    IFEQ 'N'
|   C                     SETON                     619499
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHENK STRART <= END DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE06S    S001I2  80
B2INF *CVR3012 sev.30 Field DSE06S contains more than one year
B2INF *CVR3012 sev.30 Field S001I2 contains more than one year
B2MODC           DATES     PARM           S001OI  80
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE06E    S001I2  80
B2INF *CVR3012 sev.30 Field DSE06E contains more than one year
B2INF *CVR3012 sev.30 Field S001I2 contains more than one year
B2MODC           DATEE     PARM           S001OI  80
|    C*
B2000C           DATES     IFGT DATEE
|   C                     SETON                     6061
|   C                     SETON                     9399
| 05-C                     END
|    C   99                GOTO END100
     C*
     C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
| 02-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
