     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.04  Y2K MODIFY                    */
     /*=============================================================*/
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FSOSEPF  IF  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FREWF53  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      603 603 DSEL1
     I                                      609 613 DSC11
     I*(MM/DD/YY)
     I                                      609 609 DSC11L
     I                                      614 614 DSEL2
     I*(YY/MM/DD)
     I                                      621 6260DSC08
     I*M001M                                640 6450YSC08
M001MI                                      640 6470YSC08
     I                                      650 650 DSC13
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN SC13      WSC13
     C           *LIKE     DEFN SE09      WSE09
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYSC     KLIST
     C                     KFLD           SC04
     C                     KFLD           SC05
     C                     KFLD           SD03
     C                     KFLD           WSC13
     C           KEYSE     KLIST
     C                     KFLD           SE04
     C                     KFLD           SE05
     C                     KFLD           SF03
     C                     KFLD           WSE09
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100                     *SC
     C                     EXSR RTN200                     *SE         L
     C                     SETON                     LR
     C*
      *==============================================================*
      *          RTN100....SC0
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
|   C                     EXSR RTN150
|   C                     READ SC0                      45
| 01-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN150....SD0
      *==============================================================*
02===C           RTN150    BEGSR
|    C*
|    C           SC02      SETLLSD0
|    C           SC02      READESD0                      46
| 01-C           *IN46     DOWEQ'0'
     C*已核准或電腦核准時,MOVEL空白給核准狀態WF5203
     C           SC13      IFEQ ' '
     C           SC13      OREQ 'C'
     C                     MOVEL*BLANKS   WSC13
     C                     ELSE
     C                     MOVELSC13      WSC13
     C                     END
     C*
|   C           KEYSC     CHAINWF530                47
| 02-C           *IN47     IFEQ '0'
|   C                     ADD  SD04      QTY1
|   C                     ADD  SD05      QTY1
|   C                     UPDATWF530
| 02*C                     ELSE
|   C                     MOVELSC04      WF5301
|   C                     MOVELSC05      WF5302
     C                     MOVELSD03      WF5303
     C                     MOVELWSC13     WF5304
|   C                     Z-ADDSD04      QTY1
|   C                     ADD  SD05      QTY1
|   C                     WRITEWF530
| 02-C                     END
|    C           SC02      READESD0                      46
| 01-C                     END
      *
02===C                     ENDSR
      *==============================================================*
      *          RTN200....SE0
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     READ SE0                      48
| 01-C           *IN48     DOWEQ'0'
|   C                     EXSR RTN250
|   C                     READ SE0                      48
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN250....SF0
      *==============================================================*
04===C           RTN250    BEGSR
|    C*
|    C           SE02      SETLLSF0
|    C           SE02      READESF0                      49
| 01-C           *IN49     DOWEQ'0'
     C*已核准或電腦核准時,MOVEL空白給核准狀態WF5203
     C           SE09      IFEQ ' '
     C           SE09      OREQ 'C'
     C                     MOVEL*BLANKS   WSE09
     C                     ELSE
     C                     MOVELSC13      WSE09
     C                     END
     C*
|   C           KEYSE     CHAINWF530                41
| 02-C           *IN41     IFEQ '0'
|   C                     ADD  SF04      QTY1
|   C                     ADD  SF05      QTY1
|   C                     UPDATWF530
| 02*C                     ELSE
|   C                     MOVELSE04      WF5301
|   C                     MOVELSE05      WF5302
|   C                     MOVELSF03      WF5303
|   C                     MOVELWSE09     WF5304
|   C                     Z-ADDSF04      QTY1
|   C                     ADD  SF05      QTY1
|   C                     WRITEWF530
| 02-C                     END
|   C           SE02      READESF0                      49
| 01-C                     END
      *
04===C                     ENDSR
