      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : IMR073                                        *
      * AUTHER       :  AN MING HSIA                                 *
      * CREATE DATE  : 04/15/93                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :普銷送貨揀料彙總表                           *
      ****************************************************************
     FIMR073D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      523 5240PRINT
     I                                      523 524 PRINTC
     I                                      598 5990$PRTID
     I*
     I                                      601 602 DSE01
     I                                      603 603 DSEL
     I                                      609 613 DSE07S
     I                                      609 609 DSE071
     I                                      614 618 DSE07E
     I                                      614 614 DSE072
     I*(MM/DD/YY)送貨日期
     I                                      621 6260DSE06
     I*(YY/MM/DD)
B2MODI                                      648 6610YSE06
     I*(MM/DD/YY)訂單日期
     I                                      627 6320DSE39
     I*(YY/MM/DD)
B2MODI                                      633 6460YSE39
B2MODI                                      766 766 IN20
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN87     PARM *IN87     IN87    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N87N97N98          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  03-C           *IN03     IFEQ '0'
  04-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  04*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  04-C                     END
  03-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE '0'       IN20
|    C                     MOVE *BLANK    DSE07S
|    C                     MOVE *BLANK    DSE07E
|    C                     Z-ADD0         DSE06
|    C                     Z-ADD0         YSE06
B2000C                     Z-ADD$EGMDY    DSE39
|    C                     Z-ADD0         YSE39
     C*印表機
| 05-C           PRINTC    IFNE *BLANKS
|   C                     Z-ADDPRINT     $PRTID
| 05*C                     ELSE
|   C                     Z-ADD0         $PRTID
| 05-C                     END
     C*
|    C                     Z-ADD1         $EVR
|    C                     Z-ADD1         $CPY
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*物流點
| 01-C           DSE07S    IFEQ *BLANK
     C           DSE07S    OREQ *LOVAL
|   C                     MOVE *LOVAL    DSE07S
| 01*C                     ELSE
| 02-C           DSE071    IFNE 'V'
|   C                     SETON                     658699
| 02-C                     END
| 01-C                     END
|    C*
| 03-C           DSE07E    IFEQ *BLANK
     C           DSE07E    OREQ *HIVAL
|   C                     MOVE *HIVAL    DSE07E
| 03*C                     ELSE
| 04-C           DSE072    IFNE 'V'
|   C                     SETON                     648699
| 04-C                     END
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-送貨日期
B2CHKC           DSE06     IFNE 0
B2INF *CVR3012 sev.30 Field DSE06 contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2INF *CVR3012 sev.30 Field DSE39 contains more than one year
     C           DSE39     ANDNE0
|   C                     SETON                     669099
|   C                     SETON                     67
| 05-C                     END
|    C   99                GOTO END100
|    C*
B2CHKC           DSE06     IFEQ 0
B2INF *CVR3012 sev.30 Field DSE06 contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2INF *CVR3012 sev.30 Field DSE39 contains more than one year
     C           DSE39     ANDEQ0
|   C                     SETON                     669099
|   C                     SETON                     67
| 05-C                     END
|    C   99                GOTO END100
|    C*
B2CHKC           DSE06     IFNE 0
B2INF *CVR3012 sev.30 Field DSE06 contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|    C                     CALL 'P09'
B2???C                     PARM DSE06     P0901I  80
B2INF *CVR3012 sev.30 Field DSE06 contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0911O  1
| 06-C           P0911O    IFEQ 'N'
|   C                     SETON                     669399
| 06-C                     END
     C                     MOVE '1'       IN20
|    C*(CHANGE TO CHINESE DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE06     S001I2  80
B2INF *CVR3012 sev.30 Field DSE06 contains more than one year
B2INF *CVR3012 sev.30 Field S001I2 contains more than one year
B2MODC           YSE06     PARM           S001OI  80
|    C*
     C                     ELSE
|    C                     CALL 'P09'
B2???C                     PARM DSE39     P0901I  80
B2INF *CVR3012 sev.30 Field DSE39 contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0911O  1
| 06-C           P0911O    IFEQ 'N'
|   C                     SETON                     679399
| 06-C                     END
     C                     MOVE '0'       IN20
|    C*(CHANGE TO CHINESE DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE39     S001I2  80
B2INF *CVR3012 sev.30 Field DSE39 contains more than one year
B2INF *CVR3012 sev.30 Field S001I2 contains more than one year
B2MODC           YSE39     PARM           S001OI  80
|    C*
     C                     END
|    C   99                GOTO END100
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
