      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMR0491                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/22                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :異動明細表                                   *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREWF99  IP  E           K        DISK
     FPA#2LF01IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#FLF  IF  E           K        DISK
     F            #A0                               KRENAME#A0L
     F                                              KINFDS IRRCDF
     FIMR049BAO   E             39     PRINTER
     IWF990
     I                                              WF991AL4
     I                                              WF9902L3
     I                                              WF9908L2
     I                                              WF9903L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      139 139 $RMK01
     I                                      598 5990$LPRT
     I                                      603 607 DIR02
     I                                      608 609 DIR05S
     I                                      610 611 DIR05E
     I                                      612 612 CODE
     I*(MM/DD/YY)
     I                                      630 6350DIR04S
     I                                      636 6410DIR04E
     I*(YY/MM/DD)
M001MI*                                     650 6550YIR04S
M001MI*                                     656 6610YIR04E
M001MI                                      650 6570YIR04S
M001MI                                      658 6650YIR04E
     I*
     I                                      671 679 DIR03S
     I                                      681 689 DIR03E
     I*
     I            DS
     I                                        1  32 #A03
     I                                        1   1 #A03F
     I                                        3   3 #A033
     I*
     IIRRCDF      DS
     I                                     *RECORD  RCDF
      *==============================================================*
      *                    DEFN RTN
      *==============================================================*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYME     KLIST
     C                     KFLD           WF9904
     C                     KFLD           WF9905
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *IN10     IFEQ '0'
     C                     EXSR RTN010
     C                     END
     C  NLR      *INL4     IFEQ '1'
     C                     SETON                     39
     C                     END
     C                     EXSR RTN200                     *READE DETAIL
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CL3 10                EXSR RTNL3
     CL4 10                EXSR RTNL4
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C                     SETON                     303132
|    C                     Z-ADD0         DCOST
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C                     Z-ADD0         T1TOT5
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....READ DETAIL
      *==============================================================*
01===C           RTN200    BEGSR
|    C***
|    C*異動日期
|    C***
M001AC                     Z-ADDWF9902    W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
|    C*M001M               PARM WF9902    S001I2  60
M001MC                     PARM W6        S001I2  60
|    C           D9802     PARM           S001O1  60
|    C***
|    C*客戶簡稱
      *
|   C           KEYME     CHAINME0                  41
| 02-C           *IN41     IFEQ '1'
|   C                     MOVEL*BLANKS   ME04
| 02-C                     END
|    C***
|    C*確認日期
|    C***
M001AC                     Z-ADDWF9909    W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
|    C*M001M               PARM WF9909    S001I2  60
M001MC                     PARM W6        S001I2  60
|    C           D9809     PARM           S001O1  60
|    C*
|    C***
|    C*產品簡稱
|    C***
|    C           WF9906    CHAINMA0                  44
|    C   44                MOVE *BLANK    MA03
|    C***
|    C*對應物流點
|    C***
|    C           WF9908    CHAINPA#FLF               41
| 10-C           *IN41     IFEQ '0'
|   C*
| 11-C           RCDF      IFEQ 'MD0'
|   C           WF9908    CHAINME0                  42
|   C   42                MOVE *BLANK    NAME2
|   C  N42                MOVELME04      NAME2
| 11*C                     ELSE
|   C                     MOVE *BLANK    #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVELWF9908    #A02
|   C           KEY#A     CHAIN#A0                  43
|   C   43                MOVE *BLANK    NAME2
|   C  N43                MOVEL#A03      NAME2
| 11-C                     END
|   C*
| 10-C                     END
     C*總成本
     C           WF9911    ADD  WF9912    DCOST
     C                     ADD  WF9913    DCOST
|    C*
     C   39                EXSR RTN900
|    C                     WRITEPD1
|    C***
|    C*總計
|    C***
| 01-C           WF9907    IFEQ '進'
|   C                     ADD  WF9910    T1TOT1
|   C                     ADD  WF9911    T1TOT2
|   C                     ADD  WF9912    T1TOT3
|   C                     ADD  WF9913    T1TOT4
|   C                     ADD  DCOST     T1TOT5
| 01*C                     ELSE
|   C                     SUB  WF9910    T1TOT1
|   C                     SUB  WF9911    T1TOT2
|   C                     SUB  WF9912    T1TOT3
|   C                     SUB  WF9913    T1TOT4
|   C                     SUB  DCOST     T1TOT5
| 01-C                     END
|    C                     SETOF                     303132
|    C                     MOVE *BLANK    NAME2
|    C                     Z-ADD0         DCOST
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTNL1  ...不同一單據號碼
      *==============================================================*
11===C           RTNL1     BEGSR
     C                     SETON                     32
10===C                     ENDSR
      *==============================================================*
      *          RTNL2  ...不同一對應物流點
      *==============================================================*
11===C           RTNL2     BEGSR
     C                     SETON                     31
10===C                     ENDSR
      *==============================================================*
      *          RTNL3  ...不同一異動日期
      *==============================================================*
11===C           RTNL3     BEGSR
     C                     SETON                     303132
10===C                     ENDSR
      *==============================================================*
      *          RTNL4  ...不同單別
      *==============================================================*
11===C           RTNL4     BEGSR
|    C*
|    C                     WRITEPD2
|    C*
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C                     Z-ADD0         T1TOT5
|    C*
|    C                     SETON                     303132
|    C                     SETOF                     38
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW---同一單別代號
      *==============================================================*
11===C           RTN900    BEGSR
|    C*
|    C****
|    C*物流點
|    C****
|    C           WF9901    CHAINPA#FLF               41
| 01-C           *IN41     IFEQ '0'
|   C*
| 02-C           RCDF      IFEQ 'MD0'
|   C           WF9901    CHAINME0                  42
|   C   42                MOVE *BLANK    NAME1
|   C  N42                MOVELME04      NAME1
| 02*C                     ELSE
|   C                     MOVE *BLANK    #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVELWF9901    #A02
|   C           KEY#A     CHAIN#A0                  43
|   C   43                MOVE *BLANK    NAME1
|   C  N43                MOVEL#A03      NAME1
| 02-C                     END
|   C*
| 01-C                     END
|    C****
|    C*異動單別
|    C****
|    C           WF991A    CHAIN#20                  44
|    C   44                MOVE *BLANK    D#203
|    C  N44                MOVEL#203      D#203
|    C*
|    C   10                WRITEPE1                        *續下頁
|    C                     WRITEPH1                        *HEADING
|    C                     SETON                     303132
|    C                     SETON                     10
     C                     SETOF                     39
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN999....(NO DATA)
      *==============================================================*
13===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     MOVE *BLANK    #202
|   C                     MOVE *BLANK    D#203
|   C                     WRITEPH1
|   C                     WRITEPE4
| 01*C                     ELSE
|   C*                    WRITEPD2
| 01-C                     END
|   C                     WRITEPE2
|    C*
13===C                     ENDSR
