      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : IMR072                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/04/12                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存作業                                     *
      * REMARK       :庫存與異動保留量差異表                       *
      ****************************************************************
     FIMR072D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*公司
     I                                      601 601 DIA01S
     I                                      602 602 DIA01E
     I*物流點
     I                                      603 607 DIA02S
     I                                      603 603 IA02SL
     I                                      608 612 DIA02E
     I                                      608 608 IA02EL
     I*產品
     I                                      613 621 DIA03S
     I                                      622 630 DIA03E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DIA01S
|    C                     MOVE *BLANK    DIA01E
|    C                     MOVEL'W'       DIA02S
|    C                     MOVE 'W9999'   DIA02E
|    C                     MOVE *BLANK    DIA03S
|    C                     MOVE *BLANK    DIA03E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司
| 09-C           DIA01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIA01S
| 09-C                     END
|    C*
| 10-C           DIA01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIA01E
| 10-C                     END
|    C*
| 11-C           DIA01S    IFGT DIA01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 11-C                     END
|    C*
|    C   99                GOTO END100
|    C*物流點
| 11-C           IA02SL    IFNE 'W'
|   C                     SETON                     628999
| 11-C                     END
| 11-C           IA02EL    IFNE 'W'
|   C                     SETON                     638999
| 11-C                     END
|    C   99                GOTO END100
|    C*
| 09-C           DIA02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIA02S
| 09-C                     END
|    C*
| 10-C           DIA02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIA02E
| 10-C                     END
|    C*
| 11-C           DIA02S    IFGT DIA02E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 11-C                     END
|    C*
|    C   99                GOTO END100
|    C*產品代號
| 09-C           DIA03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIA03S
| 09-C                     END
|    C*
| 10-C           DIA03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIA03E
| 10-C                     END
|    C*
| 11-C           DIA03S    IFGT DIA03E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 11-C                     END
|    C   99                GOTO END100
     C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C* 出貨物流點
| 07-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS013'
|   C                     PARM 'BW    '  S013I1  6
|   C           DIA02S    PARM DIA02S    S013O1  5
| 07-C                     END
     C*
| 07-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE51
|   C           D#COL     ANDLE55
|   C                     CALL 'WDS013'
|   C                     PARM 'BW    '  S013I1  6
|   C           DIA02E    PARM DIA02E    S013O1  5
| 07-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
