     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.04  Y2K MODIFY                    */
     /*=============================================================*/
     FREWF53  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FIMR058BPO   E             39     PRINTER
     IWF530
     I                                              WF5301L1
     I                                              WF5302L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      603 603 DSEL1
     I                                      609 613 DSC11
     I                                      609 609 DSC11L
     I                                      614 614 DSEL2
     I*(MM/DD/YY)
     I                                      621 6260DSC08
     I*(YY/MM/DD)
     I*M001M                                640 6450YSC08
M001MI                                      640 6470YSC08
     I                                      650 650 DSC13
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           WF5301
     C                     KFLD           WF5302
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *IN10     IFEQ '0'
     C                     EXSR RTN010
|    C                     SETON                         10
     C                     END
     C*
     C                     EXSR RTN100                     *SALSE
     C   39                EXSR RTN900
     CL1 10                EXSR RTNL1                      *SALSE
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
     C                     SETOF                     202122
     C           DSEL1     IFEQ '1'
     C                     SETON                     20
     C                     ELSE
     C           DSEL1     IFEQ '2'
     C                     SETON                     21
     C                     ELSE
     C                     SETON                     22
     C                     END
     C                     END
     C*
     C                     WRITEPH1
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....JUDGE SALSES  NUMBER
      *==============================================================*
02===C           RTN100    BEGSR
|   C           KEYME     CHAINME0                  40
     C           *IN40     IFEQ '1'
     C                     MOVEL*BLANKS   ME04
     C                     END
|   C           WF5303    CHAINMA0                  41
     C           *IN41     IFEQ '1'
     C                     MOVEL*BLANKS   MA03
     C                     MOVEL*BLANKS   MA13
     C                     END
     C                     WRITEPD1
     C                     SETON                     32
     C                     ADD  QTY1      T1QTY1
     C                     ADD  QTY1      T2QTY1
02===C                     ENDSR
      *==============================================================*
      *          RTNL1 ....CUSTOMER TOTAL--
      *==============================================================*
06===C           RTNL1     BEGSR
     C                     WRITEPT1
     C                     Z-ADD0         T1QTY1
     C                     SETOF                     32
     C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW --
      *==============================================================*
06===C           RTN900    BEGSR
|    C                     WRITEPE1
|    C                     WRITEPH1
     C                     SETOF                     39
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN999....END
      *==============================================================*
06===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE31
| 01*C                     ELSE
|    C                     WRITEPT2
| 01*C                     END
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
