     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.04  Y2K MODIFY                    */
     /*=============================================================*/
     FREWFB2  IP  E           K        DISK
     FIMINLF01IF  E           K        DISK
     FIMIXPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FIMR078P O   E             39     PRINTER
     IWFB20
     I                                              WFB201L3
     I                                              WFB202L2
     I                                              WFB209L1
     I                                              WFB203L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      139 139 $RMK01
     I                                      598 5990$LPRT
     I*
     I                                      601 601 DIN01
     I                                      608 616 DIN04S
     I                                      617 625 DIN04E
     I                                      626 6290DIN02S
     I                                      626 6270SMM
     I                                      628 6290SYY
M001MI*                                     630 6350WIN02S
M001MI                                      640 6470WIN02S
     I                                      636 6390DIN02E
     I                                      636 6370EMM
     I                                      638 6390EYY
M001MI*                                     640 6450WIN02E
M001MI                                      650 6570WIN02E
     I            DS
B2MODI                                        1   60WYYMM
B2MODI                                        1   40WYY
B2MODI                                        5   60WMM
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEYIX     KLIST
     C                     KFLD           WYYMM
     C                     KFLD           WFB201
     C           KEYIN     KLIST
     C                     KFLD           DIN01
     C                     KFLD           WYYMM
     C                     KFLD           WFB201
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     SETON                     10
    C                     EXSR RTN010                     *HEADING
    C                     EXSR RTN020
  01*C                     ELSE
  02-C           *INL3     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010
    C                     EXSR RTN020
  02-C                     END
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTNL1                                  L
     CL2 10                EXSR RTNL2                                  L
     CL3 10                EXSR RTNL3                                  L
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*公司
|    C                     MOVE *BLANK    #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVEL'COMPANY' #A01
|    C                     MOVELDIN01     #A02
|    C*
|    C                     MOVEL*BLANKS   #A03
|    C           KEY#A     CHAIN#A0                  40
|    C*產品
|    C                     MOVEL*BLANK    MA03
|    C           WFB201    CHAINMA0                  40
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN020....IMINLF02
      *==============================================================*
02===C           RTN020    BEGSR
     C*檢查產品歸屬
     C           MA07      IFEQ DIN01
|    C                     Z-ADD0         QTY11
|    C                     Z-ADD0         QTY12
|    C*計算起使前一月份
B2000C                     MOVELWIN02S    WYYMM
| 01-C           WMM       IFEQ 1
B2000C                     SUB  1         WYY
|   C                     Z-ADD12        WMM
| 01*C                     ELSE
|   C                     SUB  1         WMM
| 01-C                     END
|    C*
|    C                     Z-ADD0         WQTY11 152
|    C                     Z-ADD0         WQTY12 152
|    C                     Z-ADD0         WFOB1  152
|    C                     Z-ADD0         WFHI1  152
|    C                     Z-ADD0         WDUTY1 152
|    C                     Z-ADD0         WQTY21 152
|    C                     Z-ADD0         WQTY22 152
      *
|    C                     Z-ADD0         KFOB1
|    C                     Z-ADD0         KFHI1
|    C                     Z-ADD0         KDUTY1
      *
|    C                     SETOF                     20
B2000C           KEYIX     CHAINIX0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     Z-ADDIX06      QTY11
|   C                     Z-ADDIX07      QTY12
|   C           QTY11     ADD  QTY12     TQTY1
|   C                     Z-ADDIX08      FOB1
|   C                     Z-ADDIX09      FHI1
|   C                     Z-ADDIX10      DUTY1
|   C           FOB1      ADD  FHI1      TCOST1
|   C                     ADD  DUTY1     TCOST1
|   C                     Z-ADDIX06      QTY21
|   C                     Z-ADDIX07      QTY22
|   C           QTY21     ADD  QTY22     TQTY2
|   C                     Z-ADDIX02      FOB2
|   C                     Z-ADDIX03      FHI2
|   C                     Z-ADDIX04      DUTY2
|   C                     Z-ADDQTY21     WQTY21
|   C                     Z-ADDQTY22     WQTY22
| 02*C                     ELSE
B2000C           KEYIN     SETLLIN0
B2000C           KEYIN     READEIN0                      46
| 03-C           *IN46     DOWEQ'0'
|   C                     MOVELIN03      IN03L   1
| 04-C           IN03L     IFEQ 'T'
|   C                     ADD  IN17      WQTY11
| 04*C                     ELSE
|   C                     ADD  IN17      WQTY12
| 04-C                     END
|   C                     ADD  IN26      WFOB1
|   C                     ADD  IN27      WFHI1
|   C                     ADD  IN28      WDUTY1
B2000C           KEYIN     READEIN0                      46
| 03-C                     END
      *
|   C                     Z-ADDWQTY11    QTY11
|   C                     Z-ADDWQTY12    QTY12
|   C           QTY11     ADD  QTY12     TQTY1
|   C                     Z-ADDWFOB1     FOB1
|   C                     Z-ADDWFHI1     FHI1
|   C                     Z-ADDWDUTY1    DUTY1
|   C                     Z-ADDWQTY11    WQTY21
|   C                     Z-ADDWQTY12    WQTY22
|   C                     Z-ADDWQTY21    QTY21
|   C                     Z-ADDWQTY22    QTY22
|   C           QTY21     ADD  QTY22     TQTY2
| 05-C           TQTY2     IFNE 0
|   C           FOB1      DIV  TQTY2     FOB2      H
|   C           FHI1      DIV  TQTY2     FHI2      H
| 05*C                     ELSE
|   C                     Z-ADD0         FOB2
|   C                     Z-ADD0         FHI2
| 05-C                     END
| 06-C           QTY22     IFNE 0
|   C           DUTY1     DIV  QTY22     DUTY2     H
| 06*C                     ELSE
|   C                     Z-ADD0         DUTY2
| 06-C                     END
      *
| 02-C                     END
      *
|    C           FOB1      ADD  FHI1      TCOST1
|    C                     ADD  DUTY1     TCOST1
|    C           FOB2      ADD  FHI2      TCOST2
|    C                     ADD  DUTY2     TCOST2
|    C                     ADD  FOB1      KFOB1
|    C                     ADD  FHI1      KFHI1
|    C                     ADD  DUTY1     KDUTY1
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
      *
|    C                     Z-ADD0         WQTY11 152
|    C                     Z-ADD0         WQTY12 152
|    C                     Z-ADD0         WFOB1  152
|    C                     Z-ADD0         WFHI1  152
|    C                     Z-ADD0         WDUTY1 152
|    C                     Z-ADD0         WCOST1 152
     C                     END
      *
02===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
03===C           RTN100    BEGSR
|    C*
|    C                     ADD  WFB204    WQTY11
|    C                     ADD  WFB205    WQTY12
|    C                     ADD  WFB206    WFOB1
|    C                     ADD  WFB207    WFHI1
|    C                     ADD  WFB208    WDUTY1
      *
|    C                     ADD  WFB204    WQTY21
|    C                     ADD  WFB205    WQTY22
|    C                     ADD  WFB206    KFOB1
|    C                     ADD  WFB207    KFHI1
|    C                     ADD  WFB208    KDUTY1
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL1 ....WRITE PD2
      *==============================================================*
04===C           RTNL1     BEGSR
|    C*
M001AC                     Z-ADDWFB202    W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM WFB202    S001I2  80
M001MC                     PARM W6        S001I2  60
|    C           PB202     PARM           S001O1  60
|    C*
|    C*單別
|    C                     MOVEL*BLANK    P#203
|    C                     MOVELWFB203    #201
|    C                     MOVELWFB203    #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#203      P#203
| 01-C                     END
|    C*
|    C                     Z-ADDWQTY11    QTY11
|    C                     Z-ADDWQTY12    QTY12
|    C           QTY11     ADD  QTY12     TQTY1
|    C                     Z-ADDWFOB1     FOB1
|    C                     Z-ADDWFHI1     FHI1
|    C                     Z-ADDWDUTY1    DUTY1
|    C           FOB1      ADD  FHI1      TCOST1
|    C                     ADD  DUTY1     TCOST1
|    C                     Z-ADDWQTY21    QTY21
|    C                     Z-ADDWQTY22    QTY22
|    C           QTY21     ADD  QTY22     TQTY2
| 02-C           TQTY2     IFNE 0
|   C           KFOB1     DIV  TQTY2     FOB2      H
|   C           KFHI1     DIV  TQTY2     FHI2      H
| 02*C                     ELSE
|   C                     Z-ADD0         FOB2
|   C                     Z-ADD0         FHI2
| 02-C                     END
| 03-C           QTY22     IFNE 0
|   C           KDUTY1    DIV  QTY22     DUTY2     H
| 03*C                     ELSE
|   C                     Z-ADD0         DUTY2
| 03-C                     END
|    C           FOB2      ADD  FHI2      TCOST2
|    C                     ADD  DUTY2     TCOST2
      *
|    C           KFOB1     ADD  KFHI1     KCOST1
|    C                     ADD  KDUTY1    KCOST1
|    C*列印單位成本否
| 04-C           WFB210    IFEQ 'Y'
|   C                     SETOF                     31
| 04*C                     ELSE
|   C                     SETON                     31
| 04-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD2
|    C                     SETON                     30
|    C                     Z-ADD0         WQTY11
|    C                     Z-ADD0         WQTY12
|    C                     Z-ADD0         WFOB1
|    C                     Z-ADD0         WFHI1
|    C                     Z-ADD0         WDUTY1
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNL2 ....LEVEL BREAK L2
      *==============================================================*
05===C           RTNL2     BEGSR
|    C*
|    C                     SETOF                     30
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTNL3.....LEVEL BREAK L3
      *==============================================================*
06===C           RTNL3     BEGSR
     C*檢查產品歸屬
     C           MA07      IFEQ DIN01
|    C                     Z-ADD0         QTY11
|    C                     Z-ADD0         QTY12
|    C*計算迄月份
B2000C                     MOVELWIN02E    WYYMM
|    C*
|    C                     Z-ADD0         WQTY11 152
|    C                     Z-ADD0         WQTY12 152
|    C                     Z-ADD0         WFOB1  152
|    C                     Z-ADD0         WFHI1  152
|    C                     Z-ADD0         WDUTY1 152
|    C                     Z-ADD0         WQTY21 152
|    C                     Z-ADD0         WQTY22 152
      *
|    C                     Z-ADD0         KFOB1
|    C                     Z-ADD0         KFHI1
|    C                     Z-ADD0         KDUTY1
      *
|    C                     SETON                     20
B2000C           KEYIX     CHAINIX0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDIX06      QTY11
|   C                     Z-ADDIX07      QTY12
|   C           QTY11     ADD  QTY12     TQTY1
|   C                     Z-ADDIX08      FOB1
|   C                     Z-ADDIX09      FHI1
|   C                     Z-ADDIX10      DUTY1
|   C           FOB1      ADD  FHI1      TCOST1
|   C                     ADD  DUTY1     TCOST1
|   C                     Z-ADDIX06      QTY21
|   C                     Z-ADDIX07      QTY22
|   C           QTY21     ADD  QTY22     TQTY2
|   C                     Z-ADDIX02      FOB2
|   C                     Z-ADDIX03      FHI2
|   C                     Z-ADDIX04      DUTY2
|   C                     Z-ADDQTY21     WQTY21
|   C                     Z-ADDQTY22     WQTY22
| 01*C                     ELSE
B2000C           KEYIN     SETLLIN0
B2000C           KEYIN     READEIN0                      46
| 02-C           *IN46     DOWEQ'0'
|   C                     MOVELIN03      IN03L   1
| 03-C           IN03L     IFEQ 'T'
|   C                     ADD  IN17      WQTY11
| 03*C                     ELSE
|   C                     ADD  IN17      WQTY12
| 03-C                     END
|   C                     ADD  IN26      WFOB1
|   C                     ADD  IN27      WFHI1
|   C                     ADD  IN28      WDUTY1
B2000C           KEYIN     READEIN0                      46
| 02-C                     END
      *
|   C                     Z-ADDWQTY11    QTY11
|   C                     Z-ADDWQTY12    QTY12
|   C           QTY11     ADD  QTY12     TQTY1
|   C                     Z-ADDWFOB1     FOB1
|   C                     Z-ADDWFHI1     FHI1
|   C                     Z-ADDWDUTY1    DUTY1
|   C                     Z-ADDWQTY11    WQTY21
|   C                     Z-ADDWQTY12    WQTY22
|   C                     Z-ADDWQTY21    QTY21
|   C                     Z-ADDWQTY22    QTY22
|   C           QTY21     ADD  QTY22     TQTY2
| 04-C           TQTY2     IFNE 0
|   C           FOB1      DIV  TQTY2     FOB2      H
|   C           FHI1      DIV  TQTY2     FHI2      H
| 04*C                     ELSE
|   C                     Z-ADD0         FOB2
|   C                     Z-ADD0         FHI2
| 04-C                     END
| 05-C           QTY22     IFNE 0
|   C           DUTY1     DIV  QTY22     DUTY2     H
| 05*C                     ELSE
|   C                     Z-ADD0         DUTY2
| 05-C                     END
      *
| 01-C                     END
      *
|    C           FOB1      ADD  FHI1      TCOST1
|    C                     ADD  DUTY1     TCOST1
|    C           FOB2      ADD  FHI2      TCOST2
|    C                     ADD  DUTY2     TCOST2
|    C                     ADD  FOB1      KFOB1
|    C                     ADD  FHI1      KFHI1
|    C                     ADD  DUTY1     KDUTY1
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
      *
|    C                     Z-ADD0         WQTY11 152
|    C                     Z-ADD0         WQTY12 152
|    C                     Z-ADD0         WFOB1  152
|    C                     Z-ADD0         WFHI1  152
|    C                     Z-ADD0         WDUTY1 152
|    C                     Z-ADD0         WCOST1 152
     C                     END
      *
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTNLR  ...LR
      *==============================================================*
08===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
|    C*
08===C                     ENDSR
