      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0471                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/14                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :送貨未確認明細表                             *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M002      | 99.01.29 | CALL P20之前先把日期轉成中國年
     A*---------------------------------------------------------------
      ****************************************************************
     FREW500  IP  E           K        DISK
     FREW501  IF  E           K        DISK
B2CHKFIMR084P O   E             39     PRINTER
B2INF *CVR3009 sev.30 PRINTER file IMR084P must be converted, because
B2INF *   field WF5001 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert IMR084P, enlarging WF5001
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     IWF500
     I                                              WF5000L4
     I                                              WF5001L3
     I                                              WF500AL2
     I                                              WF5003L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I                                      601 605 DSE07S
     I                                      606 610 DSE07E
     I*          　　　　
     I                                      611 6160DSE06S
     I                                      617 6220DSE06E
     I*(YY/MM/DD)
     I                                      630 6350YSE06S
     I                                      636 6410YSE06E
     I*
     I* BRAND
     I                                      651 652 DSE08S
     I                                      653 654 DSE08E
     I* GIFT
     I                                      655 663 DSE09S
     I                                      664 672 DSE09E
     I                                      673 673 DSE10S
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I                                      858 8650YMD8E
     I*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *IN10     IFEQ '0'
     C                     SETON                     104041
     C                     SETON                     123738
     C*
     C                     EXSR INIL3
     C                     EXSR INIL4
     C                     END
     C                     EXSR PROCES
     CL1                   SETON                     37
     CL2                   SETON                     38
     CL3 10                EXSR CALL3
     CL4 10                EXSR CALL4
     CLR                   EXSR RTNLR
     CLR                   RETRN
      *==============================================================*
      *          PROCES. ..DETAIL PROCESS
      *==============================================================*
     C           PROCES    BEGSR
     C   41N12             WRITEPE1
     C   41                EXSR RTN900
     C   41                SETOF                     41
     C                     SETOF                     808182
     C                     SETOF                     838485
     C                     SETOF                     868788
     C                     SETOF                     899091
     C                     SETOF                     929394
     C                     SETOF                     9596
     C           WF500A    IFEQ '01'
     C                     SETON                     80
     C                     END
     C           WF500A    IFEQ '02'
     C                     SETON                     81
     C                     END
     C           WF500A    IFEQ '03'
     C                     SETON                     82
     C                     END
     C           WF500A    IFEQ '06'
     C                     SETON                     83
     C                     END
     C           WF500A    IFEQ '08'
     C                     SETON                     84
     C                     END
     C           WF500A    IFEQ '10'
     C                     SETON                     85
     C                     END
     C           WF500A    IFEQ '11'
     C                     SETON                     86
     C                     END
     C           WF500A    IFEQ '12'
     C                     SETON                     87
     C                     END
     C           WF500A    IFEQ '13'
     C                     SETON                     88
     C                     END
     C           WF500A    IFEQ '14'
     C                     SETON                     89
     C                     END
     C           WF500A    IFEQ '15'
     C                     SETON                     90
     C                     END
     C           WF500A    IFEQ '16'
     C           WF5004    ANDEQ'2'
     C                     SETON                     91
     C                     END
     C           WF500A    IFEQ '16'
     C           WF5004    ANDEQ'1'
     C                     SETON                     92
     C                     END
     C           WF500A    IFEQ '17'
     C           WF5004    ANDEQ'2'
     C                     SETON                     93
     C                     END
     C           WF500A    IFEQ '17'
     C           WF5004    ANDEQ'1'
     C                     SETON                     94
     C                     END
     C           WF500A    IFEQ '18'
     C           WF5004    ANDEQ'2'
     C                     SETON                     95
     C                     END
     C           WF500A    IFEQ '18'
     C           WF5004    ANDEQ'1'
     C                     SETON                     96
     C                     END
     C           WF5000    CHAINWF501                55
     C           *IN55     IFEQ '0'
     C           WF5007    IFNE 0
     C           WF5004    ANDEQ'1'
     C                     Z-ADDWF5013    UNIT
     C                     END
     C           WF5007    IFNE 0
     C           WF5004    ANDEQ'2'
     C                     Z-ADDWF5014    UNIT
     C                     END
     C                     END
     C   40                EXSR DAYCAL
     C           WF5006    MULT WF5012    AMT1      H
     C                     MULT DAY       AMT1      H
     C           WF5004    IFEQ '2'
     C           AMT1      MULT -1        AMT1
     C                     END
     C           WF5007    MULT UNIT      AMT2      H
     C           WF5008    MULT WF5015    AMT3      H
     C           WF5009    MULT WF5016    AMT4      H
     C                     ADD  WF5006    W15006
     C                     ADD  WF5007    W15007
     C                     ADD  WF5008    W15008
     C                     ADD  WF5009    W15009
     C                     ADD  AMT1      AMT11
     C                     ADD  AMT2      AMT21
     C                     ADD  AMT3      AMT31
     C                     ADD  AMT4      AMT41
     C   39                WRITEPE1                        *OVRFLW-THE SAME SALE
     C   39                EXSR RTN900                     *OVRFLW-THE SAME SALE
     C                     WRITEPD1
     C                     Z-ADD0         AMT1
     C                     Z-ADD0         AMT2
     C                     Z-ADD0         AMT3
     C                     Z-ADD0         AMT4
     C   40                SETOF                     40
     C   38                SETOF                     38
     C   37                SETOF                     37
     C                     ENDSR
      *==============================================================*
     C           DAYCAL    BEGSR
      *==============================================================*
M002AC           WF5001    SUB  19110000  XF5001  60       轉成中國年
M002AC           YMD8E     SUB  19110000  WSE06E  60       轉成中國年
|   C                     CALL 'P20'
M001DC*                    PARM WF5001    P2001I  80
M001AC                     PARM XF5001    P2001I  60
|    C*M002M               PARM YSE06E    P2002I  60
M002MC                     PARM WSE06E    P2002I  60
|   C           DAY       PARM           P2011O  90
     C           WF5004    IFEQ '1'
     C                     ADD  1         DAY
     C                     END
     C                     ENDSR
      *==============================================================*
      *          CALL3 . ..PROCE LEVEL BREAK 3
      *==============================================================*
     C           CALL3     BEGSR
     C                     EXSR PROL3
     C   39                WRITEPE1                        *OVRFLW-THE SAME SALE
     C   39                EXSR RTN900                     *OVRFLW-THE SAME SALE
     C                     WRITEPT1
     C                     EXSR INIL3
     C                     SETON                     40
     C                     ENDSR
      *==============================================================*
      *          PROL3 . ..INITIAL FIELD IN PT1
      *==============================================================*
     C           PROL3     BEGSR
     C                     ADD  W15006    W25006
     C                     ADD  W15007    W25007
     C                     ADD  W15008    W25008
     C                     ADD  W15009    W25009
     C                     ADD  AMT11     AMT12
     C                     ADD  AMT21     AMT22
     C                     ADD  AMT31     AMT32
     C                     ADD  AMT41     AMT42
     C                     ENDSR
      *==============================================================*
      *          INIL3 . ..INITIAL FIELD IN PT1
      *==============================================================*
     C           INIL3     BEGSR
     C                     Z-ADD*ZEROS    W15006
     C                     Z-ADD*ZEROS    W15007
     C                     Z-ADD*ZEROS    W15008
     C                     Z-ADD*ZEROS    W15009
     C                     Z-ADD*ZEROS    AMT11
     C                     Z-ADD*ZEROS    AMT21
     C                     Z-ADD*ZEROS    AMT31
     C                     Z-ADD*ZEROS    AMT41
     C                     ENDSR
     C*
      *==============================================================*
      *          CALL4 . ..PROCE LEVEL BREAK 4
      *==============================================================*
     C           CALL4     BEGSR
     C*                    ADD  W15006    W25006
     C*                    ADD  W15007    W25007
     C*                    ADD  W15008    W25008
     C*                    ADD  W15009    W25009
     C*                    ADD  AMT11     AMT12
     C*                    ADD  AMT21     AMT22
     C*                    ADD  AMT31     AMT32
     C*                    ADD  AMT41     AMT42
     C   39                WRITEPE1                        *OVRFLW-THE SAME SALE
     C   39                EXSR RTN900                     *OVRFLW-THE SAME SALE
     C                     WRITEPT2
     C                     EXSR INIL4
     C                     SETON                     41
     C                     ENDSR
      *==============================================================*
      *          INIL4 . ..INITIAL FIELD IN PT2
      *==============================================================*
     C           INIL4     BEGSR
     C                     Z-ADD*ZEROS    W25006
     C                     Z-ADD*ZEROS    W25007
     C                     Z-ADD*ZEROS    W25008
     C                     Z-ADD*ZEROS    W25009
     C                     Z-ADD*ZEROS    AMT12
     C                     Z-ADD*ZEROS    AMT22
     C                     Z-ADD*ZEROS    AMT32
     C                     Z-ADD*ZEROS    AMT42
     C                     ENDSR
     C*
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     1239
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
08===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
     C                     WRITEPH1
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
08===C                     ENDSR
