     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : IVA210                                     *
     H*    AUTHOR       : A1092  TAYLOR                              *
     H*    CREATE DATE  : 79/08/23                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :銷售系統                                  *
     H*    SUBSYSTEM    :車輛庫存                                  *
     H*    REMARK       :車型進貨單建立（庫存）                    *
     F****************************************************************
     FIVYBPF  UF  E           K        DISK                      A
     F                                              KINFDS IVYBDS
     F                                              KINFSR ERRSR
     FIVYCPF  UF  E           K        DISK                      A
     F                                              KINFDS IVYCDS
     F                                              KINFSR ERRSR
     FPOZCPF  UF  E           K        DISK
     F                                              KINFDS POZCDS
     F                                              KINFSR ERRSR
     FPOZKPF  UF  E           K        DISK
     F                                              KINFDS POZKDS
     F                                              KINFSR ERRSR
     FBAQAPF  IF  E           K        DISK
     FBAQBPF  IF  E           K        DISK
     FIVA210D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     F            DSPC5                             KIGNORE
     E*: FUNCTION DATA :
     E                    WFUN    6   6  6
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     I              'SBMJOB JOB(IVR41-    C         WC01
     I              '2) RQSDTA(''-
     I              'CALL IVR412'')'
 @   ILDA        UDS
     I                                      101 110 $USER
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I**                                    140 140 $RMK02
 @   I**                                    141 141 $RMK03
 @   I**                                    142 147 $DEP
 @   I**                                    148 151 $STORE
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      501 507 PYB011
     I                                      508 514 PYB012
     I                                      515 520 PYB021
     I                                      521 526 PYB022
     IIVYBDS      DS
     I                                     *STATUS  WCODE1
     IIVYCDS      DS
     I                                     *STATUS  WCODE2
     IPOZCDS      DS
     I                                     *STATUS  WCODE3
     IPOZKDS      DS
     I                                     *STATUS  WCODE4
     I            DS
     I                                        1   7 DYB01
     I                                        1   1 DYB011
     I                                        2   20DYB012
     I                                        3   40DYB013
     I                                        5   70DYB014
     I            DS
     I                                        1   60DYB02
     I                                        1   20DYB021
     I                                        2   20DYB02Y
     I                                        3   40DYB022
     I                                        5   60DYB023
 @   I            DS
 @   I                                        1   1 DOPT
 @   I                                        1   10WNUM
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*
     C           *LIKE     DEFN DYB02Y    WYB022
     C           *LIKE     DEFN YC03      DYC03H
     C           *LIKE     DEFN YC04      DYC04H
     C* WZF021 =進貨年（西元年個位）+進貨月
     C                     Z-ADD0         WYB021  30
     C* FOR WINDOW(?)
     C                     MOVE *BLANKS   WQUERY  1
     C* FOR ARRAY INDEX
     C                     Z-ADD0         W       40
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYQA     KLIST
     C                     KFLD           QA25
     C                     KFLD           DYB04
     C           KEYZK     KLIST
     C                     KFLD           WYC03   7
     C                     KFLD           WYC04   30
     C           KEYYC     KLIST
     C                     KFLD           DYB01
     C                     KFLD           WYC02   30
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N99                EXSR RTN010                     *INITIAL
     C           *IN03     DOWEQ'0'
     C*
     C           SCID      CASEQ'SC01'    RTN100
     C           SCID      CASEQ'SC02'    RTN200
     C           SCID      CASEQ'SC03'    RTN300
     C                     END
     C*
     C                     END
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
     C           RTN010    BEGSR
     C                     MOVE 'SC01'    SCID    4
     C                     MOVE ' '       DYB011
     C                     Z-ADD0         DYB012
     C                     Z-ADD0         DYB013
     C                     Z-ADD0         DYB014
     C                     Z-ADD0         DYB02
     C                     MOVE '1'       DOPT
 @   C* FUN AUT
 @   C                     IN   LDA
 @   C                     MOVE $ADD      WA01,1
 @   C                     MOVE $UPD      WA01,2
 @   C                     MOVE $DLT      WA01,4
 @   C                     MOVE $INQ      WA01,5
 @   C                     MOVE $RMK01    WA01,6
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN100....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
     C           RTN100    BEGSR
     C*
     C                     EXFMTDSPD1
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'
     C           *IN18     IFEQ '0'
     C                     EXSR RTN110                     *SCR CHK
     C  N99                MOVE 'SC02'    SCID
     C                     ELSE
@    C                     MOVEL'IVS210'  S0102I           *FOR RTN990
@    C                     EXSR RTN990                     *AUT CHK
@    C  N99                EXSR RTN180                     *CALL SUBPGM
     C                     END
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN110....SCREEN CHECK
     C*==============================================================*
     C           RTN110    BEGSR
     C*
@    C* CHK AUT *
@ DS C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
@    C                     SETON                     9099
@    C                     END
@    C   99                GOTO END110
     C*
STARTC*新增時－－＞進貨日期需輸入，自動編號
     C*
     C           DOPT      IFEQ '1'                        *ADD
     C***第一碼需輸入
     C           DYB011    IFEQ ' '
     C                     SETON                     609499
     C                     ELSE
     C           DYB011    IFNE 'D'
     C           DYB011    ANDNE'E'
     C                     SETON                     609499
     C                     ELSE
     C***進貨日期需輸入
     C           DYB02     IFEQ 0
     C                     SETON                     619899
     C                     ELSE
     C                     CALL 'P04'
     C                     PARM DYB02     P0401I  60
     C                     PARM           P0401O  1
     C           P0401O    IFEQ 'N'
     C                     SETON                     619599
     C                     END
     C                     END
     C                     END
     C                     END
     C   99                GOTO END110
     C*
     C****自動編號
     C* WYB021 =進貨年（西元年個位）+進貨月
     C           DYB02Y    ADD  1         WYB022
     C           WYB022    MULT 100       WYB021
     C                     ADD  DYB022    WYB021
     C                     MOVE WYB021    S001I1
     C                     MOVELDYB011    S001I1
     C                     CALL 'PTS001'
     C                     PARM           S001I1  4
     C                     PARM           S001O1  30
     C                     MOVELS001I1    DYB01
     C                     MOVE S001O1    DYB01
     C                     END
     C*
     C           DOPT      IFNE '1'
     C           DYB01     SETLLYB0                      42
     C           *IN42     IFEQ '0'
     C                     SETON                     609699
     C                     END
     C                     END
     C   99                GOTO END110
     C*
     C           END110    ENDSR
     C*==============================================================*
     C*          RTN180....CALL SUBPGM
     C*==============================================================*
     C           RTN180    BEGSR
     C*
     C                     CALL 'IVS210'
     C           DYB01     PARM DYB01     S21001  7
     C                     PARM           S210O2  2
     C*
     C           S210O2    IFEQ '03'
     C                     SETON                     03
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN200....'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
     C           RTN200    BEGSR
     C*
     C                     MOVE WFUN,WNUM DFUN
     C                     EXSR RTN205                      *CHK AUT
     C*
     C           DOPT      CASEQ'1'       RTN210           *ADD
     C           DOPT      CASEQ'2'       RTN220           *UPD
     C           DOPT      CASEQ'4'       RTN230           *DEL
     C           DOPT      CASEQ'5'       RTN240           *INQ
     C           DOPT      CASEQ'6'       RTN250           *CONFIRM
     C                     END
     C                     ENDSR
     C*==============================================================*
     C*          RTN205....CHK SUBPGM AUT
     C*==============================================================*
     C           RTN205    BEGSR
     C*
     C*使用者若有使用＜採購資料查詢＞權利時--> SETON IN32
     C*          --> 可輸入明細查詢
     C*
     C                     MOVEL'POI240'  S0102I           *FOR RTN990
     C                     EXSR RTN990                     *AUT CHK
     C           S0101O    IFEQ 'Y'
     C                     SETON                     32
     C                     END
     C*
     C*使用者若有使用＜車身資料查詢＞權利時--> SETON IN33
     C*          --> 可輸入明細查詢
     C*
     C                     MOVEL'IVA211'  S0102I           *FOR RTN990
     C                     EXSR RTN990                     *AUT CHK
     C           S0101O    IFEQ 'Y'
     C                     SETON                     33
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN210....ADD DATA --- DSPD2
     C*==============================================================*
     C           RTN210    BEGSR
     C*
     C                     SETON                     313565
     C                     SETOF                     3233
     C                     EXSR RTN800                     *INIT SC02 DSPD2
     C*
     C           *IN03     DOWEQ'0'                        *CTL LOOP
     C           SCID      ANDEQ'SC02'                     *CTL LOOP
     C*
     C                     WRITEDSPC1
     C                     WRITEDSPC3
     C                     EXFMTDSPD2
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'
     C           *IN12     IFEQ '0'
     C*
     C           *IN19     CASEQ'1'       RTN400           進貨單列印
     C           *IN20     CASEQ'1'       RTN500           廠商明細
     C                     CAS            RTN810            CHK SCR DSPD2
     C                     END
     C*
     C           *IN99     IFNE '1'
     C                     EXSR RTN820                      *DSPD2 --> FILE
     C                     WRITEYB0
     C                     MOVE 'SC03'    SCID
     C                     END
     C*  *IN12 ON
     C                     ELSE
     C           *LOVAL    SETLLYB0
     C                     MOVE 'SC01'    SCID
     C                     END                             *IN12 ENDIF
     C                     END                             *IN03 ENDIF
     C*
     C                     END                             *ENDDO
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN220....UPD DATA --- DSPD2
     C*==============================================================*
     C           RTN220    BEGSR
     C*
     C                     SETON                     313565*CAN INPUT
     C                     SETOF                     3233
     C                     EXSR RTN801                     *INT SFLSR
     C                     EXSR RTN830                     *PF-->DSPD2
     C                     EXSR RTN833                     *ADD SFLSR
     C*
     C           *IN03     DOWEQ'0'                        *CTL LOOP
     C           SCID      ANDEQ'SC02'
     C*
     C                     WRITEDSPC1
     C                     WRITESFLCR
     C*                    WRITEDSPD3
     C                     WRITEDSPC3
     C                     EXFMTDSPD5
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'
     C           *IN12     IFEQ '0'
     C*
     C           *IN19     CASEQ'1'       RTN400           進貨單列印
     C           *IN20     CASEQ'1'       RTN500           廠商明細
     C                     CAS            RTN810            CHK SCR DSPD2
     C                     END
     C*
     C           *IN99     IFNE '1'
     C                     EXSR RTN820
     C                     UPDATYB0
     C                     MOVE 'SC03'    SCID
     C                     END
     C* *IN12 ON
     C                     ELSE
     C           *LOVAL    SETLLYB0
     C                     MOVE 'SC01'    SCID
     C                     END                             *IN03 ENDIF
     C                     END                             *IN12 ENDIF
     C*
     C                     END                             *ENDDO
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN230....DEL DATA --- DSPD2 & SFLSR
     C*==============================================================*
     C           RTN230    BEGSR
     C*
     C                     SETOF                     313565
     C                     SETOF                     36
     C                     EXSR RTN801                     *INT SFLSR
     C                     EXSR RTN830                     *PF-->DSPD2
     C                     EXSR RTN833                     *ADD SFLSR
     C           *IN39     IFEQ '1'
     C                     SETON                     87
     C                     END
     C*
     C           *IN03     DOWEQ'0'                        *CTL LOOP
     C           SCID      ANDEQ'SC02'
     C*
     C                     WRITEDSPC1
     C                     WRITEDSPC4
     C                     WRITEDSPD2
     C                     WRITESFLCR
     C                     EXFMTDSPD3
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'
     C           *IN12     IFEQ '0'
     C*
     C**** FOR RTN420 (CALL
     C*
     C                     MOVE 'I'       A211I3  1
     C*
     C           *IN19     CASEQ'1'       RTN400           進貨單列印
     C           *IN20     CASEQ'1'       RTN500           廠商明細
     C           DOP1      CASNE0         RTN410           採購明細
     C           DYD02     CASNE0         RTN420           車身明細
     C                     END
     C*
     C           *IN99     IFEQ '0'
     C           *IN39     IFEQ '0'
     C                     MOVE 'D'       A211I3  1         *FOR RTN420
     C                     EXSR RTN841                      *DLT D
     C                     DELETYB0
     C                     MOVE 'SC01'    SCID
     C                     ELSE
     C                     SETON                     8799
     C                     END
     C                     END
     C*
     C                     ELSE
     C                     MOVE 'SC01'    SCID
     C                     END                             *IN12 ENDIF
     C                     END                             *IN03 ENDIF
     C*
     C                     END                             *ENDDO
     C           *LOVAL    SETLLYB0
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN240....INQ DATA
     C*==============================================================*
     C           RTN240    BEGSR
     C*
     C*
     C* LDA UPDATE TO *LDA
     C                     OUT  LDA
     C*
     C                     CALL 'IVI210'
     C           DYB01     PARM DYB01     I210I1  7
     C                     PARM           I210O1  2
     C*
     C           I210O1    IFEQ '03'
     C                     SETON                     03
     C                     END
     C*
     C                     MOVE 'SC01'    SCID
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN250....
     C*==============================================================*
     C           RTN250    BEGSR
     C*
     C                     SETOF                     313565*NO INPUT
     C                     SETOF                     36
     C                     EXSR RTN830                     *PF-->DSPD2
     C*
     C           *IN03     DOWEQ'0'                        *CTL LOOP
     C           SCID      ANDEQ'SC02'
     C*
     C                     EXSR RTN801                     *INT SFLSR
     C                     EXSR RTN833                     *ADD SFLSR
     C*
     C                     WRITEDSPC1
     C                     WRITEDSPC4
     C                     WRITEDSPD2
     C                     WRITESFLCR
     C                     EXFMTDSPD3
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'
     C           *IN12     IFEQ '0'
     C*
     C**** FOR RTN420 (CALL IVA211)
     C*
     C                     MOVE 'C'       A211I3  1
     C*
     C           *IN19     CASEQ'1'       RTN400           進貨單列印
     C           *IN20     CASEQ'1'       RTN500           廠商明細
     C           DOP1      CASNE0         RTN410           採購明細
     C           DYD02     CASNE0         RTN420           車身明細
     C                     END
     C*
     C                     ELSE
     C                     MOVE 'SC01'    SCID
     C                     END                             *IN03 ENDIF
     C                     END                             *IN12 ENDIF
     C*
     C                     END                             *ENDDO
     C                     Z-ADDDYB15     YB15
     C                     Z-ADDDYB14     YB14
     C                     UPDATYB0
     C           *LOVAL    SETLLYB0
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
     C           RTN300    BEGSR
     C*
     C                     EXSR RTN205                      *CHK AUT
     C*
     C           DOPT      CASEQ'1'       RTN310           *ADD
     C           DOPT      CASEQ'2'       RTN320           *UPD
     C                     END
     C                     ENDSR
     C*==============================================================*
     C*          RTN310....ADD DATA --- SFLSR
     C*==============================================================*
     C           RTN310    BEGSR
     C*
     C                     SETOF                     313536
     C                     EXSR RTN802                     *INT SFLSR
     C***  YB0 HAVE BEEN WRITE SO IT MUST BE CHAIN HERE
     C           DYB01     CHAINYB0                  40
     C*
     C           *IN03     DOWEQ'0'                        *CTL LOOP
     C           SCID      ANDEQ'SC03'
     C*
     C                     EXSR RTN801                     *INT SFLSR
     C                     EXSR RTN833                     *READ SFLSR
     C                     WRITEDSPC1
     C                     WRITEDSPC4
     C                     WRITEDSPD2
     C                     EXFMTSFLCR
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'
     C           *IN12     IFEQ '0'
     C*
     C**** FOR RTN420 (CALL IVA211)
     C*
     C                     MOVE 'U'       A211I3  1
     C*
     C           *IN19     CASEQ'1'       RTN400           進貨單列印
     C           *IN20     CASEQ'1'       RTN500           廠商明細
     C           DOP1      CASNE0         RTN410           採購明細
     C           DYD02     CASNE0         RTN420           車身明細
     C                     CAS            RTN811            CHK SFLSR
     C                     END
     C*
     C           *IN99     IFEQ '0'                         SAVE
     C           *IN05     ANDEQ'0'                         SAVE
     C                     EXSR RTN842                      SAVE D
     C                     END
     C*
     C                     ELSE
     C                     MOVE 'SC01'    SCID
     C                     END                             *IN03 ENDIF
     C                     END                             *IN12 ENDIF
     C*
     C                     END                             *ENDDO
     C                     Z-ADDDYB15     YB15
     C                     Z-ADDDYB14     YB14
     C                     UPDATYB0
     C           *LOVAL    SETLLYB0
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN320....UPD DATA --- SFLSR
     C*==============================================================*
     C           RTN320    BEGSR
     C*
     C                     SETOF                     313536
     C                     SETON                     29
     C                     EXSR RTN802                     *INT SFLCR
     C***  YB0 HAVE BEEN UPDAT SO IT MUST BE CHAIN HERE
     C           DYB01     CHAINYB0                  40
     C*
     C           *IN03     DOWEQ'0'                        *CTL LOOP
     C           SCID      ANDEQ'SC03'
     C*
     C                     EXSR RTN801                     *INT SFLSR
     C                     EXSR RTN833                     *ADD SFLSR
     C*
     C                     WRITEDSPC1
     C                     WRITEDSPD2
     C                     WRITEDSPC4
     C                     EXFMTSFLCR
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'
     C           *IN12     IFEQ '0'
     C*
     C**** FOR RTN420 (CALL IVA211)
     C*
     C                     MOVE 'U'       A211I3  1
     C*
     C           *IN19     CASEQ'1'       RTN400           進貨單列印
     C           *IN20     CASEQ'1'       RTN500           廠商明細
     C           DOP1      CASNE0         RTN410           採購明細
     C           DYD02     CASNE0         RTN420           車身明細
     C                     CAS            RTN811            CHK SFLSR
     C                     END
     C*
     C           *IN99     IFEQ '0'                         SAVE
     C           *IN05     ANDEQ'0'                         SAVE
     C                     EXSR RTN842                      SAVE D
     C                     END
     C*
     C                     ELSE
     C                     MOVE 'SC01'    SCID
     C                     END                             *IN03 ENDIF
     C                     END                             *IN12 ENDIF
     C*
     C                     END                             *ENDDO
     C                     Z-ADDDYB15     YB15
     C                     Z-ADDDYB14     YB14
     C                     UPDATYB0
     C           *LOVAL    SETLLYB0
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN400....進貨單列印(PF19)
     C*==============================================================*
     C           RTN400    BEGSR
     C                     Z-ADD2         $EVR
     C                     Z-ADD0         $CPY
     C                     Z-ADD0         $PRTID
     C                     EXFMTDSPD4
     C           *IN03     IFNE '1'
     C                     MOVE DYB01     PYB011
     C                     MOVE DYB01     PYB012
     C                     MOVE DYB02     PYB021
     C                     MOVE DYB02     PYB022
     C                     OUT  LDA
     C           $EVR      IFEQ 1
     C                     CALL 'IVR412'
     C                     ELSE
     C                     MOVELWC01      WCMD
     C                     CALL 'QCAEXEC'
     C                     PARM           WCMD   45
     C                     PARM 45        LENTH  155
     C                     END
     C                     ELSE
     C                     SETOF                     03
     C                     END
     C                     SETON                     99
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN410....採購明細 DOP1
     C*==============================================================*
     C           RTN410    BEGSR
     C*
     C                     Z-ADDDOP1      WYC02
     C           KEYYC     CHAINYC0                  40
-----C           *IN40     IFEQ '1'
|    C                     SETON                     799599
|----C                     ELSE
|    C                     CALL 'POI240'
|    C                     PARM YC03      I240I1  7        採購單號
|    C                     PARM           I240O1  2         FUN KEY
|    C                     Z-ADD0         DOP1
-----C                     END                              *IN40END
     C*
     C           KEYYC     SETGTYC0
     C                     SETON                     99
     C                     ENDSR
     C*==============================================================*
     C*          RTN420....車身明細 (CALL IVA211)
     C*==============================================================*
     C           RTN420    BEGSR
     C*
     C           DYD02     IFNE 0
     C                     Z-ADDDYD02     WYC02
     C                     END
     C** CHAIN AND LOCK IVYCPF
     C           KEYYC     CHAINYC0                  40
-----C           *IN40     IFEQ '1'
|    C                     SETON                     789599
|----C                     ELSE
     C** LOCK  POZKPF
     C                     MOVE YC03      WYC03
     C                     MOVE YC04      WYC04
     C           KEYZK     CHAINZK0                  40
     C** LOCK  POZCPF
     C           ZK05      CHAINZC0                  40
     C*
     C           DOPT      IFEQ '2'
     C           DOPT      OREQ '6'
     C           YC24      IFEQ 'Y'
     C                     MOVE 'I'       A211I3  1
     C                     END
     C                     END
     C*
     C                     CALL 'IVA211'
     C                     PARM DYB01     A211I1  7
     C                     PARM DYD02     A211I2  30
     C                     PARM           A211I3  1
     C                     PARM DFUN      A211I4  6
     C                     PARM           A211O1  50
     C                     PARM           A211O2  1
     C                     PARM           A211O3  2
     C                     END
     C   99                GOTO END420
     C           A211O1    SUB  YC09      CHGNUM  50       *進貨改變數量
     C*
     C           A211I3    CASEQ'U'       RTN421
     C           A211I3    CASEQ'D'       RTN421
     C           A211I3    CASEQ'C'       RTN422
     C                     END
     C*****  INQUERY DO NOTHING
     C*
     C           A211O3    IFEQ '03'
     C                     MOVE '1'       *IN03
     C                     END
     C                     MOVE *BLANKS   DYD02
     C                     SETON                     99
     C*
     C           END420    ENDSR
     C*==============================================================*
     C*          RTN421....車身明細 (CALL IVA211) : UPDATE,DELETE
     C*    更改: IVYCPF,IVYBPF,POZCPF,POZKPF FILES
     C*==============================================================*
     C           RTN421    BEGSR
     C*
     C**** 更改: IVYCPF,IVYBPF,POZCPF,POZKPF FILES
     C*
     C           A211O2    IFNE 'Y'
     C*
     C***  IVYCPF : YC09,YC23   OR   YC24
     C*
     C                     MOVE YC03      WYC03
     C                     MOVE YC04      WYC04
     C           KEYZK     CHAINZK0                  40
     C*
     C                     Z-ADDZK22      YC22
     C           YC22      MULT CHGNUM    CHGMON  90
     C                     Z-ADDA211O1    YC09
     C           YC23      ADD  CHGMON    YC23
     C                     UPDATYC0
     C*
     C***  POZKPF : ZK09
     C*
     C           ZK09      ADD  CHGNUM    ZK09
     C                     UPDATZK0
     C*
     C***  POZCPF : ZC14,ZC15   OR   ZC13,ZC14
     C*
     C           ZK05      CHAINZC0                  40
     C           ZC14      ADD  CHGNUM    ZC14
     C           ZC15      SUB  CHGNUM    ZC15
     C                     UPDATZC0
     C*
     C***  IVYBPF : YB10,YB11,YB12,YB15   OR   YB16
     C*
     C           YB11      ADD  CHGMON    YB11
     C           YB11      MULT YB09      YB10
     C           YB10      DIV  100       YB10
     C           DYB011    IFEQ 'D'
     C           YB11      ADD  YB10      YB12
     C                     ELSE
     C           YB11      MULT YB08      YB12
     C                     END
     C           DYB15     ADD  CHGNUM    DYB15
     C*
     C                     END                             *A211I3 <> 'Y'
     C*
     C           END421    ENDSR
     C*==============================================================*
     C*          RTN422....車身明細 (CALL IVA211) : 確認
     C*    更改: IVYCPF,IVYBPF,POZCPF,POZKPF FILES
     C*==============================================================*
     C           RTN422    BEGSR
     C*
     C**** 更改: IVYCPF,IVYBPF,POZCPF,POZKPF FILES
     C*
     C           A211O2    IFEQ 'Y'
     C           YC24      ANDNE'Y'
     C*
     C***  IVYCPF : YC09,YC23   OR   YC24
     C*
     C                     MOVE 'Y'       YC24
     C                     UPDATYC0
     C*
     C***  POZKPF : ZK09  ( NOT CHANGE )
     C*
     C                     MOVE YC03      WYC03
     C                     MOVE YC04      WYC04
     C           KEYZK     CHAINZK0                  40
     C*
     C***  POZCPF : ZC14,ZC15   OR   ZC13,ZC14
     C*
     C           ZK05      CHAINZC0                  40
     C           ZC13      ADD  A211O1    ZC13
     C           ZC14      SUB  A211O1    ZC14
     C                     UPDATZC0
     C*
     C***  IVYBPF : YB10,YB11,YB12,YB15   OR   YB16
     C*
     C           YB16      ADD  A211O1    YB16
     C                     Z-ADDYB16      DYB16
     C*
     C                     END
     C*
     C           END422    ENDSR
     C*==============================================================*
     C*          RTN500....廠商明細(PF20)
     C*==============================================================*
     C           RTN500    BEGSR
     C*
     C* SETON 99 --> NOT A/U/D FILE
     C*
     C                     MOVEL'BAI140'  S0102I           *FOR RTN990
     C                     EXSR RTN990                     *AUT CHK
     C*
     C           *IN99     IFEQ '0'
     C                     CALL 'BAI140'
     C                     PARM DYB03     I140I1  8
     C                     PARM           I14001  2
     C                     END
     C                     SETON                     99
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN800....INIT 'SC02' -- DSPD2
     C*==============================================================*
     C           RTN800    BEGSR
     C*
     C                     MOVE *BLANKS   DYB03
     C                     MOVE *BLANKS   DYB04
     C                     MOVE *BLANKS   DQB02
     C                     MOVE *BLANKS   DQA04
     C*
     C                     MOVE *BLANKS   YB05
     C                     MOVE *BLANKS   YB07
     C                     Z-ADD0         YB08
     C                     Z-ADD0         YB09
     C                     Z-ADD0         YB10
     C                     Z-ADD0         YB09
     C                     Z-ADD0         YB10
     C                     Z-ADD0         YB11
     C                     Z-ADD0         YB12
     C                     MOVE *BLANKS   DYB13
     C                     Z-ADD0         YB14
     C                     Z-ADD0         YB15
     C                     Z-ADD0         YB16
     C*
     C                     Z-ADD0         DYB14
     C                     Z-ADD0         DYB15
     C                     Z-ADD0         DYB16
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN801....INIT 'SC02' -- SFLSR
     C*==============================================================*
     C           RTN801    BEGSR
     C*
     C                     Z-ADD1         DRRN
     C                     Z-ADD0         WRRN    40
     C                     Z-ADD0         RRN
     C                     MOVE 'N'       WBOTOM  1        *BOTTOM
     C*
     C                     SETON                     52    *SFLCLR
     C                     WRITESFLCR
     C                     SETOF                     525053
     C                     SETON                     51    *SFLDSPCTL
     C*
     C           DYB01     SETLLYC0
     C                     ENDSR
     C*==============================================================*
     C*          RTN802....INIT 'SC03' -- SFLCR
     C*==============================================================*
     C           RTN802    BEGSR
     C                     Z-ADD0         DYC02
     C                     MOVE *BLANKS   DYC03
     C                     Z-ADD0         DYC04
     C                     Z-ADD0         DYC08
     C                     Z-ADD0         DYC09
     C                     MOVE *BLANKS   DYC24
     C                     MOVE *BLANKS   DZK05
     C                     MOVE *BLANKS   DZK06
     C                     MOVE *BLANKS   DZK10
     C                     MOVE *BLANKS   DZK11
     C                     MOVE *BLANKS   DZK12
     C                     MOVE *BLANKS   DZK13
     C                     MOVE *BLANKS   DZK14
     C                     MOVE *BLANKS   DZK15
     C                     MOVE *BLANKS   DZK16
     C                     MOVE *BLANKS   DZK17
     C                     MOVE *BLANKS   DZK18
     C                     MOVE *BLANKS   DZK19
     C                     MOVE *BLANKS   DZK20
     C                     MOVE *BLANKS   DZK21
     C                     MOVE *BLANKS   DZC02
     C                     MOVE ' '       DOP
     C                     ENDSR
     C*==============================================================*
     C*          RTN810....CHECK 'SC02' --- DSPD2
     C*==============================================================*
     C           RTN810    BEGSR
     C*
     C*CHK SCREEN
     C*
     C           DYB03     IFEQ *BLANK
     C                     SETON                     609199
     C                     ELSE
     C                     MOVELDYB03     WQUERY
     C           WQUERY    IFEQ '?'
     C                     CALL 'BAS141'
     C                     PARM '23'      S141I1  2
     C           DYB03     PARM           S141O1  8
     C                     SETON                     38
     C                     END
     C           DYB03     CHAINQB0                  40
     C           *IN40     IFEQ '1'
     C                     SETON                     609899
     C                     MOVE *BLANKS   DQB02
     C                     ELSE
     C                     MOVELQB02      DQB02
     C                     MOVE QB07      YB07
     C                     END
     C                     END
     C   99                GOTO END810
     C*
     C           QB27      IFNE '2'
     C           QB27      ANDNE'3'
     C                     SETON                     608899
     C                     END
     C   99                GOTO END810
     C*
     C**** 供應商之國內外別需與進貨單一致
     C*
     C           DYB011    IFEQ 'D'
     C           QB03      IFNE '1'
     C                     SETON                     608999
     C                     END
     C                     ELSE
     C           QB03      IFNE '2'
     C                     SETON                     608999
     C                     END
     C                     END
     C   99                GOTO END810
     C*
     C*
     C                     CALL 'P04'
     C                     PARM DYB02     P0401I  60
     C                     PARM           P0401O  1
     C           P0401O    IFEQ 'N'
     C                     SETON                     629799
     C                     END
     C   99                GOTO END810
     C*
     C           DYB04     IFEQ *BLANK
     C                     SETON                     639199
     C                     ELSE
     C                     MOVEL'13'      QA25
     C           KEYQA     CHAINQA0                  40
     C           *IN40     IFEQ '1'
     C                     SETON                     639899
     C                     MOVE *BLANKS   DQA04
     C                     ELSE
     C                     MOVELQA04      DQA04
     C                     END
     C                     END
     C   99                GOTO END810
     C           *IN38     IFEQ '1'
     C                     SETON                     99
     C                     SETOF                     38
     C                     END
     C*
     C           END810    ENDSR
     C*=============================================================*
     C*          RTN811....CHECK & SAVE
     C*=============================================================*
     C           RTN811    BEGSR
     C*
     C***  DOP='0'
     C*
     C           DOP       IFEQ '0'
     C                     EXSR RTN812
     C                     SETON                     99
     C                     GOTO END811
     C                     END
     C*
     C***  已確認，不可修改或刪除
     C*
     C                     Z-ADDDYC02     WYC02
     C           KEYYC     CHAINYC0                  40
     C           DOP       IFGT '1'
     C           YC24      ANDNE*BLANK
     C                     SETON                     818799
     C                     END
     C                     MOVE YC03      DYC03H
     C                     Z-ADDYC04      DYC04H
     C   99                GOTO END811
     C*
     C*** 輸入�洁H�洏i挑選採購單號
     C*
     C                     MOVELDYC03     WQUERY
     C           WQUERY    IFEQ '?'
     C                     CALL 'POS240'
     C           DYC03     PARM DYC03     S24001  7
     C                     PARM           S24002  2
     C                     SETON                     99
     C                     END
     C   99                GOTO END811
     C*
     C*** F5 參考資料
     C*
     C           *IN05     IFEQ '1'
     C           DOP       ANDNE'1'
     C                     EXSR RTN822
     C                     SETON                     99
     C                     END
     C   99                GOTO END811
     C*
     C*
     C           DOP       IFNE '4'
     C*
     C           DYC03     IFEQ *BLANKS
     C                     SETON                     829199
     C                     END
     C   99                GOTO END811
     C           DYC04     IFEQ 0
     C                     SETON                     839199
     C                     END
     C   99                GOTO END811
     C*
     C*採購單號＋採購項次需已存在採購檔
     C*
     C                     MOVE DYC03H    WYC03
     C                     Z-ADDDYC04H    WYC04
     C           KEYZK     CHAINZK0                  41
     C           ZK24      IFEQ 'F'
     C                     SETON                     8283
     C                     SETON                     9599
     C                     END
     C*
     C                     MOVE DYC03     WYC03
     C                     Z-ADDDYC04     WYC04
     C           KEYZK     CHAINZK0                  41
     C           *IN41     IFEQ '1'
     C                     SETON                     8283
     C                     SETON                     9599
     C                     ELSE
     C           ZK24      IFEQ 'F'
     C                     SETON                     8283
     C                     SETON                     9299
     C                     END
     C                     END
     C   99                GOTO END811
     C*
     C*
     C*** 進貨單與採購單之國內外別需一致
     C*
     C                     MOVELDYC03     WQUERY
     C           DYB011    IFEQ 'D'
     C           WQUERY    IFNE 'B'
     C                     SETON                     828899
     C                     END
     C                     ELSE
     C           WQUERY    IFNE 'C'
     C                     SETON                     828899
     C                     END
     C                     END
     C   99                GOTO END811
     C*
     C*採購單號＋採購項次之車型編號需屬該供應廠商
     C*
     C                     MOVE ZK05      DZK05
     C           DZK05     CHAINZC0                  40
     C           *IN40     IFEQ '1'
     C                     SETON                     8283
     C                     SETON                     8999
     C                     ELSE
     C           ZC04      IFNE DYB03
     C                     SETON                     8283
     C                     SETON                     8999
     C                     END
     C                     END
     C   99                GOTO END811
     C*
     C                     END                             *DOP NE '4'
     C*
     C*
     C                     Z-ADDDYC02     WYC02
     C           KEYYC     CHAINYC0                  40
     C*
     C           DOP       IFNE '1'
     C           *IN40     ANDEQ'1'
     C                     SETON                     8283
     C                     SETON                     9399
     C                     END
     C   99                GOTO END811
     C*
     C           DOP       IFEQ '1'
     C           DYC08     IFLE 0
     C                     SETON                     849599
     C                     END
     C                     ELSE
     C           DOP       IFEQ '2'
     C           DYC08     IFLT YC09
     C                     SETON                     849599
     C                     END
     C                     END
     C                     END
     C*
     C           END811    ENDSR
     C*=============================================================*
     C*          RTN812....DOP='0'
     C*=============================================================*
     C           RTN812    BEGSR
     C*
     C           *IN03     DOWEQ'0'                        *CTL LOOP
     C           SCID      ANDEQ'SC03'
     C*
     C                     EXSR RTN801                     *INT SFLSR
     C                     EXSR RTN833                     *ADD SFLSR
     C                     WRITEDSPC1
     C                     WRITEDSPC4
     C                     WRITESFLCR
     C                     WRITEDSPD2
     C                     EXFMTDSPD3
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'
     C           *IN12     IFEQ '0'
     C*
     C           *IN19     CASEQ'1'       RTN400           進貨單列印
     C           *IN20     CASEQ'1'       RTN500           廠商明細
     C           DOP1      CASNE0         RTN410           採購明細
     C           DYD02     CASNE0         RTN420           車身明細
     C                     END
     C           *IN99     IFEQ '0'
     C                     MOVE 'SC01'    SCID
     C                     END
     C*
     C                     ELSE
     C                     MOVE 'SC01'    SCID
     C                     END                             *IN03 ENDIF
     C                     END                             *IN12 ENDIF
     C*
     C                     END                             *ENDDO
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN820....SCREEN TO FILE --- H
     C*==============================================================*
     C           RTN820    BEGSR
     C*
     C                     MOVE DYB01     YB01
     C                     MOVE DYB03     YB03
     C                     Z-ADDDYB02     YB02
     C                     MOVE DYB04     YB04
     C                     MOVE DYB13     YB13
     C                     TIME           YBXX
     C                     Z-ADD$CHYMD    YBYY
     C                     MOVE $USER     YBZZ
     C           DYB011    IFEQ 'D'
     C                     Z-ADD1         YB08
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN821....SCREEN TO FILE --- D
     C*==============================================================*
     C           RTN821    BEGSR
     C*
     C                     MOVE DYB01     YC01
     C                     Z-ADDDYC02     YC02
     C                     MOVE DYC03     YC03
     C                     Z-ADDDYC04     YC04
     C                     Z-ADDDYC08     YC08
     C                     TIME           YCXX
     C                     Z-ADD$CHYMD    YCYY
     C                     MOVE $USER     YCZZ
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN822....FILE TO SCREEN SFLCR --- (F5)
     C*==============================================================*
     C           RTN822    BEGSR
     C                     Z-ADDDYC02     WYC02
     C           KEYYC     CHAINYC0                  40
-----C           *IN40     IFEQ '1'
|    C                     SETON                     819599
|----C                     ELSE
     C                     MOVE YC03      DYC03
     C                     Z-ADDYC04      DYC04
     C                     Z-ADDYC08      DYC08
     C                     Z-ADDYC09      DYC09
     C                     MOVE YC24      DYC24
     C                     EXSR RTN823
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN823....FILE TO SCREEN SFLCR --- (F5) FROM RTN822
     C*==============================================================*
     C           RTN823    BEGSR
     C                     MOVE DYC03     WYC03
     C                     Z-ADDDYC04     WYC04
     C* GET 車型編號及配備
     C           KEYZK     CHAINZK0                  41
     C           *IN41     IFEQ '1'
     C                     SETON                     819599
     C                     ELSE
     C                     MOVE ZK05      DZK05
     C                     MOVE ZK06      DZK06
     C                     MOVE ZK10      DZK10
     C                     MOVE ZK11      DZK11
     C                     MOVE ZK12      DZK12
     C                     MOVE ZK13      DZK13
     C                     MOVE ZK14      DZK14
     C                     MOVE ZK15      DZK15
     C                     MOVE ZK16      DZK16
     C                     MOVE ZK17      DZK17
     C                     MOVE ZK18      DZK18
     C                     MOVE ZK19      DZK19
     C                     MOVE ZK20      DZK20
     C                     MOVE ZK21      DZK21
     C* GET 車型名稱
     C           DZK05     CHAINZC0                  40
     C           *IN40     IFEQ '1'
     C                     MOVE *BLANKS   DZC02
     C                     ELSE
     C                     MOVELZC02      DZC02
     C                     END
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN824....SCREEN TO FILE --- D
     C*==============================================================*
     C           RTN824    BEGSR
     C*
     C                     Z-ADD0         YC09
     C                     Z-ADD0         YC22
     C                     Z-ADD0         YC23
     C                     MOVE *BLANKS   YC24
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN830....FILE TO SCREEN --- DSPD2
     C*==============================================================*
     C           RTN830    BEGSR
     C*
     C           DYB01     CHAINYB0                  40
     C                     Z-ADDYB02      DYB02
     C                     MOVE YB03      DYB03
     C                     MOVE YB04      DYB04
     C                     MOVE YB13      DYB13
     C                     Z-ADDYB14      DYB14
     C                     Z-ADDYB15      DYB15
     C                     Z-ADDYB16      DYB16
     C*
     C* GET 供應廠商
     C           DYB03     IFNE *BLANKS
     C           DYB03     CHAINQB0                  40
     C           *IN40     IFEQ '1'
     C                     MOVE *BLANKS   DQB02
     C                     ELSE
     C                     MOVELQB02      DQB02
     C                     END
     C                     END
     C*
     C* GET 存放位置
     C           DYB04     IFNE *BLANKS
     C                     MOVE *BLANKS   QA25
     C                     MOVEL'13'      QA25
     C           KEYQA     CHAINQA0                  40
     C           *IN40     IFEQ '1'
     C                     MOVE *BLANKS   DQA04
     C                     ELSE
     C                     MOVELQA04      DQA04
     C                     END
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN833....FILE TO SCREEN --- SFLSR
     C*==============================================================*
     C           RTN833    BEGSR
     C           WBOTOM    IFEQ 'Y'
     C                     SETON                         97*LST PAG
     C                     Z-ADDRRN       DRRN
     C                     ELSE
     C                     EXSR RTN83B                     *ADD SFL DTA
     C                     END
     C                     ENDSR
     C*==============================================================*
     C*          RTN83A....FILE TO SCREEN --- MOVE
     C*==============================================================*
     C           RTN83A    BEGSR
     C*
     C                     Z-ADDYC02      DYC02S
     C                     MOVE YC03      DYC03S
     C                     MOVE YC04      DYC04S
     C                     Z-ADDYC08      DYC08S
     C                     Z-ADDYC09      DYC09S
     C*
     C* GET 車型編號及配備
     C                     MOVE YC03      WYC03
     C                     MOVE YC04      WYC04
     C           KEYZK     CHAINZK0                  40
     C           *IN40     IFEQ '1'
     C                     SETON                     99
     C                     END
     C*
     C* GET 車型名稱
     C           ZK05      CHAINZC0                  40
     C           *IN40     IFEQ '1'
     C                     MOVE *BLANKS   DZC02S
     C                     ELSE
     C                     MOVELZC02      DZC02S
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN83B....FILE TO SCREEN --- SFLSR
     C*==============================================================*
     C           RTN83B    BEGSR
     C*
     C                     SETOF                     39
     C           DYB01     READEYC0                      44*NF/EOF
     C           *IN44     DOWEQ'0'
     C           YC24      IFEQ 'Y'
     C                     SETON                     39
     C                     SETOF                     35
     C                     END
     C                     EXSR RTN83A
     C                     ADD  1         RRN
     C                     WRITESFLSR
     C           DYB01     READEYC0                      44*NF/EOF
     C                     END
     C                     MOVE 'Y'       WBOTOM
     C                     SETON                         53
     C           RRN       IFGT 0
     C                     SETON                     50
     C                     ELSE
     C                     SETOF                     50
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN841....DLT D
     C*==============================================================*
     C           RTN841    BEGSR
     C*
     C           DYB01     SETLLYC0
     C           DYB01     READEYC0                      44
     C           *IN44     DOWEQ'0'
     C                     Z-ADDYC02      DYD02
     C                     EXSR RTN420
     C                     Z-ADDYC02      WYC02
     C           KEYYC     CHAINYC0                  40
     C                     DELETYC0
     C           DYB01     READEYC0                      44
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN842....SAVE D
     C*==============================================================*
     C           RTN842    BEGSR
     C*
     C           DOP       IFEQ '1'
     C                     MOVE *HIVAL    WYC02
     C           KEYYC     SETGTYC0
     C           DYB01     REDPEYC0                      45
     C           *IN45     IFEQ '1'
     C                     Z-ADD1         DYC02
     C                     ELSE
     C           YC02      ADD  1         DYC02
     C                     END
     C           DYB14     ADD  DYC08     DYB14
     C                     Z-ADD0         YC09
     C                     MOVE *BLANKS   YC24
     C                     EXSR RTN821
     C                     EXSR RTN824
     C                     WRITEYC0
     C                     EXSR RTN823
     C                     END
     C*
     C           DOP       IFEQ '2'
     C                     Z-ADDDYC02     WYC02
     C           KEYYC     CHAINYC0                  40
     C           DYB14     ADD  DYC08     DYB14
     C           DYB14     SUB  YC08      DYB14
     C                     EXSR RTN821
     C                     UPDATYC0
     C                     END
     C*
     C           DOP       IFEQ '4'
     C                     Z-ADDDYC02     WYC02
     C           KEYYC     CHAINYC0                  40
     C           DYB14     SUB  YC08      DYB14
     C           DYB15     SUB  YC09      DYB15
     C                     MOVE 'D'       A211I3  1         *FOR RTN420
     C                     Z-ADDDYC02     DYD02
     C                     EXSR RTN420
     C                     Z-ADDDYC02     WYC02
     C           KEYYC     CHAINYC0                  40
     C                     DELETYC0
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
     C           RTN990    BEGSR
     C*
     C                     CALL 'S#S01'
     C                     PARM $USER     S0101I 10
     C                     PARM           S0102I 10
     C                     PARM           S0101O  1
     C           S0101O    IFEQ 'N'
     C                     SETON                     9099
     C                     END
     C*
     C                     ENDSR
@    C*==============================================================*
@    C*          ERRSR ....MOVE DATA TO 'SC02' SCREEN
@    C*==============================================================*
@    C           ERRSR     BEGSR
@    C*
@    C           WCODE1    IFEQ 01021
@    C           WCODE1    OREQ 01218
@    C           WCODE2    OREQ 01021
@    C           WCODE2    OREQ 01218
@    C           WCODE3    OREQ 01021
@    C           WCODE3    OREQ 01218
@    C           WCODE4    OREQ 01021
@    C           WCODE4    OREQ 01218
@    C                     CALL 'P50'
@    C           DMSG      PARM           P5001O 78
@    C                     SETON                     2899
@    C                     MOVEL'*DETC'   WENDSR  6
@    C                     ELSE
@    C                     MOVE *BLANKS   WENDSR
@    C                     END
@    C*
@    C                     MOVE 'SC01'    SCID
@    C                     ENDSRWENDSR
**
新增修改      刪除查詢確認
