     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     H*
     H*    PROGRAM ID   : JLB014
     H*    PROGRAM NAME : 補貨傳票批次
     H*    AUTHOR       : D910121 CHARLES
     H*    CREATE DATE  : 1993.05.27
     H*    UPDATE DATE  :
     H*    SYSTEM       : 進銷存收TO總帳
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     F****************************************************************
     FWFJL15PFIP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FJLB0143PO   E             39     PRINTER
     IWFJL15R
     I                                              JL1501L2
     I                                              JL1502L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *確認日期
M001MI                                      601 6080F01
M001MI                                      609 6160F02
M001MI                                      617 6220D05
M001MI                                      623 6280D06
      *公司別
M001MI                                      629 629 D01
M001MI                                      630 630 D02
      *辦事處
M001MI                                      631 631 D03
M001MI                                      632 632 D04
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
      *
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*產品
|    C                     MOVEL*BLANKS   MA03
|    C           JL1504    CHAINMA0                  40
|    C           JL1507    ADD  JL1508    T1
|    C                     ADD  JL1509    T1
|    C           JL1510    ADD  JL1511    T2
|    C                     ADD  JL1512    T2
|    C           T1        ADD  T2        TOT1
      *
|    C           JL1513    ADD  JL1514    T3
|    C                     ADD  JL1515    T3
|    C           JL1516    ADD  JL1517    T4
|    C                     ADD  JL1518    T4
|    C           T3        ADD  T4        TOT2
      *
|    C           JL1519    ADD  JL1520    T5
|    C                     ADD  JL1521    T5
|    C           JL1522    ADD  JL1523    T6
|    C                     ADD  JL1524    T6
|    C           T5        ADD  T6        TOT3
      *日期轉換
M001AC                     Z-ADDJL1501    W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
|    C           PL1501    PARM           S001O1  60
      *
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     20
|    C                     SETON                     3031
|    C                     ADD  JL1505    T11505
|    C                     ADD  JL1506    T11506
|    C                     ADD  JL1507    T11507
|    C                     ADD  JL1508    T11508
|    C                     ADD  JL1509    T11509
|    C                     ADD  JL1510    T11510
|    C                     ADD  JL1511    T11511
|    C                     ADD  JL1512    T11512
|    C                     ADD  T1        T1T1
|    C                     ADD  T2        T1T2
|    C                     ADD  TOT1      T1TOT1
|    C                     ADD  JL1513    T11513
|    C                     ADD  JL1514    T11514
|    C                     ADD  JL1515    T11515
|    C                     ADD  JL1516    T11516
|    C                     ADD  JL1517    T11517
|    C                     ADD  JL1518    T11518
|    C                     ADD  T3        T1T3
|    C                     ADD  T4        T1T4
|    C                     ADD  TOT2      T1TOT2
|    C                     ADD  JL1519    T11519
|    C                     ADD  JL1520    T11520
|    C                     ADD  JL1521    T11521
|    C                     ADD  JL1522    T11522
|    C                     ADD  JL1523    T11523
|    C                     ADD  JL1524    T11524
|    C                     ADD  T5        T1T5
|    C                     ADD  T6        T1T6
|    C                     ADD  TOT3      T1TOT3
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETON                     20
|    C                     SETOF                     31
|    C                     ADD  T11505    T21505
|    C                     ADD  T11506    T21506
|    C                     ADD  T11507    T21507
|    C                     ADD  T11508    T21508
|    C                     ADD  T11509    T21509
|    C                     ADD  T11510    T21510
|    C                     ADD  T11511    T21511
|    C                     ADD  T11512    T21512
|    C                     ADD  T1T1      T2T1
|    C                     ADD  T1T2      T2T2
|    C                     ADD  T1TOT1    T2TOT1
|    C                     ADD  T11513    T21513
|    C                     ADD  T11514    T21514
|    C                     ADD  T11515    T21515
|    C                     ADD  T11516    T21516
|    C                     ADD  T11517    T21517
|    C                     ADD  T11518    T21518
|    C                     ADD  T1T3      T2T3
|    C                     ADD  T1T4      T2T4
|    C                     ADD  T1TOT2    T2TOT2
|    C                     ADD  T11519    T21519
|    C                     ADD  T11520    T21520
|    C                     ADD  T11521    T21521
|    C                     ADD  T11522    T21522
|    C                     ADD  T11523    T21523
|    C                     ADD  T11524    T21524
|    C                     ADD  T1T5      T2T5
|    C                     ADD  T1T6      T2T6
|    C                     ADD  T1TOT3    T2TOT3
|    C                     Z-ADD0         T11505
|    C                     Z-ADD0         T11506
|    C                     Z-ADD0         T11507
|    C                     Z-ADD0         T11508
|    C                     Z-ADD0         T11509
|    C                     Z-ADD0         T11510
|    C                     Z-ADD0         T11511
|    C                     Z-ADD0         T11512
|    C                     Z-ADD0         T1T1
|    C                     Z-ADD0         T1T2
|    C                     Z-ADD0         T1TOT1
|    C*
|    C                     Z-ADD0         T11513
|    C                     Z-ADD0         T11514
|    C                     Z-ADD0         T11515
|    C                     Z-ADD0         T11516
|    C                     Z-ADD0         T11517
|    C                     Z-ADD0         T11518
|    C                     Z-ADD0         T1T3
|    C                     Z-ADD0         T1T4
|    C                     Z-ADD0         T1TOT2
|    C*
|    C                     Z-ADD0         T11519
|    C                     Z-ADD0         T11520
|    C                     Z-ADD0         T11521
|    C                     Z-ADD0         T11522
|    C                     Z-ADD0         T11523
|    C                     Z-ADD0         T11524
|    C                     Z-ADD0         T1T5
|    C                     Z-ADD0         T1T6
|    C                     Z-ADD0         T1TOT3
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT3   SUBTOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     SETON                     20
|    C                     SETOF                     32
|    C                     Z-ADD0         T21505
|    C                     Z-ADD0         T21506
|    C                     Z-ADD0         T21507
|    C                     Z-ADD0         T21508
|    C                     Z-ADD0         T21509
|    C                     Z-ADD0         T21510
|    C                     Z-ADD0         T21511
|    C                     Z-ADD0         T21512
|    C                     Z-ADD0         T2T1
|    C                     Z-ADD0         T2T2
|    C                     Z-ADD0         T2TOT1
|    C*
|    C                     Z-ADD0         T21513
|    C                     Z-ADD0         T21514
|    C                     Z-ADD0         T21515
|    C                     Z-ADD0         T21516
|    C                     Z-ADD0         T21517
|    C                     Z-ADD0         T21518
|    C                     Z-ADD0         T2T3
|    C                     Z-ADD0         T2T4
|    C                     Z-ADD0         T2TOT2
|    C*
|    C                     Z-ADD0         T21519
|    C                     Z-ADD0         T21520
|    C                     Z-ADD0         T21521
|    C                     Z-ADD0         T21522
|    C                     Z-ADD0         T21523
|    C                     Z-ADD0         T21524
|    C                     Z-ADD0         T2T5
|    C                     Z-ADD0         T2T6
|    C                     Z-ADD0         T2TOT3
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     20
      *
05===C                     ENDSR
      *==============================================================*
      *          RTN999....END
      *==============================================================*
06===C           RTN999    BEGSR
      *
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
      *
06===C                     ENDSR
