     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : JLB0433                                    *
     H*    PROGRAM NAME : 國內採購傳票批次                         *
     H*    AUTHOR       : D910074 TINA                               *
     H*    CREATE DATE  : 1993.05.28                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 進銷存收TO總帳                         *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.18 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     F****************************************************************
     FWFJL19PFIP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMBPF  IF  E           K        DISK
     FJLB0433PO   E             39     PRINTER
     IWFJL19R
     I                                              JL1902L2
     I                                              JL1904L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *確認年月
M001MI                                      617 6200D03
      *公司別
     I                                      625 625 D01
     I                                      626 626 D02
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*進貨日期
M001AC                     Z-ADDJL1903    W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     X1      3
B2MODC                     PARM W6        X2      60
|    C           D1903     PARM           X3      60
|    C*供應商
|    C           JL1902    CHAINMB0                  40
|    C   40                MOVEL*BLANKS   MB03
|    C*產品
|    C           JL1905    CHAINMA0                  41
|    C   41                MOVEL*BLANKS   MA03
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     20
|    C                     SETON                     30
|    C                     ADD  JL1906    T11906
|    C                     ADD  JL1907    T11907
|    C                     ADD  JL1908    T11908
|    C                     ADD  JL1906    T21906
|    C                     ADD  JL1907    T21907
|    C                     ADD  JL1908    T21908
|    C                     ADD  JL1906    T31906
|    C                     ADD  JL1907    T31907
|    C                     ADD  JL1908    T31908
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETON                     20
|    C                     Z-ADD0         T11906
|    C                     Z-ADD0         T11907
|    C                     Z-ADD0         T11908
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   SUBTOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     SETON                     20
|    C                     SETOF                     30
|    C                     Z-ADD0         T21906
|    C                     Z-ADD0         T21907
|    C                     Z-ADD0         T21908
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     2030
      *
05===C                     ENDSR
      *==============================================================*
      *          RTN999....END
      *==============================================================*
06===C           RTN999    BEGSR
      *
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01*C                     ELSE
|   C                     WRITEPT3
| 01-C                     END
|    C                     WRITEPE2
      *
06===C                     ENDSR
