     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : JLB043                                     *
     H*    PROGRAM NAME : 國內採購傳票批次                         *
     H*    AUTHOR       : D910074 TINA                               *
     H*    CREATE DATE  : 1993.05.28                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : 進銷存收TO總帳                         *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.18 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     F****************************************************************
     FJLB043D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      119 1240$ADMDY
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
      *確認日期
M001MI                                      601 6080F01
M001MI                                      609 6160F02
M001MI                                      617 6200D03
M001MI                                      617 6180D03M
M001MI                                      619 6200D03Y
      *公司別
     I                                      625 625 D01
     I                                      626 626 D02
     I            DS
     I                                        1   60WDATE
     I                                        1   20MM
     I                                        3   40DD
     I                                        5   60YY
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C                     SETON                     10
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVE *BLANK    D01
|    C                     MOVE *BLANK    D02
|    C                     Z-ADD*ZEROS    D03
|    C                     Z-ADD*ZEROS    F01
|    C                     Z-ADD*ZEROS    F02
|    C                     Z-ADD*ZEROS    WDATE
M001AC                     Z-ADD0         W6      60
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                       99  報表格式MESSAGE
|    C*
| 01-C           $EVR      IFEQ 1                          ON-LINE
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $EVR      IFEQ 2                          BATCH
|   C                     MOVEL'UPT2111' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
02===C                     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'                        *WINDOW
|   C**********************
|   C*  F4 PROMPT PROCESS *
|   C**********************
|   C                     EXSR RTNF4
|   C                     GOTO E1000
| 02-C                     END
      *
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ *ZERO
|   C           *IN14     ANDEQ'1'
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  *NAMVAR
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
      *公司別
| 01-C           D01       IFEQ *BLANKS
|   C                     MOVEL'R'       D01
| 01-C                     END
      *
| 02-C           D02       IFEQ *BLANKS
|   C                     MOVEL'R'       D02
| 02-C                     END
      *
| 03-C           D01       IFGT D02
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     616299
| 03-C                     END
      *
| 04-C           D01       IFNE 'R'
|   C           D02       ORNE 'R'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     616299
| 04-C                     END
|    C*
|    C   99                GOTO E1B00
|    C*
|    C*++++++++++++++++++++++++++K+++++++++++++++++++++++++++++++++++++
      *確認日期
|    C*
| 05-C           D03       IFEQ *ZEROS
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 05*C                     ELSE
      *
|   C                     MOVE D03Y      YY
|   C                     MOVE D03M      MM
|   C*
|   C                     MOVE '01'      DD
|   C                     CALL 'P09'
|   C                     PARM WDATE     P0901I  60
|   C                     PARM           P0911O  1
| 06-C           P0911O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 06-C                     END
| 05-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     X1      3
|    C                     PARM WDATE     X2      60
|    C           W6        PARM           X3      60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    F01
|    C*
|    C                     MOVE '31'      DD
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     X1      3
|    C                     PARM WDATE     X2      60
|    C           W6        PARM           X3      60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    F02
|    C*
04===CSR         E1B00     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
05===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 01-C                     END
|    C*
05===C           ENDF4     ENDSR
M001AC/COPY HBP2CVTR
