     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     H*
     H*    PROGRAM ID   : JLB051
     H*    PROGRAM NAME : 庫存異動傳票批次
     H*    AUTHOR       : D910121 CHARLES
     H*    CREATE DATE  : 1993.05.22
     H*    UPDATE DATE  :
     H*    SYSTEM       : 進銷存收TO總帳
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.18 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     F****************************************************************
     FWFJL20PFIP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FJLB0513PO   E             39     PRINTER
     IWFJL20R
     I                                              JL2002L5
     I                                              JL2001L4
     I                                              JL2013L3
     I                                              JL2014L2
     I                                              JL2003L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *確認年月
M001MI                                      617 6200D05
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL5     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010                     *HEADING
    C                     SETOF                     39
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CL3 10                EXSR RTN400
     CL4 10                EXSR RTN500
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*公司別
|    C                     MOVEL*BLANKS   #A031
|    C                     MOVEL'COMPANY' #A01
|    C                     MOVELJL2002    #A01
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A031
| 03-C                     END
|    C*
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
      *日期轉換
M001AC                     Z-ADDJL2001    W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
|    C           PL2001    PARM           S001O1  60
      *
|    C*物流點
|    C                     MOVEL*BLANKS   #A032
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVELJL2003    #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A032
| 01*C                     ELSE
|   C           JL2003    CHAINME0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELME04      #A032
| 02-C                     END
| 01-C                     END
      *
|    C                     MOVEL*BLANKS   MA03
|    C           JL2004    CHAINMA0                  40
      *
|    C           JL2006    ADD  JL2007    TOT
|    C                     ADD  JL2008    TOT
|    C                     SUB  JL2010    TOT
|    C                     SUB  JL2011    TOT
|    C                     SUB  JL2012    TOT
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     20
|    C                     SETON                     3031
|    C                     ADD  JL2005    T12005
|    C                     ADD  JL2006    T12006
|    C                     ADD  JL2007    T12007
|    C                     ADD  JL2008    T12008
|    C                     ADD  JL2009    T12009
|    C                     ADD  JL2010    T12010
|    C                     ADD  JL2011    T12011
|    C                     ADD  JL2012    T12012
|    C                     ADD  TOT       T1TOT
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETON                     20
|    C                     SETOF                     30
|    C                     ADD  T12005    T22005
|    C                     ADD  T12006    T22006
|    C                     ADD  T12007    T22007
|    C                     ADD  T12008    T22008
|    C                     ADD  T12009    T22009
|    C                     ADD  T12010    T22010
|    C                     ADD  T12011    T22011
|    C                     ADD  T12012    T22012
|    C                     ADD  T1TOT     T2TOT
|    C                     Z-ADD0         T12005
|    C                     Z-ADD0         T12006
|    C                     Z-ADD0         T12007
|    C                     Z-ADD0         T12008
|    C                     Z-ADD0         T12009
|    C                     Z-ADD0         T12010
|    C                     Z-ADD0         T12011
|    C                     Z-ADD0         T12012
|    C                     Z-ADD0         T1TOT
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   SUBTOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     SETOF                     31
|    C                     ADD  T22005    T32005
|    C                     ADD  T22006    T32006
|    C                     ADD  T22007    T32007
|    C                     ADD  T22008    T32008
|    C                     ADD  T22009    T32009
|    C                     ADD  T22010    T32010
|    C                     ADD  T22011    T32011
|    C                     ADD  T22012    T32012
|    C                     ADD  T2TOT     T3TOT
|    C                     Z-ADD0         T22005
|    C                     Z-ADD0         T22006
|    C                     Z-ADD0         T22007
|    C                     Z-ADD0         T22008
|    C                     Z-ADD0         T22009
|    C                     Z-ADD0         T22010
|    C                     Z-ADD0         T22011
|    C                     Z-ADD0         T22012
|    C                     Z-ADD0         T2TOT
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT3   SUBTOTAL
      *==============================================================*
05===C           RTN400    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
|    C                     SETOF                     32
|    C                     ADD  T32005    T42005
|    C                     ADD  T32006    T42006
|    C                     ADD  T32007    T42007
|    C                     ADD  T32008    T42008
|    C                     ADD  T32009    T42009
|    C                     ADD  T32010    T42010
|    C                     ADD  T32011    T42011
|    C                     ADD  T32012    T42012
|    C                     ADD  T3TOT     T4TOT
|    C                     Z-ADD0         T32005
|    C                     Z-ADD0         T32006
|    C                     Z-ADD0         T32007
|    C                     Z-ADD0         T32008
|    C                     Z-ADD0         T32009
|    C                     Z-ADD0         T32010
|    C                     Z-ADD0         T32011
|    C                     Z-ADD0         T32012
|    C                     Z-ADD0         T3TOT
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN500....WRITE PT4   SUBTOTAL
      *==============================================================*
06===C           RTN500    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT4
|    C                     SETOF                     33
|    C                     Z-ADD0         T42005
|    C                     Z-ADD0         T42006
|    C                     Z-ADD0         T42007
|    C                     Z-ADD0         T42008
|    C                     Z-ADD0         T42009
|    C                     Z-ADD0         T42010
|    C                     Z-ADD0         T42011
|    C                     Z-ADD0         T42012
|    C                     Z-ADD0         T4TOT
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     203031
|    C                     SETOF                     3233
      *
07===C                     ENDSR
      *==============================================================*
      *          RTN999....END
      *==============================================================*
08===C           RTN999    BEGSR
      *
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
      *
08===C                     ENDSR
