     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     H*
     H*    PROGRAM ID   : JLB011
     H*    PROGRAM NAME : 銷售傳票批次
     H*    AUTHOR       : D910121 CHARLES
     H*    CREATE DATE  : 1993.05.22
     H*    UPDATE DATE  :
     H*    SYSTEM       : 進銷存收TO總帳
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     F****************************************************************
     FWFJL12PFIP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FJLB0114PO   E             39     PRINTER
     IWFJL12R
     I                                              JL1201L5
     I                                              JL1202L4
     I                                              J1203$L3
     I                                              JL1203L2
     I                                              J1204$L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *確認日期
M001MI                                      601 6080F01
M001MI                                      609 6160F02
M001MI                                      617 6220D05
M001MI                                      623 6280D06
      *公司別
M001MI                                      629 629 D01
M001MI                                      630 630 D02
      *辦事處
M001MI                                      631 631 D03
M001MI                                      632 632 D04
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN150
     CL2 10                EXSR RTN200
     CL3 10                EXSR RTN300
     CL4 10                EXSR RTN400
     CL5 10                EXSR RTN500
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
      *
|    C                     WRITEPH1
|    C                     SETOF                     303132
|    C                     SETOF                     39
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*產品
|    C                     MOVEL*BLANKS   MA03
|    C           JL1204    CHAINMA0                  40
|    C           JL1207    ADD  JL1208    TOT1
|    C                     ADD  JL1209    TOT1
|    C           JL1210    ADD  JL1211    TOT2
|    C                     ADD  JL1212    TOT2
|    C           TOT1      ADD  TOT2      TOT
      *日期轉換
M001AC                     Z-ADDJL1201    W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
|    C           PL1201    PARM           S001O1  60
      *
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     20
|    C                     SETON                     303132
|    C                     ADD  JL1205    T11205
|    C                     ADD  JL1206    T11206
|    C                     ADD  JL1207    T11207
|    C                     ADD  JL1208    T11208
|    C                     ADD  JL1209    T11209
|    C                     ADD  JL1210    T11210
|    C                     ADD  JL1211    T11211
|    C                     ADD  JL1212    T11212
|    C                     ADD  TOT1      T1TOT1
|    C                     ADD  TOT2      T1TOT2
|    C                     ADD  TOT       T1TOT
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN150....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN150    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETON                     20
|    C                     ADD  T11205    T21205
|    C                     ADD  T11206    T21206
|    C                     ADD  T11207    T21207
|    C                     ADD  T11208    T21208
|    C                     ADD  T11209    T21209
|    C                     ADD  T11210    T21210
|    C                     ADD  T11211    T21211
|    C                     ADD  T11212    T21212
|    C                     ADD  T1TOT1    T2TOT1
|    C                     ADD  T1TOT2    T2TOT2
|    C                     ADD  T1TOT     T2TOT
|    C*
|    C                     Z-ADD0         T11205
|    C                     Z-ADD0         T11206
|    C                     Z-ADD0         T11207
|    C                     Z-ADD0         T11208
|    C                     Z-ADD0         T11209
|    C                     Z-ADD0         T11210
|    C                     Z-ADD0         T11211
|    C                     Z-ADD0         T11212
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT2   SUBTOTAL
      *==============================================================*
04===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     ADD  T21205    T31205
|    C                     ADD  T21206    T31206
|    C                     ADD  T21207    T31207
|    C                     ADD  T21208    T31208
|    C                     ADD  T21209    T31209
|    C                     ADD  T21210    T31210
|    C                     ADD  T21211    T31211
|    C                     ADD  T21212    T31212
|    C                     ADD  T2TOT1    T3TOT1
|    C                     ADD  T2TOT2    T3TOT2
|    C                     ADD  T2TOT     T3TOT
|    C*
|    C                     Z-ADD0         T21205
|    C                     Z-ADD0         T21206
|    C                     Z-ADD0         T21207
|    C                     Z-ADD0         T21208
|    C                     Z-ADD0         T21209
|    C                     Z-ADD0         T21210
|    C                     Z-ADD0         T21211
|    C                     Z-ADD0         T21212
|    C                     Z-ADD0         T2TOT1
|    C                     Z-ADD0         T2TOT2
|    C                     Z-ADD0         T2TOT
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT3   SUBTOTAL
      *==============================================================*
05===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
|    C                     SETOF                     32
|    C                     ADD  T31205    T41205
|    C                     ADD  T31206    T41206
|    C                     ADD  T31207    T41207
|    C                     ADD  T31208    T41208
|    C                     ADD  T31209    T41209
|    C                     ADD  T31210    T41210
|    C                     ADD  T31211    T41211
|    C                     ADD  T31212    T41212
|    C                     ADD  T3TOT1    T4TOT1
|    C                     ADD  T3TOT2    T4TOT2
|    C                     ADD  T3TOT     T4TOT
|    C*
|    C                     Z-ADD0         T31205
|    C                     Z-ADD0         T31206
|    C                     Z-ADD0         T31207
|    C                     Z-ADD0         T31208
|    C                     Z-ADD0         T31209
|    C                     Z-ADD0         T31210
|    C                     Z-ADD0         T31211
|    C                     Z-ADD0         T31212
|    C                     Z-ADD0         T3TOT1
|    C                     Z-ADD0         T3TOT2
|    C                     Z-ADD0         T3TOT
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT4   SUBTOTAL
      *==============================================================*
06===C           RTN400    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT4
|    C                     SETOF                     31
|    C                     ADD  T41205    T51205
|    C                     ADD  T41206    T51206
|    C                     ADD  T41207    T51207
|    C                     ADD  T41208    T51208
|    C                     ADD  T41209    T51209
|    C                     ADD  T41210    T51210
|    C                     ADD  T41211    T51211
|    C                     ADD  T41212    T51212
|    C                     ADD  T4TOT1    T5TOT1
|    C                     ADD  T4TOT2    T5TOT2
|    C                     ADD  T4TOT     T5TOT
|    C*
|    C                     Z-ADD0         T41205
|    C                     Z-ADD0         T41206
|    C                     Z-ADD0         T41207
|    C                     Z-ADD0         T41208
|    C                     Z-ADD0         T41209
|    C                     Z-ADD0         T41210
|    C                     Z-ADD0         T41211
|    C                     Z-ADD0         T41212
|    C                     Z-ADD0         T4TOT1
|    C                     Z-ADD0         T4TOT2
|    C                     Z-ADD0         T4TOT
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN500....WRITE PT5   SUBTOTAL
      *==============================================================*
07===C           RTN500    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT5
|    C                     SETOF                     30
|    C                     Z-ADD0         T51205
|    C                     Z-ADD0         T51206
|    C                     Z-ADD0         T51207
|    C                     Z-ADD0         T51208
|    C                     Z-ADD0         T51209
|    C                     Z-ADD0         T51210
|    C                     Z-ADD0         T51211
|    C                     Z-ADD0         T51212
|    C                     Z-ADD0         T5TOT1
|    C                     Z-ADD0         T5TOT2
|    C                     Z-ADD0         T5TOT
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
08===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     20
      *
08===C                     ENDSR
      *==============================================================*
      *          RTN999....END
      *==============================================================*
09===C           RTN999    BEGSR
      *
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
      *
09===C                     ENDSR
