     FSOSCPF  IF  E           K        DISK
     FSOSEPF  IF  E           K        DISK
     FSOSSPF  IF  E           K        DISK
     FSOSGPF  IF  E           K        DISK
     FIMIBPF  IF  E           K        DISK
     FIMICPF  IF  E           K        DISK
     FIMIEPF  IF  E           K        DISK
     FPA#GPF  IF  E           K        DISK
     FJLBCHKP O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *確認年月
      *YMD FORMAT
     I                                      601 6040D01
     I                                      601 6020D01M
     I                                      603 6040D01Y
      *選擇年月日
      *YMD FORMAT
     I                                      605 6100D01S
     I                                      611 6160D01E
     I            DS
B2MODI                                        1  14 IB04YY
B2MODI                                        1   80IB04
B2MODI                                        9  140IBYY
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     WRITEPH1
     C*
     C                     READ SC0                      46
  01-C           *IN46     DOWEQ'0'
    C           SC02      SETLL#G0                      40
  02-C           *IN40     IFEQ '0'
    C                     MOVELSC02      ORDER
    C                     CALL 'RES001'
    C                     PARM 'YMD'     X1      3
B2MODC                     PARM SC39      X2      80
B2???C           PDATE     PARM           X3      80
B2INF *CVR3012 sev.30 Field X3 contains more than one year
B2INF *CVR3012 sev.30 Field PDATE contains more than one year
      *
    C   39                EXSR RTN900
    C                     WRITEPD1
    C                     SETON                     10
  02-C                     END
    C                     READ SC0                      46
  01-C                     END
     C*
     C                     READ SE0                      46
  03-C           *IN46     DOWEQ'0'
    C           SE02      SETLL#G0                      40
  04-C           *IN40     IFEQ '0'
    C                     MOVELSE02      ORDER
    C                     CALL 'RES001'
    C                     PARM 'YMD'     X1      3
B2MODC                     PARM SE24      X2      80
B2???C           PDATE     PARM           X3      80
B2INF *CVR3012 sev.30 Field X3 contains more than one year
B2INF *CVR3012 sev.30 Field PDATE contains more than one year
      *
    C   39                EXSR RTN900
    C                     WRITEPD1
    C                     SETON                     10
  04-C                     END
    C                     READ SE0                      46
  03-C                     END
     C*
     C                     READ SS0                      46
  05-C           *IN46     DOWEQ'0'
  06-C           SS36      IFNE 'V'
    C                     MOVELSS01      ORDER
    C                     MOVE SS02      ORDER
    C                     CALL 'RES001'
    C                     PARM 'YMD'     X1      3
B2MODC                     PARM SS35      X2      80
B2???C           PDATE     PARM           X3      80
B2INF *CVR3012 sev.30 Field X3 contains more than one year
B2INF *CVR3012 sev.30 Field PDATE contains more than one year
      *
    C   39                EXSR RTN900
    C                     WRITEPD1
    C                     SETON                     10
  06-C                     END
    C                     READ SS0                      46
  05-C                     END
     C*
     C                     READ SG0                      46
  07-C           *IN46     DOWEQ'0'
    C           SG02      SETLL#G0                      40
  08-C           *IN40     IFEQ '0'
    C                     MOVELSG02      ORDER
    C                     CALL 'RES001'
    C                     PARM 'YMD'     X1      3
B2MODC                     PARM SG26      X2      80
B2???C           PDATE     PARM           X3      80
B2INF *CVR3012 sev.30 Field X3 contains more than one year
B2INF *CVR3012 sev.30 Field PDATE contains more than one year
      *
    C   39                EXSR RTN900
    C                     WRITEPD1
    C                     SETON                     10
  08-C                     END
    C                     READ SG0                      46
  07-C                     END
     C*
     C                     READ IB0                      46
  09-C           *IN46     DOWEQ'0'
B2???C           IB04YY    SETLL#G0                      40
B2INF *CVR0001 sev.00 Field #G01 is not a date or year
  10-C           *IN40     IFEQ '0'
B2???C                     MOVELIB04YY    ORDER
B2INF *CVR5011 sev.50 Field ORDER is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
    C                     CALL 'RES001'
    C                     PARM 'YMD'     X1      3
B2MODC                     PARM IB04      X2      80
B2???C           PDATE     PARM           X3      80
B2INF *CVR3012 sev.30 Field X3 contains more than one year
B2INF *CVR3012 sev.30 Field PDATE contains more than one year
      *
    C   39                EXSR RTN900
    C                     WRITEPD1
    C                     SETON                     10
  10-C                     END
    C                     READ IB0                      46
  09-C                     END
     C*
     C                     READ IC0                      46
  11-C           *IN46     DOWEQ'0'
    C           IC02      SETLL#G0                      40
  12-C           *IN40     IFEQ '0'
    C                     MOVELIC02      ORDER
    C                     CALL 'RES001'
    C                     PARM 'YMD'     X1      3
B2MODC                     PARM IC05      X2      80
B2???C           PDATE     PARM           X3      80
B2INF *CVR3012 sev.30 Field X3 contains more than one year
B2INF *CVR3012 sev.30 Field PDATE contains more than one year
      *
    C   39                EXSR RTN900
    C                     WRITEPD1
    C                     SETON                     10
  12-C                     END
    C                     READ IC0                      46
  11-C                     END
     C*
     C                     READ IE0                      46
  13-C           *IN46     DOWEQ'0'
    C           IE02      SETLL#G0                      40
  14-C           *IN40     IFEQ '0'
    C                     MOVELIE02      ORDER
    C                     CALL 'RES001'
    C                     PARM 'YMD'     X1      3
B2MODC                     PARM IE05      X2      80
B2???C           PDATE     PARM           X3      80
B2INF *CVR3012 sev.30 Field X3 contains more than one year
B2INF *CVR3012 sev.30 Field PDATE contains more than one year
      *
    C   39                EXSR RTN900
    C                     WRITEPD1
    C                     SETON                     10
  14-C                     END
    C                     READ IE0                      46
  13-C                     END
     C*
     C  N10                WRITEPE9
     C                     WRITEPE2
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
01===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     20
      *
01===C                     ENDSR
