      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : KIA005                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/04/22                                      *
      * UPDATE DATE  : 11/20/92 JUDY                                 *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :盤點系統                                     *
      * REMARK       :庫存資料備份處理                             *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.18 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FIMITLF01UF  E           K        DISK                      A
     FIMI3PF  UF  E           K        DISK                      A
     FIMIALF03IF  E           K        DISK
     FMTMHPF  IF  E           K        DISK
     FKIA005D CF  E                    WORKSTN
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
M001AI                                      201 2080DATE
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I                                      501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I                                      513 513 $WRHTY
     I*                                     509 513 $APAUT
     I*                                     514 521 $#101
     I            DS
     I                                        1   5 DIT02S
     I                                        1   1 SIT02
     I            DS
     I                                        1   5 DIT02E
     I                                        1   1 EIT02
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C*          *LIKE     DEFN IA01      KIA01
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYIT     KLIST
     C                     KFLD           IA02
     C                     KFLD           IA01
     C                     KFLD           IA03
     C           KEYIA     KLIST
     C                     KFLD           DIT02S
     C           KEYIV     KLIST
     C                     KFLD           MA01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRM
     C*
  01-C           *IN03     DOWEQ'0'
    C*
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C*
    C                     EXSR RTN100                     *CHECK SCR01?
  02-C           *IN14     IFEQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXSR RTN200                     *PROCESS1   ?
    C                     EXSR RTN300                     *PROCESS2   ?
    C                     SETON                     98                ?
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DIT02S
|    C                     MOVE *BLANK    DIT02E
|    C*
B2MODC*M001D               Z-ADD0         DATE    80
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
|    C*                    PARM $EGMDY    S001I2  60
B2MODC*M001D     DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*物流點權限檢查
| 01-C           DIT02S    IFEQ *BLANK
|   C                     SETON                     619599
| 01-C                     END
|    C   99                GOTO END100
|    C*
| 02-C           DIT02E    IFEQ *BLANK
|   C                     SETON                     629599
| 02-C                     END
|    C   99                GOTO END100
|    C*
|    C*物流點檢查
| 03-C           SIT02     IFNE EIT02
|   C                     SETON                     6162
|   C                     SETON                     8999
| 03-C                     END
|    C   99                GOTO END100
      *
| 09-C           DIT02S    IFGT DIT02E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 09-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTN200....DATA PROCESS IMIHPF --> IMITPF
      *===============================================================*
03===C           RTN200    BEGSR
|    C*
|    C           KEYIA     SETLLIA0
|    C                     READ IA0                      44
| 01-C           *IN44     DOWEQ'0'
|   C           IA02      ANDLEDIT02E
|   C*
| 02-C           IA03      IFNE *BLANK
|   C           IA06      ANDNE0
|   C           KEYIT     CHAINIT0                  40
|   C                     MOVE IA02      IT02
|   C                     MOVE IA01      IT01
|   C                     MOVE IA03      IT03
|   C                     MOVE IA04      IT04
|   C                     MOVE IA05      IT05
|   C                     Z-ADDIA06      IT06
|   C                     Z-ADDIA07      IT07
|   C                     Z-ADDIA08      IT08
|   C                     Z-ADDIA09      IT09
|   C                     Z-ADDIA10      IT10
B2000C                     Z-ADDDATE      ITXX
B2000C                     TIME           ITYY
|   C                     MOVE $USER     ITZZ
|   C*
| 03-C           *IN40     IFEQ '0'
|   C                     UPDATIT0
| 03*C                     ELSE
|   C                     WRITEIT0
| 03-C                     END
| 02-C                     END
|   C*
|   C                     READ IA0                      44
| 01-C                     END
|    C*
03===C                     ENDSR
      *===============================================================*
      *          RTN300....DATA PROCESS MTMHPF --> IMI3PF
      *===============================================================*
04===C           RTN300    BEGSR
|    C*
|    C           *LOVAL    SETLLMA0
|    C**
|    C                     READ MA0                      44
| 01-C           *IN44     DOWEQ'0'
|   C                     MOVE MA01      IV01
|   C           KEYIV     CHAINIV0                  40
|   C                     Z-ADDMA31      IV02
|   C                     Z-ADDMA32      IV03
|   C                     Z-ADDMA33      IV04
|   C                     Z-ADDMA34      IV05
|   C                     Z-ADDMA29      IV06
|   C                     Z-ADDMA30      IV07
|   C                     Z-ADDMA26      IV08
|   C                     Z-ADDMA27      IV09
|   C                     Z-ADDMA28      IV10
B2000C                     Z-ADDDATE      IVXX
B2000C                     TIME           IVYY
|   C                     MOVE $USER     IVZZ
| 02-C           *IN40     IFEQ '0'
|   C                     UPDATIV0
| 02*C                     ELSE
|   C                     WRITEIV0
| 02-C                     END
|   C*
|   C                     READ MA0                      44
| 01-C                     END
|    C*
04===C                     ENDSR
