     FIMIOPF  UF  E           K        DISK
     FIMITPF  UF  E           K        DISK
     C*
     C                     READ IO0                      46
     C           *IN46     DOWEQ'0'
     C           IO01      IFEQ 'K'
     C                     DELETIO0
     C                     ENDIF
     C                     READ IO0                      46
     C                     ENDDO
     C*
     C                     READ IT0                      46
     C           *IN46     DOWEQ'0'
     C           IT01      IFEQ 'K'
     C                     DELETIT0
     C                     ENDIF
     C                     READ IT0                      46
     C                     ENDDO
     C                     SETON                     LR
