      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : KIB001                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 03/05/94                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :盤點系統                                     *
      * REMARK       :年終成本庫存備份　　　　　　                 *
      ****************************************************************
     FIMIYPF  O   E           K        DISK
     FIMI2PF  O   E           K        DISK
     F            IY0                               KRENAMEIY0A
     FIMI1PF  UF  E           K        DISK                      A
     F            IX0                               KRENAMEIX0A
     FIMIXPF  UF  E           K        DISK                      A
     FIMIAPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMHPF  IF  E           K        DISK
     F            MA0                               KRENAMEMA0A
     I*
     I           UDS
     I                                      101 110 $USER
B2MODI                                      119 1320$EGMDY
B2MODI                                      160 169 $USERN
     I                                      111 1160$CHYMD
B2MODI                                      143 143 $ADD
B2MODI                                      144 144 $UPD
B2MODI                                      145 145 $DLT
B2MODI                                      146 146 $INQ
B2MODI                                      147 147 $RMK01
B2MODI                                      195 2000$ADYM
B2MODI                                      511 515 $WRHUS
B2MODI                                      523 523 $WRHTY
     I*
     IRMDATA     UDS
     I                                        1   1 BCTL
     I                                        2  50 BLANK
     I            DS
     I*
B2MODI                                        1   60YYMM
B2MODI                                        1   40YY
B2MODI                                        5   60MM
     I*
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRM
     C*
    C                     EXSR RTN100                     *CHECK SCR01?
    C           *IN99     IFEQ '0'
|    C                     MOVEL'R'       CMP     1
    C                     EXSR RTN200                     *PROCESS    ?
|    C                     MOVEL'K'       CMP
    C                     EXSR RTN300                     *PROCESS    ?
    C                     EXSR RTN400                     *PROCESS    ?
  02-C                     END
     C*
     C                     SETON                     LR
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         YYMM
|    C                     Z-ADD0         YY
|    C                     Z-ADD0         MM
|    C*
B2MODC                     Z-ADD0         DATE    80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2MODC                     PARM $EGMDY    S001I2  80
B2MODC           DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*計算年終年月
B2000C                     Z-ADD$ADYM     YYMM
     C           MM        IFEQ 1
     C                     Z-ADD12        MM
B2000C                     SUB  1         YY
     C                     ELSE
     C                     SUB  1         MM
     C                     END
      *IN99判斷是否已有備份
B2000C           YYMM      SETLLIX0                      99
|    C*
02===C                     ENDSR
      *===============================================================*
      *          RTN200....DATA PROCESS
      *===============================================================*
03===C           RTN200    BEGSR
|    C*寫入IMIXPF
|    C                     READ MA0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     EXSR RTN210
|   C                     READ MA0                      46
| 01-C                     END
B2000C           *LOVAL    SETLLIX0
|    C*
|    C*寫入IMIYPF
|    C           CMP       SETLLIA0                  45
|    C           CMP       READEIA0                      46
| 02-C           *IN46     DOWEQ'0'
|   C                     EXSR RTN220
|   C           CMP       READEIA0                      46
| 02-C                     END
|    C*
04===C                     ENDSR
      *===============================================================*
      *          RTN210....IMIXPF
      *===============================================================*
05===C           RTN210    BEGSR
|    C*
|    C                     MOVE MA01      IX01
|    C                     Z-ADDMA31      IX02
|    C                     Z-ADDMA32      IX03
|    C                     Z-ADDMA33      IX04
|    C                     Z-ADDMA34      IX05
|    C                     Z-ADDMA29      IX06
|    C                     Z-ADDMA30      IX07
|    C                     Z-ADDMA26      IX08
|    C                     Z-ADDMA27      IX09
|    C                     Z-ADDMA28      IX10
B2000C                     Z-ADDYYMM      IX11
|    C*
B2000C                     Z-ADDDATE      IXXX
B2000C                     TIME           IXYY
|    C                     MOVE $USER     IXZZ
|    C*
| 01-C           CMP       IFEQ 'R'
|    C                     WRITEIX0
| 01-C                     ELSE
|    C                     WRITEIX0A
| 01-C                     END
|    C*
05===C                     ENDSR
      *===============================================================*
      *          RTN220....IMIYPF
      *===============================================================*
06===C           RTN220    BEGSR
|    C*
| 01-C           IA06      IFNE 0
|   C                     MOVE IA01      IY01
|   C                     MOVE IA02      IY02
|   C                     MOVE IA03      IY03
|   C                     MOVE IA04      IY04
|   C                     MOVE IA05      IY05
|   C                     Z-ADDIA06      IY06
|   C                     Z-ADDIA07      IY07
|   C                     Z-ADDIA08      IY08
|   C                     Z-ADDIA09      IY09
|   C                     Z-ADDIA10      IY10
B2000C                     Z-ADDYYMM      IY15
|   C*
B2000C                     Z-ADDDATE      IYXX
B2000C                     TIME           IYYY
|   C                     MOVE $USER     IYZZ
|   C*
| 01-C           CMP       IFEQ 'R'
|    C                     WRITEIY0
| 01-C                     ELSE
|    C                     WRITEIY0A
| 01-C                     END
|   C*
| 01-C                     END
|    C*
06===C                     ENDSR
      *===============================================================*
      *          RTN300....DATA PROCESS
      *===============================================================*
03===C           RTN300    BEGSR
|    C*寫入IMIXPF
|    C                     READ MA0A                     46
| 01-C           *IN46     DOWEQ'0'
|   C                     EXSR RTN210
|   C                     READ MA0A                     46
| 01-C                     END
B2000C           *LOVAL    SETLLIX0A
|    C*
|    C*寫入IMIYPF
|    C           CMP       SETLLIA0                  43
|    C           CMP       READEIA0                      46
| 02-C           *IN46     DOWEQ'0'
|   C                     EXSR RTN220
|   C           CMP       READEIA0                      46
| 02-C                     END
|    C*
04===C                     ENDSR
      *===============================================================*
      *          RTN400....專櫃出貨確認時點控制
      *===============================================================*
03===C           RTN400    BEGSR
     C           *NAMVAR   DEFN           RMDATA
|   C           *LOCK     IN   RMDATA
     C                     MOVEL'N'       BCTL
|    C                     OUT  RMDATA
04===C                     ENDSR
