      ****************************************************************
      *                                                              *
      * PROGRAM NAME : KIB002                                        *
      * AUTHER       : CHARLES                                       *
      * CREATE DATE  : 83/03/05                                      *
      * UPDATE DATE  : 12/08/92                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :盤點系統                                     *
      * REMARK       :專櫃銷售年終成本庫存調整                     *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.18 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FIMIBPF  UF  E           K        DISK
     FIMIGPF  UF  E           K        DISK
     FIMIHPF  IF  E           K        DISK
     FIMIIPF  UF  E           K        DISK
     FIMIJPF  IF  E           K        DISK
     FIMIMPF  UF  E           K        DISK
     FIMILPF  IF  E           K        DISK
     FIMI2PF  UF  E           K        DISK                      A
     FIMI1PF  UF  E           K        DISK
     FMTMHPF  IF  E           K        DISK
     FPA#KPF  UF  E           K        DISK                      A
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I                                      162 1620$EVR
     I                                      125 1270$CPY
M001AI                                      201 2080DATE
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I                                      513 513 $WRHTY
      *物流點
     I                                      601 605 DIB03S
     I                                      606 610 DIB03E
      *DATE
M001MI                                      611 6180DATES
M001MI                                      619 6260DATEE
      *YYMM
     I                                      630 6330DMMYY
     I                                      630 6310MM
     I                                      632 6330YY
B2MODI                                      640 6450YYMM
B2MODI                                      646 6470DD
B2MODI                                      640 6470YMD
     I            DS
B2MODI                                        1   80IB04
B2MODI                                        9  140IBYY
M001MI                                        3  14 IB04YY
     I            DS
     I                                        1   5 IB03
     I                                        1   1 IB03L
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYIX     KLIST
     C                     KFLD           YYMM
     C                     KFLD           IX01
     C           KEYIY     KLIST
     C                     KFLD           IY15
     C                     KFLD           IY01
     C                     KFLD           IY02
     C                     KFLD           IY03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN010
      *
B2000C                     Z-ADDYYMM      IY15
     C*IMIBPF----------------------------------------------------------
     C                     READ IB0                      45
  01-C           *IN45     DOWEQ'0'
B2???C           IB04YY    CHAIN#K0                  41    *單據對照
B2INF *CVR0001 sev.00 Field #K01 is not a date or year
  02-C           *IN41     IFEQ '1'                        *NOT FOUNT
    C                     EXSR RTN100
    C                     EXSR RTN110
    C                     EXSR RTN120
    C*
B2???C                     MOVELIB04YY    #K01
B2INF *CVR0001 sev.00 Field #K01 is not a date or year
B2000C                     Z-ADDIB04      #K02
B2000C                     Z-ADDDATE      #KXX
B2000C                     TIME           #KYY
    C                     MOVEL$USER     #KZZ
    C                     WRITE#K0
  02-C                     END
    C*
    C                     READ IB0                      45
  01-C                     END
     C*IMIGPF----------------------------------------------------------
     C                     READ IG0                      45
  03-C           *IN45     DOWEQ'0'
    C           IG02      CHAIN#K0                  41    *單據對照
  04-C           *IN41     IFEQ '1'                        *NOT FOUNT
    C           IG02      SETLLIH0
    C           IG02      READEIH0                      46
  05-C           *IN46     DOWEQ'0'
  06-C           IH03      IFNE *BLANK
    C                     EXSR RTN200
    C                     EXSR RTN210
  06-C                     END
  07-C           IH04      IFNE *BLANK
    C                     EXSR RTN220
    C                     EXSR RTN230
  07-C                     END
    C           IG02      READEIH0                      46
  05-C                     END
    C                     EXSR RTN240
    C*
    C                     MOVELIG02      #K01
B2000C                     Z-ADDIG05      #K02
B2000C                     Z-ADDDATE      #KXX
B2000C                     TIME           #KYY
    C                     MOVEL$USER     #KZZ
    C                     WRITE#K0
  04-C                     END
    C*
    C                     READ IG0                      45
  03-C                     END
     C*IMIIPF----------------------------------------------------------
     C                     READ II0                      45
  08-C           *IN45     DOWEQ'0'
    C           II02      CHAIN#K0                  41    *單據對照
  09-C           *IN41     IFEQ '1'                        *NOT FOUNT
    C           II02      SETLLIJ0
    C           II02      READEIJ0                      46
  10-C           *IN46     DOWEQ'0'
    C                     EXSR RTN300
    C                     EXSR RTN310
    C           II02      READEIJ0                      46
  10-C                     END
    C                     EXSR RTN320
    C*
    C                     MOVELII02      #K01
B2000C                     Z-ADDII06      #K02
B2000C                     Z-ADDDATE      #KXX
B2000C                     TIME           #KYY
    C                     MOVEL$USER     #KZZ
    C                     WRITE#K0
  09-C                     END
    C*
    C                     READ II0                      45
  08-C                     END
     C*
     C*IMIMPF----------------------------------------------------------
     C                     READ IM0                      45
  11-C           *IN45     DOWEQ'0'
    C           IM02      CHAIN#K0                  41    *單據對照
  12-C           *IN41     IFEQ '1'                        *NOT FOUNT
    C           IM02      SETLLIL0
    C           IM02      READEIL0                      46
  13-C           *IN46     DOWEQ'0'
    C                     EXSR RTN400
    C                     EXSR RTN410
    C           IM02      READEIL0                      46
  13-C                     END
    C                     EXSR RTN420
    C*
    C                     MOVELIM02      #K01
B2000C                     Z-ADDIM08      #K02
B2000C                     Z-ADDDATE      #KXX
B2000C                     TIME           #KYY
    C                     MOVEL$USER     #KZZ
    C                     WRITE#K0
  12-C                     END
    C*
    C                     READ IM0                      45
  11-C                     END
      *
     C                     SETON                     LR
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*
B2MODC*M001D               Z-ADD0         DATE    80
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
|    C*                    PARM $EGMDY    S001I2  60
B2MODC*M001D     DATE      PARM           S001O1  80
M001AC                     Z-ADD0         W6      60
|    C*
|    C*年終年月＋月底日
B2000C                     Z-ADDYYMM      P3401I
|    C                     Z-ADD0         DD
|    C                     CALL 'P34'
B2MODC                     PARM           P3401I  60
M001MC                     PARM '2'       P3402I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3401O  1
|    C           DD        PARM           P3402O  20
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....IMI1PF
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVELIB01      IX01
B2000C           KEYIX     CHAINIX0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  IB10      IX08
|   C                     ADD  IB11      IX09
|   C                     ADD  IB12      IX10
|   C                     ADD  IB13      IX07
     C                     EXSR RTN999
B2000C                     Z-ADDDATE      IXXX
B2000C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATIX0
| 01-C                     END
|    C*
02===C                     ENDSR
      *===============================================================*
      *          RTN110....IMI2PF
      *===============================================================*
03===C           RTN110    BEGSR
|    C*
     C           IB03L     IFEQ 'B'
|    C*
|    C                     MOVELIB02      IY01
|    C                     MOVELIB03      IY02
|    C                     MOVELIB01      IY03
|    C           KEYIY     CHAINIY0                  40
B2000C                     Z-ADDDATE      IYXX
B2000C                     TIME           IYYY
|    C                     MOVE $USER     IYZZ
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    IY04
|   C                     MOVEL*BLANK    IY05
|   C           IY03      CHAINMA0                  41
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IY04
|   C                     MOVELMA08      IY05
| 02-C                     END
|   C                     Z-ADDIB13      IY06
|   C                     Z-ADDIB13      IY07
|   C                     Z-ADD0         IY08
|   C                     Z-ADD0         IY09
|   C                     Z-ADDIB13      IY10
|   C                     WRITEIY0
      *
| 01*C                     ELSE
|   C                     ADD  IB13      IY06
|   C                     ADD  IB13      IY07
|   C                     ADD  IB13      IY10
|   C                     UPDATIY0
| 01-C                     END
|    C*
     C                     END
03===C                     ENDSR
      *===============================================================*
      *          RTN120....IMIBPF
      *===============================================================*
04===C           RTN120    BEGSR
      *
B2000C                     Z-ADDYMD       IB04
      *IMIBPF  IBYY IS KEY NO UPDATE
|    C                     UPDATIB0
|    C*
04===C                     ENDSR
      *===============================================================*
      *          RTN200....SUB IMIXPF
      *===============================================================*
05===C           RTN200    BEGSR
|    C*
|    C                     MOVELIH03      IX01
B2000C           KEYIX     CHAINIX0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  IH08      IX08
|   C                     SUB  IH09      IX09
|   C                     SUB  IH10      IX10
|   C                     SUB  IH05      IX07
     C                     EXSR RTN999
B2000C                     Z-ADDDATE      IXXX
B2000C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATIX0
| 01-C                     END
|    C*
05===C                     ENDSR
      *===============================================================*
      *          RTN210....SUB IMIYPF
      *===============================================================*
06===C           RTN210    BEGSR
|    C*
|    C                     MOVELIG01      IY01
|    C                     MOVELIG03      IY02
|    C                     MOVELIH03      IY03
|    C           KEYIY     CHAINIY0                  40
B2000C                     Z-ADDDATE      IYXX
B2000C                     TIME           IYYY
|    C                     MOVE $USER     IYZZ
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    IY04
|   C                     MOVEL*BLANK    IY05
|   C           IY03      CHAINMA0                  41
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IY04
|   C                     MOVELMA08      IY05
| 02-C                     END
|   C                     Z-SUBIH05      IY06
|   C                     Z-SUBIH05      IY07
|   C                     Z-ADD0         IY08
|   C                     Z-ADD0         IY09
|   C                     Z-SUBIH05      IY10
|   C                     WRITEIY0
      *
| 01*C                     ELSE
|   C                     SUB  IH05      IY06
|   C                     SUB  IH05      IY07
|   C                     SUB  IH05      IY10
|   C                     UPDATIY0
| 01-C                     END
|    C*
06===C                     ENDSR
      *===============================================================*
      *          RTN220....ADD IMI1PF
      *===============================================================*
07===C           RTN220    BEGSR
|    C*
|    C                     MOVELIH04      IX01
B2000C           KEYIX     CHAINIX0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  IH08      IX08
|   C                     ADD  IH09      IX09
|   C                     ADD  IH10      IX10
|   C                     ADD  IH05      IX07
     C                     EXSR RTN999
B2000C                     Z-ADDDATE      IXXX
B2000C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATIX0
| 01-C                     END
|    C*
07===C                     ENDSR
      *===============================================================*
      *          RTN230....ADD IMI2PF
      *===============================================================*
08===C           RTN230    BEGSR
|    C*
|    C                     MOVELIG01      IY01
|    C                     MOVELIG03      IY02
|    C                     MOVELIH04      IY03
|    C           KEYIY     CHAINIY0                  40
B2000C                     Z-ADDDATE      IYXX
B2000C                     TIME           IYYY
|    C                     MOVE $USER     IYZZ
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    IY04
|   C                     MOVEL*BLANK    IY05
|   C           IY03      CHAINMA0                  41
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IY04
|   C                     MOVELMA08      IY05
| 02-C                     END
|   C                     Z-ADDIH05      IY06
|   C                     Z-ADDIH05      IY07
|   C                     Z-ADD0         IY08
|   C                     Z-ADD0         IY09
|   C                     Z-ADDIH05      IY10
|   C                     WRITEIY0
      *
| 01*C                     ELSE
|   C                     ADD  IH05      IY06
|   C                     ADD  IH05      IY07
|   C                     ADD  IH05      IY10
|   C                     UPDATIY0
| 01-C                     END
|    C*
08===C                     ENDSR
      *===============================================================*
      *          RTN240....IMIGPF
      *===============================================================*
09===C           RTN240    BEGSR
      *
B2000C                     Z-ADDYMD       IG05
B2000C                     Z-ADDDATE      IGXX
B2000C                     TIME           IGYY
|    C                     MOVE $USER     IGZZ
|    C                     UPDATIG0
|    C*
09===C                     ENDSR
      *===============================================================*
      *          RTN300....SUB IMI2PF
      *===============================================================*
10===C           RTN300    BEGSR
|    C*
|    C                     MOVELII01      IY01
|    C                     MOVELII03      IY02
|    C                     MOVELIJ03      IY03
|    C           KEYIY     CHAINIY0                  40
B2000C                     Z-ADDDATE      IYXX
B2000C                     TIME           IYYY
|    C                     MOVE $USER     IYZZ
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    IY04
|   C                     MOVEL*BLANK    IY05
|   C           IY03      CHAINMA0                  41
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IY04
|   C                     MOVELMA08      IY05
| 02-C                     END
|   C                     Z-SUBIJ05      IY06
|   C                     Z-SUBIJ05      IY07
|   C                     Z-ADD0         IY08
|   C                     Z-ADD0         IY09
|   C                     Z-SUBIJ05      IY10
|   C                     WRITEIY0
      *
| 01*C                     ELSE
|   C                     SUB  IJ05      IY06
|   C                     SUB  IJ05      IY07
|   C                     SUB  IJ05      IY10
|   C                     UPDATIY0
| 01-C                     END
|    C*
10===C                     ENDSR
      *===============================================================*
      *          RTN310....ADD IMI2PF
      *===============================================================*
11===C           RTN310    BEGSR
|    C*
|    C                     MOVELII01      IY01
|    C                     MOVELII04      IY02
|    C                     MOVELIJ03      IY03
|    C           KEYIY     CHAINIY0                  40
B2000C                     Z-ADDDATE      IYXX
B2000C                     TIME           IYYY
|    C                     MOVE $USER     IYZZ
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    IY04
|   C                     MOVEL*BLANK    IY05
|   C           IY03      CHAINMA0                  41
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IY04
|   C                     MOVELMA08      IY05
| 02-C                     END
|   C                     Z-ADDIJ05      IY06
|   C                     Z-ADDIJ05      IY07
|   C                     Z-ADD0         IY08
|   C                     Z-ADD0         IY09
|   C                     Z-ADDIJ05      IY10
|   C                     WRITEIY0
      *
| 01*C                     ELSE
|   C                     ADD  IJ05      IY06
|   C                     ADD  IJ05      IY07
|   C                     ADD  IJ05      IY10
|   C                     UPDATIY0
| 01-C                     END
|    C*
11===C                     ENDSR
      *===============================================================*
      *          RTN320....IMIIPF
      *===============================================================*
12===C           RTN320    BEGSR
      *
B2000C                     Z-ADDYMD       II06
B2000C                     Z-ADDDATE      IIXX
B2000C                     TIME           IIYY
|    C                     MOVE $USER     IIZZ
|    C                     UPDATII0
|    C*
12===C                     ENDSR
      *===============================================================*
      *          RTN400....IMI1PF
      *===============================================================*
13===C           RTN400    BEGSR
|    C*
|    C                     MOVELIL05      IX01
B2000C           KEYIX     CHAINIX0                  40
| 01-C           *IN40     IFEQ '0'
| 02-C           IL07      IFLT 0
|   C                     SUB  IL08      IX08
|   C                     SUB  IL09      IX09
|   C                     SUB  IL10      IX10
|   C                     SUB  IL06      IX07
| 02*C                     ELSE
|   C                     ADD  IL08      IX08
|   C                     ADD  IL09      IX09
|   C                     ADD  IL10      IX10
|   C                     ADD  IL06      IX07
      *拆時重算產品，組時重算禮盒　　　　　　單位成本
     C                     EXSR RTN999
| 02-C                     END
B2000C                     Z-ADDDATE      IXXX
B2000C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATIX0
| 01-C                     END
|    C*
13===C                     ENDSR
      *===============================================================*
      *          RTN410....IMI2PF
      *===============================================================*
14===C           RTN410    BEGSR
|    C*
|    C                     MOVELIM01      IY01
|    C                     MOVELIM03      IY02
|    C                     MOVELIL05      IY03
|    C           KEYIY     CHAINIY0                  40
B2000C                     Z-ADDDATE      IYXX
B2000C                     TIME           IYYY
|    C                     MOVE $USER     IYZZ
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    IY04
|   C                     MOVEL*BLANK    IY05
|   C           IY03      CHAINMA0                  41
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IY04
|   C                     MOVELMA08      IY05
| 02-C                     END
| 03-C           IL07      IFLT 0
|   C                     Z-SUBIL06      IY06
|   C                     Z-SUBIL06      IY07
|   C                     Z-SUBIL06      IY10
| 03*C                     ELSE
|   C                     Z-ADDIL06      IY06
|   C                     Z-ADDIL06      IY07
|   C                     Z-ADDIL06      IY10
| 03-C                     END
|   C                     Z-ADD0         IY08
|   C                     Z-ADD0         IY09
|   C                     WRITEIY0
      *
| 01*C                     ELSE
| 04-C           IL07      IFLT 0
|   C                     SUB  IL06      IY06
|   C                     SUB  IL06      IY07
|   C                     SUB  IL06      IY10
| 04*C                     ELSE
|   C                     ADD  IL06      IY06
|   C                     ADD  IL06      IY07
|   C                     ADD  IL06      IY10
| 04-C                     END
|   C                     UPDATIY0
| 01-C                     END
|    C*
14===C                     ENDSR
      *===============================================================*
      *          RTN420....IMIMPF
      *===============================================================*
15===C           RTN420    BEGSR
      *
B2000C                     Z-ADDYMD       IM08
B2000C                     Z-ADDDATE      IMXX
B2000C                     TIME           IMYY
|    C                     MOVE $USER     IMZZ
|    C                     UPDATIM0
|    C*
15===C                     ENDSR
      *===============================================================*
      *          RTN999....計算年終單位成本
      *===============================================================*
15===C           RTN999    BEGSR
      *
|    C           IX06      ADD  IX07      QTY     70
|    C           QTY       IFNE 0
     C           IX08      DIV  QTY       IX02      H
     C           IX09      DIV  QTY       IX03      H
     C                     END
|    C           IX07      IFNE 0
     C           IX10      DIV  IX07      IX04      H
     C                     END
     C           IX02      ADD  IX03      IX05
     C                     ADD  IX04      IX05
|    C*
15===C                     ENDSR
