      ****************************************************************
      *                                                              *
      * PROGRAM NAME : KIB002                                        *
      * AUTHER       : CHARLES                                       *
      * CREATE DATE  : 83/03/05                                      *
      * UPDATE DATE  : 12/08/92                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :盤點系統                                     *
      * REMARK       :專櫃銷售年終成本庫存調整                     *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.18 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FIMIBPF  UF  E           K        DISK
     FIMIGPF  UF  E           K        DISK
     FIMIHPF  UF  E           K        DISK
     FIMIYPF  UF  E           K        DISK                      A
     FIMI1PF  UF  E           K        DISK
     F            IX0                               KRENAMEI10
     FIMIXPF  UF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPA#KPF  UF  E           K        DISK                      A
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I                                      162 1620$EVR
     I                                      125 1270$CPY
M001AI                                      201 2080DATE
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I                                      513 513 $WRHTY
      *物流點
     I                                      601 605 DIB03S
     I                                      606 610 DIB03E
      *DATE
M001MI                                      611 6180DIB04S
M001MI                                      619 6260DIB04E
      *YYMM
     I                                      630 6330DMMYY
     I                                      630 6310MM
     I                                      632 6330YY
B2MODI                                      640 6450YYMM
B2MODI                                      646 6470DD
B2MODI                                      640 6470YMD
     I            DS
B2MODI                                        1   80IB04
B2MODI                                        9  140IBYY
M001MI                                        3  14 IB04YY
     I            DS
     I                                        1   5 IB03
     I                                        1   1 IB03L
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYIX     KLIST
     C                     KFLD           YYMM
     C                     KFLD           IX01
     C           KEYIY     KLIST
     C                     KFLD           IY15
     C                     KFLD           IY01
     C                     KFLD           IY02
     C                     KFLD           IY03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN010
      *
     C                     Z-ADDYYMM      IY15
     C*IMIBPF----------------------------------------------------------
     C                     READ IB0                      45
  01-C           *IN45     DOWEQ'0'
    C           IB04YY    CHAIN#K0                  41    *單據對照
     *CVR0001 sev.00 Field #K01 is not a date or year
  02-C           *IN41     IFEQ '1'                        *NOT FOUNT
    C                     EXSR RTN100
    C                     EXSR RTN110
    C                     EXSR RTN120
    C*
    C                     MOVELIB04YY    #K01
     *CVR0001 sev.00 Field #K01 is not a date or year
    C                     Z-ADDIB04      #K02
    C                     Z-ADDDATE      #KXX
    C                     TIME           #KYY
    C                     MOVEL$USER     #KZZ
    C                     WRITE#K0
  02-C                     END
    C*
    C                     READ IB0                      45
  01-C                     END
     C*IMIGPF----------------------------------------------------------
     C                     READ IG0                      45
  03-C           *IN45     DOWEQ'0'
    C           IG02      CHAIN#K0                  41    *單據對照
  04-C           *IN41     IFEQ '1'                        *NOT FOUNT
    C           IG02      SETLLIH0
    C           IG02      READEIH0                      46
  05-C           *IN46     DOWEQ'0'
  06-C           IH03      IFNE *BLANK
    C           IH03      CHAINMA0                  40
  07-C           *IN40     IFEQ '0'
  08-C           MA07      IFEQ 'K'
    C                     EXSR RTN200
    C                     EXSR RTN210
  08-C                     END
  07-C                     END
  06-C                     END
  09-C           IH04      IFNE *BLANK
    C           IH04      CHAINMA0                  40
  10-C           *IN40     IFEQ '0'
  11-C           MA07      IFEQ 'K'
    C                     EXSR RTN220
    C                     EXSR RTN230
  11-C                     END
  10-C                     END
  09-C                     END
    C                     Z-ADDYMD       IH06
    C                     UPDATIH0
    C           IG02      READEIH0                      46
  05-C                     END
    C*
  12-C           MA07      IFEQ 'K'
    C*
    C                     MOVELIG02      #K01
    C                     Z-ADDIG05      #K02
    C                     Z-ADDDATE      #KXX
    C                     TIME           #KYY
    C                     MOVEL$USER     #KZZ
    C                     WRITE#K0
    C                     Z-ADDYMD       IG05
    C                     UPDATIG0
  12-C                     ENDIF
  04-C                     END
    C*
    C                     READ IG0                      45
  03-C                     END
     C*----------------------------------------------------------------
      *
     C                     SETON                     LR
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         W6      60
|    C*
|    C*年終年月＋月底日
|    C                     Z-ADDYYMM      P3401I
|    C                     Z-ADD0         DD
|    C                     CALL 'P34'
|    C                     PARM           P3401I  60
|    C                     PARM '2'       P3402I  1
|    C                     PARM '1'       P3404I  1
|    C                     PARM           P3401O  1
|    C           DD        PARM           P3402O  20
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....IMI1PF
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVELIB01      IX01
|    C           IB01      CHAINMA0                  41
| 01-C           MA07      IFEQ 'K'
|   C           KEYIX     CHAINI10                  40
| 02-C           *IN40     IFEQ '0'
|   C                     ADD  IB10      IX08
|   C                     ADD  IB11      IX09
|   C                     ADD  IB12      IX10
|   C                     ADD  IB13      IX07
|   C                     EXSR RTN999
|   C                     Z-ADDDATE      IXXX
|   C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATI10
| 02-C                     END
| 01*C                     ELSE
|    *
|   C           KEYIX     CHAINIX0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  IB10      IX08
|   C                     ADD  IB11      IX09
|   C                     ADD  IB12      IX10
|   C                     ADD  IB13      IX07
|   C                     EXSR RTN999
|   C                     Z-ADDDATE      IXXX
|   C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATIX0
| 03-C                     END
|    *
| 01-C                     ENDIF
|    C*
02===C                     ENDSR
      *===============================================================*
      *          RTN110....IMI2PF
      *===============================================================*
03===C           RTN110    BEGSR
|    C*
| 01-C           IB03L     IFEQ 'B'
|   C*
|   C                     MOVELIB02      IY01
|   C                     MOVELIB03      IY02
|   C                     MOVELIB01      IY03
|   C           KEYIY     CHAINIY0                  40
|   C                     Z-ADDDATE      IYXX
|   C                     TIME           IYYY
|   C                     MOVE $USER     IYZZ
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    IY04
|   C                     MOVEL*BLANK    IY05
|   C           IY03      CHAINMA0                  41
| 03-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IY04
|   C                     MOVELMA08      IY05
| 03-C                     END
|   C                     Z-ADDIB13      IY06
|   C                     Z-ADDIB13      IY07
|   C                     Z-ADD0         IY08
|   C                     Z-ADD0         IY09
|   C                     Z-ADDIB13      IY10
|   C                     WRITEIY0
|    *
| 02*C                     ELSE
|   C                     ADD  IB13      IY06
|   C                     ADD  IB13      IY07
|   C                     ADD  IB13      IY10
|   C                     UPDATIY0
| 02-C                     END
|   C*
| 01-C                     END
03===C                     ENDSR
      *===============================================================*
      *          RTN120....IMIBPF
      *===============================================================*
04===C           RTN120    BEGSR
|     *
|    C                     Z-ADDYMD       IB04
|     *IMIBPF  IBYY IS KEY NO UPDATE
|    C                     UPDATIB0
|    C*
04===C                     ENDSR
      *===============================================================*
      *          RTN200....SUB IMIXPF
      *===============================================================*
05===C           RTN200    BEGSR
|    C*
|    C                     MOVELIH03      IX01
| 01-C           MA07      IFEQ 'K'
|   C           KEYIX     CHAINI10                  40
| 02-C           *IN40     IFEQ '0'
|   C                     SUB  IH08      IX08
|   C                     SUB  IH09      IX09
|   C                     SUB  IH10      IX10
|   C                     SUB  IH05      IX07
|   C                     EXSR RTN999
|   C                     Z-ADDDATE      IXXX
|   C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATI10
| 02-C                     END
| 01*C                     ELSE
|    *
|   C           KEYIX     CHAINIX0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     SUB  IH08      IX08
|   C                     SUB  IH09      IX09
|   C                     SUB  IH10      IX10
|   C                     SUB  IH05      IX07
|   C                     EXSR RTN999
|   C                     Z-ADDDATE      IXXX
|   C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATIX0
| 03-C                     END
|    *
| 01-C                     ENDIF
|    C*
05===C                     ENDSR
      *===============================================================*
      *          RTN210....SUB IMIYPF
      *===============================================================*
06===C           RTN210    BEGSR
|    C*
|    C                     MOVELIG01      IY01
|    C                     MOVELIG03      IY02
|    C                     MOVELIH03      IY03
|    C           KEYIY     CHAINIY0                  40
|    C                     Z-ADDDATE      IYXX
|    C                     TIME           IYYY
|    C                     MOVE $USER     IYZZ
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    IY04
|   C                     MOVEL*BLANK    IY05
|   C           IY03      CHAINMA0                  41
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IY04
|   C                     MOVELMA08      IY05
| 02-C                     END
|   C                     Z-SUBIH05      IY06
|   C                     Z-SUBIH05      IY07
|   C                     Z-ADD0         IY08
|   C                     Z-ADD0         IY09
|   C                     Z-SUBIH05      IY10
|   C                     WRITEIY0
|    *
| 01*C                     ELSE
|   C                     SUB  IH05      IY06
|   C                     SUB  IH05      IY07
|   C                     SUB  IH05      IY10
|   C                     UPDATIY0
| 01-C                     END
|    C*
06===C                     ENDSR
      *===============================================================*
      *          RTN220....ADD IMI1PF
      *===============================================================*
07===C           RTN220    BEGSR
|    C*
|    C                     MOVELIH04      IX01
| 01-C           MA07      IFEQ 'K'
|   C           KEYIX     CHAINI10                  40
| 02-C           *IN40     IFEQ '0'
|   C                     ADD  IH08      IX08
|   C                     ADD  IH09      IX09
|   C                     ADD  IH10      IX10
|   C                     ADD  IH05      IX07
|   C                     EXSR RTN999
|   C                     Z-ADDDATE      IXXX
|   C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATI10
| 02-C                     END
| 01*C                     ELSE
|    *
|   C           KEYIX     CHAINIX0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  IH08      IX08
|   C                     ADD  IH09      IX09
|   C                     ADD  IH10      IX10
|   C                     ADD  IH05      IX07
|   C                     EXSR RTN999
|   C                     Z-ADDDATE      IXXX
|   C                     TIME           IXYY
|   C                     MOVE $USER     IXZZ
|   C                     UPDATIX0
| 03-C                     END
|    *
| 01-C                     END
|    C*
07===C                     ENDSR
      *===============================================================*
      *          RTN230....ADD IMI2PF
      *===============================================================*
08===C           RTN230    BEGSR
|    C*
|    C                     MOVELIG01      IY01
|    C                     MOVELIG03      IY02
|    C                     MOVELIH04      IY03
|    C           KEYIY     CHAINIY0                  40
|    C                     Z-ADDDATE      IYXX
|    C                     TIME           IYYY
|    C                     MOVE $USER     IYZZ
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    IY04
|   C                     MOVEL*BLANK    IY05
|   C           IY03      CHAINMA0                  41
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IY04
|   C                     MOVELMA08      IY05
| 02-C                     END
|   C                     Z-ADDIH05      IY06
|   C                     Z-ADDIH05      IY07
|   C                     Z-ADD0         IY08
|   C                     Z-ADD0         IY09
|   C                     Z-ADDIH05      IY10
|   C                     WRITEIY0
|    *
| 01*C                     ELSE
|   C                     ADD  IH05      IY06
|   C                     ADD  IH05      IY07
|   C                     ADD  IH05      IY10
|   C                     UPDATIY0
| 01-C                     END
|    C*
08===C                     ENDSR
      *===============================================================*
      *          RTN999....計算年終單位成本
      *===============================================================*
09===C           RTN999    BEGSR
|     *
|    C           IX06      ADD  IX07      QTY     70
| 01-C           QTY       IFNE 0
|   C           IX08      DIV  QTY       IX02      H
|   C           IX09      DIV  QTY       IX03      H
| 01-C                     END
| 02-C           IX07      IFNE 0
|   C           IX10      DIV  IX07      IX04      H
| 02-C                     END
|    C           IX02      ADD  IX03      IX05
|    C                     ADD  IX04      IX05
|    C*
09===C                     ENDSR
