     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : KIP008                                     *
     A*    AUTHOR       : A1492  TERRY                               *
     A*    DATE WRITTEN : 98/04/07                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :茂世進銷存                                *
     A*    SUBSYSTEM    :                                          *
     A*    PROCEDURE    :專櫃調撥處理(前台)                      *
     A*    REMARK       :                                            *
     A*===============================================================
      *
     FW2BALF04UF  E           K        DISK
     FW2BBLF03UF  E           K        DISK
     FW2BBLF01IF  E           K        DISK
     F            BB0                               KRENAMEBBL1
     FPA#APF  IF  E           K        DISK
     FMTMAPF  UF  E           K        DISK
     FMTMHPF  UF  E           K        DISK
     F            MA0                               KRENAMEMH0
     FIMIAPF  UF  E           K        DISK
     FSOSCPF  O   E           K        DISK
     FSOSDPF  UF  E           K        DISK                      A
     FSOSIPF  O   E           K        DISK
     FSOSJPF  O   E           K        DISK
     FMTMDPF  UF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FW1AALF01IF  E           K        DISK
     FRMWK03  UF  E           K        DISK                      A
     FRMWK03L1IF  E           K        DISK
     F            WB0                               KRENAMEWB0L1
     FRMWK04  UF  E           K        DISK                      A
     FKIP012D CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E                    WFUN    7   7  6
     E*: A/U/D/I AUT
     E                    WA01        7  1
     I*
     IBBL1
     I              BB01                            BB01L
     I              BB02                            BB02L
     I              BB03                            BB03L
     I              BB04                            BB04L
     I              BB05                            BB05L
     I              BB06                            BB06L
     I              BB07                            BB07L
     I              BB08                            BB08L
     I              BB08A                           BB08AL
     I              BB08B                           BB08BL
     I              BB09                            BB09L
     I              BB10                            BB10L
     I              BB11                            BB11L
     I              BBXX                            BBXXL
     I              BBYY                            BBYYL
     I              BBZZ                            BBZZL
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      201 2080DATE
     I                                      201 2080$EG8
     I                                      501 505 $WRHUS
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I*
     I              '無牌價資料  '      C         ERR1
     I              '可用量不足  '      C         ERR2
     I              '超過金額上限'      C         ERR3
     I              '超過金額下限'      C         ERR4
     IDA02        DS
     I                                        1   43DUTY
     I            DS
     I                                        1   9 SD03
     I                                        1   4 SD03L
     I            DS
     I                                        1   30MD26
     I                                        1   10MD26M
     I                                        2   30MD26D
     I            DS
     I                                        1   80SC08
     I                                        1   60SC08YM
     I                                        1   40SC08Y
     I                                        5   60SC08M
     I                                        7   80SC08D
     I            DS
     I                                        1   60WSC08
     I                                        1   20WSC08Y
     I                                        3   40WSC08M
     I                                        5   60WSC08D
     I            DS
     I                                        1   2 SC01
     I                                        1   1 SC01K
     I            DS
     I                                        1   80HBA01
     I                                        1   20HYY1
     I                                        3   40HYY2
     I                                        5   60HMM
     I                                        7   80HDD
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1  8
     C                     MOVE *BLANK    PARMO1 10
     C*
     C           *LIKE     DEFN DBGN3     OBGN3            *START KEY
     C           *LIKE     DEFN DBA02     OBA02            *START KEY
     C           *LIKE     DEFN BA01      KBGN3            *START KEY
     C           *LIKE     DEFN RRN2      @PRRN
     C           *LIKE     DEFN WB01      TWB01
     C           *LIKE     DEFN WB02      TWB02
     C           *LIKE     DEFN WB03      TWB03
     C           *LIKE     DEFN WB09      TWB09
      *  FOR SUBFILE (SYS+PGM CONTROL)
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYBA1    KLIST
     C                     KFLD           DBA02
     C                     KFLD           KBGN3
     C           KEYBA2    KLIST
     C                     KFLD           BA02
     C                     KFLD           BA01
     C                     KFLD           BA03
     C           KEYBA3    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           HBA01
     C                     KFLD           DBA03
     C           KEYBB1    KLIST
     C                     KFLD           DBA03
     C           KEYBB2    KLIST
     C                     KFLD           DBA03
     C                     KFLD           SBB02
     C                     KFLD           SBB03
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYIA     KLIST
     C                     KFLD           IA01
     C                     KFLD           WB02
     C                     KFLD           WB04
     C           KEYIA1    KLIST
     C                     KFLD           IA01
     C                     KFLD           DBGN1
     C                     KFLD           SBB03
     C           KEYWF     KLIST
     C                     KFLD           HBA01
     C                     KFLD           DBGN1
     C                     KFLD           SBB11
     C                     KFLD           SBB03
     C                     KFLD           SBA08
     C           KEYWF1    KLIST
     C                     KFLD           HBA01
     C                     KFLD           DBGN1
     C                     KFLD           SBB03
     C                     KFLD           SBA03
     C                     KFLD           SBB02
     C           KEYAA     KLIST
     C                     KFLD           WB04
     C                     KFLD           WB01
     C           KEYBA     KLIST
     C                     KFLD           WT02
     C                     KFLD           WT01
     C                     KFLD           WT04
     C           KEYBB     KLIST
     C                     KFLD           WT04
     C                     KFLD           WT05
     C                     KFLD           WT03
     C           KEYAA1    KLIST
     C                     KFLD           SBB03
     C                     KFLD           HBA01
     C           KEYBBL    KLIST
     C                     KFLD           BB01
     C                     KFLD           BB03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $UPD      WA01,6
|    C                     MOVE $UPD      WA01,7
|    C                     MOVE 'SCR001'  APPSCR
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVEL'R'       IA01
|    C*
|    C                     MOVEL*BLANK    DBA02
|    C                     MOVEL*BLANK    D#A031
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN3     IFNE OBGN3
|   C           DBA02     ORNE OBA02
|   C                     Z-ADD0         HRRN1
|    *新增畫面秀出文字功能
|   C                     EXSR RTN190
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN3     OBGN3
|   C                     MOVE DBA02     OBA02
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN301
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     97
| 05-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C   99                GOTO END180
|    C*
04===C           END180    ENDSR
      *==============================================================*
      *          RTN190....CHECK 'SC01' SCREEN
      *==============================================================*
05===CSR         RTN190    BEGSR
|    C*
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|     *
| 01-C           DBGN3     IFNE 0
|   C                     CALL 'P31'
|   C                     PARM DBGN3     P31I1   80
|   C                     PARM '3'       P3112   1
|   C                     PARM '1'       P31I3   1
|   C                     PARM '2'       P31I4   1
|   C                     PARM '1'       P31I5   1
|   C           KBGN3     PARM           P31IO   80
| 01*C                     ELSE
|   C                     Z-ADD*HIVAL    KBGN3
| 01-C                     ENDIF
|     *
| 02-C           DBA02     IFNE *BLANK
|   C                     MOVELDBA02     #A02
|   C           KEY#A     CHAIN#A0                  40
|   C  N40                MOVEL#A03      D#A031
|   C   40                MOVEL*BLANK    D#A031
| 02*C                     ELSE
|   C                     MOVEL*BLANK    D#A031
| 02-C                     ENDIF
|    C*
|    C           KEYBA1    SETLLBA0
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
| 02-C           DBA02     IFEQ *BLANK
|   C                     READ BA0                 N    46
| 02*C                     ELSE
|   C           DBA02     READEBA0                 N    46
| 02-C                     ENDIF
|   C*
| 03-C           *IN46     IFEQ '0'
|   C*
|   C                     Z-ADDBA01      HBA01
|   C                     CALL 'P31'
|   C                     PARM BA01      P31I1   80
|   C                     PARM '2'       P3112   1
|   C                     PARM '1'       P31I3   1
|   C                     PARM '3'       P31I4   1
|   C                     PARM '1'       P31I5   1
|   C           SBA01     PARM           P31IO   80
|   C*
|   C                     MOVELBA03      SBA03
|   C                     MOVELBA02      SBA02
|   C                     MOVELBA06      SBA06
|   C                     MOVELBA08      SBA08
|   C                     MOVEL*BLANK    S#A03
|   C                     MOVELSBA02     #A02
|   C           KEY#A     CHAIN#A0                  40
|   C  N40                MOVEL#A03      S#A03
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 03*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 03-C                     END
| 01-C                     ENDDO
|    C*
|    C*再此多做預讀一筆的判斷，去判斷是否已到最後一筆
| 04-C           *IN46     IFEQ '0'
|   C                     READ BA0                 N    46
|   C*在將KEY值帶回來
|   C           KEYBA2    SETLLBA0
| 05-C           *IN46     IFEQ '1'
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 05-C                     END
| 04-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
| 02-C           DBGN3     IFNE *ZERO
|   C                     SETON                     99    *NODATA
|   C                     MOVEL'MSG0008' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 02-C                     END
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN301....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
10===C           RTN301    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
|    C*
| 01-C           DOPT1     CASEQ'5'       RTN340           *INQ
|   C           DOPT1     CASEQ'6'       RTN321           *UPD
|   C           DOPT1     CASEQ'7'       RTN321           *UPD
| 01-C                     END
|    C           *LOVAL    SETLLBA0
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN321....UPD DATA --- SFLSR
     C*==============================================================*
11===C           RTN321    BEGSR
|    C*
|    C                     SETON                     33
|    C                     EXSR RTN390                     *INT SFLSR
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C                     CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN09     ANDEQ'1'                         SAVE
| 06-C           DOPT1     IFEQ '6'
|   C                     EXSR RTN39T                     轉檔
| 06*C                     ELSE
| 07-C           DOPT1     IFEQ '7'
|   C                     EXSR RTN39S                     還原
| 07-C                     ENDIF
| 06-C                     ENDIF
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR2
     C*==============================================================*
12===C           RTN340    BEGSR
|    C*
|    C                     SETOF                       33  *NO INPUT
|    C                     EXSR RTN390                     *INT SFLSR
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN99     IFEQ '0'                         SAVE
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN12 ENDIF
| 02-C                     END                             *IN03 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN380....CHECK 'SC03' --- SFLSR
     C*==============================================================*
13===C           RTN380    BEGSR
|    C*
|    C                     SETON                     54
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*
|   C                     SETOF                     606162
|   C*
|   C   99                GOTO UPD
|   C*
| 02-C           DOPT1     IFEQ '6'
| 03-C           HERR      IFEQ 'E1'
|   C           HERR      OREQ 'E4'
|   C                     SETON                     9961
|   C                     MOVEL'MSG0032' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 03-C                     ENDIF
| 02-C                     ENDIF
|   C   99                GOTO DSP
|   C*
|   C           DSP       TAG
|   C   99                Z-ADDRRN2      DRRN2
|   C*
|   C           UPD       TAG
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
|    C*
13===C           END380    ENDSR
     C*==============================================================*
     C*          RTN390....搬值給第2各畫面需要的KEY值
     C*==============================================================*
14===C           RTN390    BEGSR
|    C*
|    C                     MOVELSBA02     DBGN1
|    C                     MOVEL*BLANK    D#A03
|    C                     MOVELSBA02     #A02
|    C           KEY#A     CHAIN#A0                  40
|    C  N40                MOVEL#A03      D#A03
|    C                     Z-ADDSBA01     DBA01
|    C                     MOVELSBA03     DBA03
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN391....INIT 'SC03' -- SFLSR2
     C*==============================================================*
15===C           RTN391    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD999       DSPRC2  40
|    C                     Z-ADD10        WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     Z-ADD9         @SFTOP  20
|    C                     Z-ADD18        @SFBOT  20
|    C                     Z-ADD1         @LNUM   20
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYBB1    SETLLBB0
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          RTN398....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
16===C           RTN398    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '6'
|   C           DOPT1     OREQ '7'
|   C                     SETON                     54
| 01*C                     ELSE
|   C                     SETOF                     54
| 01-C                     END
|    C*
|    C           KEYBB1    READEBB0                 N    44*NF/EOF
|    C*
| 02-C           *IN44     DOWEQ'0'
| 03-C           BB09      IFEQ 'E'
|   C                     EXSR RTN39B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
| 03-C                     ENDIF
|   C           KEYBB1    READEBB0                 N    44*NF/EOF
| 02-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          RTN39B....FILE TO SCREEN --- MOVE
     C*==============================================================*
17===C           RTN39B    BEGSR
|    C*
|    C                     MOVELBB03      SBB03
|    C           SBB03     CHAINMA0                 N40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELMA03      SMA03
| 01*C                     ELSE
|   C                     MOVEL*BLANK    SMA03
| 01-C                     ENDIF
|    C*
|    C                     MOVEL*BLANK    RTN
| 02-C           BB04      IFNE 0
|   C           BB07      DIV  BB04      SAMT
|   C*
|   C                     CALL 'KIP007'
|   C                     PARM BB03      TAA02   9
|   C                     PARM HBA01     TAA03   80
|   C                     PARM SAMT      AMT    112
|   C                     PARM           RTN     2
|   C*
|   C                     MOVELRTN       HERR
|   C*
|   C                     MOVEL*BLANK    SERR
| 03-C                     SELEC
|   C           RTN       WHEQ 'E1'
|   C                     MOVELERR1      SERR
|   C           RTN       WHEQ 'E2'
|   C                     MOVELERR3      SERR
|   C           RTN       WHEQ 'E3'
|   C                     MOVELERR4      SERR
| 03-C                     ENDSL
| 02-C                     ENDIF
|    C*
| 04-C           RTN       IFEQ *BLANK
|   C           RTN       OREQ 'E0'
|   C                     MOVELERR2      SERR
| 04-C                     ENDIF
|    C*
|    C                     Z-ADD0         WQTY
|    C                     Z-ADD0         WQTY1
|    C*
|    C           KEYBBL    SETLLBBL1
|    C           KEYBBL    READEBBL1                     39
| 05-C           *IN39     DOWEQ'0'
| 06-C           BB09L     IFEQ 'E'
| 07-C           SBA06     IFEQ 'A1'
|   C           BB04L     ADD  BB05L     WQTY1   90
|   C                     ADD  WQTY1     WQTY    90
| 07*C                     ELSE
| 08-C           SBA06     IFEQ 'A3'
|   C                     ADD  BB06L     WQTY
| 08-C                     ENDIF
| 07-C                     ENDIF
| 06-C                     ENDIF
|   C           KEYBBL    READEBBL1                     39
| 05-C                     ENDDO
|    C*
|    C           KEYIA1    CHAINIA0                 N40
| 09-C           *IN40     IFEQ '0'
|   C           IA10      ANDLTWQTY
|   C           *IN40     OREQ '1'
|   C                     MOVEL'E4'      HERR
| 09-C                     ENDIF
|    C*
|    C                     Z-ADD0         SAMT1
|    C           KEYAA1    SETGTAA0
|    C           SBB03     REDPEAA0                      40
|    C  N40                Z-ADDAA04      SAMT1
|    C*
|    C                     MOVELBB11      SBB11
|    C                     Z-ADDBB02      SBB02
|    C                     Z-ADDBB04      SBB04
|    C                     Z-ADDBB05      SBB05
|    C                     Z-ADDBB06      SBB06
|    C                     Z-ADDBB07      SBB07
|    C                     Z-ADDBB08      SBB08
|    C                     Z-ADDBB08A     SBB08A
|    C                     Z-ADDBB08B     SBB08B
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          RTN39S....SAVE D
     C*==============================================================*
18===C           RTN39S    BEGSR
|    C*
|    C                     READCSFLSR2                 5757
| 01-C           *IN57     DOWEQ'0'
|   C*
|   C           KEYBB2    CHAINBB0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL*BLANK    BB09
|   C                     Z-ADDDATE      BBXX
|   C                     TIME           BBYY
|   C                     MOVE $USER     BBZZ
|   C                     UPDATBB0
| 02-C                     ENDIF
|   C*
|   C                     READCSFLSR2                   57
| 01-C                     ENDDO
|    C*
|    C           KEYBA3    CHAINBA0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVEL*BLANK    BA05
|   C                     Z-ADDDATE      BAXX
|   C                     TIME           BAYY
|   C                     MOVE $USER     BAZZ
|   C                     UPDATBA0
| 03-C                     ENDIF
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          RTN39T....
     C*==============================================================*
19===C           RTN39T    BEGSR
|    C*
|    C           *LOVAL    SETLLWB0
|    C                     READ WB0                      41
| 01-C           *IN41     DOWEQ'0'
|   C                     DELETWB0
|   C                     READ WB0                      41
| 01-C                     ENDDO
|    C           *LOVAL    SETLLWT0
|    C                     READ WT0                      41
| 02-C           *IN41     DOWEQ'0'
|   C                     DELETWT0
|   C                     READ WT0                      41
| 02-C                     ENDDO
|    C*
|    C                     READCSFLSR2                 5757
| 03-C           *IN57     DOWEQ'0'
|   C*
|   C           KEYWF     CHAINWB0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     Z-ADDHBA01     WB01
|   C                     MOVELDBGN1     WB02
|   C                     MOVELSBB11     WB03
|   C                     MOVELSBB03     WB04
|   C                     Z-ADDSBB04     WB05
|   C                     Z-ADDSBB05     WB06
|   C                     Z-ADDSBB07     WB07
|   C                     Z-ADDSBB06     WB08
|   C                     MOVELSBA08     WB09
|   C                     Z-ADDSBB08     WB10
|   C                     Z-ADDSBB08A    WB10A
|   C                     Z-ADDSBB08B    WB10B
|   C                     WRITEWB0
| 04*C                     ELSE
|   C                     ADD  SBB04     WB05
|   C                     ADD  SBB05     WB06
|   C                     ADD  SBB07     WB07
|   C                     ADD  SBB06     WB08
|   C                     UPDATWB0
| 04-C                     ENDIF
|   C*
|   C           KEYWF1    CHAINWT0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     Z-ADDHBA01     WT01
|   C                     MOVELDBGN1     WT02
|   C                     MOVELSBB03     WT03
|   C                     MOVELDBA03     WT04
|   C                     Z-ADDSBB02     WT05
|   C                     WRITEWT0
| 05-C                     ENDIF
|   C*
|   C                     READCSFLSR2                   57
| 03-C                     ENDDO
|    C*
|    C                     EXSR RTN200
|    C                     EXSR RTN201
|    C                     EXSR RTN202
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          RTN200....PROCESS
     C*==============================================================*
20===C           RTN200    BEGSR
|    C*
|    C                     SETON                     22
|    C                     Z-ADD0         I       30
|    C           *LOVAL    SETLLWB0
|    C                     READ WB0                      45
| 01-C           *IN45     DOWEQ'0'
| 02-C           WB09      IFNE *BLANK
|   C                     GOTO $NEXT
| 02-C                     ENDIF
|    *搬第一次至KEY FIELD
| 03-C           I         IFEQ 0
|   C                     Z-ADDWB01      TWB01
|   C                     MOVELWB02      TWB02
|   C                     MOVELWB03      TWB03
| 03-C                     END
|    *
| 04-C           WB01      IFNE TWB01
|   C           WB02      ORNE TWB02
|   C           WB03      ORNE TWB03
|    *PROCESS HANDING
|   C                     EXSR RTN400
|   C                     EXSR RTN500
|   C                     Z-ADD0         I
| 04-C                     END
|    *
|   C                     ADD  1         I
|    *
| 05-C           I         IFEQ 1
|    *頭檔單號
|   C                     EXSR RTN211
|    *頭檔初值
|   C                     EXSR RTN210
| 05-C                     END
|    * PROCESS DETIAL
|   C                     EXSR RTN300
|   C*
|   C                     Z-ADDWB01      TWB01
|   C                     MOVELWB02      TWB02
|   C                     MOVELWB03      TWB03
|   C           $NEXT     TAG
|   C                     READ WB0                      45
| 01-C                     END
|     *
| 06-C           I         IFNE 0
|    *PROCESS HANDING
|   C                     EXSR RTN400
|   C                     EXSR RTN500
| 06-C                     END
|     *
20===C                     ENDSR
     C*==============================================================*
     C*          RTN201....PROCESS  試飲
     C*==============================================================*
21===C           RTN201    BEGSR
|    C*
|    C                     SETOF                     22
|    C                     Z-ADD0         I       30
|    C           *LOVAL    SETLLWB0L1
|    C                     READ WB0L1                    45
| 01-C           *IN45     DOWEQ'0'
| 02-C           WB09      IFEQ *BLANK
|   C                     GOTO $NEXT1
| 02-C                     ENDIF
|    *搬第一次至KEY FIELD
| 03-C           I         IFEQ 0
|   C                     Z-ADDWB01      TWB01
|   C                     MOVELWB02      TWB02
|   C                     MOVELWB09      TWB09
| 03-C                     END
|    *
| 04-C           WB01      IFNE TWB01
|   C           WB02      ORNE TWB02
|   C           WB09      ORNE TWB09
|    *PROCESS HANDING
|   C                     WRITESC0
|   C                     Z-ADD0         I
| 04-C                     END
|    *
|   C                     ADD  1         I
|    *
| 05-C           I         IFEQ 1
|    *頭檔單號
|   C                     EXSR RTN211
|    *頭檔初值
|   C                     EXSR RTN210
| 05-C                     END
|    *PROCESS DETIAL
|   C                     EXSR RTN300
|   C*
|   C                     Z-ADDWB01      TWB01
|   C                     MOVELWB02      TWB02
|   C                     MOVELWB09      TWB09
|   C           $NEXT1    TAG
|   C                     READ WB0L1                    45
| 01-C                     END
|     *
| 06-C           I         IFNE 0
|    *PROCESS HANDING
|   C                     WRITESC0
| 06-C                     END
|     *
21===C                     ENDSR
     C*==============================================================*
     C*          RTN202....UPDATE STATUS
     C*==============================================================*
22===C           RTN202    BEGSR
|     *
|    C           *LOVAL    SETLLWT0
|    C                     READ WT0                      41
| 01-C           *IN41     DOWEQ'0'
|   C           KEYBB     SETLLBB0
|   C           KEYBB     READEBB0                      42
| 02-C           *IN42     DOWEQ'0'
|   C                     MOVEL'P'       BB09
|   C                     Z-ADDDATE      BBXX
|   C                     TIME           BBYY
|   C                     MOVE $USER     BBZZ
|   C                     UPDATBB0
|   C           KEYBB     READEBB0                      42
| 02-C                     ENDDO
|   C                     READ WT0                      41
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLWT0
|    C                     READ WT0                      41
| 03-C           *IN41     DOWEQ'0'
|   C           KEYBA     CHAINBA0                  40
| 04-C           *IN40     IFEQ '0'
|   C           BA03      SETLLBB0
|   C           BA03      READEBB0                      42
| 05-C           *IN42     DOWEQ'0'
| 06-C           BB09      IFNE 'P'
|   C                     LEAVE
| 06-C                     ENDIF
|   C           BA03      READEBB0                      42
| 05-C                     ENDDO
| 07-C           *IN42     IFEQ '1'
|   C                     MOVEL'P'       BA05
|   C                     Z-ADDDATE      BAXX
|   C                     TIME           BAYY
|   C                     MOVE $USER     BAZZ
|   C                     UPDATBA0
| 07-C                     ENDIF
| 04-C                     ENDIF
|   C                     READ WT0                      41
| 03-C                     ENDDO
|     *
22===C                     ENDSR
     C*==============================================================*
     C*          RTN211....單號
     C*==============================================================*
23===C           RTN211    BEGSR
|     *GET ORDER NUMBER
|    C   22                MOVEL'S2'      S004I2
|    C  N22                MOVEL'S4'      S004I2
|    C                     CALL 'RES004'
|    C                     PARM 'R1'      S004I1  2
|    C                     PARM           S004I2  2
|    C                     PARM HYY2      S004I3  20
|    C           SC02      PARM           S004O1 12
|     *
23===C                     ENDSR
     C*==============================================================*
     C*          RTN210....頭檔
     C*==============================================================*
24===C           RTN210    BEGSR
|    C*
|    C                     MOVEL'R1'      SC01
|    C   22                MOVEL'S2'      SC03
|    C  N22                MOVEL'S4'      SC03
|    C                     MOVELWB02      SC04
|    C                     MOVE *BLANK    SC05
|    C                     MOVE *BLANK    SC06
|    C                     Z-ADDWB01      SC07
|    C                     Z-ADDWB01      SC08
|    C                     MOVE *BLANKS   SC09
|    C   22                MOVE *BLANK    SC10
|    C  N22                MOVELWB09      SC10
|    C                     MOVELSC04      SC11
|    C                     Z-ADD0         SC12
|    C                     MOVEL'V'       SC13
|    C                     MOVELWB02      SC14
|    C                     MOVE *BLANK    SC15
|    C                     MOVELWB02      SC16
|    C                     MOVE *BLANK    SC17
|    C                     MOVE *BLANK    SC18
|    C                     MOVE *BLANK    SC19
|    C                     MOVE *BLANK    SC20
|    C                     MOVE *BLANK    SC21
|    C                     MOVEL'C'       SC22
|    C                     MOVEL'C'       SC23
|    C                     MOVEL'C'       SC24
|    C                     MOVEL'C'       SC25
|    C                     MOVEL'C'       SC26
|    C                     MOVE *BLANK    SC27
|    C                     MOVE *BLANK    SC28
|    C                     MOVE *BLANK    SC31
|    C                     MOVE *BLANK    SC32
|    C           WB02      CHAINME0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELME07      SC31
|   C                     MOVELME08      SC32
|   C                     MOVELME15      SC27
|   C           SC27      CHAINMC0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELMC03      SC28
| 02-C                     END
| 01-C                     END
|    C                     MOVE *BLANKS   SC33
|    C                     MOVE *BLANKS   SC34
|    C           SC04      CHAINMD0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     Z-ADDMD18      SC09
|   C                     MOVELMD07      SC33
|   C                     MOVELMD08      SC34
| 03-C                     END
|    C                     MOVEL*ALL'*'   SC29
|    C                     MOVE SC02      SC30
|    C                     MOVEL'N'       SC35
|    C                     MOVELWB02      SC36
|    C                     MOVELWB03      SC37
|    C                     MOVEL'V'       SC38
|    C                     Z-ADDWB01      SC39
|    C                     Z-ADDDATE      SCXX
|    C                     TIME           SCYY
|    C                     MOVE $USER     SCZZ
|     *
24===C                     ENDSR
     C*==============================================================*
     C*          RTN300....PROCESS DETAIL  SOSDPF
     C*==============================================================*
25===C           RTN300    BEGSR
|    C*
|    C                     MOVELSC01      SD01
|    C                     MOVELSC02      SD02
|    C                     MOVELWB04      SD03
|    C           SD03      CHAINMA0                  40
|    C           *LOVAL    SETLLMA0
|    C   22                Z-ADDWB05      SD04
|    C   22                Z-ADDWB06      SD05
|    C  N22                Z-ADDWB08      SD04
|    C  N22                Z-ADD0         SD05
|    C                     Z-ADDWB07      SD07
| 01-C           SD04      IFNE 0
|   C           SD07      DIV  SD04      SD06
|   C           SD07      DIV  SD04      SD08
| 01*C                     ELSE
|   C                     Z-ADD0         SD06
|   C                     Z-ADD0         SD08
| 01-C                     ENDIF
|    C           KEYAA     SETGTAA0
|    C           WB04      REDPEAA0                      40
|    C  N40                Z-ADDAA04      SD15
|    C   40                Z-ADD0         SD15
|    C                     Z-ADD0         SD09
|    C                     Z-ADDWB10      SD10
|    C                     Z-ADDWB10A     SD11
|    C                     Z-ADDWB10B     SD12
|    C                     Z-ADDSD06      SD13
|    C                     Z-ADDSD06      SD14
|     *累加至頭檔
|    C                     ADD  SD07      SC12
|     *
|    C                     MOVELMA07      SD16
|    C                     MOVEL'C'       SD17
|    C                     MOVEL'C'       SD18
|    C                     Z-ADDWB01      SD19
|    C                     MOVELWB02      SD20
|    C                     MOVELWB02      SD21
|    C                     Z-ADDWB10      SD22
|    C                     Z-ADDWB10A     SD23
|    C                     Z-ADDWB10B     SD24
|    C                     Z-ADDDATE      SDXX
|    C                     TIME           SDYY
|    C                     MOVE $USER     SDZZ
|    C                     WRITESD0
|     *IMIAPF,MTMHPF,MTMAPF
|    C                     EXSR RTN320
|     *
25===C                     ENDSR
     C*==============================================================*
     C*          RTN320....PROCESS DETAIL  IMIAPF,MTMAPF,MTMDPF
     C*==============================================================*
26===C           RTN320    BEGSR
|    C*
|    C           SD04      ADD  SD05      SD045   60
|    C*IMIAPF
|    C           KEYIA     CHAINIA0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  SD04      IA06
|   C                     SUB  SD04      IA07
|   C                     SUB  SD04      IA10
|   C                     SUB  SD05      IA06
|   C                     SUB  SD05      IA07
|   C                     SUB  SD05      IA10
|   C                     Z-ADDDATE      IAXX
|   C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
|   C                     UPDATIA0
| 01-C                     ENDIF
|     *MTMAPF
|    C                     Z-ADD0         WFLD   132
|    C           SD03      CHAINMA0                  40
| 02-C           *IN40     IFEQ '0'
|   C           MA07      ANDEQ'R'
|   C                     SUB  SD045     MA30
|   C           SD045     MULT MA31      WFLD
|   C                     SUB  WFLD      MA26
|   C           SD045     MULT MA32      WFLD
|   C                     SUB  WFLD      MA27
|   C           SD045     MULT MA33      WFLD
|   C                     SUB  WFLD      MA28
|   C                     Z-ADDDATE      MAXX
|   C                     TIME           MAYY
|   C                     MOVE $USER     MAZZ
|   C                     UPDATMA0
| 02*C                     ELSE
| 03-C           MA07      IFEQ 'K'
|   C           SD03      CHAINMH0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     SUB  SD045     MA30
|   C           SD045     MULT MA31      WFLD
|   C                     SUB  WFLD      MA26
|   C           SD045     MULT MA32      WFLD
|   C                     SUB  WFLD      MA27
|   C           SD045     MULT MA33      WFLD
|   C                     SUB  WFLD      MA28
|   C                     Z-ADDDATE      MAXX
|   C                     TIME           MAYY
|   C                     MOVE $USER     MAZZ
|   C                     UPDATMH0
| 04-C                     ENDIF
| 03-C                     ENDIF
| 02-C                     ENDIF
|     *
26===C                     ENDSR
     C*==============================================================*
     C*          RTN400....PROCESS HANDING SOSCPF
     C*==============================================================*
27===C           RTN400    BEGSR
|    C*
|    C                     WRITESC0
|     *MTMDPF
|    C   22                EXSR RTN420
|     *
27===C                     ENDSR
     C*==============================================================*
     C*          RTN420....PROCESS HANDING MTMDPF
     C*==============================================================*
28===C           RTN420    BEGSR
|    C* UPDATE 客戶主檔(MTMDPF)
|    C           SC04      CHAINMD0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  SC12      MD29
|   C                     ADD  SC12      MD31
|   C                     UPDATMD0
| 01-C                     END
|     *
28===C                     ENDSR
     C*==============================================================*
     C*          RTN500....WRITESI0 SJ0
     C*==============================================================*
29===C           RTN500    BEGSR
|     *
|    C           SC02      SETLLSD0
|    C           SC02      READESD0                      47
| 01-C           *IN47     DOWEQ'0'
|    *
|   C                     MOVELSC01      SJ01
|   C                     MOVE SC02      SJ02
|   C                     MOVELSD03      SJ03
|   C                     Z-ADDSD04      SJ04
|   C                     Z-ADDSD15      SJ05
|   C           SD15      MULT SD04      SJ06
|   C           SD06      MULT SD04      SJ061     H
|   C           SD15      SUB  SD06      WFLD   132
|   C           WFLD      MULT SD04      SJ07      H
|   C           WFLD      MULT SD04      SJ071     H
|   C                     Z-ADD0         SJ08
|   C                     Z-ADD0         SJ09
|   C                     Z-ADD0         SJ091
|   C                     MOVELSD16      SJ10
|   C                     MOVELSC04      SJ11
|   C                     MOVE *BLANK    SJ12
|   C                     Z-ADD0         SJ13
|   C                     Z-ADD0         SJ14
|   C                     Z-ADD0         SJ15
|   C                     Z-ADDSC07      SJ16
|   C                     Z-ADDDATE      SJXX
|   C                     TIME           SJYY
|   C                     MOVE $USER     SJZZ
|   C                     WRITESJ0
|    *
|   C           SC02      READESD0                      47
| 01-C                     ENDDO
|     *
|    C                     MOVELSC01      SI01
|    C                     MOVE SC02      SI02
|    C                     MOVELSC33      SI03
|    C                     MOVELSC34      SI04
|    C                     MOVE *BLANK    SI05
|    C                     Z-ADDSC07      SI06
|    C                     MOVE *BLANK    SI07
|    C                     MOVE SC04      SI08
|    C                     MOVE *BLANK    SI09
|    C                     MOVE SC02      SI10
|    C*                    MOVE SE02      SI11
|    C                     MOVE *BLANK    SI11
|    C                     MOVE SC04      SI12
|    C                     MOVE *BLANK    SI13
|    C                     MOVE SC04      SI14
|    C                     MOVE *BLANK    SI15
|    C                     MOVE 'Y'       SI16
|    C                     Z-ADD3         SI17
|    C                     MOVE *BLANK    SI18
|    C                     MOVE *BLANK    SI19
|    C                     MOVE *BLANK    SI20
|    C                     Z-ADDSC07      SI21
|    C                     MOVE SC37      SI22
|    C*M002M               Z-ADDSC12      SI25
|    C*M003M               Z-ADDSC12      SI23
|    C                     Z-ADDSC12      SI25
|    C*營業稅
| 02-C           SI22      IFEQ 'D'
|   C           *NAMVAR   DEFN           DA02
|   C                     IN   DA02
|   C           DUTY      ADD  1         WRKFLD  43
|   C           SI25      DIV  WRKFLD    SI23      H
|   C           SI25      SUB  SI23      SI24
| 02*C                     ELSE
|   C                     Z-ADD0         SI24
|   C                     Z-ADDSI25      SI23
| 02-C                     END
|    C                     Z-ADD0         SI26
|    C                     Z-ADD0         SI27
|    C                     Z-ADD0         SI28
|    C*
|    C                     Z-ADDSC08      WSC08
|    C           SC14      CHAINMD0                  40
|    C           *LOVAL    SETLLMD0
| 03-C           *IN40     IFEQ '0'
| 04-C                     SELEC
|   C           MD23      WHEQ 'C'
|   C                     Z-ADDSC08      SI29
|   C           MD23      WHEQ 'D'
|   C           SC08      SUB  19110000  SC08C   60
|   C                     Z-ADD0         W6      60
|   C                     CALL 'P62'
|   C                     PARM SC08C     P6201I  60
|   C                     PARM MD25      P6202I  40
|   C           W6        PARM           P6211O  60
|   C           W6        ADD  19110000  SI29
|   C           MD23      WHEQ 'M'
| 05-C           SC08D     IFGT MD24
|   C           SC08M     ADD  1         WSC08M
| 05-C                     END
|   C                     ADD  MD26M     WSC08M
|   C*應收月份＞１２，日期更動
| 06-C           WSC08M    IFGT 12
|   C                     ADD  10000     WSC08
|   C           WSC08M    SUB  12        WSC08M
| 06-C                     END
|   C*
|   C                     MOVE WSC08Y    HB2@YY  2
|   C                     EXSR HB@24Y
|   C                     MOVE HB2@Y4    FYY4    40
|   C           FYY4      SUB  1911      W2      20
|   C                     MOVELW2        P2201I  40
|   C                     MOVE WSC08M    P2201I  40
|    *CVR0001 sev.00 Field WSC08M is not a date or year
|    *CVR0004 sev.00 Assumed to be the update of a date field in the zone
|    *   that does not contain a year
|   C*M001M               SUB  1100      P2201I
|   C                     CALL 'P22'
|   C                     PARM           P2201I
|   C                     PARM           P2201O  1
|   C                     PARM           P2202O  20
|   C*
| 07-C           MD26D     IFGT P2202O
|   C                     Z-ADDP2202O    WSC08D
| 07*C                     ELSE
|   C                     Z-ADDMD26D     WSC08D
| 07-C                     END
|   C*
|   C*M001M               Z-ADDWSC08     SI29
|   C                     MOVE WSC08     HB2@F6  6
|   C                     EXSR HB@68L
|   C                     MOVE HB2@T8    W8      80
|   C                     Z-ADDW8        SI29
| 04-C                     ENDSL
| 03-C                     END
|    C*
|    C                     Z-ADDSI25      SI30
|    C                     MOVELSC27      SI31
|    C                     MOVELSC28      SI32
|    C                     Z-ADD0         SI33
|    C                     MOVE *BLANK    SI34
|    C                     Z-ADDSC39      SI35
|    C                     Z-ADDDATE      SIXX
|    C                     TIME           SIYY
|    C                     MOVE $USER     SIZZ
|    C                     WRITESI0
29===C                     ENDSR
      *
     C/COPY HBP2CVTR
**
新增修改      刪除查詢轉檔還原
