      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      *    PROGRAM ID   : CHKIP                                      *
      *    WRITTEN BY   : A1491 EASON                                *
      *    DATE WRITTEN : 98/04/17                                   *
      *    SYSTEM       :茂世銷售                                  *
      ****************************************************************
     FW1ABPF  IF  E           K        DISK
     F*
     I           UDS
     I                                      101 110 USER
     I                                      119 1240$EGMDY
     I                                      187 1920DDATE
     I                                      201 2080$A8YMD
     I                                      501 505 $WRHUS
      *==============================================================*
      *                    *ENTRY
      *==============================================================*
      *
     C           *ENTRY    PLIST
     C                     PARM           IP     15
     C                     PARM           IPCHK   1
     C                     PARM           USERX  10
      *
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C                     CALL 'P63'
      *
     C                     EXSR RTN100                     *INITIAL
      *
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....'SC01' SCREEN MAIN ROUTINE
      *==============================================================*
01===C           RTN100    BEGSR
|     *
|    C                     MOVEL'N'       IPCHK
|    C*                    MOVEL*BLANK    USER   10
|    C*                    MOVEL$WRHUS    USER
|     *
|    C           USERX     SETLLAB0
|    C           USERX     READEAB0                      46
      *
      *不在表裡面的不作檢核
     C           *IN46     IFEQ '1'
     C                     MOVEL'Y'       IPCHK
     C                     GOTO EASON
     C                     ENDIF
      *
| 01-C           *IN46     DOWEQ'0'
|    *
| 02-C           AB02      IFEQ IP
|   C                     MOVEL'Y'       IPCHK
|   C                     GOTO EASON
| 02-C                     ENDIF
|    *
| 03-C           AB02      IFEQ '*ALL'
|   C                     MOVEL'Y'       IPCHK
|   C                     GOTO EASON
| 03-C                     ENDIF
|    *
|   C           USERX     READEAB0                      46
| 01-C                     ENDDO
|     *
|    C           EASON     TAG
|     *
01===C                     ENDSR
