     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : KIP001                                     *
     A*    AUTHOR       : A1491  EASON                               *
     A*    DATE WRITTEN : 98/04/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                          *
     A*    SUBSYSTEM    :                                          *
     A*    PROCEDURE    :銷售訂單維護 (A/U/D/I)                    *
     A*    REMARK       :                                            *
     A*===============================================================
     F* 後台訂單銷貨主檔
     FW2BAPF  UF  E           K        DISK                      A
     FW2BALF01IF  E           K        DISK
     F            BA0                               KRENAMEBA0L1
     F* 後台訂單銷貨明細檔
     FW2BBPF  UF  E           K        DISK                      A
     F* 產品主檔
     FMTMAPF  IF  E           K        DISK
     FMTMHPF  IF  E           K        DISK
     F            MA0                               KRENAMEMH0
     FIMIAPF  IF  E           K        DISK
     F* 客戶主檔
     FPA#APF  IF  E           K        DISK
     FKIP001D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     F                                        RRN3  KSFILE SFLSR3
     E*: FUNCTION DATA :
     E                    WFUN    6   6  6
     E*: A/U/D/I AUT
     E                    WA01        6  1
     E                    @EA       999  9
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      201 2080DATE
     I                                      201 2080$EG8
     I                                      501 505 $WRHUS
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I            DS
     I                                        1   60DBA01
     I                                        5   60DYY
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I              '已產生訂單號碼'    C         NUMSC
     I              '一般銷售'          C         @A1
     I              '預售訂單'          C         @A2
     I              '試飲訂單'          C         @A3
     I              '預收訂單'          C         @A4
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C                     MOVE *BLANKS   APPSCR  6
     C*
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C           *LIKE     DEFN DBA02     OBA02            *START KEY
     C           *LIKE     DEFN RRN2      @PRRN
      *  FOR SUBFILE (SYS+PGM CONTROL)
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYBA     KLIST
     C                     KFLD           DBA02
     C                     KFLD           KBGN1
     C                     KFLD           DBGN2
     C           KEYBA2    KLIST
     C                     KFLD           SBA01H
     C                     KFLD           SBA02H
     C                     KFLD           SBA03
     C           KEYBA3    KLIST
     C                     KFLD           BA01
     C                     KFLD           BA02
     C                     KFLD           BA03
     C           KEYBA4    KLIST
     C                     KFLD           BA02
     C                     KFLD           BA01
     C                     KFLD           BA03
     C           KEYBB1    KLIST
     C                     KFLD           DBA03
     C                     KFLD           SBB02H
     C           KEYPA     KLIST
     C                     KFLD           #A01S   8
     C                     KFLD           #A02
     C           KEYPA1    KLIST
     C                     KFLD           #A01W   8
     C                     KFLD           #A02
     C           KEYIA     KLIST
     C                     KFLD           DIA01   1
     C                     KFLD           DBA022
     C                     KFLD           SBB03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN310
    C           *IN07     CASEQ'1'       RTN310
    C           *IN08     CASEQ'1'       RTN310
    C*          *IN09     CASEQ'1'       RTN310
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $UPD      WA01,6
|    C                     MOVE 'SCR001'  APPSCR
|    C                     Z-ADD0         KBGN1   80
|    C                     MOVEL'R'       DIA01
|    C*
|    C                     MOVEL'STORAGE' #A01S
|    C                     MOVEL'STOCK'   #A01W
| 01-C           $WRHUS    IFEQ '*ALL '
|   C           $WRHUS    OREQ *BLANK
|   C                     SETON                     39
| 01*C                     ELSE
|   C                     SETOF                     39
|   C                     MOVEL$WRHUS    DBA02
| 01-C                     ENDIF
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C           DBA02     ORNE OBA02
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     Z-ADDDBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
|   C                     MOVE DBA02     OBA02
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN300
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C*                    SETON                     97
| 05-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     6099
|   C                     Z-ADDRRN1      DRRN1
|   C                     MOVEL'MSG0024' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 01-C                     END
|    C*
|    C   99                GOTO END180
|    C*
| 02-C           SBA05     IFEQ 'B'
|   C           DOPT1     ANDEQ'2'
|   C           SBA05     OREQ 'B'
|   C           DOPT1     ANDEQ'4'
|   C           SBA05     OREQ 'B'
|   C           DOPT1     ANDEQ'6'
|   C                     MOVEL'MSG0010' ERRID
|   C                     MOVEL'R1MF'    ERRF
|   C                     SETON                     6099
| 02-C                     ENDIF
|    C*
|    C   99                GOTO END180
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
04===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|     *
|    C                     Z-ADDDBGN1     P3101I
|    C                     CALL 'P31'
|    C                     PARM           P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           KBGN1     PARM           P31110  80
|    C*
| 01-C           KBGN1     IFEQ 0
|   C                     Z-ADD*HIVAL    KBGN1
| 01-C                     ENDIF
|    C*
| 02-C           DBA02     IFNE *BLANK
|   C                     MOVELDBA02     #A02
|   C           KEYPA     CHAIN#A0                  40
|   C  N40                MOVEL#A03      D#A03
|   C   40                MOVEL*BLANK    D#A03
| 02*C                     ELSE
|   C                     MOVEL*BLANK    D#A03
| 02-C                     ENDIF
|    C*
|    C           KEYBA     SETLLBA0L1
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
| 02-C           DBA02     IFEQ *BLANK
|   C                     READ BA0L1               N    46
| 02*C                     ELSE
|   C           DBA02     READEBA0L1               N    46
| 02-C                     ENDIF
|   C*
| 03-C           *IN46     IFEQ '0'
|   C*
|   C                     Z-ADDBA01      SBA01H
|   C                     CALL 'P31'
|   C                     PARM BA01      P31I1   80
|   C                     PARM '2'       P3112   1
|   C                     PARM '1'       P31I3   1
|   C                     PARM '3'       P31I4   1
|   C                     PARM '1'       P31I5   1
|   C           SBA01     PARM           P31IO   80
|   C                     MOVELBA03      SBA03
|   C                     MOVELBA02      SBA02H
|   C                     MOVELBA05      SBA05
|   C                     MOVELBA06      SBA06
|   C                     MOVELBA07      SBA07
|   C                     MOVELBA08      SBA08
|   C                     MOVELBA10      SBA10
|    *
| 04-C                     SELEC
|   C           BA06      WHEQ 'A1'
|   C                     MOVEL@A1       STAT1
|   C           BA06      WHEQ 'A2'
|   C                     MOVEL@A2       STAT1
|   C           BA06      WHEQ 'A3'
|   C                     MOVEL@A3       STAT1
|   C           BA06      WHEQ 'A4'
|   C                     MOVEL@A4       STAT1
| 04-C                     ENDSL
|    *
| 05-C                     SELEC
|   C           BA05      WHEQ *BLANK
|   C                     MOVEL'未上傳'STAT2
|   C           BA05      WHEQ 'B'
|   C                     MOVEL'已上傳'STAT2
| 05-C                     ENDSL
|    *
| 06-C                     SELEC
|   C           BA06      WHEQ 'A3'
|   C                     MOVEL*BLANK    #A02
|   C                     MOVELBA08      #A02
|   C           KEYPA1    CHAIN#A0                  40
|   C  N40                MOVEL#A03      STAT3
|   C   40                MOVEL*BLANK    STAT3
|   C                     OTHER
|   C                     MOVEL*BLANK    STAT3
| 06-C                     ENDSL
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 03*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 03-C                     END
|   C*
| 01-C                     ENDDO
|     *
|    C*再此多做預讀一筆的判斷，去判斷是否已到最後一筆
| 07-C           *IN46     IFEQ '0'
| 08-C           DBA02     IFEQ *BLANK
|   C                     READ BA0L1               N    46
| 08*C                     ELSE
|   C           DBA02     READEBA0L1               N    46
| 08-C                     ENDIF
|   C*在將KEY值帶回來
|   C           KEYBA4    SETLLBA0L1
| 09-C           *IN46     IFEQ '1'
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 09-C                     END
| 07-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
| 02-C           DBGN1     IFNE 0
|   C           DBA02     ORNE *BLANK
|   C                     SETON                     99    *NODATA
|   C                     MOVEL'MSG0008' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 02-C                     END
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
| 03-C           *IN39     IFEQ '1'
|   C                     SETON                     31
| 03*C                     ELSE
|   C                     SETOF                     31
|   C                     MOVEL$WRHUS    DBA02
|   C                     MOVEL$WRHUS    OBA02
| 03-C                     ENDIF
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
09===C           RTN300    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
|    C*
| 01-C           DOPT1     CASEQ'2'       RTN320           *UPD
|   C           DOPT1     CASEQ'4'       RTN330           *DLT
|   C           DOPT1     CASEQ'5'       RTN340           *INQ
|   C           DOPT1     CASEQ'6'       RTN350           上傳
| 01-C                     END
|    C   12                SETOF                     12
|    C           *LOVAL    SETLLBA0L1
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN310....ADD
     C*==============================================================*
10===C           RTN310    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE '新增'  DFUN
|    C*
|    C                     SETON                     343536
|    C                     SETON                     313233
|    C   39                SETON                     31
|    C  N39                SETOF                     31
| 01-C  N39                DO
|   C                     MOVEL$WRHUS    DBA022
|   C                     MOVELDBA022    #A02
|   C           KEYPA     CHAIN#A0                  40
| 02-C           *IN40     IFEQ *OFF
|   C                     MOVEL#A03      D#A032
| 02-C                     ENDIF
| 01-C                     ENDDO
|    C*
|    C                     EXSR RTN389                     *INT SFLSR
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN397                     *READ BLANK
|    C*
| 03-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|    *
|   C                     EXSR RTN351
|    *
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 04-C           *IN03     IFEQ '0'
| 05-C           *IN12     IFEQ '0'
|   C*
| 06-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 06-C                     END
|   C*
|   C*
| 07-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C                     EXSR RTN39S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
|   C                     SETON                     97
| 07-C                     END
|   C*
| 05*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END                             *IN03 ENDIF
| 04-C                     END                             *IN12 ENDIF
|   C*
| 03-C                     END                             *ENDDO
|    C* N12                Z-ADDRRN1      HRRN1
|    C*  12                SETOF                     12
|    C                     EXSR RTN191
|    C                     EXSR RTN192
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN320....UPD DATA --- SFLSR
     C*==============================================================*
11===C           RTN320    BEGSR
|    C*
|    C                     SETON                     333435
|    C                     SETOF                     313236
|    C                     EXSR RTN390                     *INT SFLSR
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA
|    C                     EXSR RTN397                     *READ BLANK
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|    *
|   C                     EXSR RTN351
|    *
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C                     EXSR RTN39S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
|   C                     SETON                     92
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          RTN330....DEL DATA --- SFLSR2
     C*==============================================================*
12===C           RTN330    BEGSR
|    C*
|    C                     SETOF                     313233
|    C                     SETOF                     343536*NO INPUT
|    C                     EXSR RTN390                     *INT SFLSR
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|    *
|   C                     EXSR RTN351
|    *
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 05-C           DLTFLG    IFEQ 'Y'
|   C                     EXSR RTN39T                      DLT D
|   C                     SETON                     93
| 05-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN12 ENDIF
| 02-C                     END                             *IN03 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR2
     C*==============================================================*
13===C           RTN340    BEGSR
|    C*
|    C                     SETOF                     313233*NO INPUT
|    C                     SETOF                     343536*NO INPUT
|    C                     EXSR RTN390                     *INT SFLSR
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|    *
|   C                     EXSR RTN351
|    *
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN99     IFEQ '0'                         SAVE
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN12 ENDIF
| 02-C                     END                             *IN03 ENDIF
|   C                     SETON                     94
|   C*
| 01-C                     END                             *ENDDO
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          RTN350....上傳
     C*==============================================================*
14===C           RTN350    BEGSR
|    C*
|    C           KEYBA2    CHAINBA0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL'B'       BA05
|   C                     Z-ADDDATE      BAXX
|   C                     TIME           BAYY
|   C                     MOVEL$USER     BAZZ
|   C                     UPDATBA0
|   C*
|   C           SBA03     SETLLBB0
|   C           SBA03     READEBB0                      41
| 02-C           *IN41     DOWEQ'0'
| 03-C           BB09      IFEQ *BLANK
|   C                     MOVEL'B'       BB09
|   C                     Z-ADDDATE      BBXX
|   C                     TIME           BBYY
|   C                     MOVEL$USER     BBZZ
|   C                     UPDATBB0
| 03-C                     ENDIF
|   C           SBA03     READEBB0                      41
| 02-C                     ENDDO
| 01-C                     ENDIF
|     *
|     *
14===C                     ENDSR
     C*==============================================================*
     C*          RTN351....決定使用畫面
     C*==============================================================*
15===C           RTN351    BEGSR
|     *
| 01-C                     SELEC
|   C           DBA06     WHEQ 'A1'
|   C                     SETON                     86
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C           DBA06     WHEQ 'A2'
|   C                     SETON                     87
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C           DBA06     WHEQ 'A3'
|   C                     SETON                     88
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR3
|   C           DBA06     WHEQ 'A4'
|   C                     SETON                     89
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR3
| 01-C                     ENDSL
|     *
15===C                     ENDSR
     C*==============================================================*
     C*          RTN380....CHECK 'SC03' --- SFLSR
     C*==============================================================*
16===C           RTN380    BEGSR
|     *
|     *先將SFL燈號還原
| 01-C           DBA06     IFEQ 'A1'
|   C           DBA06     OREQ 'A2'
|   C                     SETON                     54
|   C                     READCSFLSR2                 5757
|   C*
| 02-C           *IN57     DOWEQ'0'
|   C                     SETOF                     616271
|   C                     SETOF                     727374
|   C                     SETOF                     75
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 02-C                     END
| 01*C                     ELSE
|    *
| 03-C                     SELEC
|   C           DBA06     WHEQ 'A3'
|   C                     SETON                     78
|   C                     SETOF                     7934
|   C           DBA06     WHEQ 'A4'
|   C                     SETON                     79
|   C                     SETOF                     7835
|   C                     OTHER
|   C                     SETOF                     7879
| 03-C                     ENDSL
|    *
|   C                     SETON                     54
|   C                     READCSFLSR3                 5757
|   C*
| 04-C           *IN57     DOWEQ'0'
|   C                     SETOF                     616271
|   C                     SETOF                     727374
|   C                     SETOF                     75
|   C                     UPDATSFLSR3
|   C                     READCSFLSR3                   57
|   C* READC DOW LOOP
| 04-C                     END
| 01-C                     ENDIF
|     *
| 05-C           DBA022    IFEQ *BLANK
|   C                     SETON                     6199
|   C                     MOVEL'MSG0001' ERRID
|   C                     MOVEL'R1MF'    ERRF
|   C                     MOVEL*BLANK    D#A032
| 05*C                     ELSE
|   C                     MOVELDBA022    #A02
|   C           KEYPA     CHAIN#A0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     SETON                     6199
|   C                     MOVEL'MSG0006' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 06*C                     ELSE
|   C                     MOVEL#A03      D#A032
| 06-C                     ENDIF
| 05-C                     ENDIF
|    C   99                GOTO END380
|     *
| 07-C           DBA01     IFEQ 0
|   C                     SETON                     6299
|   C                     MOVEL'MSG0002' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 07*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DBA01     P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 08-C           P3011O    IFEQ 'N'
|   C                     SETON                     6299
|   C                     MOVEL'MSG0003' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 08-C                     ENDIF
| 07-C                     ENDIF
|    C   99                GOTO END380
|    C*
| 09-C           DBA06     IFEQ 'A3'
| 10-C           DBA08     IFEQ *BLANK
|   C                     SETON                     6399
|   C                     MOVEL'MSG0001' ERRID
|   C                     MOVEL'R1MF'    ERRF
|   C                     MOVEL*BLANK    DBA08W
| 10*C                     ELSE
|   C                     MOVEL*BLANK    #A02
|   C                     MOVELDBA08     #A02
|   C           KEYPA1    CHAIN#A0                  40
| 11-C           *IN40     IFEQ '1'
|   C                     SETON                     6399
|   C                     MOVEL'MSG0006' ERRID
|   C                     MOVEL'R1MF'    ERRF
|   C                     MOVEL*BLANK    DBA08W
| 11*C                     ELSE
|   C                     MOVEL#A03      DBA08W
| 11-C                     ENDIF
| 10-C                     ENDIF
| 09-C                     ENDIF
|    C   99                GOTO END380
|    C*
| 12-C           DBA06     IFEQ 'A1'
|   C           DBA06     OREQ 'A2'
|   C*
|   C*CHK SCREEN
|   C                     Z-ADD0         K       30
|   C                     MOVE *BLANKS   @EA
|    *
|   C                     Z-ADD0         CKFLD   10
|   C                     Z-ADD0         TOTAL
|   C                     SETON                     54
|   C                     READCSFLSR2                 5757
|   C*
| 13-C           *IN57     DOWEQ'0'
|   C*
|   C                     SETOF                     616271
|   C                     SETOF                     727374
|   C                     SETOF                     75
|   C*沒有資料的欄位清空
| 14-C           SBB03     IFEQ *BLANK
|   C           SBB03H    ANDEQ*BLANK
|   C                     EXSR RTN39A
|   C                     GOTO UPD
| 14-C                     ENDIF
|   C*沒有資料的欄位清空
| 15-C           SBB03     IFEQ *BLANK
|   C           SBB03H    ANDNE*BLANK
|   C                     MOVEL*BLANKS   SBB03
|   C                     MOVEL*BLANKS   SMA03
|   C                     Z-ADD0         SBB04
|   C                     Z-ADD0         SBB05
|   C                     Z-ADD0         SBB07
|   C                     GOTO UPD
| 15-C                     ENDIF
|    *確認有一筆資料
|   C                     Z-ADD1         CKFLD
|   C   99                GOTO UPD
|    *新增或修改時產品必須要存在代碼檔中
| 16-C           SBB03     IFNE *BLANK
|   C           SBB03     CHAINMA0                  40
| 17-C           *IN40     IFEQ '1'
|   C                     SETON                     7199
|   C                     MOVEL'MSG0006' ERRID
|   C                     MOVEL'R1MF'    ERRF
|   C                     MOVEL*BLANK    SMA03
| 17*C                     ELSE
|   C                     MOVELMA03      SMA03
| 17-C                     ENDIF
| 16-C                     ENDIF
|   C   99                GOTO DSP
|    *產品無任何銷售數量或金額
| 18-C           SBB03     IFNE *BLANK
|   C           SBB04     ANDEQ0
|   C           SBB05     ANDEQ0
|   C                     SETON                     729974
|   C                     MOVEL'MSG0022' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 18-C                     ENDIF
|   C   99                GOTO DSP
|    *檢核庫存量
| 19-C           DBA06     IFEQ 'A1'
|   C                     Z-ADD0         XXXX
|   C           KEYIA     CHAINIA0                  40
| 20-C           *IN40     IFEQ '0'
|   C           SBB04     ADD  SBB05     XXXX    90
|   C                     ADD  SBB06     XXXX    90
| 21-C           XXXX      IFGT IA10
|   C                     SETON                     729974
|   C                     MOVEL'MSG0020' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 21-C                     ENDIF
| 20*C                     ELSE
|   C                     SETON                     729974
|   C                     MOVEL'MSG0020' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 20-C                     ENDIF
| 19-C                     ENDIF
|   C   99                GOTO DSP
|    *
|   C                     ADD  SBB07     TOTAL
|    *
|   C           DSP       TAG
|   C   99                Z-ADDRRN2      DRRN2
|   C*
|   C           UPD       TAG
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 13-C                     END
| 12*C                     ELSE
|   C*
|   C*CHK SCREEN
|    *
|   C                     Z-ADD0         CKFLD   10
|   C                     SETON                     54
|   C                     READCSFLSR3                 5757
|   C*
| 22-C           *IN57     DOWEQ'0'
|   C*
|   C                     SETOF                     616271
|   C                     SETOF                     727374
|   C                     SETOF                     75
|   C*沒有資料的欄位清空
| 23-C           SBB03     IFEQ *BLANK
|   C           SBB03H    ANDEQ*BLANK
|   C                     EXSR RTN39A
|   C                     GOTO UPD1
| 23-C                     ENDIF
|   C*沒有資料的欄位清空
| 24-C           SBB03     IFEQ *BLANK
|   C           SBB03H    ANDNE*BLANK
|   C                     MOVEL*BLANKS   SBB03
|   C                     MOVEL*BLANKS   SMA03
|   C                     Z-ADD0         SBB04
|   C                     Z-ADD0         SBB05
|   C                     Z-ADD0         SBB07
|   C                     GOTO UPD1
| 24-C                     ENDIF
|    *確認有一筆資料
|   C                     Z-ADD1         CKFLD
|   C   99                GOTO UPD1
|    *新增或修改時產品必須要存在代碼檔中
| 25-C           SBB03     IFNE *BLANK
|   C           SBB03     CHAINMA0                  40
| 26-C           *IN40     IFEQ '1'
|   C                     SETON                     7199
|   C                     MOVEL'MSG0006' ERRID
|   C                     MOVEL'R1MF'    ERRF
|   C                     MOVEL*BLANK    SMA03
| 26*C                     ELSE
|   C                     MOVELMA03      SMA03
| 26-C                     ENDIF
| 25-C                     ENDIF
|   C   99                GOTO DSP1
|    *產品無任何試飲數量
| 27-C           DBA06     IFEQ 'A3'
| 28-C           SBB03     IFNE *BLANK
|   C           SBB06     ANDEQ0
|   C                     SETON                     7599
|   C                     MOVEL'MSG0023' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 28-C                     ENDIF
| 27-C                     ENDIF
|   C   99                GOTO DSP1
|    *檢核庫存量
| 29-C           DBA06     IFEQ 'A3'
|   C                     Z-ADD0         XXXX
|   C           KEYIA     CHAINIA0                  40
| 30-C           *IN40     IFEQ '0'
|   C           SBB04     ADD  SBB05     XXXX    90
|   C                     ADD  SBB06     XXXX    90
| 31-C           XXXX      IFGT IA10
|   C                     SETON                     7599
|   C                     MOVEL'MSG0020' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 31-C                     ENDIF
| 30*C                     ELSE
|   C                     SETON                     7599
|   C                     MOVEL'MSG0020' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 30-C                     ENDIF
| 29-C                     ENDIF
|   C   99                GOTO DSP1
|    *
|   C                     ADD  SBB07     TOTAL
|    *
|   C           DSP1      TAG
|   C   99                Z-ADDRRN3      DRRN3
|   C*
|   C           UPD1      TAG
|   C                     UPDATSFLSR3
|   C                     READCSFLSR3                   57
|   C* READC DOW LOOP
| 22-C                     END
| 12-C                     ENDIF
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 32-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 32-C                     END
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 33-C           DBA06     IFEQ 'A1'
|   C           DBA06     OREQ 'A2'
| 34-C           CKFLD     IFEQ 0
|   C                     MOVEL'MSG0011' ERRID
|   C                     MOVEL'R1MF'    ERRF
|   C                     Z-ADD1         RRN2
|   C           RRN2      CHAINSFLSR2               40
|   C                     SETON                     7199
|   C  N40                UPDATSFLSR2
| 34-C                     END
|   C   99                GOTO END380
| 33*C                     ELSE
| 35-C           DBA06     IFNE 'A4'
| 36-C           CKFLD     IFEQ 0
|   C                     MOVEL'MSG0011' ERRID
|   C                     MOVEL'R1MF'    ERRF
|   C                     Z-ADD1         RRN3
|   C           RRN3      CHAINSFLSR3               40
|   C                     SETON                     7199
|   C  N40                UPDATSFLSR3
| 36-C                     END
| 35-C                     END
|   C   99                GOTO END380
| 33-C                     ENDIF
|    C*
16===C           END380    ENDSR
     C*==============================================================*
     C*          RTN381....F4 --- SFLSR
     C*==============================================================*
17===C           RTN381    BEGSR
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           DBA06     IFEQ 'A3'
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE13
|   C           D#COL     ANDLE14
|   C                     CALL 'SWD012'
|   C                     PARM 'STOCK'   PARMA   8
|   C           DBA08     PARM DBA08     PARMB  10
| 02-C                     END
| 01-C                     END
|    C*該部分為計算SFL
| 03-C           D#ROW     IFLT @SFTOP
|   C           D#ROW     ORGT @SFBOT
|   C                     GOTO END381
| 03-C                     END
|    C*
|     * GET SFL REC
|    C           D#ROW     SUB  @SFTOP    @PRRN
|    C           @PRRN     DIV  @LNUM     @PRRN
|    C                     MVR            @LINE   20
|    C*
|    C                     ADD  1         @LINE
|    C                     ADD  #DRRN     @PRRN
|     *
| 04-C           DBA06     IFEQ 'A1'
|   C           DBA06     OREQ 'A2'
|    *
|   C           @PRRN     CHAINSFLSR2               40
|   C   40                GOTO END381
|   C*
| 05-C           @LINE     IFEQ 1
|   C           D#COL     ANDGE2
|   C           D#COL     ANDLE10
|   C                     CALL 'SWD011'
|   C           SBB03     PARM SBB03     PARM1   9
|   C           SMA03     PARM           PARM2  18
| 05-C                     END
|    *
| 06-C           SBB03     IFNE *BLANK
|   C                     Z-ADD36        D#COL
| 06-C                     ENDIF
|    *
|    * UPD SFL
|   C                     SETON                     54
|   C                     Z-ADDRRN2      DRRN2
|   C                     UPDATSFLSR2
|    *
| 04*C                     ELSE
|    *
|   C           @PRRN     CHAINSFLSR3               40
|   C   40                GOTO END381
|   C*
|    *
| 07-C           @LINE     IFEQ 1
|   C           D#COL     ANDGE2
|   C           D#COL     ANDLE10
|   C                     CALL 'SWD011'
|   C           SBB03     PARM SBB03     PARM1   9
|   C           SMA03     PARM           PARM2  18
| 07-C                     END
|    *
| 08-C           DBA06     IFEQ 'A3'
| 09-C           SBB03     IFNE *BLANK
|   C                     Z-ADD46        D#COL
| 09-C                     ENDIF
| 08-C                     ENDIF
|    *
| 10-C           DBA06     IFEQ 'A4'
| 11-C           SBB03     IFNE *BLANK
|   C                     Z-ADD36        D#COL
| 11-C                     ENDIF
| 10-C                     ENDIF
|    *
|    * UPD SFL
|   C                     SETON                     54
|   C                     Z-ADDRRN3      DRRN3
|   C                     UPDATSFLSR3
|    *
| 04-C                     ENDIF
|    C*
|    C           END381    TAG
|     *離開時因為燈號99會亮，所以控制清空之前的訊息
|    C                     SETON                     99
|    C                     MOVEL*BLANK    ERRID
|    C                     MOVEL*BLANK    ERRF
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          RTN389....搬值給第2各畫面需要的KEY值- ADD
     C*==============================================================*
18===C           RTN389    BEGSR
|    C*
|    C                     Z-ADD$EGMDY    DBA01
|    C*                    MOVELSBA02H    DBA022
|    C   39                MOVEL*BLANK    DBA022
|    C                     MOVEL*BLANK    D#A032
|    C                     MOVEL*BLANK    DBA03
|    C                     MOVEL*BLANK    DBA06
|    C                     MOVEL*BLANK    DBA08W
|    C                     MOVEL*BLANK    DBA10
|     *
| 01-C                     SELEC
|   C           *IN06     WHEQ '1'
|   C                     MOVEL'A1'      DBA06
|   C           *IN07     WHEQ '1'
|   C                     MOVEL'A3'      DBA06
|   C           *IN08     WHEQ '1'
|   C                     MOVEL'A2'      DBA06
|   C*          *IN09     WHEQ '1'
|   C*                    MOVEL'A4'      DBA06
| 01-C                     ENDSL
|     *
|    C                     MOVEL*BLANK    DBA06W
| 02-C                     SELEC
|   C           DBA06     WHEQ 'A1'
|   C                     MOVEL@A1       DBA06W
|   C           DBA06     WHEQ 'A2'
|   C                     MOVEL@A2       DBA06W
|   C           DBA06     WHEQ 'A3'
|   C                     MOVEL@A3       DBA06W
|   C           DBA06     WHEQ 'A4'
|   C                     MOVEL@A4       DBA06W
| 02-C                     ENDSL
|     *
|    C                     MOVEL*BLANK    DBA07
|    C                     MOVEL*BLANK    DBA08
|    C                     Z-ADD0         TOTAL
|    C*
|    C                     MOVELDBA022    #A02
|    C           KEYPA     CHAIN#A0                  40
|    C  N40                MOVEL#A03      D#A032
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          RTN390....搬值給第2各畫面需要的KEY值- UPD&DEL
     C*==============================================================*
19===C           RTN390    BEGSR
|    C*
|    C                     Z-ADDSBA01     DBA01
|    C                     MOVELSBA02H    DBA022
|    C                     MOVEL*BLANK    D#A032
|    C                     MOVELSBA03     DBA03
|    C                     MOVELSBA06     DBA06
|     *
|    C                     MOVEL*BLANK    DBA06W
| 01-C                     SELEC
|   C           DBA06     WHEQ 'A1'
|   C                     MOVEL@A1       DBA06W
|   C           DBA06     WHEQ 'A2'
|   C                     MOVEL@A2       DBA06W
|   C           DBA06     WHEQ 'A3'
|   C                     MOVEL@A3       DBA06W
|   C           DBA06     WHEQ 'A4'
|   C                     MOVEL@A4       DBA06W
| 01-C                     ENDSL
|     *
|    C                     MOVELSBA07     DBA07
|    C                     MOVELSBA08     DBA08
|    C                     MOVELSBA10     DBA10
|    C                     MOVEL*BLANK    #A02
|    C                     MOVELDBA08     #A02
|    C           KEYPA1    CHAIN#A0                  40
|    C  N40                MOVEL#A03      DBA08W
|    C*
|    C                     MOVELDBA022    #A02
|    C           KEYPA     CHAIN#A0                  40
|    C  N40                MOVEL#A03      D#A032
|    C                     MOVELSBA10     DBA10
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          RTN391....INIT 'SC03' -- SFLSR2
     C*==============================================================*
20===C           RTN391    BEGSR
|    C*
|     *
| 01-C           DBA06     IFEQ 'A1'
|   C           DBA06     OREQ 'A2'
|   C                     Z-ADD1         DRRN2
|   C                     Z-ADD0         WRRN2   40
|   C                     Z-ADD0         RRN2
|   C                     Z-ADD999       DSPRC2  40
|   C                     Z-ADD10        WPRCD2  40       *PAG RCD
|   C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|   C*
|   C                     Z-ADD11        @SFTOP  20
|   C                     Z-ADD20        @SFBOT  20
|   C                     Z-ADD1         @LNUM   20
|   C*
|   C                     SETON                     52    *SFLCLR
|   C                     WRITESFLCR2
|    *
|   C                     SETOF                     525053
|   C                     SETON                     51    *SFLDSPCTL
| 01*C                     ELSE
|   C                     Z-ADD1         DRRN3
|   C                     Z-ADD0         WRRN3   40
|   C                     Z-ADD0         RRN3
|   C                     Z-ADD999       DSPRC3  40
|   C                     Z-ADD10        WPRCD3  40       *PAG RCD
|   C                     MOVE 'N'       WBOTM3  1        *BOTTOM
|   C*
|   C                     Z-ADD11        @SFTOP  20
|   C                     Z-ADD20        @SFBOT  20
|   C                     Z-ADD1         @LNUM   20
|   C*
|   C                     SETON                     52    *SFLCLR
|   C                     WRITESFLCR3
|    *
|   C                     SETOF                     525053
|   C                     SETON                     51    *SFLDSPCTL
| 01-C                     ENDIF
|    C*
|    C           DBA03     SETLLBB0
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN397....FILE TO SCREEN --- SFLSR(FOR ADD OR UPD)
     C*==============================================================*
21===C           RTN397    BEGSR
|     *
| 01-C                     SELEC
|   C           DBA06     WHEQ 'A3'
|   C                     SETON                     78
|   C                     SETOF                     7934
|   C           DBA06     WHEQ 'A4'
|   C                     SETON                     79
|   C                     SETOF                     7835
|   C                     OTHER
|   C                     SETOF                     7879
| 01-C                     ENDSL
|    C*
|    C                     SETOF                     54    *45 FOR BLANK LOOP
|    C                     SETON                     32
|    C                     EXSR RTN39A                     *INIT SFLDTA
|    C*
| 02-C           DBA06     IFEQ 'A1'
|   C           DBA06     OREQ 'A2'
| 03-C           RRN2      DOWLTDSPRC2
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
| 03-C                     END
| 02*C                     ELSE
| 04-C           RRN3      DOWLTDSPRC3
|   C                     ADD  1         RRN3
|   C                     WRITESFLSR3
| 04-C                     END
| 02-C                     ENDIF
|    C*
|    C                     SETON                     5053
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          RTN398....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
22===C           RTN398    BEGSR
|     *
|    C                     SETON                     54
|    C                     Z-ADD*ZERO     TOTAL
|     *
| 01-C                     SELEC
|   C           DBA06     WHEQ 'A3'
|   C                     SETON                     78
|   C                     SETOF                     7934
|   C           DBA06     WHEQ 'A4'
|   C                     SETON                     79
|   C                     SETOF                     7835
|   C                     OTHER
|   C                     SETOF                     7879
| 01-C                     ENDSL
|     *
|    C           DBA03     READEBB0                 N    44*NF/EOF
|    C*
| 02-C           *IN44     DOWEQ'0'
| 03-C           BB09      IFEQ *BLANK
|   C           BB09      OREQ 'B'
|   C                     EXSR RTN39B
| 04-C           DBA06     IFEQ 'A1'
|   C           DBA06     OREQ 'A2'
|   C                     ADD  1         RRN2
|   C                     ADD  SBB07     TOTAL
|   C                     WRITESFLSR2
| 04*C                     ELSE
|   C                     ADD  1         RRN3
|   C                     WRITESFLSR3
| 04-C                     ENDIF
| 03-C                     ENDIF
|   C           DBA03     READEBB0                 N    44*NF/EOF
| 02-C                     END
|    C*
|    C                     SETON                     53
| 05-C           DBA06     IFEQ 'A1'
|   C           DBA06     OREQ 'A2'
|   C                     Z-ADDRRN2      WRRN2      50
| 05*C                     ELSE
|   C                     Z-ADDRRN3      WRRN3      50
| 05-C                     ENDIF
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          RTN39A....INIT 'SC03' -- SFLSR(DTA)
     C*==============================================================*
23===C           RTN39A    BEGSR
|    C*
|    C                     Z-ADD0         SBB02H
|    C                     MOVEL*BLANKS   SBB03
|    C                     MOVEL*BLANKS   SBB03H
|    C                     MOVEL*BLANKS   SMA03
|    C                     Z-ADD0         SBB04
|    C                     Z-ADD0         SBB05
|    C                     Z-ADD0         SBB06
|    C                     Z-ADD0         SBB07
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*          RTN39B....FILE TO SCREEN --- MOVE
     C*==============================================================*
24===C           RTN39B    BEGSR
|     *
|    C                     Z-ADDBB02      SBB02H
|    C                     MOVELBB03      SBB03
|    C                     MOVELBB03      SBB03H
|    C                     MOVEL*BLANK    SMA03
|    C           BB03      CHAINMA0                  40
|    C  N40                MOVELMA03      SMA03
|    C                     Z-ADDBB04      SBB04
|    C                     Z-ADDBB05      SBB05
|    C                     Z-ADDBB06      SBB06
|    C                     Z-ADDBB07      SBB07
|     *
24===C                     ENDSR
     C*==============================================================*
     C*          RTN39C....SCREEN TO FILE --- H
     C*==============================================================*
25===C           RTN39C    BEGSR
|    C*
|    C                     MOVELDBA03     BB01
|    C                     Z-ADDSBB02H    BB02
|    C                     MOVELSBB03     BB03
|    C                     Z-ADDSBB04     BB04
|    C                     Z-ADDSBB05     BB05
|    C                     Z-ADDSBB06     BB06
|    C                     Z-ADDSBB07     BB07
|     *
|    C           BB03      CHAINMA0                  40
| 01-C           *IN40     IFEQ '0'
| 02-C           MA07      IFEQ 'R'
|   C                     Z-ADDMA31      BB08
|   C                     Z-ADDMA32      BB08A
|   C                     Z-ADDMA33      BB08B
| 02*C                     ELSE
|   C           BB03      CHAINMH0                  41
|   C  N41                Z-ADDMA31      BB08
|   C  N41                Z-ADDMA32      BB08A
|   C  N41                Z-ADDMA33      BB08B
|   C   41                Z-ADD0         BB08
|   C   41                Z-ADD0         BB08A
|   C   41                Z-ADD0         BB08B
| 02-C                     ENDIF
| 01-C                     ENDIF
|     *
|    C                     MOVEL*BLANK    BB09
|    C                     MOVEL*BLANK    BB10
|    C                     MOVEL*BLANK    BB11
|    C           BB03      CHAINMA0                  40
|    C  N40                MOVELMA59      BB11
|    C                     Z-ADDDATE      BBXX
|    C                     TIME           BBYY
|    C                     MOVEL$USER     BBZZ
|    C*
25===C                     ENDSR
     C*==============================================================*
     C*          RTN39D....SCREEN TO FILE --- H
     C*==============================================================*
26===C           RTN39D    BEGSR
|     *
|    C                     MOVELDBA022    BA02
|    C                     CALL 'P31'
|    C                     PARM DBA01     P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           BA01      PARM           P31110  80
|    C                     MOVELDBA03     BA03
|    C           KEYBA3    CHAINBA0                  40
|    C*
|    C                     Z-ADD0         TT     152
|    C           DBA03     SETLLBB0
|    C           DBA03     READEBB0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     ADD  BB07      TT
|   C           DBA03     READEBB0                      46
| 01-C                     ENDDO
|    C                     Z-ADDTT        BA04
|    C                     MOVEL*BLANK    BA05
|    C                     MOVELDBA06     BA06
|    C                     MOVELDBA07     BA07
|    C                     MOVELDBA08     BA08
|    C                     MOVEL*BLANK    BA09
|    C                     MOVELDBA10     BA10
|    C                     Z-ADDDATE      BAXX
|    C                     TIME           BAYY
|    C                     MOVEL$USER     BAZZ
|    C   40                WRITEBA0
|    C  N40                UPDATBA0
|     *
|    C   40                SETON                     91
|    C  N40                SETON                     92
|    C           NUMSC     CAT  BA03:1    @MSG   60
|     *
26===C                     ENDSR
     C*==============================================================*
     C*          RTN39S....SAVE D
     C*==============================================================*
27===C           RTN39S    BEGSR
|     *
|     *新增時取號
|     *
| 01-C           *IN06     IFEQ '1'
|   C                     CALL 'RES003'
|   C                     PARM 'R1'      S003I1  2
|   C                     PARM 'A1'      S003I2  2
|   C                     PARM DYY       S003I3  20
|   C           BA03      PARM           S003O1 12
|   C                     MOVELBA03      DBA03
| 01-C                     ENDIF
|     *
| 02-C           *IN07     IFEQ '1'
|   C                     CALL 'RES003'
|   C                     PARM 'R1'      S003I1  2
|   C                     PARM 'A3'      S003I2  2
|   C                     PARM DYY       S003I3  20
|   C           BA03      PARM           S003O1 12
|   C                     MOVELBA03      DBA03
| 02-C                     ENDIF
|    C*
|     *
| 03-C           *IN08     IFEQ '1'
|   C                     CALL 'RES003'
|   C                     PARM 'R1'      S003I1  2
|   C                     PARM 'A2'      S003I2  2
|   C                     PARM DYY       S003I3  20
|   C           BA03      PARM           S003O1 12
|   C                     MOVELBA03      DBA03
| 03-C                     ENDIF
|     *
|    C*          *IN09     IFEQ '1'
|    C*                    CALL 'RES003'
|    C*                    PARM 'R1'      S003I1  2
|    C*                    PARM 'A4'      S003I2  2
|    C*                    PARM DYY       S003I3  20
|    C*          BA03      PARM           S003O1 12
|    C*                    MOVELBA03      DBA03
|    C*                    ENDIF
|    C*
| 04-C           DBA06     IFEQ 'A1'
|   C           DBA06     OREQ 'A2'
|   C                     Z-ADD0         TOTAL
|   C*
|   C                     SETON                     54
|   C                     READCSFLSR2                 5757
| 05-C           *IN57     DOWEQ'0'
|   C*
| 06-C           SBB02H    IFEQ 0
|   C           DBA03     SETGTBB0
|   C           DBA03     REDPEBB0                      46
| 07-C           *IN46     IFEQ '1'
|   C                     Z-ADD1         SBB02H
| 07*C                     ELSE
|   C           BB02      ADD  1         SBB02H
| 07-C                     ENDIF
| 06-C                     ENDIF
|   C*新增&修改
| 08-C           SBB03     IFNE *BLANK
|   C           KEYBB1    CHAINBB0                  40
| 09-C           *IN40     IFEQ '0'
|   C                     EXSR RTN39C
|   C                     UPDATBB0
| 09*C                     ELSE
|   C                     EXSR RTN39C
|   C                     WRITEBB0
| 09-C                     ENDIF
| 08-C                     END
|    *
|   C                     ADD  SBB07     TOTAL
|    *
|   C*刪除
| 10-C           SBB03     IFEQ *BLANK
|   C           SBB03H    ANDNE*BLANK
|   C           KEYBB1    CHAINBB0                  40
| 11-C           *IN40     IFEQ '0'
|   C                     DELETBB0
| 11-C                     END
| 10-C                     END
|   C*
|   C                     READCSFLSR2                   57
| 05-C                     END
| 04*C                     ELSE
|   C*
|   C                     Z-ADD0         TOTAL
|   C                     SETON                     54
|   C                     READCSFLSR3                 5757
| 12-C           *IN57     DOWEQ'0'
|   C*
| 13-C           SBB02H    IFEQ 0
|   C           DBA03     SETGTBB0
|   C           DBA03     REDPEBB0                      46
| 14-C           *IN46     IFEQ '1'
|   C                     Z-ADD1         SBB02H
| 14*C                     ELSE
|   C           BB02      ADD  1         SBB02H
| 14-C                     ENDIF
| 13-C                     ENDIF
|   C*新增&修改
| 15-C           SBB03     IFNE *BLANK
|   C           KEYBB1    CHAINBB0                  40
| 16-C           *IN40     IFEQ '0'
|   C                     EXSR RTN39C
|   C                     UPDATBB0
| 16*C                     ELSE
|   C                     EXSR RTN39C
|   C                     WRITEBB0
| 16-C                     ENDIF
| 15-C                     END
|    *
|   C*刪除
| 17-C           SBB03     IFEQ *BLANK
|   C           SBB03H    ANDNE*BLANK
|   C           KEYBB1    CHAINBB0                  40
| 18-C           *IN40     IFEQ '0'
|   C                     DELETBB0
| 18-C                     END
| 17-C                     END
|   C*
|   C                     READCSFLSR3                   57
| 12-C                     END
| 04-C                     ENDIF
|     *
|     *****************************
|     *         WRITE BA0         *
|     *****************************
|     *
|    C                     EXSR RTN39D
|     *
27===C                     ENDSR
     C*==============================================================*
     C*          RTN39T....DLT D
     C*==============================================================*
28===C           RTN39T    BEGSR
|    C*
|    C           DBA03     SETLLBB0
|    C           DBA03     READEBB0                      44
| 01-C           *IN44     DOWEQ'0'
| 02-C           BB09      IFEQ 'B'
|   C           BB09      OREQ *BLANK
|   C                     DELETBB0
| 02-C                     ENDIF
|   C           DBA03     READEBB0                      44
| 01-C                     ENDDO
|    C*
|    C           DBA03     CHAINBB0                  40
|    C*
| 03-C           *IN40     IFEQ '1'
|   C           KEYBA2    CHAINBA0                  44
| 04-C           *IN44     IFEQ '0'
|   C                     DELETBA0
|   C                     SETON                     93
| 04-C                     ENDIF
| 03-C                     ENDIF
|     *
|     *檢查是否為轉檔後再還原，只為了刪除一筆資料
|     *
|    C                     MOVEL*BLANK    XCHK    1
|     *
|     *先檢查是否有資料
|    C           DBA03     CHAINBB0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     MOVEL'Y'       XCHK
| 05-C                     ENDIF
|     *再進到迴圈檢查狀態碼是否都為"P"
|    C           DBA03     SETLLBB0
|    C           DBA03     READEBB0                      46
| 06-C           *IN46     DOWEQ'0'
| 07-C           BB09      IFNE 'P'
|   C                     MOVEL'N'       XCHK
| 07-C                     ENDIF
|   C           DBA03     READEBB0                      46
| 06-C                     ENDDO
|    C*
| 08-C           XCHK      IFEQ 'Y'
|   C           KEYBA2    CHAINBA0                  44
| 09-C           *IN44     IFEQ '0'
|   C                     MOVEL'P'       BA05
|   C                     UPDATBA0
| 09-C                     ENDIF
| 08-C                     ENDIF
|    C*
28===C                     ENDSR
**
新增修改      刪除查詢上傳
