     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : KIP007                                     *
     A*    AUTHOR       : A1492  TERRY                               *
     A*    DATE WRITTEN : 98/04/16                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :茂世進銷存                                *
     A*    SUBSYSTEM    :                                          *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :  RTN='E0'-資料正確                       *
     A*                    RTN='E1'-無牌價資料                     *
     A*                    RTN='E2'-超過金額上限                   *
     A*                    RTN='E3'-超過金額下限                   *
     A*===============================================================
      *
     FW1AALF01IF  E           K        DISK
     E*
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      201 2080DATE
     I                                      201 2080$EG8
     I                                      501 505 $WRHUS
     IKIP01       DS
     I                                        1   32KIPU
     I                                        4   62KIPD
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           TAA02
     C                     PARM           TAA03
     C                     PARM           AMT    112
     C                     PARM           RTN     2
     C*
     C           *NAMVAR   DEFN           KIP01
     C                     IN   KIP01
     C*
     C           *LIKE     DEFN AA04      AA04U
     C           *LIKE     DEFN AA04      AA04D
     C           *LIKE     DEFN AA02      TAA02
     C           *LIKE     DEFN AA03      TAA03
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYAA     KLIST
     C                     KFLD           TAA02
     C                     KFLD           TAA03
     C           KEYAA1    KLIST
     C                     KFLD           TAA02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C*
     C                     EXSR RTN180
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL*BLANK    RTN
|    C                     Z-ADD0         KIP     32
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN180....CHECK AMT
     C*==============================================================*
02===C           RTN180    BEGSR
|    C*
|    C           KEYAA     SETGTAA0
|    C           KEYAA1    REDPEAA0                      41
| 01-C           *IN41     IFEQ '0'
|   C           1         ADD  KIPU      KIP
|   C           AA04      MULT KIP       AA04U
|   C           1         SUB  KIPD      KIP
|   C           AA04      MULT KIP       AA04D
      *
     C                     SELEC
| 02-C           AMT       WHGT AA04U
|   C                     MOVEL'E2'      RTN
| 03-C           AMT       WHLT AA04D
|   C                     MOVEL'E3'      RTN
     C           AMT       WHLE AA04U
     C           AMT       ANDGEAA04D
     C                     MOVEL'E0'      RTN
| 03-C                     ENDSL
      *
| 01*C                     ELSE
|   C                     MOVEL'E1'      RTN
| 01-C                     ENDIF
|    C*
02===C                     ENDSR
