     A*===============================================================
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : KIP004                                     *
     A*    AUTHOR       : A1492  TERRY                               *
     A*    DATE WRITTEN : 98/04/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                          *
     A*    SUBSYSTEM    :                                          *
     A*    PROCEDURE    :批次轉檔                                  *
     A*    REMARK       :                                            *
     A*===============================================================
     FW2BAPF  UF  E           K        DISK
     FW2BBLF03UF  E           K        DISK
     FIMIAPF  UF  E           K        DISK
     FMTMHPF  UF  E           K        DISK
     F            MA0                               KRENAMEMH0
     FMTMAPF  UF  E           K        DISK
     FSOSCPF  O   E           K        DISK
     FSOSDPF  O   E           K        DISK
     FMTMDPF  UF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FW1AALF01IF  E           K        DISK
     FRMWK03  UF  E           K        DISK                      A
     FRMWK03L1IF  E           K        DISK
     F            WB0                               KRENAMEWB0L1
     FRMWK04  UF  E           K        DISK                      A
     FKIP004D CF  E                    WORKSTN
     FKIP004P O   E             39     PRINTER                        UC
     I**********
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      201 2080DATE
     IDA02        DS
     I                                        1   43DUTY
     I            DS
     I                                        1   9 SD03
     I                                        1   4 SD03L
     I            DS
     I                                        1   30MD26
     I                                        1   10MD26M
     I                                        2   30MD26D
     I            DS
     I                                        1   80SC08
     I                                        1   60SC08YM
     I                                        1   40SC08Y
     I                                        5   60SC08M
     I                                        7   80SC08D
     I            DS
     I                                        1   60WSC08
     I                                        1   20WSC08Y
     I                                        3   40WSC08M
     I                                        5   60WSC08D
     I            DS
     I                                        1   2 SC01
     I                                        1   1 SC01K
     I*
     I              '無牌價資料  '      C         ERR1
     I              '可用量不足  '      C         ERR2
     I              '超過金額上限'      C         ERR3
     I              '超過金額下限'      C         ERR4
     I            DS
     I                                        1  12 BA03
     I                                        3   4 BA032
     I            DS
     I                                        1   60XDATE
     I                                        1   20XMM
     I                                        3   40XDD
     I                                        5   60XYY
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
      *==============================================================*
      *                   *LIKE DEFN
      *==============================================================*
     C           *LIKE     DEFN WB01      TWB01
     C           *LIKE     DEFN WB02      TWB02
     C           *LIKE     DEFN WB03      TWB03
     C           *LIKE     DEFN WB09      TWB09
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYIA     KLIST
     C                     KFLD           IA01
     C                     KFLD           WB02
     C                     KFLD           WB04
     C           KEYWF     KLIST
     C                     KFLD           BA01
     C                     KFLD           BA02
     C                     KFLD           BB11
     C                     KFLD           BB03
     C                     KFLD           BA08
     C           KEYWF1    KLIST
     C                     KFLD           BA01
     C                     KFLD           BA02
     C                     KFLD           BB03
     C                     KFLD           BA03
     C                     KFLD           BB02
     C           KEYWF2    KLIST
     C                     KFLD           WB01
     C                     KFLD           WB02
     C                     KFLD           WB04
     C           KEYAA     KLIST
     C                     KFLD           WB04
     C                     KFLD           WB01
     C           KEYBA     KLIST
     C                     KFLD           WT01
     C                     KFLD           WT02
     C                     KFLD           WT04
     C           KEYBB     KLIST
     C                     KFLD           WT04
     C                     KFLD           WT05
     C                     KFLD           WT03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010
      *
  01-C           *IN03     DOWEQ'0'
    C                     EXFMTDSPC1
    C   03                LEAVE
    C*CHECK
    C                     EXSR RTN100
     *
  02-C           *IN13     IFEQ '1'
    C           *IN99     ANDEQ'0'
    C*
    C                     EXSR RTN199
    C                     EXSR RTN200
    C                     EXSR RTN201
    C                     EXSR RTN202
    C                     EXSR RTN203
  02-C                     ENDIF
  01-C                     ENDDO
      *
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|     *
|    C                     MOVEL'R'       IA01
|    C                     Z-ADD$EGMDY    DDATE
|    C                     Z-ADD$EGMDY    XDATE
|    C                     SETON                     3997
|    C                     MOVEL'N'       PRT     1
|    C                     Z-ADD0         TDATE   80
|     *
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....CHECK
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     SETOF                     9961
|    C                     SETON                     39
|    C*
| 01-C           XDATE     IFEQ 0
|   C                     SETON                     9961
|   C                     MOVEL'MSG0002' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 01-C                     ENDIF
|    C   99                GOTO $ED100
|    C*
|    C                     CALL 'P30'
|    C                     PARM XDATE     P3001I  80
|    C                     PARM '3'       P3002I  1
|    C                     PARM '1'       P3003I  1
|    C                     PARM           P3011O  1
| 02-C           P3011O    IFEQ 'N'
|   C                     SETON                     6199
|   C                     MOVEL'MSG0003' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 02-C                     ENDIF
|    C   99                GOTO $ED100
|    C*
|    C           $ED100    TAG
02===C                     ENDSR
     C*==============================================================*
     C*          RTN199....
     C*==============================================================*
03===C           RTN199    BEGSR
|    C*
|    C                     OPEN KIP004P
|    C*
|    C           *LOVAL    SETLLWB0
|    C                     READ WB0                      41
| 01-C           *IN41     DOWEQ'0'
|   C                     DELETWB0
|   C                     READ WB0                      41
| 01-C                     ENDDO
|    C           *LOVAL    SETLLWT0
|    C                     READ WT0                      41
| 02-C           *IN41     DOWEQ'0'
|   C                     DELETWT0
|   C                     READ WT0                      41
| 02-C                     ENDDO
|    C*
|    C                     Z-ADDXDATE     P3101I
|    C                     CALL 'P31'
|    C                     PARM           P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           TDATE     PARM           P31110  80
|    C*
|    C           TDATE     SETLLBA0
|    C           TDATE     READEBA0                      41
| 03-C           *IN41     DOWEQ'0'
|   C*
| 04-C           BA05      IFEQ 'O'
|   C           BA03      SETLLBB0
|   C           BA03      READEBB0                      42
| 05-C           *IN42     DOWEQ'0'
| 06-C           BB09      IFEQ 'O'
|   C*
| 07-C           BA06      IFEQ 'A1'
|   C           BA06      OREQ 'A3'
|   C                     EXSR RTN101                     檢核牌價
| 08-C           *IN99     IFEQ '0'
|   C                     EXSR RTN103
| 08*C                     ELSE
|   C                     MOVEL'E'       BB09
|   C                     MOVEL'E'       BA05
|   C                     Z-ADDDATE      BBXX
|   C                     TIME           BBYY
|   C                     MOVE $USER     BBZZ
|   C                     UPDATBB0
| 08-C                     ENDIF
| 07-C                     ENDIF
|   C*
| 06-C                     ENDIF
|   C           BA03      READEBB0                      42
| 05-C                     ENDDO
| 04-C                     ENDIF
|   C*
| 09-C           BA05      IFEQ 'E'
|   C                     Z-ADDDATE      BAXX
|   C                     TIME           BAYY
|   C                     MOVE $USER     BAZZ
|   C                     UPDATBA0
| 09-C                     ENDIF
|   C           TDATE     READEBA0                      41
| 03-C                     ENDDO
|    C*
|    C                     EXSR RTN104
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN101....檢核牌價
     C*==============================================================*
04===C           RTN101    BEGSR
|    C*
|    C                     SETOF                     626399
|    C                     SETOF                     656667
|    C           BB04      CABEQ0         $ED101
     C           BA06      IFEQ 'A3'
     C                     GOTO $ED101
     C                     ENDIF
|    C*
|    C           BB07      DIV  BB04      AMT
|    C*
|    C                     CALL 'KIP007'
|    C                     PARM           BB03
|    C                     PARM           BA01
|    C                     PARM           AMT    112
|    C                     PARM           RTN     2
|    C*
| 01-C           RTN       IFNE 'E0'
|   C                     SETON                     6299
| 02-C           RTN       IFEQ 'E1'
|   C                     SETON                     65
| 02*C                     ELSE
| 03-C           RTN       IFEQ 'E2'
|   C                     SETON                     66
| 03*C                     ELSE
| 04-C           RTN       IFEQ 'E3'
|   C                     SETON                     67
| 04-C                     ENDIF
| 03-C                     ENDIF
| 02-C                     ENDIF
|   C                     EXSR RTN102
| 01-C                     ENDIF
|    C*
|    C           $ED101    TAG
04===C                     ENDSR
     C*==============================================================*
     C*          RTN102....WRITE ERROR REPORT
     C*==============================================================*
05===C           RTN102    BEGSR
|    C*
|    C                     MOVEL'Y'       PRT
|    C   39                WRITEPH1
|    C   39                SETOF                     39
|    C                     Z-ADDBA01      PBA01
|    C   62                MOVELBA02      PBA02
|    C   63                MOVELWB02      PBA02
|    C   62                MOVELBA03      PBA03
|    C   62                MOVELBB03      PBB03
|    C   63                MOVELWB04      PBB03
|    C   62 65             MOVELERR1      PDESC
|    C   62 66             MOVELERR3      PDESC
|    C   62 67             MOVELERR4      PDESC
|    C   63                MOVELERR2      PDESC
|    C                     WRITEPD1
|    C                     CLEARPD1
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN103....WRITE WORKFILE
     C*==============================================================*
06===C           RTN103    BEGSR
|    C*
|    C           KEYWF     CHAINWB0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     Z-ADDBA01      WB01
|   C                     MOVELBA02      WB02
|   C                     MOVELBB11      WB03
|   C                     MOVELBB03      WB04
|   C                     Z-ADDBB04      WB05
|   C                     Z-ADDBB05      WB06
|   C                     Z-ADDBB07      WB07
|   C                     Z-ADDBB06      WB08
|   C                     MOVELBA08      WB09
|   C                     Z-ADDBB08      WB10
|   C                     Z-ADDBB08A     WB10A
|   C                     Z-ADDBB08B     WB10B
|   C                     WRITEWB0
| 01*C                     ELSE
|   C                     ADD  BB04      WB05
|   C                     ADD  BB05      WB06
|   C                     ADD  BB07      WB07
|   C                     ADD  BB06      WB08
|   C                     UPDATWB0
| 01-C                     ENDIF
|    C*
|    C           KEYWF1    CHAINWT0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     Z-ADDBA01      WT01
|   C                     MOVELBA02      WT02
|   C                     MOVELBB03      WT03
|   C                     MOVELBA03      WT04
     C                     Z-ADDBB02      WT05
|   C                     WRITEWT0
| 02-C                     ENDIF
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN104....CHECK 可用量
     C*==============================================================*
07===C           RTN104    BEGSR
|    C*
|    C           *LOVAL    SETLLWB0
|    C                     READ WB0                      41
| 01-C           *IN41     DOWEQ'0'
|   C                     SETOF                     6263
|   C                     SETOF                     656667
|   C*
| 02-C           WB09      IFEQ *BLANK
|   C           WB05      ADD  WB06      WQTY    90
| 02*C                     ELSE
|   C                     Z-ADDWB08      WQTY
| 02-C                     ENDIF
|   C*
|   C           KEYIA     CHAINIA0                  40
| 03-C           *IN40     IFEQ '0'
|   C           IA10      ANDLTWQTY
|   C           *IN40     OREQ '1'
|   C                     SETON                     63
|   C                     EXSR RTN102
|   C                     DELETWB0
|   C*
|   C           KEYWF2    SETLLWT0
|   C           KEYWF2    READEWT0                      43
| 04-C           *IN43     DOWEQ'0'
|   C                     DELETWT0
|   C*
|   C           KEYBA     CHAINBA0                  46
| 05-C           *IN46     IFEQ '0'
|   C                     MOVEL'E'       BA05
|   C                     Z-ADDDATE      BAXX
|   C                     TIME           BAYY
|   C                     MOVE $USER     BAZZ
|   C                     UPDATBA0
| 05-C                     ENDIF
|   C*
|   C           KEYBB     CHAINBB0                  46
| 06-C           *IN46     IFEQ '0'
|   C                     MOVEL'E'       BB09
|   C                     Z-ADDDATE      BBXX
|   C                     TIME           BBYY
|   C                     MOVE $USER     BBZZ
|   C                     UPDATBB0
| 06-C                     ENDIF
|   C*
|   C           KEYWF2    READEWT0                      43
| 04-C                     ENDDO
|   C*
| 03-C                     ENDIF
|   C*
|   C                     READ WB0                      41
| 01-C                     ENDDO
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          RTN200....PROCESS
     C*==============================================================*
08===C           RTN200    BEGSR
|    C*
|    C                     SETON                     50
|    C                     Z-ADD0         I       30
|    C           *LOVAL    SETLLWB0
|    C                     READ WB0                      45
| 01-C           *IN45     DOWEQ'0'
| 02-C           WB09      IFNE *BLANK
|   C                     GOTO $NEXT
| 02-C                     ENDIF
|    *搬第一次至KEY FIELD
| 03-C           I         IFEQ 0
|   C                     Z-ADDWB01      TWB01
|   C                     MOVELWB02      TWB02
|   C                     MOVELWB03      TWB03
| 03-C                     END
|    *
| 04-C           WB01      IFNE TWB01
|   C           WB02      ORNE TWB02
|   C           WB03      ORNE TWB03
|    *PROCESS HANDING
|   C                     EXSR RTN400
|   C                     Z-ADD0         I
| 04-C                     END
|    *
|   C                     ADD  1         I
|    *
| 05-C           I         IFEQ 1
|    *頭檔單號
|   C                     EXSR RTN211
|    *頭檔初值
|   C                     EXSR RTN210
| 05-C                     END
|    * PROCESS DETIAL
|   C                     EXSR RTN300
|   C*
|   C                     Z-ADDWB01      TWB01
|   C                     MOVELWB02      TWB02
|   C                     MOVELWB03      TWB03
|   C           $NEXT     TAG
|   C                     READ WB0                      45
| 01-C                     END
|     *
| 06-C           I         IFNE 0
|    *PROCESS HANDING
|   C                     EXSR RTN400
| 06-C                     END
|     *
08===C                     ENDSR
     C*==============================================================*
     C*          RTN201....PROCESS  試飲
     C*==============================================================*
09===C           RTN201    BEGSR
|    C*
|    C                     SETOF                     50
|    C                     Z-ADD0         I       30
|    C           *LOVAL    SETLLWB0L1
|    C                     READ WB0L1                    45
| 01-C           *IN45     DOWEQ'0'
| 02-C           WB09      IFEQ *BLANK
|   C                     GOTO $NEXT1
| 02-C                     ENDIF
|    *搬第一次至KEY FIELD
| 03-C           I         IFEQ 0
|   C                     Z-ADDWB01      TWB01
|   C                     MOVELWB02      TWB02
|   C                     MOVELWB09      TWB09
| 03-C                     END
|    *
| 04-C           WB01      IFNE TWB01
|   C           WB02      ORNE TWB02
|   C           WB09      ORNE TWB09
|    *PROCESS HANDING
|   C                     WRITESC0
|   C                     Z-ADD0         I
| 04-C                     END
|    *
|   C                     ADD  1         I
|    *
| 05-C           I         IFEQ 1
|    *頭檔單號
|   C                     EXSR RTN211
|    *頭檔初值
|   C                     EXSR RTN210
| 05-C                     END
|    *PROCESS DETIAL
|   C                     EXSR RTN300
|   C*
|   C                     Z-ADDWB01      TWB01
|   C                     MOVELWB02      TWB02
|   C                     MOVELWB09      TWB09
|   C           $NEXT1    TAG
|   C                     READ WB0L1                    45
| 01-C                     END
|     *
| 06-C           I         IFNE 0
|    *PROCESS HANDING
|   C                     WRITESC0
| 06-C                     END
|     *
09===C                     ENDSR
     C*==============================================================*
     C*          RTN202....UPDATE STATUS
     C*==============================================================*
10===C           RTN202    BEGSR
|     *
|    C           *LOVAL    SETLLWT0
|    C                     READ WT0                      41
| 01-C           *IN41     DOWEQ'0'
|   C           KEYBB     SETLLBB0
|   C           KEYBB     READEBB0                      42
| 02-C           *IN42     DOWEQ'0'
|   C                     MOVEL'P'       BB09
|    C                     Z-ADDDATE      BBXX
|    C                     TIME           BBYY
|    C                     MOVE $USER     BBZZ
|   C                     UPDATBB0
|   C           KEYBB     READEBB0                      42
| 02-C                     ENDDO
|   C                     READ WT0                      41
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLWT0
|    C                     READ WT0                      41
| 03-C           *IN41     DOWEQ'0'
|   C           KEYBA     CHAINBA0                  40
| 04-C           *IN40     IFEQ '0'
|   C           BA03      SETLLBB0
|   C           BA03      READEBB0                      42
| 05-C           *IN42     DOWEQ'0'
| 06-C           BB09      IFNE 'P'
|   C                     LEAVE
| 06-C                     ENDIF
|   C           BA03      READEBB0                      42
| 05-C                     ENDDO
| 07-C           *IN42     IFEQ '1'
|   C                     MOVEL'P'       BA05
|    C                     Z-ADDDATE      BAXX
|    C                     TIME           BAYY
|    C                     MOVE $USER     BAZZ
|   C                     UPDATBA0
| 07-C                     ENDIF
| 04-C                     ENDIF
|   C                     READ WT0                      41
| 03-C                     ENDDO
|     *
10===C                     ENDSR
     C*==============================================================*
     C*          RTN203....
     C*==============================================================*
11===C           RTN203    BEGSR
|     *
|    C                     SETON                     99
| 01-C           PRT       IFEQ 'Y'
|   C                     WRITEPE1
|   C                     MOVEL'MSG0027' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 01*C                     ELSE
|   C                     MOVEL'MSG1005' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 01-C                     ENDIF
|     *
|    C                     CLOSEKIP004P
|     *
11===C                     ENDSR
     C*==============================================================*
     C*          RTN211....單號
     C*==============================================================*
12===C           RTN211    BEGSR
|     *GET ORDER NUMBER
|    C   50                MOVEL'S2'      S004I2
|    C  N50                MOVEL'S4'      S004I2
|    C                     CALL 'RES004'
|    C                     PARM 'R1'      S004I1  2
|    C                     PARM           S004I2  2
|    C                     PARM XYY       S004I3  20
|    C           SC02      PARM           S004O1 12
|     *
12===C                     ENDSR
     C*==============================================================*
     C*          RTN210....頭檔
     C*==============================================================*
13===C           RTN210    BEGSR
|    C*
|    C                     MOVEL'R1'      SC01
|    C   50                MOVEL'S2'      SC03
|    C  N50                MOVEL'S4'      SC03
|    C                     MOVELWB02      SC04
|    C                     MOVE *BLANK    SC05
|    C                     MOVE *BLANK    SC06
|    C                     Z-ADDWB01      SC07
|    C                     Z-ADDWB01      SC08
|    C                     MOVE *BLANKS   SC09
|    C   50                MOVE *BLANK    SC10
|    C  N50                MOVELWB09      SC10
|    C                     MOVELSC04      SC11
|    C                     Z-ADD0         SC12
|    C                     MOVEL'V'       SC13
|    C                     MOVELWB02      SC14
|    C                     MOVE *BLANK    SC15
|    C                     MOVELWB02      SC16
|    C                     MOVE *BLANK    SC17
|    C                     MOVE *BLANK    SC18
|    C                     MOVE *BLANK    SC19
|    C                     MOVE *BLANK    SC20
|    C                     MOVE *BLANK    SC21
|    C                     MOVEL'C'       SC22
|    C                     MOVEL'C'       SC23
|    C                     MOVEL'C'       SC24
|    C                     MOVEL'C'       SC25
|    C                     MOVEL'C'       SC26
|    C                     MOVE *BLANK    SC27
|    C                     MOVE *BLANK    SC28
|    C                     MOVE *BLANK    SC31
|    C                     MOVE *BLANK    SC32
|    C           WB02      CHAINME0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELME07      SC31
|   C                     MOVELME08      SC32
|   C                     MOVELME15      SC27
|   C           SC27      CHAINMC0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELMC03      SC28
| 02-C                     END
| 01-C                     END
|    C                     MOVE *BLANKS   SC33
|    C                     MOVE *BLANKS   SC34
|    C           SC04      CHAINMD0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     Z-ADDMD18      SC09
|   C                     MOVELMD07      SC33
|   C                     MOVELMD08      SC34
| 03-C                     END
|    C                     MOVEL*ALL'*'   SC29
|    C                     MOVE SC02      SC30
|    C                     MOVEL'N'       SC35
|    C                     MOVELWB02      SC36
|    C                     MOVELWB03      SC37
|    C                     MOVEL'V'       SC38
|    C                     Z-ADDWB01      SC39
|    C                     Z-ADDDATE      SCXX
|    C                     TIME           SCYY
|    C                     MOVE $USER     SCZZ
|     *
13===C                     ENDSR
     C*==============================================================*
     C*          RTN300....PROCESS DETAIL  SOSDPF
     C*==============================================================*
14===C           RTN300    BEGSR
|    C*
|    C                     MOVELSC01      SD01
|    C                     MOVELSC02      SD02
|    C                     MOVELWB04      SD03
|    C           SD03      CHAINMA0                  40
|    C           *LOVAL    SETLLMA0
|    C   50                Z-ADDWB05      SD04
|    C   50                Z-ADDWB06      SD05
|    C  N50                Z-ADDWB08      SD04
|    C  N50                Z-ADD0         SD05
|    C                     Z-ADDWB07      SD07
|    C           KEYAA     SETGTAA0
|    C           WB04      REDPEAA0                      40
|    C  N40                Z-ADDAA04      SD06
|    C  N40                Z-ADDAA04      SD08
|    C  N40                Z-ADDAA04      SD15
|    C   40                Z-ADD0         SD06
|    C   40                Z-ADD0         SD08
|    C   40                Z-ADD0         SD15
|    C                     Z-ADD0         SD09
|    C                     Z-ADDWB10      SD10
|    C                     Z-ADDWB10A     SD11
|    C                     Z-ADDWB10B     SD12
|    C                     Z-ADDSD06      SD13
|    C                     Z-ADDSD06      SD14
|     *累加至頭檔
|    C                     ADD  SD07      SC12
|     *
|    C                     MOVELMA07      SD16
|    C                     MOVEL'C'       SD17
|    C                     MOVEL'C'       SD18
|    C                     Z-ADDWB01      SD19
|    C                     MOVELWB02      SD20
|    C                     MOVELWB02      SD21
|    C                     Z-ADDWB10      SD22
|    C                     Z-ADDWB10A     SD23
|    C                     Z-ADDWB10B     SD24
|    C                     Z-ADDDATE      SDXX
|    C                     TIME           SDYY
|    C                     MOVE $USER     SDZZ
|    C                     WRITESD0
|     *IMIAPF,MTMHPF,MTMAPF
|    C                     EXSR RTN320
|     *
14===C                     ENDSR
     C*==============================================================*
     C*          RTN320....PROCESS DETAIL  IMIAPF,MTMAPF,MTMDPF
     C*==============================================================*
15===C           RTN320    BEGSR
|    C*
|    C           SD04      ADD  SD05      SD045   60
|    C*IMIAPF
|    C           KEYIA     CHAINIA0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  SD04      IA06
|   C                     SUB  SD04      IA07
|   C                     SUB  SD04      IA10
|   C                     SUB  SD05      IA06
|   C                     SUB  SD05      IA07
|   C                     SUB  SD05      IA10
|   C                     Z-ADDDATE      IAXX
|   C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
|   C                     UPDATIA0
| 01-C                     ENDIF
|     *MTMAPF
|    C                     Z-ADD0         WFLD   132
|    C           SD03      CHAINMA0                  40
| 02-C           *IN40     IFEQ '0'
|   C           MA07      ANDEQ'R'
|   C                     SUB  SD045     MA30
|   C           SD045     MULT MA31      WFLD
|   C                     SUB  WFLD      MA26
|   C           SD045     MULT MA32      WFLD
|   C                     SUB  WFLD      MA27
|   C           SD045     MULT MA33      WFLD
|   C                     SUB  WFLD      MA28
|   C                     Z-ADDDATE      MAXX
|   C                     TIME           MAYY
|   C                     MOVE $USER     MAZZ
|   C                     UPDATMA0
| 02*C                     ELSE
| 03-C           MA07      IFEQ 'K'
|   C           SD03      CHAINMH0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     SUB  SD045     MA30
|   C           SD045     MULT MA31      WFLD
|   C                     SUB  WFLD      MA26
|   C           SD045     MULT MA32      WFLD
|   C                     SUB  WFLD      MA27
|   C           SD045     MULT MA33      WFLD
|   C                     SUB  WFLD      MA28
|   C                     Z-ADDDATE      MAXX
|   C                     TIME           MAYY
|   C                     MOVE $USER     MAZZ
|   C                     UPDATMH0
| 04-C                     ENDIF
| 03-C                     ENDIF
| 02-C                     ENDIF
|     *
15===C                     ENDSR
     C*==============================================================*
     C*          RTN400....PROCESS HANDING SOSCPF
     C*==============================================================*
16===C           RTN400    BEGSR
|    C*
|    C                     WRITESC0
|     *MTMDPF
|    C   50                EXSR RTN420
|     *
16===C                     ENDSR
     C*==============================================================*
     C*          RTN420....PROCESS HANDING MTMDPF
     C*==============================================================*
17===C           RTN420    BEGSR
|    C* UPDATE 客戶主檔(MTMDPF)
|    C           SC04      CHAINMD0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  SC12      MD29
|   C                     ADD  SC12      MD31
|   C                     UPDATMD0
| 01-C                     END
|     *
17===C                     ENDSR
