      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR054                                        *
      * AUTHER       : TEDDY                                         *
      * CREATE DATE  : 85/02/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存子系統                                   *
      * REMARK       :年終物流庫存彙總表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.05  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FIMI2PF  IP  E           K        DISK
     FMTMHPF  IF  E           K        DISK
     FREWFC3  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 6040DIY15
     I                                      601 6020DIY15M
     I                                      603 6040DIY15Y
M001MI*                                     605 6080IY15E
M001MI*                                     605 6060IY15EY
M001MI*                                     607 6080IY15EM
M001MI                                      605 6100IY15E
M001MI                                      605 6080IY15EY
M001MI                                      609 6100IY15EM
     I                                      621 629 DIY03S
     I                                      631 639 DIY03E
     I                                      641 642 IY03MS
     I                                      643 644 IY03ME
      *組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I            DS
     I                                        1   9 IY03
     I                                        3   4 IY03M
     I            DS
     I                                        1   5 IY02
     I                                        1   1 IY02A
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11A
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100
     C*==============================================================*
     C*          RTN100....GET DETAIL
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C*產品代號
| 01-C           IY03      IFGE DIY03S
|   C           IY03      ANDLEDIY03E
|   C           IY03      CHAINMA0                  40
|   C*組別
| 02-C           MA11A     IFGE DMA11S
|   C           MA11A     ANDLEDMA11E
|   C*品牌
| 03-C           IY03M     IFGE IY03MS
|   C           IY03M     ANDLEIY03ME
|   C           IY03      CHAINWFC30                41
| 04-C           *IN41     IFEQ '1'                          新增
|   C                     EXSR RTN200
| 04*C                     ELSE                              修改
|   C                     EXSR RTN300
| 04-C                     END
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE WORK FILE
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C                     MOVELMA11      WFC301
|    C                     MOVE IY03M     WFC302
|    C                     MOVE IY03      WFC303
|    C*設庫存初值
|    C                     Z-ADD0         WFC304
|    C                     Z-ADD0         WFC305
|    C                     Z-ADD0         WFC306
|    C                     Z-ADD0         WFC307
|    C*是否專櫃庫存
| 01-C           IY02A     IFEQ 'B'
|   C                     Z-ADDIY06      WFC304
| 01*C                     ELSE
|   C*是否完稅庫存
| 02-C           IY02A     IFEQ 'W'
|   C                     Z-ADDIY06      WFC305
| 02*C                     ELSE
|   C*是否保稅庫存
| 03-C           IY02A     IFEQ 'T'
|   C                     Z-ADDIY06      WFC306
| 03*C                     ELSE
|   C*其他庫存（寄賣放）
|   C                     Z-ADDIY06      WFC307
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*WRITE WORK FILE
|    C                     WRITEWFC30
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....UPDATE WORK FILE
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
| 01-C           IY02A     IFEQ 'B'
|   C                     ADD  IY06      WFC304
| 01*C                     ELSE
| 02-C           IY02A     IFEQ 'W'
|   C                     ADD  IY06      WFC305
| 02*C                     ELSE
| 03-C           IY02A     IFEQ 'T'
|   C                     ADD  IY06      WFC306
| 03*C                     ELSE
|   C                     ADD  IY06      WFC307
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*WRITE WORK FILE
|    C                     UPDATWFC30
|    C***
03===C                     ENDSR
