     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有     TEL:5042266    *
     A*                                                              *
     A* PROGRAM NAME : KIR047                                        *
     A* AUTHER       : TINA                                          *
     A* CREATE DATE  : 11/23/94                                      *
     A* UPDATE DATE  :                                               *
     A* SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :盤點系統                                     *
     A* REMARK       :年終成本標準箱數　　                         *
     A****************************************************************
     FKIR047D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
     I                                      598 5990$PRTID
     I*
     I                                      601 6040DIX11
     I                                      601 6020MM
     I                                      603 6040YY
     I                                      615 623 DIX01S
     I                                      624 632 DIX01E
     I                                      640 6430DYYMM
     I                                      640 6410WYY
     I                                      642 6430WMM
     I                                      650 650 COMP
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*===============================================================*
     C*          RTN010....INIT SCREEN
     C*===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         DYYMM
|    C                     Z-ADD0         WYY
|    C                     Z-ADD0         WMM
|    C                     Z-ADD0         DIX11
|    C                     Z-ADD0         YY
|    C                     Z-ADD0         MM
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    DIX01S
|    C                     MOVE *BLANK    DIX01E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*年終年月
| 01-C           DIX11     IFEQ 0
|   C                     SETON                     619599
| 01-C                     END
|    C   99                GOTO END100
| 02-C           MM        IFLT 1
|   C           MM        ORGT 12
|   C                     SETON                     619399
| 02-C                     END
|    C   99                GOTO END100
|    C                     Z-ADDYY        WYY
|    C                     Z-ADDMM        WMM
|    C*產品代號
| 06-C           DIX01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DIX01S
| 06-C                     END
|    C*
| 07-C           DIX01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIX01E
| 07-C                     END
|    C*
| 08-C           DIX01S    IFGT DIX01E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 08-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品代號
| 02-C           D#ROW     IFEQ 8
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DIX01S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DIX01E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
