      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR054                                        *
      * AUTHER       : TEDDY                                         *
      * CREATE DATE  : 85/02/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :盤點資料子系統                               *
      * REMARK       :年終庫存物流彙總表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.05  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FKIR048D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 6040DIY15
     I                                      601 6020DIY15M
     I                                      603 6040DIY15Y
M001MI*                                     605 6080IY15E
M001MI*                                     605 6060IY15EY
M001MI*                                     607 6080IY15EM
M001MI                                      605 6100IY15E
M001MI                                      605 6080IY15EY
M001MI                                      609 6100IY15EM
     I                                      611 619 IY03
     I                                      621 629 DIY03S
     I                                      631 639 DIY03E
     I                                      641 642 IY03MS
     I                                      643 644 IY03ME
     I                                      651 655 IY02
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
| 04-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 04-C                     END
|    C                     Z-ADD0         DIY15
|    C                     Z-ADD0         IY15EM
|    C                     Z-ADD0         IY15EY
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    IY03MS
|    C                     MOVE *BLANK    IY03ME
|    C                     MOVE *BLANK    DIY03S
|    C                     MOVE *BLANK    DIY03E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*年終年月
| 01-C           DIY15     IFNE 0
|   C*
| 02-C           DIY15M    IFGT 12
|   C           DIY15M    ORLT 1
|   C                     SETON                     609499
| 02-C                     END
|   C*M001M               Z-ADDDIY15Y    IY15EY
M001AC                     MOVE DIY15Y    HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    IY15EY
|   C                     Z-ADDDIY15M    IY15EM
|   C   99                GOTO END100
|   C*
| 03-C           IY03ME    IFEQ *BLANKS
|   C                     MOVE *HIVAL    IY03ME
| 03-C                     END
|   C*品牌
| 04-C           IY03MS    IFEQ *BLANKS
|   C                     MOVE *LOVAL    IY03MS
| 04-C                     END
|   C*
| 05-C           IY03ME    IFEQ *BLANKS
|   C                     MOVE *HIVAL    IY03ME
| 05-C                     END
|   C*
| 06-C           IY03MS    IFGT IY03ME
|   C                     SETON                     6263
|   C                     SETON                     9399
| 06-C                     END
|   C   99                GOTO END100
|   C*產品代號
| 07-C           DIY03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIY03S
| 07-C                     END
|   C*
| 08-C           DIY03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIY03E
| 08-C                     END
|   C*
| 09-C           DIY03S    IFGT DIY03E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 09-C                     END
|   C   99                GOTO END100
|   C*
| 01*C                     ELSE
|   C                     SETON                     609699
| 01-C                     END
|    C* 組別
| 10-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
| 10*C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 10-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C**
| 02-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DIY03S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C**
| 03-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE59
|   C                     CALL 'WDS001'
|   C                     PARM           DIY03E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
