     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有     TEL:5042266    *
     A*                                                              *
     A* PROGRAM NAME : KIR047                                        *
     A* AUTHER       : TINA                                          *
     A* CREATE DATE  : 11/23/94                                      *
     A* UPDATE DATE  :                                               *
     A* SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :盤點系統                                     *
     A* REMARK       :年終成本標準箱數　　                         *
     A****************************************************************
     FIMI1LF03IP  E           K        DISK
     FMTMHPF  IF  E           K        DISK
     FPA#HPF  IF  E           K        DISK
     FKIR047P O   E             39     PRINTER
     IIX0
     I                                              IX01B L1
     I                                              IX01A L2
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I                                      601 6040DIX11
     I                                      601 6020MM
     I                                      603 6040YY
     I                                      615 623 DIX01S
     I                                      624 632 DIX01E
     I            DS
     I                                        1   9 IX01
     I                                        3   4 IX01D
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#H     KLIST
     C                     KFLD           #H01
     C                     KFLD           #H02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *HEADING
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CLR                   EXSR RTNLR
      *==============================================================*
     C*          RTN010....INIT VALUE
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         IX06S
|    C                     Z-ADD0         IX07S
|    C                     MOVEL*BLANK    #H03T
|    C                     Z-ADD0         STANDC
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C                     Z-ADD0         T1TOT5
|    C                     Z-ADD0         T1TOT6
|    C                     Z-ADD0         T1TOT7
|    C                     Z-ADD0         T1TOT8
|    C                     Z-ADD0         T2TOT1
|    C                     Z-ADD0         T2TOT2
|    C                     Z-ADD0         T2TOT3
|    C                     Z-ADD0         T2TOT4
|    C                     Z-ADD0         T2TOT5
|    C                     Z-ADD0         T2TOT6
|    C                     Z-ADD0         T2TOT7
|    C                     Z-ADD0         T2TOT8
|    C                     Z-ADD0         T3TOT1
|    C                     Z-ADD0         T3TOT2
|    C                     Z-ADD0         T3TOT3
|    C                     Z-ADD0         T3TOT4
|    C                     Z-ADD0         T3TOT5
|    C                     Z-ADD0         T3TOT6
|    C                     Z-ADD0         T3TOT7
|    C                     Z-ADD0         T3TOT8
|    C                     WRITEPH1
|    C*
|    C                     SETON                     10                L
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....READ
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*產品簡稱
|    C           IX01      CHAINMA0                  43
|    C   43                MOVE *BLANKS   MA03
|    C  N43                MOVE MA03      MA03
|    C   43                Z-ADD0         MA15
|    C  N43                MOVE MA15      MA15
     C           IX06      MULT MA15      IX06S     H
     C           IX07      MULT MA15      IX07S     H
|    C*標準容積
     C                     MOVEL'STANDARD'#H01
     C                     MOVELIX01D     #H02
|    C           KEY#H     CHAIN#H0                  43
     C*#H03T IF EQ '*' MEANS #H03 HAS ERROR
|    C   43                Z-ADD1         #H03
|    C   43                MOVEL'*'       #H03T
|    C  N43                MOVE #H03      #H03
|    C  N43                MOVEL' '       #H03T
     C*
     C           #H03      IFNE 0
     C           IX06S     DIV  #H03      IX06S     H
     C           IX07S     DIV  #H03      IX07S     H
     C           IX06S     ADD  IX07S     STANDC    H
     C                     END
|    C   39                EXSR RTN900
|   C                     ADD  IX06      T1TOT1
|   C                     ADD  IX06S     T1TOT2
|   C                     ADD  IX07      T1TOT3
|   C                     ADD  IX07S     T1TOT4
|   C                     ADD  STANDC    T1TOT5
|   C                     ADD  IX08      T1TOT6
|   C                     ADD  IX09      T1TOT7
|   C                     ADD  IX10      T1TOT8
     C           STANDC    IFNE 0
|    C                     WRITEPD1
     C                     END
|    C                     SETOF                     2122
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTNL1 ....PT1
     C*==============================================================*
04===C           RTNL1     BEGSR
|    C*
|    C   39                EXSR RTN900
     C           IX01A     IFEQ 'ESRM'
     C           T1TOT3    ANDNE0
|    C                     WRITEPT1
     C                     END
     C                     ADD  T1TOT1    T2TOT1
     C                     ADD  T1TOT2    T2TOT2
     C                     ADD  T1TOT3    T2TOT3
     C                     ADD  T1TOT4    T2TOT4
     C                     ADD  T1TOT5    T2TOT5
     C                     ADD  T1TOT6    T2TOT6
     C                     ADD  T1TOT7    T2TOT7
     C                     ADD  T1TOT8    T2TOT8
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C                     Z-ADD0         T1TOT5
|    C                     Z-ADD0         T1TOT6
|    C                     Z-ADD0         T1TOT7
|    C                     Z-ADD0         T1TOT8
|    C                     SETON                     21
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTNL2 ....PT2
     C*==============================================================*
04===C           RTNL2     BEGSR
|    C*
|    C   39                EXSR RTN900
     C           T2TOT3    IFNE 0
|    C                     WRITEPT2
     C                     END
     C                     ADD  T2TOT1    T3TOT1
     C                     ADD  T2TOT2    T3TOT2
     C                     ADD  T2TOT3    T3TOT3
     C                     ADD  T2TOT4    T3TOT4
     C                     ADD  T2TOT5    T3TOT5
     C                     ADD  T2TOT6    T3TOT6
     C                     ADD  T2TOT7    T3TOT7
     C                     ADD  T2TOT8    T3TOT8
|    C                     Z-ADD0         T2TOT1
|    C                     Z-ADD0         T2TOT2
|    C                     Z-ADD0         T2TOT3
|    C                     Z-ADD0         T2TOT4
|    C                     Z-ADD0         T2TOT5
|    C                     Z-ADD0         T2TOT6
|    C                     Z-ADD0         T2TOT7
|    C                     Z-ADD0         T2TOT8
|    C                     SETON                     21
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
     C                     ELSE
|    C   39                EXSR RTN900
|    C                     WRITEPT3
| 01-C                     END
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
