     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : KIS014D                                    *
     A*    AUTHOR       : A1491  EASON                               *
     A*    CREATE DATE  : 98/06/11                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : KIS014                                     *
     A*    SYSTEM       :                                            *
     A*    SUBSYSTEM    :採購資料子系統- FOR茂世專櫃             *
     A*    REMARK       :採購單批次結案                            *
     /*=============================================================*/
     FW1AFPF  UP  E           K        DISK
     FW1AGPF  UF  E           K        DISK
     FIMIAPF  UF  E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      201 2080DATE
     I                                      601 606 WAF01
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYIA     KLIST
     C                     KFLD           IA01
     C                     KFLD           AF03
     C                     KFLD           AG02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100
     C*
     C   LR                RETRN
     C*==============================================================*
     C*          RTN100....GET HEADING  FILE
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*設結案檢查SWITCH (WCHKSW)  1=可結案  0=不可結案
|    C                     Z-ADD1         WCHKSW  10
|    C                     MOVEL'R'       IA01
|    C*
|    C                     EXSR RTN110                       *CHK RTN
|    C*
| 01-C           WCHKSW    IFEQ 1
|   C*採購明細檔資料結案
|   C                     EXSR RTN200
|   C*採購主檔資料結案
|   C                     MOVE 'P'       AF05
|   C                     UPDATAF0
| 01-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....CHECK DATA
      *==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C           AF02      SETLLAG0
|    C           AF02      READEAG0                      41
|    C*
| 01-C           *IN41     DOWEQ'0'
|    *
|   C           KEYIA     CHAINIA0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         WCHKSW
|   C                     GOTO CHKEND
| 02-C                     ENDIF
|    *
|   C           KEYIA     CHAINIA0                  40
| 03-C           *IN40     IFEQ '0'
| 04-C           IA09      IFLT AG03
|   C                     Z-ADD0         WCHKSW
|   C                     GOTO CHKEND
| 04-C                     ENDIF
| 03-C                     ENDIF
|    *
| 05-C           AG04      IFNE 0
|   C                     Z-ADD0         WCHKSW
|   C                     GOTO CHKEND
| 05-C                     END
|    *
|   C           AF02      READEAG0                      41
| 01-C                     END
|    C           *LOVAL    SETLLAG0
|    C*
02===C           CHKEND    ENDSR
      *==============================================================*
      *          RTN200....GET DETAIL  FILE
      *==============================================================*
03===C           RTN200    BEGSR
|    C*採購明細檔資料結案
|    C*
|    C           AF02      SETLLAG0
|    C           AF02      READEAG0                      41
| 01-C           *IN41     DOWEQ'0'
|    *
|   C                     MOVE 'P'       AG05
|   C                     UPDATAG0
|    *
|   C           KEYIA     CHAINIA0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     SUB  AG03      IA09
|   C                     ADD  AG03      IA10
|   C                     UPDATIA0
| 02-C                     ENDIF
|    *
|   C           AF02      READEAG0                      41
| 01-C                     END
|    C*
03===C                     ENDSR
