     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : KIS010                                     *
     A*    AUTHOR       : A1492  TERRY                               *
     A*    DATE WRITTEN : 98/03/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                          *
     A*    SUBSYSTEM    :                                          *
     A*    PROCEDURE    :採購訂單驗收                            *
     A*    REMARK       :                                            *
     A*===============================================================
     FW2BGPF  UF  E           K        DISK
     FW2BGLF01IF  E           K        DISK
     F            BG0                               KRENAMEBG0L1
     FW2BHPF  UF  E           K        DISK
     FW2BFPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPOPPPF  O   E           K        DISK                      A
     FPOPHPF  UF  E           K        DISK                      A
     FPOPIPF  UF  E           K        DISK                      A
     FMTMHPF  UF  E           K        DISK
     F            MA0                               KRENAMEMH0
     FIMIAPF  UF  E           K        DISK                      A
     FPOPALF01IF  E           K        DISK
     FKIS010D CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E                    WFUN    6   6  6
     E*: A/U/D/I AUT
     E                    WA01        6  1
     E                    @EA       999  9
     I*
     IDA02        DS
     I                                        1   43DUTY
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      201 2080DATE
     I                                      201 2080$EG8
     I                                      205 2060DMON
     I                                      501 505 $WRHUS
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I              '尚未驗收'          C         STDSC1
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C                     MOVE *BLANKS   APPSCR  6
     C*
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C           *LIKE     DEFN DBG02     OBG02            *START KEY
     C           *LIKE     DEFN RRN2      @PRRN
     C           *LIKE     DEFN PP02      GNUM
      *  FOR SUBFILE (SYS+PGM CONTROL)
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYBG     KLIST
     C                     KFLD           DBG02
     C                     KFLD           KBGN1
     C                     KFLD           DBGN2
     C           KEYBG1    KLIST
     C                     KFLD           BG02
     C                     KFLD           BG01
     C                     KFLD           BG03
     C           KEYBG2    KLIST
     C                     KFLD           SBG01H
     C                     KFLD           SBG02H
     C                     KFLD           SBG03
     C           KEYBH     KLIST
     C                     KFLD           SBG03
     C           KEYBH1    KLIST
     C                     KFLD           SBG03
     C                     KFLD           SBH02
     C           KEYBF     KLIST
     C                     KFLD           DBG06
     C                     KFLD           SBH02
     C           KEYPA     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYPO     KLIST
     C                     KFLD           SBG04H
     C                     KFLD           SBH02
     C                     KFLD           SBG01H
     C           KEYPO1    KLIST
     C                     KFLD           SBG04H
     C                     KFLD           SBH02
     C           KEYPP     KLIST
     C                     KFLD           GNUM
     C                     KFLD           SBG06H
     C                     KFLD           SBH02
     C           KEYIA     KLIST
     C                     KFLD           CMP
     C                     KFLD           DBG022
     C                     KFLD           SBH02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $UPD      WA01,6
|    C                     MOVE 'SCR001'  APPSCR
|    C                     Z-ADD0         KBGN1   80
|    C                     MOVEL'R'       CMP     1
|    C*
|    C                     MOVEL'STORAGE' #A01
| 01-C           $WRHUS    IFEQ '*ALL '
|   C           $WRHUS    OREQ *BLANK
|   C                     SETON                     39
| 01*C                     ELSE
|   C                     SETOF                     39
| 01-C                     ENDIF
|    C*
|    C           *NAMVAR   DEFN           DA02
|    C                     IN   DA02
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C           DBG02     ORNE OBG02
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     Z-ADDDBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
|   C                     MOVELDBG02     OBG02
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETOF                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN300
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     97
| 05-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     6099
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C*
|    C   99                GOTO END180
|    C*
04===C           END180    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVELDBG02     #A02
|    C                     MOVEL*BLANK    D#A03
|    C           KEYPA     CHAIN#A0                 N40
|    C  N40                MOVEL#A03      D#A03
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|     *
|    C                     Z-ADDDBGN1     P3101I
|    C                     CALL 'P31'
|    C                     PARM           P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           KBGN1     PARM           P31110  80
|    C*
| 01-C           KBGN1     IFEQ 0
|   C                     Z-ADD*HIVAL    KBGN1
| 01-C                     ENDIF
|    C*
|    C           KEYBG     SETLLBG0L1
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
| 02-C           DBG02     IFEQ *BLANK
|   C                     READ BG0L1               N    46
| 02*C                     ELSE
|   C           DBG02     READEBG0L1               N    46
| 02-C                     ENDIF
|   C*
| 03-C           *IN46     IFEQ '0'
|   C*
|   C                     Z-ADDBG01      SBG01H
|   C                     CALL 'P31'
|   C                     PARM BG01      P31I1   80
|   C                     PARM '2'       P3112   1
|   C                     PARM '1'       P31I3   1
|   C                     PARM '3'       P31I4   1
|   C                     PARM '1'       P31I5   1
|   C           SBG01     PARM           P31IO   80
|   C                     MOVELBG02      SBG02H
|   C                     MOVELBG03      SBG03
| 04-C           BG07      IFEQ *BLANK
|   C                     MOVELSTDSC1    STATUS
| 04-C                     ENDIF
|   C                     MOVELBG06      SBG06H
|   C                     MOVELBG04      SBG04H
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 03*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 03-C                     END
|   C*
| 01-C                     ENDDO
|     *
|    C*再此多做預讀一筆的判斷，去判斷是否已到最後一筆
| 05-C           *IN46     IFEQ '0'
| 06-C           DBG02     IFEQ *BLANK
|   C                     READ BG0L1               N    46
| 06*C                     ELSE
|   C           DBG02     READEBG0L1               N    46
| 06-C                     ENDIF
|   C*在將KEY值帶回來
|   C           KEYBG1    SETLLBG0L1
| 07-C           *IN46     IFEQ '1'
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 07-C                     END
| 05-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
| 02-C           DBGN1     IFNE 0
|   C           DBG02     ORNE *BLANK
|   C                     SETON                     99    *NODATA
|   C                     MOVEL'MSG0008' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 02-C                     END
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
| 03-C           *IN39     IFEQ '1'
|   C                     SETON                     31
| 03*C                     ELSE
|   C                     SETOF                     31
|   C                     MOVEL$WRHUS    DBG02
|   C                     MOVEL$WRHUS    OBG02
| 03-C                     ENDIF
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
09===C           RTN300    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
|    C*
| 01-C           DOPT1     CASEQ'6'       RTN320           *UPD
|   C           DOPT1     CASEQ'5'       RTN340           *INQ
| 01-C                     END
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN320....UPD DATA --- SFLSR
     C*==============================================================*
10===C           RTN320    BEGSR
|    C*
|    C                     SETON                     3334
|    C                     EXSR RTN390                     *INT SFLSR
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C                     CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C           *IN09     ANDEQ'1'                         SAVE
|   C                     EXSR RTN39S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR2
     C*==============================================================*
11===C           RTN340    BEGSR
|    C*
|    C                     SETOF                     3334  *NO INPUT
|    C                     EXSR RTN390                     *INT SFLSR
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN99     IFEQ '0'                         SAVE
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN12 ENDIF
| 02-C                     END                             *IN03 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          RTN390....搬值給第2各畫面需要的KEY值
     C*==============================================================*
12===C           RTN390    BEGSR
|    C*
|    C                     MOVELSBG02H    DBG022
|    C                     MOVELDBG022    #A02
|    C                     MOVEL*BLANK    D#A032
|    C           KEYPA     CHAIN#A0                 N40
|    C  N40                MOVEL#A03      D#A032
|    C                     Z-ADDSBG01     DBG01
|    C                     MOVELSBG06H    DBG06
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN391....INIT 'SC03' -- SFLSR2
     C*==============================================================*
13===C           RTN391    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD999       DSPRC2  40
|    C                     Z-ADD10        WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     Z-ADD9         @SFTOP  20
|    C                     Z-ADD18        @SFBOT  20
|    C                     Z-ADD1         @LNUM   20
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYBH     SETLLBH0
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          RTN398....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
14===C           RTN398    BEGSR
|     *
| 01-C           DOPT1     IFEQ '6'
|   C                     SETON                     54
| 01*C                     ELSE
|   C                     SETOF                     54
| 01-C                     END
|    C*
|    C           KEYBH     READEBH0                 N    44*NF/EOF
|    C*
| 02-C           *IN44     DOWEQ'0'
| 03-C           BH06      IFEQ 0
|   C                     EXSR RTN39B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
| 03-C                     ENDIF
|   C           KEYBH     READEBH0                 N    44*NF/EOF
| 02-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN39B....FILE TO SCREEN --- MOVE
     C*==============================================================*
15===C           RTN39B    BEGSR
|    C*
|    C                     MOVELBH02      SBH02
|    C                     MOVEL*BLANK    SMA03
|    C           BH02      CHAINMA0                 N40
|    C  N40                MOVELMA03      SMA03
|    C                     Z-ADD0         SBF03
|    C           KEYBF     CHAINBF0                 N40
|    C  N40                Z-ADDBF03      SBF03
|    C                     Z-ADD0         SBH03
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          RTN39C....SCREEN TO FILE --- H
     C*==============================================================*
16===C           RTN39C    BEGSR
|    C*
|    C                     Z-ADDSBH03     BH03
|    C                     Z-ADD$EG8      BH06
|    C                     Z-ADD$EG8      SBH06   80
|    C           BH03      MULT BH04      BH05
|    C                     ADD  BH05      AMT
|    C                     Z-ADD$EG8      BHXX
|    C                     TIME           BHYY
|    C                     MOVEL$USER     BHZZ
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          RTN39S....SAVE D
     C*==============================================================*
17===C           RTN39S    BEGSR
|    C*
|    C                     MOVEL*BLANK    @PRC    1
|    C                     MOVEL*BLANK    @GET    1
|    C*
|    C                     Z-ADD0         AMT    112
|    C                     READCSFLSR2                 5757
| 01-C           *IN57     DOWEQ'0'
|   C*
| 02-C           SBH03     IFNE 0
|   C           KEYBH1    CHAINBH0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     EXSR RTN39C
|   C                     UPDATBH0
|   C                     MOVEL'Y'       @PRC
|   C*
| 04-C           @GET      IFEQ *BLANK
|   C                     EXSR GETNUM
|   C                     MOVEL'N'       @GET
| 04-C                     ENDIF
|   C*
|   C                     EXSR RTN301
|   C                     EXSR RTN302
|   C                     EXSR RTN303
|   C                     EXSR RTN304
|   C                     EXSR RTN305
| 03-C                     ENDIF
| 02-C                     ENDIF
|   C*
|   C                     READCSFLSR2                   57
| 01-C                     END
|    C*
| 05-C           @PRC      IFEQ 'Y'
|   C           KEYBG2    CHAINBG0                  40
| 06-C           *IN40     IFEQ '0'
|   C*判斷明細有無未驗收資料
|   C           KEYBH     SETLLBH0
|   C           KEYBH     READEBH0                 N    48
| 07-C           *IN48     DOWEQ'0'
| 08-C           BH03      IFEQ 0
|   C                     LEAVE
| 08-C                     ENDIF
|   C           KEYBH     READEBH0                 N    48
| 07-C                     ENDDO
|   C   48                MOVEL'P'       BG07
|   C                     ADD  AMT       BG05
|   C                     Z-ADD$EG8      BGXX
|   C                     TIME           BGYY
|   C                     MOVEL$USER     BGZZ
|   C                     UPDATBG0
| 06-C                     ENDIF
| 05-C                     ENDIF
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          RTN301....WRITE POPPPF
     C*==============================================================*
18===C           RTN301    BEGSR
|    C*
|    C                     MOVEL'R1'      PP01
|    C                     MOVELGNUM      PP02
|    C                     MOVELSBG06H    PP03
|    C                     MOVELSBH02     PP04
|    C                     Z-ADDSBH06     PP05
|    C                     Z-ADDSBH03     PP06
|    C           KEYPO     SETGTPA0
|    C           KEYPO1    REDPEPA0                      41
|    C  N41                Z-ADDPA09      PP07
|    C   41                Z-ADD0         PP07
|    C                     MOVELDBG022    PP08
|    C           PP06      MULT PP07      DPP10   90H
|    C                     Z-ADDDPP10     PP10
|    C           PP10      MULT DUTY      DPP09   90H
|    C                     Z-ADDDPP09     PP09
|    C                     MOVELDOPT1     PP99
|    C                     Z-ADDDATE      PPXX
|    C                     TIME           PPYY
|    C                     MOVEL$USER     PPZZ
|    C                     WRITEPP0
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          RTN302....WRITE POPIPF
     C*==============================================================*
19===C           RTN302    BEGSR
|    C*
|    C                     Z-ADD0         AMT1   110
|    C           KEYPP     CHAINPI0                  45
| 01-C           *IN45     IFEQ '1'
|   C                     MOVEL'R1'      PI01
|   C                     MOVELGNUM      PI02
|   C                     MOVELSBG06H    PI03
|   C                     MOVELSBH02     PI04
|   C                     Z-ADDSBH06     PI05
|   C                     Z-ADDSBH03     PI06
|   C           KEYPO     SETGTPA0
|   C  N41      KEYPO1    REDPEPA0                      41
|   C  N41                Z-ADDPA09      PI07
|   C   41                Z-ADD0         PI07
|   C           PI06      MULT PI07      AMT1      H
|   C                     MOVELDBG022    PI08
|   C           PI06      MULT PI07      DPI10   90H
|   C                     Z-ADDDPI10     PI10
|   C           PI10      MULT DUTY      DPI09   90H
|   C                     Z-ADDDPI09     PI09
|   C                     Z-ADDDATE      PIXX
|   C                     TIME           PIYY
|   C                     MOVEL$USER     PIZZ
|   C                     WRITEPI0
| 01-C                     ENDIF
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          RTN303....WRITE POPHPF
     C*==============================================================*
20===C           RTN303    BEGSR
|    C*
|    C           GNUM      CHAINPH0                  40
| 01-C           *IN40     IFEQ '1'
|   C*
|   C                     MOVEL'R1'      PH01
|   C                     MOVELGNUM      PH02
|   C                     MOVEL'I4'      PH03
|   C                     Z-ADDSBH06     PH04
|   C                     MOVELDBG022    PH05
|   C                     MOVELSBG04H    PH06
|   C                     MOVEL*BLANK    PH07
|   C                     MOVEL*BLANK    PH08
|   C                     MOVEL*BLANK    PH09
|   C                     MOVEL*BLANK    PH10
|   C                     Z-ADDPI10      PH11
|   C                     Z-ADDPI09      PH12
|   C                     Z-ADDDATE      PHXX
|   C                     TIME           PHYY
|   C                     MOVEL$USER     PHZZ
|   C                     WRITEPH0
| 01*C                     ELSE
|   C                     ADD  PI10      PH11
|   C                     ADD  PI09      PH12
|   C                     Z-ADDDATE      PHXX
|   C                     TIME           PHYY
|   C                     MOVEL$USER     PHZZ
|   C                     UPDATPH0
|   C*
| 01-C                     ENDIF
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN304....WRITE IMIAPF
     C*==============================================================*
21===C           RTN304    BEGSR
|    C*
|    C                     MOVEL'R'       CMP
|    C           SBH02     CHAINMA0                 N41
|    C*
|    C           KEYIA     CHAINIA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVELDBG022    IA02
|   C                     MOVELSBH02     IA03
|   C                     MOVEL'R'       IA01
|   C                     MOVEL*BLANK    IA04
|   C                     MOVEL*BLANK    IA05
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA09      IA04
|   C                     MOVELMA08      IA05
| 02-C                     ENDIF
|   C                     Z-ADDSBH03     IA06
|   C                     Z-ADDSBH03     IA07
|   C                     Z-ADD0         IA08
|   C                     Z-ADD0         IA09
|   C                     Z-ADDSBH03     IA10
|   C                     Z-ADDDATE      IAXX
|   C                     TIME           IAYY
|   C                     MOVEL$USER     IAZZ
|   C                     WRITEIA0
| 01*C                     ELSE
|   C                     ADD  SBH03     IA06
|   C                     ADD  SBH03     IA07
|   C                     ADD  SBH03     IA10
|   C                     Z-ADDDATE      IAXX
|   C                     TIME           IAYY
|   C                     MOVEL$USER     IAZZ
|   C                     UPDATIA0
| 01-C                     ENDIF
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          RTN305....UPDAT MTMHPF
     C*==============================================================*
22===C           RTN305    BEGSR
|    C*
|    C           SBH02     CHAINMH0                  40
| 01-C           *IN40     IFEQ '0'
|   C           MA07      ANDEQ'K'
|   C*
|   C                     ADD  AMT1      MA26
|   C                     ADD  SBH03     MA30
| 02-C           MA30      IFEQ 0
|   C                     Z-ADD0         MA31
| 02*C                     ELSE
|   C           MA26      DIV  MA30      MA31      H
| 02-C                     ENDIF
|   C           MA31      ADD  MA32      MA34
|   C                     ADD  MA33      MA34
|   C                     Z-ADDDATE      MAXX
|   C                     TIME           MAYY
|   C                     MOVEL$USER     MAZZ
|   C                     UPDATMH0
| 01-C                     ENDIF
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          GETNUM ...驗收取號
     C*==============================================================*
23===C           GETNUM    BEGSR
|    C*
|    C                     CALL 'RES003'
|    C                     PARM 'R1'      S003I1  2
|    C                     PARM 'I4'      S003I2  2
|    C                     PARM DMON      S003I3  20
|    C           GNUM      PARM           S003O1 12
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*          RTN380....CHECK 'SC03' --- SFLSR
     C*==============================================================*
24===C           RTN380    BEGSR
|    C*
|    C                     SETON                     54
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*
|   C                     SETOF                     61
|   C*
|   C   99                GOTO UPD
|   C*
| 02-C           SBH03     IFGT SBF03
|   C                     SETON                     6199
|   C                     MOVEL'MSG0041' ERRID
|   C                     MOVEL'R1MF'    ERRF
| 02-C                     ENDIF
|   C   99                GOTO DSP
|   C*
|   C           DSP       TAG
|   C   99                Z-ADDRRN2      DRRN2
|   C*
|   C           UPD       TAG
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                   57
| 01-C                     ENDDO
|    C*
24===C           END380    ENDSR
**
新增修改      刪除查詢確認
