     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : KIS0061                                    *
     H*    PROGRAM NAME :茂世產品匯總表(後台)                    *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/03/26                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                          *
     H****************************************************************
     FPOPHPF  IP  E           K        DISK
     FPOPIPF  IF  E           K        DISK
     FW2BGLF03IF  E           K        DISK
     FMTMBPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FW2CEPF  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      139 139 $RMK01
     I                                      201 2080$A8YMD
     I                                      201 2060DYM
     I                                      203 2080DDATE
     I                                      510 510 DATA
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYCE     KLIST
     C                     KFLD           CE04
     C                     KFLD           CE07
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100                      .MAIN
      *
     C                     EXSR R0200                      .MAIN
     C                     OUT  LDA
     C*==============================================================*
     C*                    R0100 ... DEL 原本的資料
     C*==============================================================*
01===C           R0100     BEGSR
|     *
|    C           *LOCK     IN   *NAMVAR
|     *
|    C                     SETON                     10
|    C                     MOVEL'N'       DATA    1
|     *
01===C                     ENDSR
     C*==============================================================*
     C*                    R0200 ... INIT PROCESS
     C*==============================================================*
02===C           R0200     BEGSR
|     *
|    C           PH02      SETLLPI0
|    C           PH02      READEPI0                      46
| 01-C           *IN46     DOWEQ'0'
|    *
     C                     MOVELPH02      CE04
     C                     MOVELPI04      CE07
     C           KEYCE     CHAINCE0                  40
     C           *IN40     IFEQ '1'
     C                     MOVELPH06      CE01
     C           CE01      CHAINMB0                  41
     C  N41                MOVELMB03      CE02
     C   41                MOVEL*BLANK    CE02
     C                     Z-ADDPI05      CE03
     C                     MOVELPI08      CE05
     C           CE05      CHAINME0                  42
     C  N42                MOVELME04      CE06
     C   42                MOVEL*BLANK    CE06
     C           CE07      CHAINMA0                  43
     C  N43                MOVELMA03      CE08
     C   43                MOVEL*BLANK    CE08
     C                     Z-ADDPI06      CE09
     C                     Z-ADDPI07      CE10
     C                     Z-ADDPI10      CE11
     C                     Z-ADDPI09      CE12
     C                     MOVELPI03      CE14
     C           CE14      CHAINBG0                  44
     C  N44                Z-ADDBG01      CE13
     C  N44                MOVELBG03      CE15
     C   44                Z-ADD*ZERO     CE13
     C   44                MOVEL*BLANK    CE15
     C                     WRITECE0
|    C                     MOVEL'Y'       DATA
     C                     ELSE
     C                     ENDIF
|    *
|   C           PH02      READEPI0                      46
| 01-C                     ENDDO
|     *
02===C                     ENDSR
     C*==============================================================*
