     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : KIS0201                                    *
     H*    PROGRAM NAME :產品代號報表                              *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 2009/07/03                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FKIS021D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      131 1340$WWW
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 501 DSC33S
     I                                      502 502 DSC33E
     I                                      503 507 DSC04S
     I                                      508 512 DSC04E
     I                                      513 521 DSD03S
     I                                      522 530 DSD03E
     I                                      531 5360DSC39S
     I                                      537 5420DSC39E
     I                                      550 5570WSC39S
     I                                      560 5670WSC39E
     I            DS
     I                                        1   5 XSC04S
     I                                        1   1 SC04S
     I            DS
     I                                        1   5 XSC04E
     I                                        1   1 SC04E
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     Z-ADD*ZERO     DSC39S
|    C                     Z-ADD*ZERO     DSC39E
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     IN   LDA
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFNE '2'                        NOT-BATCH
|   C           $DATA     ANDEQ'N'                        NO-DATA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     GOTO E0200
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
| 04-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C*
02===C           E0200     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
| 03-C           *IN07     IFEQ '1'
|   C                     CALL 'KIS0212C'                 .PROMPT
|   C                     GOTO E1000
| 03-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 04-C           *IN99     IFEQ *ZERO
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 04-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
| 01-C           DSC33S    IFEQ *BLANK
|   C                     MOVEL*LOVAL    DSC33S
| 01-C                     END
| 02-C           DSC33E    IFEQ *BLANK
|   C                     MOVEL*HIVAL    DSC33E
| 02-C                     END
|     *
| 03-C           DSC33S    IFGT DSC33E
|   C                     SETON                     616299
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     ENDIF
|    C   99                GOTO E1B00
|     *
| 04-C           DSC04S    IFNE *BLANK
|   C                     MOVELDSC04S    XSC04S
| 05-C           SC04S     IFNE 'B'
|   C                     SETON                     6399
|   C                     MOVEL'UPT6001' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 05-C                     ENDIF
| 04-C                     ENDIF
|    C   99                GOTO E1B00
|     *
| 06-C           DSC04E    IFNE *BLANK
|   C                     MOVELDSC04E    XSC04E
| 07-C           SC04E     IFNE 'B'
|   C                     SETON                     6499
|   C                     MOVEL'UPT6001' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 07-C                     ENDIF
| 06-C                     ENDIF
|    C   99                GOTO E1B00
|     *
| 08-C           DSC04S    IFEQ *BLANK
|   C                     MOVEL'BAAAA'   DSC04S
| 08-C                     END
| 09-C           DSC04E    IFEQ *BLANK
|   C                     MOVEL'B9999'   DSC04E
| 09-C                     END
|     *
| 10-C           DSC04S    IFGT DSC04E
|   C                     SETON                     636499
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 10-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
| 11-C           DSD03S    IFEQ *BLANK
|   C                     MOVEL*LOVAL    DSD03S
| 11-C                     END
| 12-C           DSD03E    IFEQ *BLANK
|   C                     MOVEL*HIVAL    DSD03E
| 12-C                     END
|     *
| 13-C           DSD03S    IFGT DSD03E
|   C                     SETON                     656699
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 13-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
| 14-C           DSC39S    IFEQ *ZERO
|   C                     SETON                     6799
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 14-C                     ENDIF
|    C   99                GOTO E1B00
|     *
|    C                     CALL 'P09'
|    C                     PARM DSC39S    P0901I  60
|    C                     PARM           P0911O  1
| 15-C           P0911O    IFEQ 'N'
|   C                     SETON                     6799
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 15-C                     ENDIF
|    C   99                GOTO E1B00
|     *
|     *
| 16-C           DSC39E    IFEQ *ZERO
|   C                     SETON                     6899
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 16-C                     ENDIF
|    C   99                GOTO E1B00
|     *
|    C                     CALL 'P09'
|    C                     PARM DSC39E    P0901I  60
|    C                     PARM           P0911O  1
| 17-C           P0911O    IFEQ 'N'
|   C                     SETON                     6899
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 17-C                     ENDIF
|    C   99                GOTO E1B00
|     *
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|     *
|    C                     Z-ADD0         WSC39S  80
|    C                     Z-ADD0         WSC39E  80
|     *
|    C                     CALL 'P31'
|    C                     PARM DSC39S    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WSC39S    PARM           P3101O  80
|     *
|    C                     CALL 'P31'
|    C                     PARM DSC39E    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           WSC39E    PARM           P3101O  80
|     *
| 18-C           WSC39E    IFLT WSC39S
|   C                     SETON                     676899
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 18-C                     ENDIF
|    C   99                GOTO E1B00
|     *
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|     *
| 01-C           #LIN      IFEQ 7
|   C           #COL      ANDGE35
|   C           #COL      ANDLE35
|   C                     CALL 'WDS018'
|   C           DSC33S    PARM DSC33S    PARM1   1
| 01-C                     END
|     *
| 02-C           #LIN      IFEQ 7
|   C           #COL      ANDGE39
|   C           #COL      ANDLE39
|   C                     CALL 'WDS018'
|   C           DSC33E    PARM DSC33E    PARM1   1
| 02-C                     END
|     *
| 03-C           #LIN      IFEQ 9
|   C           #COL      ANDGE35
|   C           #COL      ANDLE39
|   C                     CALL 'WDS024'
|   C           DSC04S    PARM DSC04S    PARM2   5
|   C                     PARM           PARM3   4
| 03-C                     END
|     *
| 04-C           #LIN      IFEQ 9
|   C           #COL      ANDGE43
|   C           #COL      ANDLE47
|   C                     CALL 'WDS024'
|   C           DSC04E    PARM DSC04E    PARM2   5
|   C                     PARM           PARM3   4
| 04-C                     END
|     *
| 04-C           #LIN      IFEQ 11
|   C           #COL      ANDGE35
|   C           #COL      ANDLE43
|   C                     CALL 'WDS001'
|   C           DSD03S    PARM DSD03S    PARM4   9
| 04-C                     END
|     *
| 04-C           #LIN      IFEQ 11
|   C           #COL      ANDGE47
|   C           #COL      ANDLE55
|   C                     CALL 'WDS001'
|   C           DSD03E    PARM DSD03E    PARM4   9
| 04-C                     END
|     *
|    C*-------------------------------------------------------------***
05===C           E1E00     ENDSR
     C*==============================================================*
