     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : KIS0181                                    *
     H*    PROGRAM NAME :物流點庫存報表-年終庫存資料             *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 2009/06/16                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FKIS018D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      125 1270$CPY
     I                                      131 1340$WWW
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 505 DIA02S
     I                                      506 510 DIA02E
     I                                      511 519 DIA03S
     I                                      520 528 DIA03E
     I                                      530 5330DIY15
     I                                      540 5450WIY15
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C                     MOVEL*BLANK    W#Y01  10
     C                     MOVEL*BLANK    W#Y02  10
     C           KEY#Y     KLIST                           *PT#YPF
     C                     KFLD           W#Y01  10
     C                     KFLD           W#Y02  10
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVE *BLANK    DIA02S
|    C                     MOVE *BLANK    DIA02E
|    C                     MOVE *BLANK    DIA03S
|    C                     MOVE *BLANK    DIA03E
|    C                     Z-ADD$WWW      DIY15
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     IN   LDA
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
| 01-C           $PENV     IFNE '2'                        NOT-BATCH
|   C           $DATA     ANDEQ'N'                        NO-DATA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     GOTO E0200
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
| 04-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     END
|    C*
02===C           E0200     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
| 03-C           *IN07     IFEQ '1'
|   C                     CALL 'KIS0182C'                 .PROMPT
|   C                     GOTO E1000
| 03-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 04-C           *IN99     IFEQ *ZERO
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 04-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
| 01-C           DIA02S    IFEQ *BLANK
|   C                     MOVEL*LOVAL    DIA02S
| 01-C                     END
| 02-C           DIA02E    IFEQ *BLANK
|   C                     MOVEL*HIVAL    DIA02E
| 02-C                     END
|    C*
| 03-C           DIA03S    IFEQ *BLANK
|   C                     MOVEL*LOVAL    DIA03S
| 03-C                     END
| 04-C           DIA03E    IFEQ *BLANK
|   C                     MOVEL*HIVAL    DIA03E
| 04-C                     END
|     *
| 05-C           DIY15     IFEQ *ZERO
|   C                     SETON                     9966
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 05-C                     ENDIF
|    C   99                GOTO E1B00
|     *
|    C                     Z-ADD0         WIY15   60
|     *
|    C                     CALL 'P38'
|    C                     PARM DIY15     P3801I  60
|    C                     PARM '3'       P3802I  1
|    C                     PARM '1'       P3803I  1
|    C           WIY15     PARM           P3801O  60
|    C                     PARM           P3811O  1
|     *
| 06-C           P3811O    IFEQ 'N'
|   C                     SETON                     9966
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 06-C                     ENDIF
|    C   99                GOTO E1B00
|     *
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|     *
|     *
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|     *
| 01-C           #LIN      IFEQ 10
|   C           #COL      ANDGE41
|   C           #COL      ANDLE49
|   C                     CALL 'WDS001'
|   C           DIA03S    PARM DIA03S    P101I1  9         公司別
| 01-C                     END
|     *
| 02-C           #LIN      IFEQ 11
|   C           #COL      ANDGE41
|   C           #COL      ANDLE49
|   C                     CALL 'WDS001'
|   C           DIA03E    PARM DIA03E    P101I1  9         公司別
| 02-C                     END
|     *
|    C*-------------------------------------------------------------***
05===C           E1E00     ENDSR
     C*==============================================================*
