     A****************************************************************
     A*    PROGRAM ID   : KIS007                                     *
     A*    AUTHOR       : A1492 TERRY                                *
     A*    DATE WRITTEN : 97/03/10                                   *
     A*===============================================================
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*================================================================
     A****************************************************************
      *後台訂單訂貨主檔
     FW2BCPF  UF  E           K        DISK
      *後台訂單訂貨明細檔
     FW2BDPF  UF  E           K        DISK
      *後台採購主檔
     FW2BEPF  UF  E           K        DISK                      A
      *後台採購明細檔
     FW2BFPF  UF  E           K        DISK                      A
      *後台採購驗收檔
     FW2BGPF  UF  E           K        DISK                      A
     FW2BHPF  UF  E           K        DISK                      A
      *後台訂單工作檔
     FRMWK01  UF  E           K        DISK                      A
      *供應商報價檔
     FPOPALF01IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FIMIAPF  UF  E           K        DISK
      *調撥檔
     FW1AFLF01UF  E           K        DISK                      A
     FW1AGPF  UF  E           K        DISK                      A
     FKIS008P O   E             39     PRINTER
     E*
     E                    @EA       999  9   @EA1    9 0
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      201 2080$A8YMD
     I*
     I                                      509 509 CHK
     I                                      510 510 DATA
     I            DS
     I                                        1   80WK01
     I                                        5   60DMON
     I            DS
     I                                        1   80BC01
     I                                        5   60DMON1
      *
     I              '無該產品資料    '  C         @A1
     I              '無報價資料      '  C         @A2
     I              '調撥可用量不足  '  C         @A3
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C*
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           P1KEY     KLIST
     C                     KFLD           BE01
     C                     KFLD           BE02
     C                     KFLD           BE03
     C           P2KEY     KLIST
     C                     KFLD           BF01
     C                     KFLD           BF02
     C           P3KEY     KLIST
     C                     KFLD           PA01
     C                     KFLD           PA03
     C                     KFLD           PA04
     C           P3KEY1    KLIST
     C                     KFLD           PA01
     C                     KFLD           PA03
     C           P4KEY     KLIST
     C                     KFLD           WK01
     C                     KFLD           WK02
     C                     KFLD           WK03
     C           P5KEY     KLIST
     C                     KFLD           WK03
     C                     KFLD           WK04
     C           P6KEY     KLIST
     C                     KFLD           BG01
     C                     KFLD           BG02
     C                     KFLD           BG03
     C           P7KEY     KLIST
     C                     KFLD           BC01
     C                     KFLD           BC02
     C           P8KEY     KLIST
     C                     KFLD           BD07
     C                     KFLD           BD02
     C           P9KEY     KLIST
     C                     KFLD           BH01
     C                     KFLD           BH02
     C           P10KEY    KLIST
     C                     KFLD           AF01
     C                     KFLD           AF04
     C                     KFLD           AF02
     C           P11KEY    KLIST
     C                     KFLD           AG01
     C                     KFLD           AG02
     C           P12KEY    KLIST
     C                     KFLD           BD03
     C                     KFLD           BD02
     C                     KFLD           BC01
     C           P13KEY    KLIST
     C                     KFLD           BD03
     C                     KFLD           BD02
     C           P14KEY    KLIST
     C                     KFLD           DIA01   1
     C                     KFLD           DIA02   5
     C                     KFLD           DIA03   9
     C*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C  N10                EXSR RTN001
     C*
  01-C           CHK       IFEQ 'N'
    C*
    C   10                EXSR RTN010
    C*
    C   10                EXSR RTN190
    C*
  01-C                     ENDIF
      *
     C                     OUT  LDA
      *
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN001....INITIAL VALUE
     C*==============================================================*
01===C           RTN001    BEGSR
|     *
|    C                     SETON                     10
|    C                     MOVEL'R'       DIA01
|    C                     MOVEL'W9999'   DIA02
|    C                     MOVEL*BLANK    DIA03
|    C                     MOVEL*BLANK    HEAD    1
|    C                     MOVEL*BLANK    DSE
|    C                     MOVEA*BLANK    @EA
|    C                     Z-ADD0         @EA1
|    C                     Z-ADD0         I       30
|    C                     Z-ADD0         BC01
|    C                     Z-ADD0         DMON1
|     *
|    C           *LOVAL    SETLLBC0
|    C                     READ BC0                      46
| 01-C           *IN46     DOWEQ'0'
|    *
|   C           BC03      SETLLBD0
|   C           BC03      READEBD0                      47
| 02-C           *IN47     DOWEQ'0'
|    *
|   C           BD02      CHAINMA0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL'Y'       CHK
|   C                     MOVEL@A1       DSE
|   C                     WRITEPD1
|   C                     MOVEL*BLANK    DSE
| 03-C                     ENDIF
|    *
| 04-C           MA07      IFEQ 'K'
|    *
|   C           P12KEY    SETGTPA0
|   C           P13KEY    REDPEPA0                      41
| 05-C           *IN41     IFEQ '1'
| 06-C           HEAD      IFEQ *BLANK
|   C                     MOVEL'Y'       HEAD
|   C                     WRITEPH1
| 06-C                     ENDIF
|   C                     MOVEL'Y'       CHK
|   C                     MOVEL@A2       DSE
|   C                     WRITEPD1
|   C                     MOVEL*BLANK    DSE
| 05-C                     ENDIF
|    *
| 07-C           *IN41     IFEQ '0'
| 08-C           BC01      IFLT PA04
|   C           BC01      ORGT PA06
| 09-C           HEAD      IFEQ *BLANK
|   C                     MOVEL'Y'       HEAD
|   C                     WRITEPH1
| 09-C                     ENDIF
|   C                     MOVEL'Y'       CHK
|   C                     MOVEL@A2       DSE
|   C                     WRITEPD1
|   C                     MOVEL*BLANK    DSE
| 08-C                     ENDIF
| 07-C                     ENDIF
|    *
| 04*C                     ELSE
|   C                     Z-ADD1         J       40
|   C           BD02      LOKUP@EA,J                    11
| 10-C           *IN11     IFEQ '0'
|   C                     ADD  1         I
|   C                     MOVELBD02      @EA,I
|   C                     Z-ADDBD05      @EA1,I
| 10*C                     ELSE
|   C                     ADD  BD05      @EA1,J
| 10-C                     ENDIF
| 04-C                     ENDIF
|    *
|   C           BC03      READEBD0                      47
| 02-C                     ENDDO
|    *
|   C                     READ BC0                      46
| 01-C                     ENDDO
|     *
| 11-C           1         DO   999       J
| 12-C           @EA,J     IFEQ *BLANK
|   C                     LEAVE
| 12-C                     ENDIF
|   C                     MOVEL@EA,J     DIA03
|   C           P14KEY    CHAINIA0                  40
| 13-C           *IN40     IFEQ '0'
| 14-C           IA10      IFLT @EA1,J
| 15-C           HEAD      IFEQ *BLANK
|   C                     MOVEL'Y'       HEAD
|   C                     WRITEPH1
| 15-C                     ENDIF
|   C                     MOVEL'Y'       CHK
|   C                     MOVEL@EA,J     BD02
|   C           BD02      CHAINMA0                  40
|   C                     MOVEL@A3       DSE
|   C                     WRITEPD1
|   C                     MOVEL*BLANK    DSE
| 14-C                     ENDIF
| 13*C                     ELSE
| 16-C           @EA1,J    IFNE 0
| 17-C           HEAD      IFEQ *BLANK
|   C                     MOVEL'Y'       HEAD
|   C                     WRITEPH1
| 17-C                     ENDIF
|   C                     MOVEL'Y'       CHK
|   C                     MOVEL@EA,J     BD02
|   C           BD02      CHAINMA0                  40
|   C                     MOVEL@A3       DSE
|   C                     WRITEPD1
|   C                     MOVEL*BLANK    DSE
| 16-C                     ENDIF
| 13-C                     ENDIF
| 11-C                     ENDDO
|     *
| 18-C           CHK       IFEQ 'Y'
|   C                     WRITEPE1
| 18-C                     ENDIF
|     *
01===C                     ENDSR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
02===C           RTN010    BEGSR
|    C*
|    C                     MOVEL*BLANK    TWK05   5
|    C                     MOVEL*BLANK    TWK02   5
|    C                     Z-ADD*ZERO     TWK01   80
|    C                     Z-ADD0         AF01
|    C                     MOVEL*BLANK    AF02
|    C                     MOVEL*BLANK    AF04
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN190....PROCESS
     C*==============================================================*
03===C           RTN190    BEGSR
|    C*
|    C                     EXSR RTN191
|    C                     EXSR RTN192
|    C                     EXSR RTN193
|    C*
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN191....WRITE WORKFILE
     C*==============================================================*
04===C           RTN191    BEGSR
|    C*
|    C           *LOVAL    SETLLBC0
|    C                     READ BC0                      46
| 01-C           *IN46     DOWEQ'0'
|   C           BC03      SETLLBD0
|   C           BC03      READEBD0                      45
| 02-C           *IN45     DOWEQ'0'
| 03-C           BD05      IFNE 0
|   C           BD02      CHAINMA0                  40
| 04-C           *IN40     IFEQ '0'
|   C           MA07      ANDNE'R'
|   C                     Z-ADDBC01      WK01
|   C                     MOVELBC02      WK02
|   C                     MOVELBC03      WK03
|   C                     MOVELBD02      WK04
|   C                     MOVELBD03      WK05
|   C                     Z-ADDBD05      WK06
|   C                     WRITEWK0
|   C                     MOVEL'Y'       DATA
| 04*C                     ELSE
|   C                     EXSR RTN201
|   C                     MOVEL'Y'       DATA
| 04-C                     ENDIF
| 03-C                     ENDIF
|   C           BC03      READEBD0                      45
| 02-C                     ENDDO
|   C                     READ BC0                      46
| 01-C                     ENDDO
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN192....WRITE W2BEPF
     C*==============================================================*
05===C           RTN192    BEGSR
|    C*
|    C           *LOVAL    SETLLRMWK01
|    C                     READ RMWK01                   46
| 01-C           *IN46     IFEQ '0'
|   C                     MOVELWK05      TWK05
|   C                     MOVELWK02      TWK02
|   C                     Z-ADDWK01      TWK01
|   C                     EXSR RTN202
| 01-C                     ENDIF
| 02-C           *IN46     DOWEQ'0'
|   C*
| 03-C           TWK05     IFNE WK05
|   C           TWK02     ORNE WK02
|   C           TWK01     ORNE WK01
|   C*
|   C                     Z-ADDTWK01     BE01
|   C                     MOVELTWK02     BE02
|   C           P1KEY     CHAINBE0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     EXSR RTN203
|   C                     WRITEBE0
|   C                     CLEARBE0
| 04-C                     ENDIF
|   C*
|   C                     MOVELWK05      TWK05
|   C                     MOVELWK02      TWK02
|   C                     Z-ADDWK01      TWK01
|   C                     EXSR RTN202
| 03-C                     ENDIF
|   C*
|   C                     MOVELBE03      BF01
|   C                     MOVELWK04      BF02
|   C           P2KEY     CHAINBF0                  40
|   C*          *IN40     IFEQ '1'
|   C                     EXSR RTN204
|   C   40                WRITEBF0
|   C  N40                UPDATBF0
|   C                     EXSR RTN205
|   C*                    ENDIF
|   C*
|   C                     READ RMWK01                   46
| 02-C                     ENDDO
|    C*
| 05-C           TWK05     IFNE *BLANK
|   C                     Z-ADDTWK01     BE01
|   C                     MOVELTWK02     BE02
|   C           P1KEY     CHAINBE0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     EXSR RTN203
|   C                     WRITEBE0
|   C                     CLEARBE0
| 06-C                     ENDIF
| 05-C                     ENDIF
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN203.... MOVE DATA
     C*==============================================================*
06===C           RTN203    BEGSR
|    C*
|    C                     MOVEL*BLANK    BE05
|    C                     MOVELTWK05     BE06
|    C                     Z-ADD$A8YMD    BEXX
|    C                     TIME           BEYY
|    C                     MOVEL$USER     BEZZ
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN204.... MOVE DATA
     C*==============================================================*
07===C           RTN204    BEGSR
|    C*
|    C   40                Z-ADDWK06      BF03
|    C  N40                ADD  WK06      BF03
|    C                     MOVELWK05      PA01
|    C                     MOVELWK04      PA03
|    C                     Z-ADDWK01      PA04
|    C                     Z-ADD0         BF04
|    C           P3KEY     SETGTPA0
|    C           P3KEY1    REDPEPA0                      41
|    C  N41                Z-ADDPA09      BF04
|    C   41                Z-ADD0         BF04
|    C           BF03      MULT BF04      BF05
|    C           WK06      MULT BF04      TBE04  112
|    C                     ADD  TBE04     BE04
|    C                     MOVEL*BLANK    BF06
|    C                     Z-ADD$A8YMD    BFXX
|    C                     TIME           BFYY
|    C                     MOVEL$USER     BFZZ
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          RTN202....採購取號
     C*==============================================================*
08===C           RTN202    BEGSR
|    C*
|    C                     CALL 'RES002'
|    C                     PARM 'R1'      S002I1  2
|    C                     PARM 'P3'      S002I2  2
|    C                     PARM '1'       S002I3  1
|    C                     PARM DMON      S002I4  20
|    C           BE03      PARM           S002O1 12
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN205....UPDAT W2BDPF
     C*==============================================================*
09===C           RTN205    BEGSR
|    C*
|    C           P5KEY     CHAINBD0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELBE03      BD07
     C                     Z-ADD$A8YMD    BDXX
     C                     TIME           BDYY
     C                     MOVEL$USER     BDZZ
|   C                     UPDATBD0
| 01-C                     ENDIF
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN193....WRITE W2BGPF W2BHPF
     C*==============================================================*
10===C           RTN193    BEGSR
|    C*
|    C                     Z-ADD0         TWK01
|    C                     MOVEL*BLANK    TWK02
|    C                     MOVEL*BLANK    TWK05
|    C           *LOVAL    SETLLBC0
|    C                     READ BC0                      46
| 01-C           *IN46     DOWEQ'0'
|   C*
|   C           BC03      SETLLBD0
|   C           BC03      READEBD0                      45
| 02-C           *IN45     DOWEQ'0'
| 03-C           BD05      IFEQ 0
|   C                     GOTO $NEXT
| 03-C                     ENDIF
|   C           BD02      CHAINMA0                  40
| 04-C           *IN40     IFEQ '1'
|   C           MA07      OREQ 'R'
|   C                     GOTO $NEXT
| 04-C                     ENDIF
|   C*
| 05-C           TWK01     IFNE BC01
|   C           TWK02     ORNE BC02
|   C           TWK05     ORNE BD03
|   C                     EXSR RTN206
|   C                     Z-ADDBC01      TWK01
|   C                     MOVELBC02      TWK02
|   C                     MOVELBD03      TWK05
| 05-C                     ENDIF
|   C*
|   C                     Z-ADDBC01      BG01
|   C                     MOVELBC02      BG02
|   C           P6KEY     CHAINBG0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVELBD03      BG04
|   C                     Z-ADD0         BG05
|   C                     MOVELBD07      BG06
|   C                     MOVEL*BLANK    BG07
|   C                     Z-ADD$A8YMD    BGXX
|   C                     TIME           BGYY
|   C                     MOVEL$USER     BGZZ
|   C                     WRITEBG0
| 06-C                     ENDIF
|   C*
|   C                     MOVELBG03      BH01
|   C                     MOVELBD02      BH02
|   C           P9KEY     CHAINBH0                  40
| 07-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         BH03
|   C                     Z-ADD0         BH04
|   C                     MOVELBD03      PA01
|   C                     MOVELBD02      PA03
|   C                     Z-ADDBC01      PA04
|   C           P3KEY     SETGTPA0
|   C           P3KEY1    REDPEPA0                      41
|   C  N41                Z-ADDPA09      BH04
|   C   41                Z-ADD0         BH04
|   C                     Z-ADD0         BH05
|   C                     Z-ADD0         BH06
|   C                     Z-ADD$A8YMD    BHXX
|   C                     TIME           BHYY
|   C                     MOVEL$USER     BHZZ
|   C                     WRITEBH0
| 07-C                     ENDIF
|   C*
|   C           P8KEY     CHAINBF0                  40
| 08-C           *IN40     IFEQ '0'
|   C                     MOVELBG03      BF06
|   C                     Z-ADD$A8YMD    BFXX
|   C                     TIME           BFYY
|   C                     MOVEL$USER     BFZZ
|   C                     UPDATBF0
| 08-C                     ENDIF
|   C*
|   C                     MOVEL'P'       BD06
|   C                     Z-ADD$A8YMD    BDXX
|   C                     TIME           BDYY
|   C                     MOVEL$USER     BDZZ
|   C                     UPDATBD0
|   C*
|   C           $NEXT     TAG
|   C           BC03      READEBD0                      45
| 02-C                     ENDDO
|   C*
|   C                     MOVEL'P'       BC04
|   C                     Z-ADD$A8YMD    BCXX
|   C                     TIME           BCYY
|   C                     MOVEL$USER     BCZZ
|   C                     UPDATBC0
|   C*
|   C                     READ BC0                      46
| 01-C                     ENDDO
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN206....驗收取號
     C*==============================================================*
11===C           RTN206    BEGSR
|    C*
|    C                     CALL 'RES003'
|    C                     PARM 'R1'      S003I1  2
|    C                     PARM 'I3'      S003I2  2
|    C                     PARM DMON1     S003I3  20
|    C           BG03      PARM           S003O1 12
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          RTN201....寫調撥檔
     C*==============================================================*
12===C           RTN201    BEGSR
|    C*
| 01-C           BC01      IFNE AF01
|   C           BC02      ORNE AF04
|   C                     Z-ADDBC01      AF01
|   C                     MOVELBC02      AF04
|   C                     EXSR RTN207
|   C           P10KEY    CHAINAF0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'W9999'   AF03
|   C                     MOVEL*BLANK    AF05
|   C                     MOVEL*BLANK    AF06
|   C                     Z-ADD$A8YMD    AFXX
|   C                     TIME           AFYY
|   C                     MOVEL$USER     AFZZ
|   C                     WRITEAF0
| 02-C                     ENDIF
| 01-C                     ENDIF
|    C*
|    C                     MOVELAF02      AG01
|    C                     MOVELBD02      AG02
|    C           P11KEY    CHAINAG0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     Z-ADDBD05      AG03
|   C                     Z-ADD0         AG04
|   C                     MOVEL*BLANK    AG05
|   C                     MOVEL*BLANK    AG06
|   C                     Z-ADD$A8YMD    AGXX
|   C                     TIME           AGYY
|   C                     MOVEL$USER     AGZZ
|   C                     WRITEAG0
| 03*C                     ELSE
|   C                     ADD  BD05      AG03
|   C                     Z-ADD$A8YMD    AGXX
|   C                     TIME           AGYY
|   C                     MOVEL$USER     AGZZ
|   C                     UPDATAG0
| 03-C                     ENDIF
|    C*計算保留量，以及可用量
|    C                     EXSR RTN500
|    C*
|    C                     MOVEL'P'       BD06
|   C                     Z-ADD$A8YMD    BDXX
|   C                     TIME           BDYY
|   C                     MOVEL$USER     BDZZ
|    C                     UPDATBD0
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN207....採購取號
     C*==============================================================*
13===C           RTN207    BEGSR
|    C*
|    C                     CALL 'RES007'
|    C                     PARM 'R1'      S002I1  2
|    C                     PARM 'M3'      S002I2  2
|    C                     PARM '1'       S002I3  1
|    C                     PARM DMON1     S002I4  20
|    C           AF02      PARM           S002O1 12
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          RTN500...計算可用量跟保留量
     C*==============================================================*
14===C           RTN500    BEGSR
|     *
|    C                     MOVEL'R'       DIA01
|    C                     MOVELAF03      DIA02
|    C                     MOVELBD02      DIA03
|     *
|    C           P14KEY    CHAINIA0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  BD05      IA09
|   C                     SUB  BD05      IA10
|   C                     Z-ADD$A8YMD    IAXX
|   C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
|   C                     UPDATIA0
| 01-C                     ENDIF
|     *
14===C                     ENDSR
