     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : KIS0182                                    *
     H*    PROGRAM NAME :物流點庫存報表-年終                     *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 2009/06/17                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H****************************************************************
     FIMIYPF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FIMIXPF  IF  E           K        DISK
     FW1AALF01IF  E           K        DISK
     FIMI1PF  IF  E           K        DISK
     F            IX0                               KRENAMEI10
     FREW504  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     I*
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      125 1270$CPY
     I                                      201 2080$EG8
     I                                      211 2160DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 505 DIA02S
     I                                      506 510 DIA02E
     I                                      511 519 DIA03S
     I                                      520 528 DIA03E
     I                                      530 5330DIY15
     I                                      540 5450WIY15
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
      *
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYIX     KLIST
     C                     KFLD           WIY15
     C                     KFLD           IY03
      *
     C           KEYAA     KLIST
     C                     KFLD           WF01
     C                     KFLD           $EG8
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C                     EXSR RTN100
     C*==============================================================*
     C*          RTN010... INITIAL PROCESS
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   PTDA01
|    C*
|    C                     SETON                     10
|    C                     SETON                     39
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... WRITE REW503
     C*==============================================================*
02===C           RTN100    BEGSR
|     *
|    C                     CLEARWF0
|    C                     Z-ADDWIY15     WF04
|     *
|    C           IY03      CHAINWF0                  40
| 01-C           *IN40     IFEQ '1'
|    *茂世單位成本計算方式
|    *茂世產品抓取IMIXPF
|   C           IY03      CHAINMA0                  42
| 02-C           MA07      IFEQ 'R'
|   C           KEYIX     CHAINIX0                  41
|   C                     MOVELMA01      WF01
|   C                     MOVELMA03      WF02
|    *
|   C           KEYAA     SETGTAA0
|   C           WF01      REDPEAA0                      46
| 03-C           *IN46     IFEQ '0'
|   C                     Z-ADDAA04      WF05
| 03*C                     ELSE
|   C                     Z-ADD0         WF05
| 03-C                     ENDIF
|    *
|   C                     Z-ADD0         X1     122       FOB+FHI
|   C                     Z-ADD0         X2      70       庫存量
|   C                     Z-ADD0         X3      92       暫存
|    *
|   C           IX08      ADD  IX09      X1        H
|   C           IX06      ADD  IX07      X2
| 03-C           X2        IFNE 0
|   C           X1        DIV  X2        WF03      H
| 04-C           IX07      IFNE 0
|   C           IX10      DIV  IX07      X3        H
| 04*C                     ELSE
|   C                     Z-ADD0         X3
| 04-C                     ENDIF
|   C                     ADD  X3        WF03
|    *
| 03*C                     ELSE
|   C                     Z-ADD0         WF03
| 05-C           IX07      IFNE 0
|   C           IX10      DIV  IX07      X3        H
| 05*C                     ELSE
|   C                     Z-ADD0         X3
| 05-C                     ENDIF
|   C                     ADD  X3        WF03
| 03-C                     ENDIF
|    *
|   C                     EXSR RTN200
|    *
| 02*C                     ELSE
|   C           KEYIX     CHAINI10                  41
|   C                     MOVELIY03      WF01
|   C                     MOVELMA03      WF02
|    *
|   C           KEYAA     SETGTAA0
|   C           WF01      REDPEAA0                      46
| 03-C           *IN46     IFEQ '0'
|   C                     Z-ADDAA04      WF05
| 03*C                     ELSE
|   C                     Z-ADD0         WF05
| 03-C                     ENDIF
|    *
|   C                     Z-ADDIX05      WF03
|   C                     EXSR RTN200
| 02-C                     ENDIF
|    *
|   C                     WRITEWF0
| 01*C                     ELSE
|    *
|   C                     EXSR RTN200
|    *
|   C                     UPDATWF0
| 01-C                     ENDIF
|     *
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200... WRITE REW503
     C*==============================================================*
03===C           RTN200    BEGSR
|     *
| 01-C                     SELEC
|   C           IY02      WHEQ 'B0000'
|   C                     ADD  IY06      B0000
|   C           IY02      WHEQ 'B0003'
|   C                     ADD  IY06      B0003
|   C           IY02      WHEQ 'B0006'
|   C                     ADD  IY06      B0006
|   C           IY02      WHEQ 'B0007'
|   C                     ADD  IY06      B0007
|   C           IY02      WHEQ 'B0011'
|   C                     ADD  IY06      B0011
|   C           IY02      WHEQ 'B0013'
|   C                     ADD  IY06      B0013
|   C           IY02      WHEQ 'B0014'
|   C                     ADD  IY06      B0014
|   C           IY02      WHEQ 'B0015'
|   C                     ADD  IY06      B0015
|   C           IY02      WHEQ 'B0017'
|   C                     ADD  IY06      B0017
|   C           IY02      WHEQ 'B0018'
|   C                     ADD  IY06      B0018
|   C           IY02      WHEQ 'B0019'
|   C                     ADD  IY06      B0019
|   C           IY02      WHEQ 'B0022'
|   C                     ADD  IY06      B0022
|   C           IY02      WHEQ 'B0026'
|   C                     ADD  IY06      B0026
|   C           IY02      WHEQ 'B0030'
|   C                     ADD  IY06      B0030
|   C           IY02      WHEQ 'B0031'
|   C                     ADD  IY06      B0031
|   C           IY02      WHEQ 'B0032'
|   C                     ADD  IY06      B0032
|   C           IY02      WHEQ 'B0033'
|   C                     ADD  IY06      B0033
|   C           IY02      WHEQ 'B0099'
|   C                     ADD  IY06      B0099
|   C           IY02      WHEQ 'B1001'
|   C                     ADD  IY06      B1001
|   C           IY02      WHEQ 'W0005'
|   C                     ADD  IY06      W0005
|   C           IY02      WHEQ 'W9999'
|   C                     ADD  IY06      W9999
| 01-C                     ENDSL
|     *
03===C                     ENDSR
