      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : MSOR0411                                      *
      * AUTHER       :                                               *
      * CREATE DATE  : 82/01/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :業務員銷售月報表　　                         *
      ****************************************************************
     FSOCDPF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMSOR041PO   E             39     PRINTER
     ICD0
     I                                              CD04  L1
     I                                              CD28  L2
     I                                              CD13  L3
     I                                              CD02  L4
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I*辦事處，通路，地區，組別，業務員，產品
     I*
     I                                      600 600 COMP
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      603 603 DCD13S
     I                                      604 604 DCD13E
     I                                      695 696 DCD14S
     I                                      697 698 DCD14E
     I                                      605 606 DCD11S
     I                                      607 608 DCD11E
     I                                      609 612 DCD10S
     I                                      613 616 DCD10E
     I                                      617 622 DCD09S
     I                                      623 628 DCD09E
     I                                      630 638 DCD04S
     I                                      640 648 DCD04E
     I                                      675 683 DCD06S
     I                                      684 692 DCD06E
     I*(MM/YY)
     I                                      650 6530DCD01S
     I                                      650 6510WCD01M
     I                                      650 651 DCD01M
     I                                      652 653 DCD01Y
     I*(MM/YY)
     I                                      654 6570DCD01E
     I                                      654 6550WCD1EM
     I                                      654 655 DCD1EM
     I                                      656 657 DCD1EY
     I*(YY/MM)
     I                                      658 661 YCD01S
     I                                      670 673 YCD01E
     I                                      665 665 DSEL
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11A
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *INIT ENVIRM
  01*C                     ELSE
    C*
  02-C           *INL3     IFEQ '1'
    C                     WRITEPE1
    C*
  03-C           CD02      IFEQ '1'
    C                     MOVEL'台北'  COMPC
  03*C                     ELSE
  04-C           CD02      IFEQ '2'
    C                     MOVEL'台中'  COMPC
  04*C                     ELSE
    C                     MOVEL'高雄'  COMPC
  04-C                     END
  03-C                     END
    C*種類
    C                     MOVEL*BLANKS   GROUP
  05-C           DMA11     IFEQ '1'
    C                     MOVEL'白蘭地'GROUP
  05*C                     ELSE
  06-C           DMA11     IFEQ '2'
    C                     MOVEL'威士忌'GROUP
  06*C                     ELSE
  07-C           DMA11     IFEQ '3'
    C                     MOVEL'葡萄酒'GROUP
  07*C                     ELSE
    C                     MOVEL'全部'  GROUP
  07-C                     END
  06-C                     END
  05-C                     END
    C*通路
    C                     MOVEL'DISTRUBT'#A01
    C                     MOVELCD13      #A02
    C           KEY#A     CHAIN#A0                  41
  08-C           *IN41     IFEQ '1'
    C                     MOVE *BLANK    #A03
  08-C                     END
    C*
  09-C           DSEL      IFEQ 'A'
    C                     SETON                     20
  09*C                     ELSE
    C                     SETOF                     20
  09-C                     END
    C                     WRITEPH1
    C*
  02-C                     END
  01-C                     END
     C*
     C                     EXSR RTN100                     *GET HEADING
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CL3 10                EXSR RTN400
     CL4 10                EXSR RTN500
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         CD161
|    C                     Z-ADD0         CD171
|    C                     Z-ADD0         CD181
|    C                     Z-ADD0         CD241
|    C                     Z-ADD0         CD201
|    C                     Z-ADD0         CD211
|    C                     Z-ADD0         CD231
|    C                     Z-ADD0         CD261
|    C                     Z-ADD0         CDT11
|    C                     Z-ADD0         CDT21
|    C                     Z-ADD0         CDT31
|    C                     Z-ADD0         TOTAL
|    C                     Z-ADD0         CDT41
|    C                     Z-ADD0         CD162
|    C                     Z-ADD0         CD172
|    C                     Z-ADD0         CD182
|    C                     Z-ADD0         CD242
|    C                     Z-ADD0         CD202
|    C                     Z-ADD0         CD212
|    C                     Z-ADD0         CD232
|    C                     Z-ADD0         CD262
|    C                     Z-ADD0         CDT12
|    C                     Z-ADD0         CDT22
|    C                     Z-ADD0         CDT32
|    C                     Z-ADD0         CDT42
|    C                     Z-ADD0         CD163
|    C                     Z-ADD0         CD173
|    C                     Z-ADD0         CD183
|    C                     Z-ADD0         CD243
|    C                     Z-ADD0         CD203
|    C                     Z-ADD0         CD213
|    C                     Z-ADD0         CD233
|    C                     Z-ADD0         CD263
|    C                     Z-ADD0         CDT13
|    C                     Z-ADD0         CDT23
|    C                     Z-ADD0         CDT33
|    C                     Z-ADD0         CDT43
|    C                     Z-ADD0         CD164
|    C                     Z-ADD0         CD174
|    C                     Z-ADD0         CD184
|    C                     Z-ADD0         CD244
|    C                     Z-ADD0         CD204
|    C                     Z-ADD0         CD214
|    C                     Z-ADD0         CD234
|    C                     Z-ADD0         CD264
|    C                     Z-ADD0         CDT14
|    C                     Z-ADD0         CDT24
|    C                     Z-ADD0         CDT34
|    C                     Z-ADD0         CDT44
|    C*辦事處
| 10-C           CD02      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 10*C                     ELSE
| 11-C           CD02      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 11*C                     ELSE
|   C                     MOVEL'高雄'  COMPC
| 11-C                     END
| 10-C                     END
|    C*通路
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVELCD13      #A02
|    C           KEY#A     CHAIN#A0                  41
| 13-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    #A03
| 13-C                     END
|    C*
| 14-C           DSEL      IFEQ 'A'
|   C                     SETON                     20
| 14*C                     ELSE
|   C                     SETOF                     20
| 14-C                     END
|    C                     WRITEPH1
|    C*
|    C                     SETON                     10
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     ADD  CD16      CD161
|    C                     ADD  CD19      CD161
|    C                     ADD  CD17      CD171
|    C                     ADD  CD18      CD181
|    C                     ADD  CD24      CD241
|    C                     ADD  CD25      CD241
|    C                     ADD  CD20      CD201
|    C                     ADD  CD21      CD211
|    C                     ADD  CD23      CD231
|    C                     ADD  CD26      CD261
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....SUBTOT1
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C*產品簡稱
|    C           CD04      CHAINMA0                  41
| 01-C           *IN41     IFEQ '0'
| 02-C           MA11A     IFGE DMA11S
|   C           MA11A     ANDLEDMA11E
|   C*產品分類
| 03-C           CD28      IFEQ 'R'
|   C                     MOVE 'REMY  '  DCD04
| 03*C                     ELSE
| 04-C           CD28      IFEQ 'W'
|   C                     MOVE 'WINE  '  DCD04
| 04*C                     ELSE
|   C                     MOVE '烈酒'  DCD04
| 04-C                     END
| 03-C                     END
|   C*
|   C           CD161     SUB  CD201     CDT11
|   C           CD171     SUB  CD211     CDT21
|   C           CD181     SUB  CD231     CDT31
|   C           CD241     SUB  CD261     CDT41
     C           CDT11     ADD  CDT21     TOTAL
     C                     ADD  CDT31     TOTAL
|   C   39                EXSR RTN900
| 05-C           CDT11     IFNE 0
|   C           CDT31     ORNE 0
|   C                     WRITEPD1
| 05-C                     END
|   C*
|   C                     SETOF                     21
|   C                     ADD  CD161     CD162
|   C                     ADD  CD171     CD172
|   C                     ADD  CD181     CD182
|   C                     ADD  CD241     CD242
|   C                     ADD  CD201     CD202
|   C                     ADD  CD211     CD212
|   C                     ADD  CD231     CD232
|   C                     ADD  CD261     CD262
|   C                     ADD  CDT11     CDT12
|   C                     ADD  CDT21     CDT22
|   C                     ADD  CDT31     CDT32
|   C                     ADD  TOTAL     TOTAL2
|   C                     ADD  CDT41     CDT42
| 02-C                     END
| 01-C                     END
|    C                     Z-ADD0         CD161
|    C                     Z-ADD0         CD171
|    C                     Z-ADD0         CD181
|    C                     Z-ADD0         CD241
|    C                     Z-ADD0         CD201
|    C                     Z-ADD0         CD211
|    C                     Z-ADD0         CD231
|    C                     Z-ADD0         CD261
|    C                     Z-ADD0         CDT11
|    C                     Z-ADD0         CDT21
|    C                     Z-ADD0         CDT31
|    C                     Z-ADD0         TOTAL
|    C                     Z-ADD0         CDT41
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN300....SUBTOT2
     C*==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
| 01-C           CDT12     IFNE 0
|   C           CDT32     ORNE 0
|   C                     WRITEPT2
| 01-C                     END
|    C*
|    C                     SETON                     21
|    C                     ADD  CD162     CD163
|    C                     ADD  CD172     CD173
|    C                     ADD  CD182     CD183
|    C                     ADD  CD242     CD243
|    C                     ADD  CD202     CD203
|    C                     ADD  CD212     CD213
|    C                     ADD  CD232     CD233
|    C                     ADD  CD262     CD263
|    C                     ADD  CDT12     CDT13
|    C                     ADD  CDT22     CDT23
|    C                     ADD  CDT32     CDT33
|    C                     ADD  TOTAL2    TOTAL3
|    C                     ADD  CDT42     CDT43
|    C                     Z-ADD0         CD162
|    C                     Z-ADD0         CD172
|    C                     Z-ADD0         CD182
|    C                     Z-ADD0         CD242
|    C                     Z-ADD0         CD202
|    C                     Z-ADD0         CD212
|    C                     Z-ADD0         CD232
|    C                     Z-ADD0         CD262
|    C                     Z-ADD0         CDT12
|    C                     Z-ADD0         CDT22
|    C                     Z-ADD0         CDT32
|    C                     Z-ADD0         TOTAL2
|    C                     Z-ADD0         CDT42
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN400....SUBTOT2
     C*==============================================================*
05===C           RTN400    BEGSR
|    C*
|    C   39                EXSR RTN900
| 01-C           CDT13     IFNE 0
|   C           CDT33     ORNE 0
|   C                     WRITEPT3
| 01-C                     END
|    C                     ADD  CD163     CD164
|    C                     ADD  CD173     CD174
|    C                     ADD  CD183     CD184
|    C                     ADD  CD243     CD244
|    C                     ADD  CD203     CD204
|    C                     ADD  CD213     CD214
|    C                     ADD  CD233     CD234
|    C                     ADD  CD263     CD264
|    C                     ADD  CDT13     CDT14
|    C                     ADD  CDT23     CDT24
|    C                     ADD  CDT33     CDT34
|    C                     ADD  TOTAL3    TOTAL4
|    C                     ADD  CDT43     CDT44
|    C*
|    C*
|    C                     Z-ADD0         CD163
|    C                     Z-ADD0         CD173
|    C                     Z-ADD0         CD183
|    C                     Z-ADD0         CD243
|    C                     Z-ADD0         CD203
|    C                     Z-ADD0         CD213
|    C                     Z-ADD0         CD233
|    C                     Z-ADD0         CD263
|    C                     Z-ADD0         CDT13
|    C                     Z-ADD0         CDT23
|    C                     Z-ADD0         CDT33
|    C                     Z-ADD0         TOTAL3
|    C                     Z-ADD0         CDT43
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN500....SUBTOT3
     C*==============================================================*
06===C           RTN500    BEGSR
|    C*
|    C*辦事處
| 01-C           CD02      IFEQ '1'
|   C                     MOVEL'台北'  DCD02
| 01*C                     ELSE
| 02-C           CD02      IFEQ '2'
|   C                     MOVEL'台中'  DCD02
| 02*C                     ELSE
|   C                     MOVEL'高雄'  DCD02
| 02-C                     END
| 01-C                     END
|    C   39                EXSR RTN900
| 03-C           CDT14     IFNE 0
|   C           CDT34     ORNE 0
|   C                     WRITEPT4
| 03-C                     END
|    C                     ADD  CD164     CD165
|    C                     ADD  CD174     CD175
|    C                     ADD  CD184     CD185
|    C                     ADD  CD244     CD245
|    C                     ADD  CD204     CD205
|    C                     ADD  CD214     CD215
|    C                     ADD  CD234     CD235
|    C                     ADD  CD264     CD265
|    C                     ADD  CDT14     CDT15
|    C                     ADD  CDT24     CDT25
|    C                     ADD  CDT34     CDT35
|    C                     ADD  TOTAL4    TOTAL5
|    C                     ADD  CDT44     CDT45
|    C*
|    C                     Z-ADD0         CD164
|    C                     Z-ADD0         CD174
|    C                     Z-ADD0         CD184
|    C                     Z-ADD0         CD244
|    C                     Z-ADD0         CD204
|    C                     Z-ADD0         CD214
|    C                     Z-ADD0         CD234
|    C                     Z-ADD0         CD264
|    C                     Z-ADD0         CDT14
|    C                     Z-ADD0         CDT24
|    C                     Z-ADD0         CDT34
|    C                     Z-ADD0         TOTAL4
|    C                     Z-ADD0         CDT44
|    C*
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
08===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
     C                     WRITEPT5
|    C                     WRITEPE2
08===C                     ENDSR
