      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MSOR042                                        *
      * AUTHER       :                                               *
      * CREATE DATE  : 82/01/15                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :　　　　　　                                 *
     A* REMARK       :業務員業績月報表                             *
      ****************************************************************
     FMSOR042DCF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 604 DCD10S
     I                                      605 608 DCD10E
     I                                      611 616 DCD09S
     I                                      617 622 DCD09E
     I                                      641 641 DATA
     I                                      642 6450DCD01
     I                                      642 6430WCD01M
     I                                      642 643 DCD01M
     I                                      644 645 DCD01Y
     I                                      646 649 YCD01
      *辦事處
     I                                      670 670 COMP
     I                                      671 671 COMPS
     I                                      672 672 COMPE
M001AI*(YYYY/MM/DD)
M001AI                                      850 855 YMD8S
     I*
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
     C                     Z-ADD0         D#ROW
     C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DCD10S
|    C                     MOVE *BLANK    DCD10E
|    C                     MOVE *BLANK    DCD09S
|    C                     MOVE *BLANK    DCD09E
|    C                     MOVE 'A'       DATA
|    C                     Z-ADD0         DCD01
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK辦事處
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
     C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK組別
| 01-C           DCD10S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCD10S
| 01-C                     END
|    C*
| 02-C           DCD10E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCD10E
| 02-C                     END
|    C*
| 03-C           DCD10S    IFGT DCD10E
|   C                     SETON                     606193
|   C                     SETON                     99
|   C                     GOTO END100
| 03-C                     END
|    C*
|    C* CHK業務員
| 04-C           DCD09S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCD09S
| 04-C                     END
|    C*
| 05-C           DCD09E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCD09E
| 05-C                     END
|    C*
| 06-C           DCD09S    IFGT DCD09E
|   C                     SETON                     626393
|   C                     SETON                     99
|   C                     GOTO END100
| 06-C                     END
|    C*
|    C*送貨年月
| 04-C           DCD01     IFEQ 0
|   C                     SETON                     668999
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK日期
| 18-C           WCD01M    IFGT 12
|   C           WCD01M    ORLT 1
|   C                     SETON                     669399
| 18-C                     END
     C                     MOVE DCD01M    YCD01
     C                     MOVELDCD01Y    YCD01
M001AC*                    MOVE YCD01     YMD8S
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE YCD01     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8S
|    C   99                GOTO END100
|    C*
|    C**選擇單別
| 15-C           DATA      IFEQ *BLANKS
|   C                     SETON                     65
|   C                     SETON                     9699
| 15-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS016'
|   C                     PARM           DCD10S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 47
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS016'
|   C                     PARM           DCD10E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C                     PARM           DCD09S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 47
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS015'
|   C                     PARM           DCD09E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
