      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : MSO0421                                       *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/01/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :業務員銷售月報表                           *
      ****************************************************************
     FSOCDPF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMSOR042PO   E             39     PRINTER
     ICD0
     I                                              CD04  L1
     I                                              CD28  L2
     I                                              CD09  L3
     I                                              CD10  L4
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I*辦事處，通路，地區，組別，業務員，產品
     I                                      601 604 DCD10S
     I                                      605 608 DCD10E
     I                                      611 616 DCD09S
     I                                      617 622 DCD09E
     I                                      641 641 DATA
     I                                      642 6450DCD01
     I                                      642 6430WCD01M
     I                                      642 643 DCD01M
     I                                      644 645 DCD01Y
     I                                      646 649 YCD01
      *辦事處
     I                                      670 670 COMP
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I*(YY/MM)
     I                                      665 665 DSEL
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *INIT ENVIRM
  01*C                     ELSE
  02-C           *INL4     IFEQ '1'
    C                     WRITEPE1
    C* GET部門組別
    C                     MOVELCD10      DCD10
    C                     MOVEL'CENTER  '#A01
    C                     MOVE *BLANKS   #A02
    C                     MOVELCD10      #A02
    C           KEY#A     CHAIN#A0                  40
  03-C           *IN40     IFEQ '0'
    C                     MOVEL#A03      D#A03
  03*C                     ELSE
    C                     MOVE *BLANKS   D#A03
  03-C                     END
    C                     WRITEPH1
  02-C                     END
  01-C                     END
     C*
     C                     EXSR RTN100                     *GET HEADING
     C*
     CL1 10                EXSR RTN110
     CL2 10                EXSR RTN200
     CL3 10                EXSR RTN300
     CL4 10                EXSR RTN400
     CLR 10                EXSR RTN500
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         CD161
|    C                     Z-ADD0         CD171
|    C                     Z-ADD0         CD181
|    C                     Z-ADD0         CD241
|    C                     Z-ADD0         CD201
|    C                     Z-ADD0         CD211
|    C                     Z-ADD0         CD231
|    C                     Z-ADD0         CD261
|    C                     Z-ADD0         CDT11
|    C                     Z-ADD0         CDT21
|    C                     Z-ADD0         CDT31
|    C                     Z-ADD0         CDT41
|    C*
|    C                     Z-ADD0         TOT1
|    C                     Z-ADD0         TOT2
|    C                     Z-ADD0         TOT3
|    C                     Z-ADD0         TOT4
|    C                     Z-ADD0         TOT5
|    C                     Z-ADD0         TOT6
|    C                     Z-ADD0         TOT7
|    C                     Z-ADD0         TOT8
|    C                     Z-ADD0         CDT12
|    C                     Z-ADD0         CDT22
|    C                     Z-ADD0         CDT32
|    C                     Z-ADD0         CDT42
|    C*
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C                     Z-ADD0         T1TOT5
|    C                     Z-ADD0         T1TOT6
|    C                     Z-ADD0         T1TOT7
|    C                     Z-ADD0         T1TOT8
|    C                     Z-ADD0         CDT13
|    C                     Z-ADD0         CDT23
|    C                     Z-ADD0         CDT33
|    C                     Z-ADD0         CDT43
|    C*
|    C                     Z-ADD0         T2TOT1
|    C                     Z-ADD0         T2TOT2
|    C                     Z-ADD0         T2TOT3
|    C                     Z-ADD0         T2TOT4
|    C                     Z-ADD0         T2TOT5
|    C                     Z-ADD0         T2TOT6
|    C                     Z-ADD0         T2TOT7
|    C                     Z-ADD0         T2TOT8
|    C                     Z-ADD0         CDT14
|    C                     Z-ADD0         CDT24
|    C                     Z-ADD0         CDT34
|    C                     Z-ADD0         CDT44
|    C*
|    C                     Z-ADD0         T3TOT1
|    C                     Z-ADD0         T3TOT2
|    C                     Z-ADD0         T3TOT3
|    C                     Z-ADD0         T3TOT4
|    C                     Z-ADD0         T3TOT5
|    C                     Z-ADD0         T3TOT6
|    C                     Z-ADD0         T3TOT7
|    C                     Z-ADD0         T3TOT8
|    C                     Z-ADD0         CDT15
|    C                     Z-ADD0         CDT25
|    C                     Z-ADD0         CDT35
|    C                     Z-ADD0         CDT45
|    C                     MOVE *BLANKS   DCD04
|    C*辦事處
| 04-C           COMP      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 04*C                     ELSE
| 05-C           COMP      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 05*C                     ELSE
| 06-C           COMP      IFEQ '3'
|   C                     MOVEL'高雄'  COMPC
| 06*C                     ELSE
|   C                     MOVEL'全部'  COMPC
| 06-C                     END
| 05-C                     END
| 04-C                     END
|    C*
| 07-C           DATA      IFEQ 'A'
|   C                     SETON                     20
| 07*C                     ELSE
|   C                     SETOF                     20
| 07-C                     END
|    C* GET部門組別
|    C                     MOVELCD10      DCD10
|    C                     MOVEL'CENTER  '#A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVELCD10      #A02
|    C           KEY#A     CHAIN#A0                  40
| 08-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 08*C                     ELSE
|   C                     MOVE *BLANKS   D#A03
| 08-C                     END
|    C                     WRITEPH1
|    C*
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C                     ADD  CD16      CD161
|    C                     ADD  CD19      CD161
|    C                     ADD  CD17      CD171
|    C                     ADD  CD18      CD181
|    C                     ADD  CD24      CD241
|    C                     ADD  CD25      CD241
|    C                     ADD  CD20      CD201
|    C                     ADD  CD21      CD211
|    C                     ADD  CD23      CD231
|    C                     ADD  CD26      CD261
|    C*
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN110....GET DETAILS
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*業務員
|    C           CD09      CHAINMC0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MC02
| 01-C                     END
|    C*
|    C*產品簡稱
|    C           CD04      CHAINMA0                  41
| 02-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    MA03
| 02-C                     END
|    C*
|    C*算出實際銷售銷退數量
|    C           CD161     SUB  CD201     CDT11
|    C           CD171     SUB  CD211     CDT21
|    C           CD181     SUB  CD231     CDT31
|    C           CD241     SUB  CD261     CDT41
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETON                     30
|    C*
|    C                     ADD  CD161     TOT1
|    C                     ADD  CD171     TOT2
|    C                     ADD  CD181     TOT3
|    C                     ADD  CD241     TOT4
|    C                     ADD  CD201     TOT5
|    C                     ADD  CD211     TOT6
|    C                     ADD  CD231     TOT7
|    C                     ADD  CD261     TOT8
|    C                     ADD  CDT11     CDT12
|    C                     ADD  CDT21     CDT22
|    C                     ADD  CDT31     CDT32
|    C                     ADD  CDT41     CDT42
|    C*
|    C                     ADD  CD161     T1TOT1
|    C                     ADD  CD171     T1TOT2
|    C                     ADD  CD181     T1TOT3
|    C                     ADD  CD241     T1TOT4
|    C                     ADD  CD201     T1TOT5
|    C                     ADD  CD211     T1TOT6
|    C                     ADD  CD231     T1TOT7
|    C                     ADD  CD261     T1TOT8
|    C                     ADD  CDT11     CDT13
|    C                     ADD  CDT21     CDT23
|    C                     ADD  CDT31     CDT33
|    C                     ADD  CDT41     CDT43
|    C*
|    C*
|    C                     ADD  CD161     T2TOT1
|    C                     ADD  CD171     T2TOT2
|    C                     ADD  CD181     T2TOT3
|    C                     ADD  CD241     T2TOT4
|    C                     ADD  CD201     T2TOT5
|    C                     ADD  CD211     T2TOT6
|    C                     ADD  CD231     T2TOT7
|    C                     ADD  CD261     T2TOT8
|    C                     ADD  CDT11     CDT14
|    C                     ADD  CDT21     CDT24
|    C                     ADD  CDT31     CDT34
|    C                     ADD  CDT41     CDT44
|    C*
|    C                     ADD  CD161     T3TOT1
|    C                     ADD  CD171     T3TOT2
|    C                     ADD  CD181     T3TOT3
|    C                     ADD  CD241     T3TOT4
|    C                     ADD  CD201     T3TOT5
|    C                     ADD  CD211     T3TOT6
|    C                     ADD  CD231     T3TOT7
|    C                     ADD  CD261     T3TOT8
|    C                     ADD  CDT11     CDT15
|    C                     ADD  CDT21     CDT25
|    C                     ADD  CDT31     CDT35
|    C                     ADD  CDT41     CDT45
|    C*
|    C                     Z-ADD0         CD161
|    C                     Z-ADD0         CD171
|    C                     Z-ADD0         CD181
|    C                     Z-ADD0         CD241
|    C                     Z-ADD0         CD201
|    C                     Z-ADD0         CD211
|    C                     Z-ADD0         CD231
|    C                     Z-ADD0         CD261
|    C                     Z-ADD0         CDT11
|    C                     Z-ADD0         CDT21
|    C                     Z-ADD0         CDT31
|    C                     Z-ADD0         CDT41
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN200....SUBTOT1
     C*==============================================================*
04===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C*產品分類
| 01-C           CD28      IFEQ 'R'
|   C                     MOVE 'REMY  '  DCD04
| 01*C                     ELSE
| 02-C           CD28      IFEQ 'W'
|   C                     MOVE 'WINE  '  DCD04
| 02*C                     ELSE
|   C                     MOVE '烈酒'  DCD04
| 02-C                     END
| 01-C                     END
|    C                     WRITEPT1
|    C                     SETON                     21
|    C*
|    C                     Z-ADD0         TOT1
|    C                     Z-ADD0         TOT2
|    C                     Z-ADD0         TOT3
|    C                     Z-ADD0         TOT4
|    C                     Z-ADD0         TOT5
|    C                     Z-ADD0         TOT6
|    C                     Z-ADD0         TOT7
|    C                     Z-ADD0         TOT8
|    C                     Z-ADD0         CDT12
|    C                     Z-ADD0         CDT22
|    C                     Z-ADD0         CDT32
|    C                     Z-ADD0         CDT42
|    C                     SETOF                     21
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN300....SUBTOT2
     C*==============================================================*
05===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     SETOF                     30
|    C                     WRITEPT2
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C                     Z-ADD0         T1TOT5
|    C                     Z-ADD0         T1TOT6
|    C                     Z-ADD0         T1TOT7
|    C                     Z-ADD0         T1TOT8
|    C                     Z-ADD0         CDT13
|    C                     Z-ADD0         CDT23
|    C                     Z-ADD0         CDT33
|    C                     Z-ADD0         CDT43
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN400....SUBTOT3
     C*==============================================================*
06===C           RTN400    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
|    C                     Z-ADD0         T2TOT1
|    C                     Z-ADD0         T2TOT2
|    C                     Z-ADD0         T2TOT3
|    C                     Z-ADD0         T2TOT4
|    C                     Z-ADD0         T2TOT5
|    C                     Z-ADD0         T2TOT6
|    C                     Z-ADD0         T2TOT7
|    C                     Z-ADD0         T2TOT8
|    C                     Z-ADD0         CDT14
|    C                     Z-ADD0         CDT24
|    C                     Z-ADD0         CDT34
|    C                     Z-ADD0         CDT44
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN500....SUBTOT3
     C*==============================================================*
07===C           RTN500    BEGSR
|    C   39                EXSR RTN900
|    C                     WRITEPT4
|    C                     WRITEPE2
07===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
08===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     30
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
09===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
09===C                     ENDSR
