      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : MSOR0452                                      *
      * AUTHOR       : AN MING HSIA                                  *
      * CREATE DATE  : 05/23/94                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :月客戶銷售（退）統計表                       *
      ****************************************************************
     FREWF15  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPA#HPF  IF  E           K        DISK
     FMSOR045PO   E             39     PRINTER
     E*
     E*: FUNCTION DATA :
     E                    TEST    1   4 22
     IWF150
     I                                              WF1501L4
     I                                              WF1502L3
     I                                              WF1503L2
     I                                              WF1504L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      600 600 COMPA
     I                                      671 679 DCD06S
     I                                      681 689 DCD06E
      *MM/DD/YY
     I                                      611 6140DCD01
     I                                      611 6120DCD01M
     I                                      613 6140DCD01Y
      *YY/MM/DD--------------------------------------------------------
      *本年月
     I                                      615 6180CD01E
     I                                      615 6160CD01EY
     I                                      617 6180CD01EM
      *螢幕上年下月
     I                                      619 6220CD01S
     I                                      619 6200CD01SY
     I                                      621 6220CD01SM
      *
     I                                      623 623 DSEL
     I                                      624 624 COMP
     I                                      625 625 DCD13S
     I                                      626 626 DCD13E
     I                                      627 628 DCD14S
     I                                      629 630 DCD14E
     I                                      631 632 DCD11S
     I                                      633 634 DCD11E
     I                                      705 705 DSEL1
     I                                      706 706 DSEL3
     I                                      710 715 DCD09S
     I                                      716 721 DCD09E
     I                                      750 750 IN20
      *
     I                                      760 768 WF1504
     I                                      762 763 $H2
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11A
     I            DS
     I                                        1   40YM01
     I                                        1   20YY01
     I                                        3   40MM01
     I            DS
     I                                        1   40YM02
     I                                        1   20YY02
     I                                        3   40MM02
     I            DS
     I                                        1   40YM03
     I                                        1   20YY03
     I                                        3   40MM03
     I            DS
     I                                        1   40YM04
     I                                        1   20YY04
     I                                        3   40MM04
     I            DS
     I                                        1   40YM05
     I                                        1   20YY05
     I                                        3   40MM05
     I            DS
     I                                        1   40YM06
     I                                        1   20YY06
     I                                        3   40MM06
     I            DS
     I                                        1   40YM07
     I                                        1   20YY07
     I                                        3   40MM07
     I            DS
     I                                        1   40YM08
     I                                        1   20YY08
     I                                        3   40MM08
     I            DS
     I                                        1   40YM09
     I                                        1   20YY09
     I                                        3   40MM09
     I            DS
     I                                        1   40YM10
     I                                        1   20YY10
     I                                        3   40MM10
     I            DS
     I                                        1   40YM11
     I                                        1   20YY11
     I                                        3   40MM11
     I            DS
     I                                        1   40YM12
     I                                        1   20YY12
     I                                        3   40MM12
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           WF1501
     C                     KFLD           WF1502
     C           KEY#H     KLIST
     C                     KFLD           #H1
     C                     KFLD           #H2
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     WRITEPH1
    C                     SETON                     10
    C                     MOVE 'STANDARD'#H1     8
  01*C                     ELSE
  02-C           *INL4     IFEQ '1'
    C                     WRITEPH1                        *HEADING
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL2 10                EXSR RTN300
     CL3 10                EXSR RTN400
     CL4 10                EXSR RTN500
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
     C                     Z-ADDCD01SY    YY01
|    C                     Z-ADDCD01SM    MM01
     C                     Z-ADDCD01EY    YY12
|    C                     Z-ADDCD01EM    MM12
|    C                     Z-ADD0         YM02
|    C                     Z-ADD0         YM03
|    C                     Z-ADD0         YM04
|    C                     Z-ADD0         YM05
|    C                     Z-ADD0         YM06
|    C                     Z-ADD0         YM07
|    C                     Z-ADD0         YM08
|    C                     Z-ADD0         YM09
|    C                     Z-ADD0         YM10
|    C                     Z-ADD0         YM11
|    C*
|    C*種類
|    C                     MOVEL*BLANKS   GROUP
| 03-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'GROUP
| 03*C                     ELSE
| 04-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'GROUP
| 04*C                     ELSE
| 05-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'GROUP
| 05*C                     ELSE
|   C                     MOVEL'全部'  GROUP
| 05-C                     END
| 04-C                     END
| 03-C                     END
|    C*
| 06-C           COMP      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 06*C                     ELSE
| 07-C           COMP      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 07*C                     ELSE
| 08-C           COMP      IFEQ '3'
|   C                     MOVEL'高雄'  COMPC
| 08*C                     ELSE
|   C                     MOVEL'全部'  COMPC
| 08-C                     END
| 07-C                     END
| 06-C                     END
|    C*
| 09-C           DSEL1     IFEQ '1'
|   C                     MOVE TEST,1    TITE
| 09*C                     ELSE
| 10-C           DSEL1     IFEQ '2'
|   C                     MOVE TEST,2    TITE
| 10*C                     ELSE
| 11-C           DSEL1     IFEQ '3'
|   C                     MOVE TEST,3    TITE
| 11*C                     ELSE
|   C                     MOVE TEST,4    TITE
| 11-C                     END
| 10-C                     END
| 09-C                     END
|    C*禮盒
|    C                     SETOF                     22
| 12-C           DSEL      IFEQ 'A'
|   C                     SETOF                     22
| 12*C                     ELSE
|   C                     SETON                     22
| 12-C                     END
|    C*合計
|    C                     SETOF                     23
| 13-C           DSEL3     IFEQ 'A'
|   C                     SETOF                     23
| 13*C                     ELSE
|   C                     SETON                     23
| 13-C                     END
|    C*
|    C           MM01      ADD  1         MM02
| 14-C           MM02      IFGT 12
|   C                     SUB  12        MM02
|   C           YY01      ADD  1         YY02
| 14*C                     ELSE
|   C                     Z-ADDYY01      YY02
| 14-C                     END
|    C*
|    C           MM01      ADD  2         MM03
| 15-C           MM03      IFGT 12
|   C                     SUB  12        MM03
|   C           YY01      ADD  1         YY03
| 15*C                     ELSE
|   C                     Z-ADDYY01      YY03
| 15-C                     END
|    C*
|    C           MM01      ADD  3         MM04
| 16-C           MM04      IFGT 12
|   C                     SUB  12        MM04
|   C           YY01      ADD  1         YY04
| 16*C                     ELSE
|   C                     Z-ADDYY01      YY04
| 16-C                     END
|    C*
|    C           MM01      ADD  4         MM05
| 17-C           MM05      IFGT 12
|   C                     SUB  12        MM05
|   C           YY01      ADD  1         YY05
| 17*C                     ELSE
|   C                     Z-ADDYY01      YY05
| 17-C                     END
|    C*
|    C           MM01      ADD  5         MM06
| 18-C           MM06      IFGT 12
|   C                     SUB  12        MM06
|   C           YY01      ADD  1         YY06
| 18*C                     ELSE
|   C                     Z-ADDYY01      YY06
| 18-C                     END
|    C*
|    C           MM01      ADD  6         MM07
| 19-C           MM07      IFGT 12
|   C                     SUB  12        MM07
|   C           YY01      ADD  1         YY07
| 19*C                     ELSE
|   C                     Z-ADDYY01      YY07
| 19-C                     END
|    C*
|    C           MM01      ADD  7         MM08
| 20-C           MM08      IFGT 12
|   C                     SUB  12        MM08
|   C           YY01      ADD  1         YY08
| 20*C                     ELSE
|   C                     Z-ADDYY01      YY08
| 20-C                     END
|    C*
|    C           MM01      ADD  8         MM09
| 21-C           MM09      IFGT 12
|   C                     SUB  12        MM09
|   C           YY01      ADD  1         YY09
| 21*C                     ELSE
|   C                     Z-ADDYY01      YY09
| 21-C                     END
|    C*
|    C           MM01      ADD  9         MM10
| 22-C           MM10      IFGT 12
|   C                     SUB  12        MM10
|   C           YY01      ADD  1         YY10
| 22*C                     ELSE
|   C                     Z-ADDYY01      YY10
| 22-C                     END
|    C*
|    C           MM01      ADD  10        MM11
| 23-C           MM11      IFGT 12
|   C                     SUB  12        MM11
|   C           YY01      ADD  1         YY11
| 23*C                     ELSE
|   C                     Z-ADDYY01      YY11
| 23-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*客戶名稱
|    C           KEYME     CHAINME0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   ME04
| 01-C                     END
|    C*產品單位容積
|    C           WF1504    CHAINMA0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL0         MA15
| 02-C                     END
|    C*標準箱數
|    C                     MOVEL$H2       #H2    10
|    C           KEY#H     CHAIN#H0                  40
      *計算每月標準箱數
|    C           MA15      MULT WF1505    H1505   92
|    C           MA15      MULT WF1507    H1507   92
|    C           MA15      MULT WF1509    H1509   92
|    C           MA15      MULT WF1511    H1511   92
|    C           MA15      MULT WF1513    H1513   92
|    C           MA15      MULT WF1515    H1515   92
|    C           MA15      MULT WF1517    H1517   92
|    C           MA15      MULT WF1519    H1519   92
|    C           MA15      MULT WF1521    H1521   92
|    C           MA15      MULT WF1523    H1523   92
|    C           MA15      MULT WF1525    H1525   92
|    C           MA15      MULT WF1527    H1527   92
|    C*計算每月標準箱數
| 03-C           H1505     IFNE 0
|   C           H1505     DIV  #H03      HF1505    H
| 03-C                     END
      *
| 04-C           H1507     IFNE 0
|   C           H1507     DIV  #H03      HF1507    H
| 04-C                     END
      *
| 05-C           H1509     IFNE 0
|   C           H1509     DIV  #H03      HF1509    H
| 05-C                     END
      *
| 06-C           H1511     IFNE 0
|   C           H1511     DIV  #H03      HF1511    H
| 06-C                     END
      *
| 07-C           H1513     IFNE 0
|   C           H1513     DIV  #H03      HF1513    H
| 07-C                     END
      *
| 08-C           H1515     IFNE 0
|   C           H1515     DIV  #H03      HF1515    H
| 08-C                     END
      *
| 09-C           H1517     IFNE 0
|   C           H1517     DIV  #H03      HF1517    H
| 09-C                     END
      *
| 10-C           H1519     IFNE 0
|   C           H1519     DIV  #H03      HF1519    H
| 10-C                     END
      *
| 11-C           H1521     IFNE 0
|   C           H1521     DIV  #H03      HF1521    H
| 11-C                     END
      *
| 12-C           H1523     IFNE 0
|   C           H1523     DIV  #H03      HF1523    H
| 12-C                     END
      *
| 13-C           H1525     IFNE 0
|   C           H1525     DIV  #H03      HF1525    H
| 13-C                     END
      *
| 14-C           H1527     IFNE 0
|   C           H1527     DIV  #H03      HF1527    H
| 14-C                     END
      *統計全年標準箱數
|    C           HF1505    ADD  HF1507    HFTOT1
|    C                     ADD  HF1509    HFTOT1
|    C                     ADD  HF1511    HFTOT1
|    C                     ADD  HF1513    HFTOT1
|    C                     ADD  HF1515    HFTOT1
|    C                     ADD  HF1517    HFTOT1
|    C                     ADD  HF1519    HFTOT1
|    C                     ADD  HF1521    HFTOT1
|    C                     ADD  HF1523    HFTOT1
|    C                     ADD  HF1525    HFTOT1
|    C                     ADD  HF1527    HFTOT1
      *統計全年數量
|    C           WF1505    ADD  WF1507    WFTOT1
|    C                     ADD  WF1509    WFTOT1
|    C                     ADD  WF1511    WFTOT1
|    C                     ADD  WF1513    WFTOT1
|    C                     ADD  WF1515    WFTOT1
|    C                     ADD  WF1517    WFTOT1
|    C                     ADD  WF1519    WFTOT1
|    C                     ADD  WF1521    WFTOT1
|    C                     ADD  WF1523    WFTOT1
|    C                     ADD  WF1525    WFTOT1
|    C                     ADD  WF1527    WFTOT1
      *統計全年金額
|    C           WF1506    ADD  WF1508    WFTOT2
|    C                     ADD  WF1510    WFTOT2
|    C                     ADD  WF1512    WFTOT2
|    C                     ADD  WF1514    WFTOT2
|    C                     ADD  WF1516    WFTOT2
|    C                     ADD  WF1518    WFTOT2
|    C                     ADD  WF1520    WFTOT2
|    C                     ADD  WF1522    WFTOT2
|    C                     ADD  WF1524    WFTOT2
|    C                     ADD  WF1526    WFTOT2
|    C                     ADD  WF1528    WFTOT2
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETON                     20
      *IN20 CONTROL型態是否顯示
      *1
|    C                     ADD  HF1505    T2H505
|    C                     ADD  HF1507    T2H507
|    C                     ADD  HF1509    T2H509
|    C                     ADD  HF1511    T2H511
|    C                     ADD  HF1513    T2H513
|    C                     ADD  HF1515    T2H515
|    C                     ADD  HF1517    T2H517
|    C                     ADD  HF1519    T2H519
|    C                     ADD  HF1521    T2H521
|    C                     ADD  HF1523    T2H523
|    C                     ADD  HF1525    T2H525
|    C                     ADD  HF1527    T2H527
|    C                     ADD  HFTOT1    T2HOT1
|    C*2
|    C                     ADD  WF1506    T21506
|    C                     ADD  WF1508    T21508
|    C                     ADD  WF1510    T21510
|    C                     ADD  WF1512    T21512
|    C                     ADD  WF1514    T21514
|    C                     ADD  WF1516    T21516
|    C                     ADD  WF1518    T21518
|    C                     ADD  WF1520    T21520
|    C                     ADD  WF1522    T21522
|    C                     ADD  WF1524    T21524
|    C                     ADD  WF1526    T21526
|    C                     ADD  WF1528    T21528
|    C                     ADD  WFTOT2    T2TOT2
|    C*3
|    C                     ADD  WF1505    T21505
|    C                     ADD  WF1507    T21507
|    C                     ADD  WF1509    T21509
|    C                     ADD  WF1511    T21511
|    C                     ADD  WF1513    T21513
|    C                     ADD  WF1515    T21515
|    C                     ADD  WF1517    T21517
|    C                     ADD  WF1519    T21519
|    C                     ADD  WF1521    T21521
|    C                     ADD  WF1523    T21523
|    C                     ADD  WF1525    T21525
|    C                     ADD  WF1527    T21527
|    C                     ADD  WFTOT1    T2TOT1
|    C*
|    C                     Z-ADD0         HF1505
|    C                     Z-ADD0         HF1507
|    C                     Z-ADD0         HF1509
|    C                     Z-ADD0         HF1511
|    C                     Z-ADD0         HF1513
|    C                     Z-ADD0         HF1515
|    C                     Z-ADD0         HF1517
|    C                     Z-ADD0         HF1519
|    C                     Z-ADD0         HF1521
|    C                     Z-ADD0         HF1523
|    C                     Z-ADD0         HF1525
|    C                     Z-ADD0         HF1527
|    C*
|    C                     Z-ADD0         H1505
|    C                     Z-ADD0         H1507
|    C                     Z-ADD0         H1509
|    C                     Z-ADD0         H1511
|    C                     Z-ADD0         H1513
|    C                     Z-ADD0         H1515
|    C                     Z-ADD0         H1517
|    C                     Z-ADD0         H1519
|    C                     Z-ADD0         H1521
|    C                     Z-ADD0         H1523
|    C                     Z-ADD0         H1525
|    C                     Z-ADD0         H1527
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   SUBTOTAL2
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
      *1
|    C                     ADD  T2H505    T3H505
|    C                     ADD  T2H507    T3H507
|    C                     ADD  T2H509    T3H509
|    C                     ADD  T2H511    T3H511
|    C                     ADD  T2H513    T3H513
|    C                     ADD  T2H515    T3H515
|    C                     ADD  T2H517    T3H517
|    C                     ADD  T2H519    T3H519
|    C                     ADD  T2H521    T3H521
|    C                     ADD  T2H523    T3H523
|    C                     ADD  T2H525    T3H525
|    C                     ADD  T2H527    T3H527
|    C                     ADD  T2HOT1    T3HOT1
|    C*2
|    C                     ADD  T21506    T31506
|    C                     ADD  T21508    T31508
|    C                     ADD  T21510    T31510
|    C                     ADD  T21512    T31512
|    C                     ADD  T21514    T31514
|    C                     ADD  T21516    T31516
|    C                     ADD  T21518    T31518
|    C                     ADD  T21520    T31520
|    C                     ADD  T21522    T31522
|    C                     ADD  T21524    T31524
|    C                     ADD  T21526    T31526
|    C                     ADD  T21528    T31528
|    C                     ADD  T2TOT2    T3TOT2
|    C*3
|    C                     ADD  T21505    T31505
|    C                     ADD  T21507    T31507
|    C                     ADD  T21509    T31509
|    C                     ADD  T21511    T31511
|    C                     ADD  T21513    T31513
|    C                     ADD  T21515    T31515
|    C                     ADD  T21517    T31517
|    C                     ADD  T21519    T31519
|    C                     ADD  T21521    T31521
|    C                     ADD  T21523    T31523
|    C                     ADD  T21525    T31525
|    C                     ADD  T21527    T31527
|    C                     ADD  T2TOT1    T3TOT1
|    C*1
|    C                     Z-ADD0         T2H505
|    C                     Z-ADD0         T2H507
|    C                     Z-ADD0         T2H509
|    C                     Z-ADD0         T2H511
|    C                     Z-ADD0         T2H513
|    C                     Z-ADD0         T2H515
|    C                     Z-ADD0         T2H517
|    C                     Z-ADD0         T2H519
|    C                     Z-ADD0         T2H521
|    C                     Z-ADD0         T2H523
|    C                     Z-ADD0         T2H525
|    C                     Z-ADD0         T2H527
|    C                     Z-ADD0         T2HOT1
|    C*2
|    C                     Z-ADD0         T21506
|    C                     Z-ADD0         T21508
|    C                     Z-ADD0         T21510
|    C                     Z-ADD0         T21512
|    C                     Z-ADD0         T21514
|    C                     Z-ADD0         T21516
|    C                     Z-ADD0         T21518
|    C                     Z-ADD0         T21520
|    C                     Z-ADD0         T21522
|    C                     Z-ADD0         T21524
|    C                     Z-ADD0         T21526
|    C                     Z-ADD0         T21528
|    C                     Z-ADD0         T2TOT2
|    C*3
|    C                     Z-ADD0         T21505
|    C                     Z-ADD0         T21507
|    C                     Z-ADD0         T21509
|    C                     Z-ADD0         T21511
|    C                     Z-ADD0         T21513
|    C                     Z-ADD0         T21515
|    C                     Z-ADD0         T21517
|    C                     Z-ADD0         T21519
|    C                     Z-ADD0         T21521
|    C                     Z-ADD0         T21523
|    C                     Z-ADD0         T21525
|    C                     Z-ADD0         T21527
|    C                     Z-ADD0         T2TOT1
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT3   TOTAL
      *==============================================================*
04===C           RTN400    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
|    C                     SETOF                     20
|    C*1
|    C                     ADD  T3H505    T4H505
|    C                     ADD  T3H507    T4H507
|    C                     ADD  T3H509    T4H509
|    C                     ADD  T3H511    T4H511
|    C                     ADD  T3H513    T4H513
|    C                     ADD  T3H515    T4H515
|    C                     ADD  T3H517    T4H517
|    C                     ADD  T3H519    T4H519
|    C                     ADD  T3H521    T4H521
|    C                     ADD  T3H523    T4H523
|    C                     ADD  T3H525    T4H525
|    C                     ADD  T3H527    T4H527
|    C                     ADD  T3HOT1    T4HOT1
|    C*2
|    C                     ADD  T31506    T41506
|    C                     ADD  T31508    T41508
|    C                     ADD  T31510    T41510
|    C                     ADD  T31512    T41512
|    C                     ADD  T31514    T41514
|    C                     ADD  T31516    T41516
|    C                     ADD  T31518    T41518
|    C                     ADD  T31520    T41520
|    C                     ADD  T31522    T41522
|    C                     ADD  T31524    T41524
|    C                     ADD  T31526    T41526
|    C                     ADD  T31528    T41528
|    C                     ADD  T3TOT2    T4TOT2
|    C*
|    C                     ADD  T31505    T41505
|    C                     ADD  T31507    T41507
|    C                     ADD  T31509    T41509
|    C                     ADD  T31511    T41511
|    C                     ADD  T31513    T41513
|    C                     ADD  T31515    T41515
|    C                     ADD  T31517    T41517
|    C                     ADD  T31519    T41519
|    C                     ADD  T31521    T41521
|    C                     ADD  T31523    T41523
|    C                     ADD  T31525    T41525
|    C                     ADD  T31527    T41527
|    C                     ADD  T3TOT1    T4TOT1
|    C*1
|    C                     Z-ADD0         T3H505
|    C                     Z-ADD0         T3H507
|    C                     Z-ADD0         T3H509
|    C                     Z-ADD0         T3H511
|    C                     Z-ADD0         T3H513
|    C                     Z-ADD0         T3H515
|    C                     Z-ADD0         T3H517
|    C                     Z-ADD0         T3H519
|    C                     Z-ADD0         T3H521
|    C                     Z-ADD0         T3H523
|    C                     Z-ADD0         T3H525
|    C                     Z-ADD0         T3H527
|    C                     Z-ADD0         T3HOT1
|    C*2
|    C                     Z-ADD0         T31506
|    C                     Z-ADD0         T31508
|    C                     Z-ADD0         T31510
|    C                     Z-ADD0         T31512
|    C                     Z-ADD0         T31514
|    C                     Z-ADD0         T31516
|    C                     Z-ADD0         T31518
|    C                     Z-ADD0         T31520
|    C                     Z-ADD0         T31522
|    C                     Z-ADD0         T31524
|    C                     Z-ADD0         T31526
|    C                     Z-ADD0         T31528
|    C                     Z-ADD0         T3TOT2
|    C*3
|    C                     Z-ADD0         T31505
|    C                     Z-ADD0         T31507
|    C                     Z-ADD0         T31509
|    C                     Z-ADD0         T31511
|    C                     Z-ADD0         T31513
|    C                     Z-ADD0         T31515
|    C                     Z-ADD0         T31517
|    C                     Z-ADD0         T31519
|    C                     Z-ADD0         T31521
|    C                     Z-ADD0         T31523
|    C                     Z-ADD0         T31525
|    C                     Z-ADD0         T31527
|    C                     Z-ADD0         T3TOT1
      *
04===C                     ENDSR
      *==============================================================*
      *          RTN500....WRITE PT4   TOTAL
      *==============================================================*
05===C           RTN500    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT4
|    C*1
|    C                     Z-ADD0         T4H505
|    C                     Z-ADD0         T4H507
|    C                     Z-ADD0         T4H509
|    C                     Z-ADD0         T4H511
|    C                     Z-ADD0         T4H513
|    C                     Z-ADD0         T4H515
|    C                     Z-ADD0         T4H517
|    C                     Z-ADD0         T4H519
|    C                     Z-ADD0         T4H521
|    C                     Z-ADD0         T4H523
|    C                     Z-ADD0         T4H525
|    C                     Z-ADD0         T4H527
|    C                     Z-ADD0         T4HOT1
|    C*2
|    C                     Z-ADD0         T41506
|    C                     Z-ADD0         T41508
|    C                     Z-ADD0         T41510
|    C                     Z-ADD0         T41512
|    C                     Z-ADD0         T41514
|    C                     Z-ADD0         T41516
|    C                     Z-ADD0         T41518
|    C                     Z-ADD0         T41520
|    C                     Z-ADD0         T41522
|    C                     Z-ADD0         T41524
|    C                     Z-ADD0         T41526
|    C                     Z-ADD0         T41528
|    C                     Z-ADD0         T4TOT2
|    C*3
|    C                     Z-ADD0         T41505
|    C                     Z-ADD0         T41507
|    C                     Z-ADD0         T41509
|    C                     Z-ADD0         T41511
|    C                     Z-ADD0         T41513
|    C                     Z-ADD0         T41515
|    C                     Z-ADD0         T41517
|    C                     Z-ADD0         T41519
|    C                     Z-ADD0         T41521
|    C                     Z-ADD0         T41523
|    C                     Z-ADD0         T41525
|    C                     Z-ADD0         T41527
|    C                     Z-ADD0         T4TOT1
|    C*
| 01-C           *INLR     IFEQ '0'
|   C                     WRITEPE1
| 01-C                     END
      *
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     20
      *
06===C                     ENDSR
      *==============================================================*
      *          RTNLR
      *==============================================================*
07===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
07===C                     ENDSR
      *==============================================================*
**
銷售（退）　　　　　
銷售（退）含搭贈　　
銷售（退）含試飲　　
銷售（退）含搭贈試飲
