      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : MSOR0481                                      *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 83/04/03                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :通路產品平均銷售單價表                       *
      ****************************************************************
     FSOCDPF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMSOR048PO   E             39     PRINTER
     ICD0
     I                                              CD04  L2
     I                                              CD13  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I*辦事處，通路，地區，組別，業務員，產品
     I*
     I                                      600 600 COMP
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      603 603 DCD13S
     I                                      604 604 DCD13E
     I                                      695 696 DCD14S
     I                                      697 698 DCD14E
     I                                      605 606 DCD11S
     I                                      607 608 DCD11E
     I                                      609 612 DCD10S
     I                                      613 616 DCD10E
     I                                      617 622 DCD09S
     I                                      623 628 DCD09E
     I                                      630 638 DCD04S
     I                                      640 648 DCD04E
     I                                      675 683 DCD06S
     I                                      684 692 DCD06E
     I*(MM/YY)
     I                                      650 6530DCD01S
     I                                      650 6510WCD01M
     I                                      650 651 DCD01M
     I                                      652 653 DCD01Y
     I*(MM/YY)
     I                                      654 6570DCD01E
     I                                      654 6550WCD1EM
     I                                      654 655 DCD1EM
     I                                      656 657 DCD1EY
     I*(YY/MM)
     I                                      658 661 YCD01S
     I                                      670 673 YCD01E
     I                                      665 665 DSEL
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11A
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *INIT ENVIRM
  01-C                     END
     C*
|    C           CD04      CHAINMA0                  41
| 01-C           *IN41     IFEQ '0'
| 02-C           MA11A     ANDGEDMA11S
|   C           MA11A     ANDLEDMA11E
     C                     EXSR RTN100                     *GET HEADING
     C                     END
     C*
     CL1 10                EXSR RTN200
     CL2 10                SETOF                     22
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         AMOUNT
|    C                     Z-ADD0         QTY1
|    C                     Z-ADD0         PRICE1
|    C                     Z-ADD0         QTY2
|    C                     Z-ADD0         PRICE2
|    C                     Z-ADD0         QTY3
|    C                     Z-ADD0         PRICE3
|    C*辦事處
| 02-C           COMP      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 02*C                     ELSE
| 03-C           COMP      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 03*C                     ELSE
| 04-C           COMP      IFEQ '3'
|   C                     MOVEL'高雄'  COMPC
| 04*C                     ELSE
|   C                     MOVEL'全部 ' COMPC
| 04-C                     END
| 03-C                     END
| 02-C                     END
|    C*
|    C*種類
|    C                     MOVEL*BLANKS   GROUP
| 05-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'GROUP
| 05*C                     ELSE
| 06-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'GROUP
| 06*C                     ELSE
| 07-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'GROUP
| 07*C                     ELSE
|   C                     MOVEL'全部'  GROUP
| 07-C                     END
| 06-C                     END
| 05-C                     END
|    C*
| 08-C           DSEL      IFEQ 'A'
|   C                     SETON                     20
| 08*C                     ELSE
|   C                     SETOF                     20
| 08-C                     END
|    C                     WRITEPH1
|    C*
|    C                     SETON                     10
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
 2===C           RTN100    BEGSR
     C*
|    C*金額
|    C                     ADD  CD24      AMOUNT
|    C                     ADD  CD25      AMOUNT
|    C                     SUB  CD26      AMOUNT
|    C*銷售
|    C                     ADD  CD16      QTY1             *訂貨
|    C                     ADD  CD19      QTY1             *寄賣
|    C                     SUB  CD20      QTY1             *訂退
|    C*含搭贈
|    C                     ADD  CD16      QTY2
|    C                     ADD  CD17      QTY2
|    C                     ADD  CD19      QTY2
|    C                     SUB  CD20      QTY2
|    C                     SUB  CD21      QTY2
|    C*含試飲
|    C                     ADD  CD16      QTY3
|    C                     ADD  CD17      QTY3
|    C                     ADD  CD18      QTY3
|    C                     ADD  CD19      QTY3
|    C                     SUB  CD20      QTY3
|    C                     SUB  CD21      QTY3
|    C                     SUB  CD23      QTY3
|    C*
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....SUBTOT1
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C*產品簡稱
|    C           AMOUNT    IFNE 0
|   C*通路
|   C                     MOVEL'DISTRUBT'#A01
|   C                     MOVELCD13      #A02
|   C           KEY#A     CHAIN#A0                  41
| 03-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    #A03A
     C                     ELSE
     C                     MOVEL#A03      #A03A
| 03-C                     END
|   C*
| 04-C           QTY1      IFNE 0
|   C           AMOUNT    DIV  QTY1      PRICE1    H
| 04*C                     ELSE
|   C                     Z-ADD0         PRICE1
| 04-C                     END
| 05-C           QTY2      IFNE 0
|   C           AMOUNT    DIV  QTY2      PRICE2    H
| 05*C                     ELSE
|   C                     Z-ADD0         PRICE2
| 05-C                     END
| 06-C           QTY3      IFNE 0
|   C           AMOUNT    DIV  QTY3      PRICE3    H
| 06*C                     ELSE
|   C                     Z-ADD0         PRICE3
| 06-C                     END
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPD1
     C                     SETON                     22
|   C*
|   C                     Z-ADD0         AMOUNT
|   C                     Z-ADD0         QTY1
|   C                     Z-ADD0         PRICE1
|   C                     Z-ADD0         QTY2
|   C                     Z-ADD0         PRICE2
|   C                     Z-ADD0         QTY3
|   C                     Z-ADD0         PRICE3
| 02-C                     END
|    C*
|    C*
03===C                     ENDSR
     C*
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
05===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
05===C                     ENDSR
