      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:75042266   *
      *                                                              *
      * PROGRAM NAME : MSORR41                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 82/01/12                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :月通路產品銷售彙總表                         *
      ****************************************************************
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*辦事處，通路，地區，組別，業務員，產品
     I                                      600 600 COMP
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      603 603 DCD13S
     I                                      604 604 DCD13E
     I                                      695 696 DCD14S
     I                                      697 698 DCD14E
     I                                      605 606 DCD11S
     I                                      607 608 DCD11E
     I                                      609 612 DCD10S
     I                                      613 616 DCD10E
     I                                      617 622 DCD09S
     I                                      623 628 DCD09E
     I                                      630 638 DCD04S
     I                                      640 648 DCD04E
     I                                      675 683 DCD06S
     I                                      684 692 DCD06E
     I*(MM/YY)
     I                                      650 6530DCD01S
     I                                      650 6510WCD01M
     I                                      650 651 DCD01M
     I                                      652 653 DCD01Y
     I*(MM/YY)
     I                                      654 6570DCD01E
     I                                      654 6550WCD1EM
     I                                      654 655 DCD1EM
     I                                      656 657 DCD1EY
     I*(YY/MM)
     I                                      658 6610YCD01S
     I                                      670 6730YCD01E
     I                                      665 665 DSEL
     I* FOR F4 HELP -- GET CURSOR POSITION
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     .INIT SCREEN
    C                     EXSR RTN100                     .CHECK      ?
     C*
     C                     EXSR OUTLDA
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    DCD13E
|    C                     MOVE *BLANK    DCD13E
|    C                     MOVE *BLANK    DCD14E
|    C                     MOVE *BLANK    DCD14E
|    C                     MOVE *BLANK    DCD11S
|    C                     MOVE *BLANK    DCD11E
|    C                     MOVE *BLANK    DCD10S
|    C                     MOVE *BLANK    DCD10E
|    C                     MOVE *BLANK    DCD09S
|    C                     MOVE *BLANK    DCD09E
|    C                     MOVE *BLANK    DCD04S
|    C                     MOVE *BLANK    DCD04E
|    C                     MOVE *BLANK    DCD06S
|    C                     MOVE *BLANK    DCD06E
|    C                     MOVE 'A'       DSEL
|    C                     Z-ADD0         DCD01S
|    C                     Z-ADD0         DCD01E
|    C                     Z-ADD0         YCD01S
|    C                     Z-ADD0         YCD01E
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK辦事處
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
|    C*
|    C*通路代號
|   C                     MOVE *LOVAL    DCD13S
|    C*
|   C                     MOVE *HIVAL    DCD13E
|    C*
|    C*型態代號
|   C                     MOVE *LOVAL    DCD14S
|    C*
|   C                     MOVE *HIVAL    DCD14E
|    C*
|    C*
|    C*地區代號
|   C                     MOVE *LOVAL    DCD11S
|    C*
|   C                     MOVE *HIVAL    DCD11E
|    C*
|   C                     MOVE *LOVAL    DCD10S
|    C*
|   C                     MOVE *HIVAL    DCD10E
|    C*
|    C*
|    C* CHK業務員
|   C                     MOVE *LOVAL    DCD09S
|    C*
|   C                     MOVE *HIVAL    DCD09E
|    C*
|    C*
|    C*產品代號
|   C                     MOVEL'ESRM'    DCD04S
|    C*
|   C                     MOVEL'ESRM9999'DCD04E
|    C*
| 16-C           DCD04S    IFGT DCD04E
|   C                     SETON                     6970
|   C                     SETON                     9299
| 16-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶
|   C                     MOVE *LOVAL    DCD06S
|    C*
|   C                     MOVE *HIVAL    DCD06E
|    C*
|    C*(CHECK DATE)-日期
     C*
     C                     MOVE '12'      YCD01S
     C                     MOVEL'94'      YCD01S
     C                     MOVE '12'      YCD01E
     C                     MOVEL'94'      YCD01E
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
