      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : MSOR045D                                      *
      * AUTHOR       : AN MING HSIA                                  *
      * CREATE DATE  : 05/23/93                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :月客戶銷售統計表                             *
      ****************************************************************
     FMSOR045DCF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FMSOR045ZO   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*MM/YY
     I                                      611 6140DCD01
     I                                      611 6120DCD01M
     I                                      613 6140DCD01Y
     I*YY/MM--------------------------------------------------------
     I*本年月
     I                                      615 6180CD01E
     I                                      615 6160CD01EY
     I                                      617 6180CD01EM
     I*螢幕上年下月
     I                                      619 6220CD01S
     I                                      619 6200CD01SY
     I                                      621 6220CD01SM
     I*
     I                                      623 623 DSEL
     I                                      624 624 COMP
     I                                      625 625 DCD13S
     I                                      626 626 DCD13E
     I                                      627 628 DCD14S
     I                                      629 630 DCD14E
     I*                                     631 632 DCD11S
     I*                                     633 634 DCD11E
     I                                      651 659 DCD04S
     I                                      660 668 DCD04E
     I                                      671 679 DCD06S
     I                                      681 689 DCD06E
     I                                      710 715 DCD09S
     I                                      716 721 DCD09E
     I                                      705 705 DSEL1
     I                                      706 706 DSEL3
     I                                      751 751 COMPS
     I                                      752 752 COMPE
M001AI*(YYYY/MM/DD)
M001AI                                      850 855 YMD8S
M001AI                                      858 863 YMD8E
      *產品組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
| 04-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 04-C                     END
|    C                     MOVE ' '       COMP
|    C                     MOVE *BLANK    DCD13S
|    C                     MOVE *BLANK    DCD13E
|    C                     MOVE *BLANK    DCD14S
|    C                     MOVE *BLANK    DCD14E
|    C*                    MOVE *BLANK    DCD11S
|    C*                    MOVE *BLANK    DCD11E
|    C                     MOVE *BLANK    DCD06S
|    C                     MOVE *BLANK    DCD06E
|    C                     MOVE *BLANK    DCD04S
|    C                     MOVE *BLANK    DCD04E
|    C                     MOVE *BLANK    DCD09S
|    C                     MOVE *BLANK    DCD09E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11S
|    C                     MOVE *BLANK    DMA11E
|    C                     Z-ADD0         DCD01
|    C                     Z-ADD0         CD01E
|    C                     Z-ADD0         CD01S
|    C                     MOVE 'A'       DSEL
|    C                     MOVE '1'       DSEL1
|    C                     MOVE 'A'       DSEL3
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*辦事處
| 01-C           COMP      IFEQ *BLANK
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVELCOMP      COMPS
|   C                     MOVELCOMP      COMPE
| 01-C                     END
|    C*
|    C*通路
| 02-C           DCD13S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD13S
| 02-C                     END
|    C*
| 03-C           DCD13E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD13E
| 03-C                     END
|    C*
| 04-C           DCD13S    IFGT DCD13E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*型態
| 05-C           DCD14S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD14S
| 05-C                     END
|    C*
| 06-C           DCD14E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD14E
| 06-C                     END
|    C*
| 07-C           DCD14S    IFGT DCD14E
|   C                     SETON                     6364
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*地區
| 08-C*          DCD11S    IFEQ *BLANK
|   C*                    MOVE *LOVAL    DCD11S
| 08-C*                    END
|    C*
| 09-C*          DCD11E    IFEQ *BLANK
|   C*                    MOVE *HIVAL    DCD11E
| 09-C*                    END
|    C*
| 10-C*          DCD11S    IFGT DCD11E
|   C*                    SETON                     6566
|   C*                    SETON                     9299
| 10-C*                    END
|    C*  99                GOTO END100
|    C*客戶
| 11-C           DCD06S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD06S
| 11-C                     END
|    C*
| 12-C           DCD06E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD06E
| 12-C                     END
|    C*
| 13-C           DCD06S    IFGT DCD06E
|   C                     SETON                     6768
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
|    C* 種類
| 14-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
| 14*C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 14-C                     END
|    C*產品
| 15-C           DCD04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD04S
| 15-C                     END
|    C*
| 16-C           DCD04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD04E
| 16-C                     END
|    C*
| 17-C           DCD04S    IFGT DCD04E
|   C                     SETON                     6970
|   C                     SETON                     9299
| 17-C                     END
|    C   99                GOTO END100
|    C*業務員代號
| 18-C           DCD09S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD09S
| 18-C                     END
|    C*
| 19-C           DCD09E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD09E
| 19-C                     END
|    C*
| 20-C           DCD09S    IFGT DCD09E
|   C                     SETON                     7475
|   C                     SETON                     9299
| 20-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 21-C           DCD01     IFNE 0
|   C*
| 22-C           DCD01M    IFGT 12
|   C           DCD01M    ORLT 1
|   C                     SETON                     729399
| 22-C                     END
|   C   99                GOTO END100
|   C*
|   C*(CHANGE TO CHINESE DATE)
|   C*本年月YY/MM
|   C                     Z-ADDDCD01Y    CD01EY
|   C                     Z-ADDDCD01M    CD01EM
|   C*
|   C*去年下月OR本年一月
|   C           CD01EM    ADD  1         CD01SM
| 23-C           CD01SM    IFEQ 13
|   C                     Z-ADD1         CD01SM
|   C                     Z-ADDCD01EY    CD01SY
| 23*C                     ELSE
M001AC                     MOVE CD01EY    HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    CD01XY  40
M001DC*          CD01EY    SUB  1         CD01SY
M001AC           CD01XY    SUB  1         CD01SY
| 23-C                     END
| 21*C                     ELSE
|   C                     SETON                     729399
| 21-C                     END
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE CD01S     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8S
|    C*
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE CD01E     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8E
|    C   99                GOTO END100
      *SCREEN LOG
|    C                     OPEN MSOR045Z
|    C                     WRITEPH1
|    C                     CLOSEMSOR045Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*通路
| 01-C           D#ROW     IFEQ 5
|   C           D#COL     ANDEQ30
|   C                     CALL 'WDS018'
|   C                     PARM           DCD13S
|   C                     GOTO ENDF4
| 01-C                     END
|    C*
| 02-C           D#ROW     IFEQ 5
|   C           D#COL     ANDEQ42
|   C                     CALL 'WDS018'
|   C                     PARM           DCD13E
|   C                     GOTO ENDF4
| 02-C                     END
|    C*型態
| 03-C           D#ROW     IFEQ 6
| 04-C           D#COL     IFGE 30
|   C           D#COL     ANDLE31
|   C                     CALL 'WDS009'
|   C                     PARM DCD13S    PCD13   1
|   C           DCD14S    PARM DCD14S    PCD14   2
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#COL     IFGE 42
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS009'
|   C                     PARM DCD13E    PCD13
|   C           DCD14E    PARM DCD14E    PCD14
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 03-C                     END
|    C*地區
| 06-C*          D#ROW     IFEQ 7
|   C*          D#COL     ANDGE30
|   C*          D#COL     ANDLE31
|   C*                    CALL 'WDS007'
|   C*                    PARM           DCD11S
|   C*                    GOTO ENDF4
| 06-C*                    END
|    C*
| 07-C*          D#ROW     IFEQ 7
|   C*          D#COL     ANDGE42
|   C*          D#COL     ANDLE43
|   C*                    CALL 'WDS007'
|   C*                    PARM           DCD11E
|   C*                    GOTO ENDF4
| 07-C*                    END
| 08-C           APPSCR    IFEQ 'SCR001'
|   C*客戶
| 09-C           D#ROW     IFEQ 7
| 10-C           D#COL     IFGE 30
|   C           D#COL     ANDLE38
|   C*                    MOVELDCD06S    P003O1
|   C                     CALL 'WDS003'
|   C                     PARM           DCD06S
|   C*                    PARM           P003O1  9
|   C*                    MOVELP003O1    DCD06S
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 11-C           D#COL     IFGE 42
|   C           D#COL     ANDLE50
|   C*                    MOVELDCD06E    P003O1
|   C                     CALL 'WDS003'
|   C                     PARM           DCD06E
|   C*                    PARM           P003O1
|   C*                    MOVELP003O1    DCD06E
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 09-C                     END
|   C*產品
| 12-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE30
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS001'
|   C                     PARM           DCD04S
|   C                     GOTO ENDF4
| 12-C                     END
|   C*
| 13-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE42
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS001'
|   C                     PARM           DCD04E
|   C                     GOTO ENDF4
| 13-C                     END
|   C*
| 14-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE31
|   C           D#COL     ANDLE32
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 14-C                     END
|   C*業務員代號
| 15-C           D#ROW     IFEQ 10
| 16-C           D#COL     IFGE 30
|   C           D#COL     ANDLE35
|   C                     CALL 'WDS015'
|   C                     PARM           DCD09S
|   C                     GOTO ENDF4
| 16-C                     END
|   C*
| 17-C           D#COL     IFGE 42
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS015'
|   C                     PARM           DCD09E
|   C                     GOTO ENDF4
| 17-C                     END
|   C*
| 15-C                     END
|   C*
| 08-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C*          *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
