      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : MSOR047D                                      *
      * AUTHOR       : AN MING HSIA                                  *
      * CREATE DATE  : 05/23/93                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :月客戶銷售統計表                             *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.06  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FMSOR047DCF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FMSOR047ZO   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *日期
     I                                      600 608 DCD04S
     I                                      610 618 DCD04E
     I*MM/YY
     I                                      620 6230DCD01S
     I                                      620 6210CD01MS
     I                                      622 6230CD01YS
     I*MM/YY
     I                                      632 6350DCD01E
     I                                      632 6330CD01ME
     I                                      634 6350CD01YE
     I*YY/MM
     I                                      624 6270DATEE
     I                                      624 6250YYE
     I                                      626 6270MME
     I                                      628 6310DATES
     I                                      628 6290YYS
     I                                      630 6310MMS
M001AI*
M001AI                                      850 8550YM6S
M001AI                                      856 8610YM6E
      *產品組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
| 04-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 04-C                     END
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     MOVE *BLANK    DCD04S
|    C                     MOVE *BLANK    DCD04E
|    C                     Z-ADD0         DCD01S
|    C                     Z-ADD0         DCD01E
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
M001AC                     Z-ADD0         YM6S
M001AC                     Z-ADD0         YM6E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK組別
| 01-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
| 01*C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 01-C                     END
|    C*產品
| 02-C           DCD04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD04S
| 02-C                     END
|    C*
| 03-C           DCD04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD04E
| 03-C                     END
|    C*
| 04-C           DCD04S    IFGT DCD04E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-日期
| 05-C           DCD01S    IFEQ 0
|   C                     SETON                     639599
| 05-C                     END
|    C   99                GOTO END100
| 06-C           DCD01E    IFEQ 0
|   C                     SETON                     649599
| 06-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           CD01MS    IFGT 12
|   C           CD01MS    ORLT 1
|   C                     SETON                     639399
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHANGE TO CHINESE DATE)
|    C*YY/MM
|    C                     Z-ADDCD01YS    YYS
|    C                     Z-ADDCD01MS    MMS
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE DATES     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YM6S
|    C*
|    C*(CHECK DATE)-日期
|    C*
| 08-C           CD01ME    IFGT 12
|   C           CD01ME    ORLT 1
|   C                     SETON                     649399
| 08-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHANGE TO CHINESE DATE)
|    C*YY/MM
|    C                     Z-ADDCD01YE    YYE
|    C                     Z-ADDCD01ME    MME
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE DATEE     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YM6E
|    C*
| 09-C*M001M     DATES     IFGT DATEE
M001MC           YM6S      IFGT YM6E
|   C                     SETON                     646399
|   C                     SETON                     92
| 09-C                     END
|    C   99                GOTO END100
|    C*
      *SCREEN LOG
|    C                     OPEN MSOR047Z
|    C                     WRITEPH1
|    C                     CLOSEMSOR047Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*產品
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE30
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS001'
|   C                     PARM           DCD04S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE42
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS001'
|   C                     PARM           DCD04E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE31
|   C           D#COL     ANDLE32
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C*          *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
