     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : MSOR044D                                   *
     A*    AUTHOR       : D910074  TINA                              *
     A*    CREATE DATE  : 83/04/22                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MSOR044D                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :訂單系統                                  *
     A*    REMARK       :月ＹＤＴ品牌通路銷售彙總表                *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.05  Y2K MODIFY                    */
     /*=============================================================*/
     A****************************************************************
     FMSOR044DCF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FMSOR044ZO   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*辦事處，通路，產品
     I                                      600 600 COMP
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      603 603 DCD13S
     I                                      604 604 DCD13E
     I                                      605 606 SCD04S
     I                                      607 608 SCD04E
     I                                      609 617 DCD04S
     I                                      618 626 DCD04E
     I*(MM/YY)
     I                                      627 6300DCD01S
     I                                      627 6280CD01M
     I                                      629 6300CD01Y
     I*(YY/MM)
M001MI*                                     631 6340YYMM1
M001MI                                      631 6360YYMM1
     I*YTD(MM/YY)
     I                                      640 6430YTDS
     I                                      640 6410YTDM
     I                                      642 6430YTDY
     I*YTD(YY/MM)
M001MI*                                     644 6470YYMM2
M001MI                                      644 6490YYMM2
     I*去年同期
M001MI*                                     651 6540YYMM3
M001MI*                                     655 6580YYMM4
M001MI                                      651 6560YYMM3
M001MI                                      657 6620YYMM4
     I*報表內容
M001MI*                                     659 659 TYPE
M001MI                                      669 669 TYPE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    DCD13E
|    C                     MOVE *BLANK    DCD13E
|    C                     MOVE *BLANK    SCD04S
|    C                     MOVE *BLANK    SCD04E
|    C                     MOVE *BLANK    DCD04S
|    C                     MOVE *BLANK    DCD04E
|    C                     Z-ADD0         DCD01S
|    C                     Z-ADD0         YTDS
|    C                     Z-ADD0         YYMM1
|    C                     Z-ADD0         YYMM2
|    C                     Z-ADD0         YYMM3
|    C                     Z-ADD0         YYMM4
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK辦事處
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C*通路代號
| 02-C           DCD13S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD13S
| 02-C                     END
|    C*
| 03-C           DCD13E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD13E
| 03-C                     END
|    C*
| 04-C           DCD13S    IFGT DCD13E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*品牌
| 14-C           SCD04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    SCD04S
| 14-C                     END
|    C*
| 15-C           SCD04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    SCD04E
| 15-C                     END
|    C*
| 16-C           SCD04S    IFGT SCD04E
|   C                     SETON                     6364
|   C                     SETON                     9299
| 16-C                     END
|    C   99                GOTO END100
|    C*產品代號
| 14-C           DCD04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DCD04S
| 14-C                     END
|    C*
| 15-C           DCD04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DCD04E
| 15-C                     END
|    C*
| 16-C           DCD04S    IFGT DCD04E
|   C                     SETON                     6566
|   C                     SETON                     9299
| 16-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 17-C           DCD01S    IFEQ 0
|   C                     SETON                     679599
| 17-C                     END
|    C   99                GOTO END100
     C*
| 18-C           CD01M     IFGT 12
|   C*M001M     CD01Y     ORLT 1
M001MC           CD01M     ORLT 1
|   C                     SETON                     679399
| 18-C                     END
|    C   99                GOTO END100
     C*CURENT MONTH
     C                     MOVE CD01M     YYMM1
M001MC*                    MOVELCD01Y     YYMM1
M001AC                     MOVE CD01Y     HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVELHB2@Y4    YYMM1
|    C* YTD(MM/YY)
     C           CD01M     IFLE 3
M001MC*          CD01Y     SUB  1         YTDY
M001AC                     MOVE CD01Y     HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4      40
M001MC           W4        SUB  1         W4Y     40
M001AC                     Z-ADDW4Y       YTDY
     C                     ELSE
     C                     Z-ADDCD01Y     YTDY
     C                     END
     C                     Z-ADD4         YTDM
|    C* YTD(YY/MM)
     C*M001M               MOVELYTDY      YYMM2
M001AC                     MOVE YTDY      HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVELHB2@Y4    YYMM2
     C                     MOVE YTDM      YYMM2
     C*去年同期  MONTH
     C*M001M     CD01Y     SUB  1         WORK01  20
     C*M001M               MOVELWORK01    YYMM3
M001AC                     MOVE CD01Y     HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4      40
M001MC           W4        SUB  1         W4Y     40
M001AC                     MOVELW4Y       YYMM3
     C                     MOVE CD01M     YYMM3
     C*去年同期  YTD
M001MC*          YTDY      SUB  1         WORK01
M001MC*                    MOVELWORK01    YYMM4
M001AC                     MOVE YTDY      HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4      40
M001MC           W4        SUB  1         W4Y     40
M001AC                     MOVELW4Y       YYMM4
     C                     MOVE YTDM      YYMM4
     C*
      *SCREEN LOG
     C                     OPEN MSOR044Z
     C                     WRITEPH1
     C                     CLOSEMSOR044Z
      *
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*通路
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFEQ 37
|   C                     CALL 'WDS018'
|   C                     PARM           DCD13S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 49
|   C                     CALL 'WDS018'
|   C                     PARM           DCD13E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*品牌
| 02-C           D#ROW     IFEQ 8
| 03-C           D#COL     IFGE 37
| 03-C           D#COL     ANDLE38
|   C                     CALL 'WDS026'
|   C                     PARM           SCD04S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 49
| 03-C           D#COL     ANDLE50
|   C                     CALL 'WDS026'
|   C                     PARM           SCD04E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*產品
| 08-C           D#ROW     IFEQ 10
| 09-C           D#COL     IFGE 37
|   C           D#COL     ANDLE45
|   C                     CALL 'WDS001'
|   C                     PARM           DCD04S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 49
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS001'
|   C                     PARM           DCD04E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*
| 11-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE37
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C*          *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
