     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : MTA001                                     *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    DATE WRITTEN : 81/01/13                                   *
     A*    UPDATE DATE  : 81/04/07                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :主檔資料維護子系統                        *
     A*    PROCEDURE    :產品資料建立 (A/U/D/I)                    *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.04 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 99.06.02 | CPY RECORD RESET MA31/MA32/MA33/MA34
     A*---------------------------------------------------------------
     A* M003      | 99.06.02 |長．寬．高用下列欄位代表
     A*           |          |MA35/MA36/MA47
     A*---------------------------------------------------------------
     A* M004      | 01.03.20 |禮盒碼＝組拆組，新增真正禮盒碼
     A*---------------------------------------------------------------
     A* M005      | 01.05.25 | NEW INPUT
     A*---------------------------------------------------------------
     A* M006      | 01.07.26 |康齡產品不需要輸入產品歸類檔DMA07='K'
     A*---------------------------------------------------------------
     A* M007      | 01.12.18 |開徵菸酒稅
     A*---------------------------------------------------------------
     A****************************************************************
     FMTMALF  IF  E           K        DISK
     F            MA0                               KRENAMEMA0L
M004AFMTMAPFX UF  E           K        DISK                      A
M005AFBRBEPF  UF  E           K        DISK                      A
     FMTMAPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMHLF  UF  E           K        DISK                      A
     F            MA0                               KRENAMEMH0
     FMTMIPF  O   E                    DISK
     FPA#APF  IF  E           K        DISK
M005AFPA#7PF  IF  E           K        DISK
M005AFBRBNPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMBLF  IF  E           K        DISK
     FPOPILF02IF  E           K        DISK
     FPOPELF02IF  E           K        DISK
     FSOSFLF02IF  E           K        DISK
     FPOPALF04UF  E           K        DISK
     FPOPCLF01UF  E           K        DISK
     FMTA001D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     F                                              KINFDS DSPFDS
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        5  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
B2MODI*M001M                                187 1940$EGYMD
M001MI                                      187 1920$EGYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I**                                    140 140 $RMK02
 @   I**                                    141 141 $RMK03
     I**                                    162 1620$EVR
     I**                                    125 1270$CPY
M001AI                                      201 2080$EG8
B2MODI*M001M                                600 6010$LPRT
B2MODI*M001M                                503 507 $WRHUS
B2MODI*M001M                                508 508 $PURID
B2MODI*M001M                                509 510 $TRNID
B2MODI*M001M                                511 515 $APAUT
B2MODI*M001M                                516 523 $#101
M001MI                                      598 5990$LPRT
M001MI                                      501 505 $WRHUS
M001MI                                      506 506 $PURID
M001MI                                      507 508 $TRNID
M001MI                                      509 513 $APAUT
M001MI                                      514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I            DS
     I                                        1   9 DMA01
     I                                        1   1 DMA01L
     I                                        1   2 DMA08
     I                                        3   4 DMA10
     I                                        7   7 DMA10R
M005AI            DS
M005AI                                        1   6 DBE06
M005AI                                        1   2 D1
M005AI                                        3   4 D2
M005AI                                        5   5 DSIZE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C                     Z-ADD0         HRRN    40
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C           *LIKE     DEFN MA01      OBGN1            *START KEY
     C*  FOR SUBFILE (SYS+PGM CONTROL)
     C***        *LIKE     DEFN MA01      BMA01            *SUBFIL BUTTOM
     C                     MOVE *BLANK    WBOTOM  1
     C           *LIKE     DEFN RRN       WRRN
     C           *LIKE     DEFN RRN       WPRCD
     C           *LIKE     DEFN RRN       DSPRCD
     C           *LIKE     DEFN PI05      WPI05
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#A2    KLIST
     C                     KFLD           #A012   8
     C                     KFLD           #A022  10
     C           KEYPI     KLIST
     C                     KFLD           MA01
     C                     KFLD           WPI05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
     C*
     C                     MOVE *ALL'0'   *IN,60
     C                     MOVE *ALL'0'   *IN,70
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN120
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $ADD      WA01,3
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN120....F6(ADD)
      *==============================================================*
02===C           RTN120    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9099
| 01-C                     END
|    C  N99                EXSR RTN200
| 02-C           DRRN      IFGT 0
|   C           DRRN      SUB  1         HRRN
| 02-C                     END
|    C                     EXSR RTN191
|    C                     EXSR RTN192
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C                     Z-ADD0         HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN       HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR                  4040*NF
| 01-C           *IN40     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN       DRRN
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           UPD       TAG
|   C*
|   C                     UPDATSFLSR
|   C                     READCSFLSR                    40*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     98
| 05-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
| 01-C                     END
|    C   99                GOTO END180
|    C*
05===C           END180    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         WRRN
|    C                     Z-ADD10        WPRCD
|    C                     Z-ADD0         DSPRCD
|    C           HRRN      DIV  WPRCD     DSPRCD
|    C                     MULT WPRCD     DSPRCD
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR
|    C                     SETOF                     52
|    C           DBGN1     SETLLMA0L
|    C***                  MOVE DBGN1     BMA01
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     97    *LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
|   C***        BMA01     IFNE DBGN1
|   C***        BMA01     SETGTMA0L
|   C***                  END
|   C                     EXSR RTN193
|   C***                  MOVE MA01      BMA01
|   C***        *LOVAL    SETLLMA0L
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANK    DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN      RRN
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN       DOWLTDSPRCD
|   C                     READ MA0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN       DRRN
|    C                     Z-ADDRRN       WRRN
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN       IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     96    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'3'       RTN225           *CPY
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C           *LOVAL    SETLLMA0
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
11===C           RTN210    BEGSR
|    C*
|    C                     SETON                     3031  *ADD MSG
|    C                     EXSR RTN251                     *CLR FIELD
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     MOVE '0'       *IN01
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C*
| 05-C           DMA07     IFEQ 'R'
|   C                     MOVELDMA01     DMA012
| 06-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN01     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD3
|   C                     MOVEA*ALL'0'   *IN,70
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 07-C           *IN03     IFEQ '0'
|   C           *IN01     ANDEQ'0'
|   C*
| 08-C           *IN04     CASEQ'1'       RTNF42
|   C                     CAS            RTN580
| 08-C                     END
| 09-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C                     EXSR RTN253
|   C                     EXSR RTN553
|   C                     WRITEMX0
|   C                     WRITEMA0
|   C                     WRITEMI0
|   C                     WRITEBE0
|   C                     EXSR RTN353
|   C                     WRITEMH0
|   C                     MOVE 'SCR001'  APPSCR
| 09-C                     END
| 07-C                     END
| 06-C                     END
| 05*C                     ELSE
|   C                     EXSR RTN253
|   C                     WRITEMX0
|   C                     WRITEMA0
|   C                     WRITEMI0
|   C                     EXSR RTN353
|   C                     WRITEMH0
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
12===C           RTN220    BEGSR
|    C*
|    C           MA01      CHAINMA0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     Z-ADD0         MA16B
|    C                     Z-ADDMA16      MA16B   30
|    C           MA01      CHAINMX0                  49
| 01-C           *IN49     IFEQ '0'
|   C                     MOVE DMX54     MX54
|   C                     MOVE DMX55     MX55
|   C                     UPDATMX0
| 01-C                     END
|    C  N40                UPDATMA0
| 02-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     30
|   C                     SETON                     31    *CAN INPUT
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     MOVE '0'       *IN01
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTNF4
|   C                     CAS            RTN280
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C*
| 06-C           DMA07     IFEQ 'R'
|   C           MA01      CHAINBE0                  48
|   C                     MOVELMA01      DMA012
|   C                     EXSR RTN552                     *FIEL->SCRN
| 07-C           *IN03     DOWEQ'0'
|   C           *IN01     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     30
|   C                     SETON                     31    *CAN INPUT
|   C                     EXFMTDSPD3
|   C                     MOVEA*ALL'0'   *IN,70
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 08-C           *IN03     IFEQ '0'
|   C           *IN01     ANDEQ'0'
|   C*
| 09-C           *IN04     CASEQ'1'       RTNF42
|   C                     CAS            RTN580
| 09-C                     END
|   C*
| 10-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C           MA01      CHAINMA0                  40
|   C                     EXSR RTN253
|   C           MA01      CHAINMX0                  49
| 11-C           *IN49     IFEQ '0'
|   C                     MOVE DMX54     MX54
|   C                     MOVE DMX55     MX55
|   C                     UPDATMX0
| 11-C                     END
|   C  N40                UPDATMA0
|   C           MA01      CHAINBE0                  48
|   C                     EXSR RTN553
| 12-C           *IN48     IFEQ '0'
|   C                     UPDATBE0
| 12*C                     ELSE
|   C                     MOVELMAXX      BEXX
|   C                     MOVELMAYY      BEYY
|   C                     MOVELMAZZ      BEZZ
|   C                     WRITEBE0
| 12-C                     END
| 13-C           MA16      IFNE MA16B
|   C                     EXSR UPDPOP
| 13-C                     END
|   C                     WRITEMI0
|   C           MA01      CHAINMH0                  41
|   C                     EXSR RTN353
|   C  N41                UPDATMH0
|   C                     MOVE 'SCR001'  APPSCR
| 10-C                     END
| 08-C                     END
| 07-C                     END
| 06*C                     ELSE
|   C           MA01      CHAINMA0                  40
|   C                     EXSR RTN253
|   C           MA01      CHAINMX0                  49
| 14-C           *IN49     IFEQ '0'
|   C                     MOVE DMX54     MX54
|   C                     MOVE DMX55     MX55
|   C                     UPDATMX0
| 14-C                     END
|   C  N40                UPDATMA0
| 15-C           MA16      IFNE MA16B
|   C                     EXSR UPDPOP
| 15-C                     END
|   C                     WRITEMI0
|   C           MA01      CHAINMH0                  41
|   C                     EXSR RTN353
|   C  N41                UPDATMH0
|   C                     MOVE 'SCR001'  APPSCR
| 06-C                     END
| 05-C                     END
| 03-C                     END
|   C*
| 02-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          UPDPOP....UPD DATA
      *==============================================================*
13===C           UPDPOP    BEGSR
|    C*
|    C           MA01      SETLLPA0
|    C           MA01      READEPA0                      61
| 01-C           *IN61     DOWEQ'0'
| 02-C           PA14      IFNE MA16
|   C           PA13      ANDEQMA14
|   C                     Z-ADDMA16      PA14
|   C                     UPDATPA0
| 02-C                     END
|   C  N61      MA01      READEPA0                      61
| 01-C                     END
|    C*
|    C           MA01      SETLLPC0
|    C           MA01      READEPC0                      61
| 03-C           *IN61     DOWEQ'0'
| 04-C           PC10      IFNE MA16
|   C           PC09      ANDEQMA14
|   C           MA16      DIV  PC10      WPA     42
|   C           PC06      DIV  WPA       WPA2    60
|   C           PC07      MULT WPA       WPA3    82
|   C                     Z-ADDMA16      PC10
|   C                     Z-ADDWPA2      PC06
|   C                     Z-ADDWPA3      PC07
|   C                     UPDATPC0
| 04-C                     END
|   C  N61      MA01      READEPC0                      61
| 03-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN225....COPY ADD DATA
      *==============================================================*
14===C           RTN225    BEGSR
|    C*
|    C                     SETON                     3031  *ADD MSG
|    C           MA01      CHAINMA0                  40
|    C                     EXSR RTN254                     *FIEL->SCRN
|    C*課稅別
|    C*                    MOVE 'B'       DMA59
|    C                     MOVE 'D'       DMA59
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     MOVE '0'       *IN01
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
| 05-C           DMA07     IFEQ 'R'
|   C           MA01      CHAINBE0                  48
|   C                     MOVELDMA01     DMA012
|   C                     EXSR RTN554                     *FIEL->SCRN
| 06-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN01     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD3
|   C                     MOVEA*ALL'0'   *IN,70
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 07-C           *IN03     IFEQ '0'
|   C           *IN01     ANDEQ'0'
|   C*
| 08-C           *IN04     CASEQ'1'       RTNF42
|   C                     CAS            RTN580
| 08-C                     END
| 09-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C                     EXSR RTN253
|   C                     EXSR RTN553
|   C                     WRITEMX0
|   C                     WRITEBE0
|   C                     WRITEMA0
|   C           MA01      CHAINMH0                  41
|   C                     EXSR RTN353
|   C                     WRITEMH0
|   C                     MOVE 'SCR001'  APPSCR
| 09-C                     END
| 07-C                     END
| 06-C                     END
| 05*C                     ELSE
|   C                     EXSR RTN253
|   C                     WRITEMX0
|   C                     WRITEMA0
|   C           MA01      CHAINMH0                  41
|   C                     EXSR RTN353
|   C                     WRITEMH0
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
15===C           RTN230    BEGSR
|    C*
|    C           MA01      CHAINMA0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     3031  *NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     MOVE '0'       *IN01
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
| 03-C           DMA07     IFEQ 'R'
|   C           DMA01     CHAINBE0                  48
|   C                     MOVELDMA01     DMA012
|   C                     EXSR RTN552                     *FIEL->SCRN
| 04-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN01     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD3
|   C                     MOVEA*ALL'0'   *IN,70
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 05-C           *IN03     IFEQ '0'
|   C           *IN01     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C*
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 06-C           DLTFLG    IFEQ 'Y'
|   C***        D#B01     CHAIN#B0                  41
|   C           MA01      CHAINMX0                  49
| 07-C           *IN49     IFEQ '0'
|   C                     DELETMX0
| 07-C                     END
|   C           MA01      CHAINBE0                  48
| 08-C           *IN48     IFEQ '0'
|   C                     DELETBE0
| 08-C                     END
|   C                     DELETMA0
|   C           MA01      CHAINMH0                  41
|   C                     DELETMH0
| 06-C                     END
| 05-C                     END
| 04-C                     END
| 03*C                     ELSE
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 09-C           DLTFLG    IFEQ 'Y'
|   C           MA01      CHAINMX0                  49
| 10-C           *IN49     IFEQ '0'
|   C                     DELETMX0
| 10-C                     END
|   C                     DELETMA0
|   C           MA01      CHAINMH0                  41
|   C                     DELETMH0
|   C                     MOVE 'SCR001'  APPSCR
| 09-C                     END
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
16===C           RTN240    BEGSR
|    C*
|    C           MA01      CHAINMA0L                 40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     3031  *NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     MOVE '0'       *IN01
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
| 03-C           DMA07     IFEQ 'R'
|   C           DMA01     CHAINBE0                  48
|   C                     MOVELDMA01     DMA012
|   C                     EXSR RTN552                     *FIEL->SCRN
| 04-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN01     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD3
|   C                     MOVEA*ALL'0'   *IN,70
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 05-C           *IN03     IFEQ '0'
|   C           *IN01     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     Z-ADDRRN       DRRN
| 05-C                     END
| 04-C                     END
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
|   C                     Z-ADDRRN       DRRN
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
16===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
17===CSR         RTN251    BEGSR
|    C*
|    C                     MOVE *BLANK    DMA01
|    C                     MOVE *BLANK    DMA02
|    C                     MOVE *BLANK    DMA03
|    C                     MOVE *BLANK    DMA04
|    C                     MOVE *BLANK    DMA05
|    C                     MOVE *BLANK    DMA06
|    C                     MOVE *BLANK    DMA07
|    C                     MOVE *BLANK    DCMP
|    C                     MOVE *BLANK    DMA08
|    C                     MOVE *BLANK    DID
|    C                     MOVE *BLANK    DMA09
|    C                     MOVE *BLANK    DGROUP
|    C                     MOVE *BLANK    DMA10
|    C                     MOVE *BLANK    DBRAND
|    C                     MOVE *BLANK    DMA11
|    C*                    MOVE 'B'       DMA59
|    C                     MOVE 'D'       DMA59
|    C                     MOVEL'瓶'    DMA13
|    C                     MOVE *BLANK    DMA12
|    C                     MOVE *BLANK    DMB03
|    C                     Z-ADD0         DMA31
|    C                     MOVEL'CASE'    DMA14
|    C                     Z-ADD0         DMA18
|    C                     Z-ADD0         DMA32
|    C                     Z-ADD0         DMA15
|    C                     MOVE *BLANK    DMA19
|    C                     MOVE *BLANK    DMC02
|    C                     Z-ADD0         DMA33
|    C                     Z-ADD0         DMA16
|    C                     MOVE *BLANK    DMA20
|    C                     Z-ADD0         DMA34
|    C                     Z-ADD0         DMA15C
|    C                     Z-ADD0         DMA21
|    C*                    Z-ADD0         DMA22
|    C                     Z-ADD0         DMA45
|    C                     MOVE *BLANK    DMA17
|    C                     Z-ADD0         DMA35
|    C                     Z-ADD0         DMA36
|    C                     Z-ADD0         DMA47
|    C                     Z-ADD0         DMA46
|    C                     MOVE *BLANK    DMA54
|    C                     MOVE *BLANK    DMX54
|    C                     MOVE *BLANK    DMX55
|    C                     MOVE *BLANK    DMA55
|    C                     MOVE *BLANK    DMA56
|    C                     Z-ADD0         DMA37
|    C****                 Z-ADD0         DMA50
|    C                     MOVEL*BLANK    DMA57
|    C                     Z-ADD0         DMA38
|    C                     Z-ADD0         DMA50
|    C                     Z-ADD0         DMA51
|    C                     Z-ADD0         DMA25
|    C                     MOVEL'I'       DMA58
|    C                     Z-ADD$EGMDY    DMA53
|    C                     MOVE *BLANK    DMA23
|    C                     MOVE *BLANK    DMA24
|    C*
|    C                     Z-ADD0         MA26
|    C                     Z-ADD0         MA27
|    C                     Z-ADD0         MA28
|    C                     Z-ADD0         MA29
|    C                     Z-ADD0         MA30
|    C                     Z-ADD0         MA39
|    C                     Z-ADD0         MA40
|    C                     Z-ADD0         MA41
|    C                     Z-ADD0         MA42
|    C                     Z-ADD0         MA43
|    C                     Z-ADD0         MA44
|    C                     Z-ADD0         MA45
|    C                     Z-ADD0         MA46
|    C                     Z-ADD0         MA47
|    C                     Z-ADD0         MA48
|    C                     Z-ADD0         MA49
|    C                     MOVE *BLANK    DMA012
|    C                     MOVE *BLANK    DBE02
|    C                     MOVE *BLANK    DBE03
|    C                     MOVE *BLANK    DBE04
|    C                     MOVE *BLANK    DBE05
|    C                     MOVE *BLANK    DBE06
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
18===CSR         RTN252    BEGSR
|    C*
|    C                     MOVE MA01      DMA01
|    C                     MOVE MA02      DMA02
|    C                     MOVE MA03      DMA03
|    C                     MOVE MA04      DMA04
|    C                     MOVE MA05      DMA05
|    C                     MOVE MA06      DMA06
|    C                     MOVE MA07      DMA07
|    C                     MOVE MA08      DMA08
|    C                     MOVE MA09      DMA09
|    C                     MOVE MA10      DMA10
|    C                     MOVE MA11      DMA11
|    C                     MOVE MA59      DMA59
|    C                     MOVE MA12      DMA12
|    C                     MOVE MA13      DMA13
|    C*                    Z-ADDMA31      DMA31
|    C                     MOVE MA14      DMA14
|    C                     Z-ADDMA18      DMA18
|    C*                    Z-ADDMA32      DMA32
|    C                     Z-ADDMA15      DMA15
|    C                     MOVE MA19      DMA19
|    C*                    Z-ADDMA33      DMA33
|    C                     Z-ADDMA16      DMA16
|    C                     MOVE MA20      DMA20
|    C*                    Z-ADDMA34      DMA34
|    C                     Z-ADDMA21      DMA21
|    C*                    Z-ADDMA22      DMA22
|    C                     MOVE MA17      DMA17
|    C                     Z-ADDMA35      DMA35
|    C                     Z-ADDMA36      DMA36
|    C                     Z-ADDMA47      DMA47
|    C                     MOVE MA54      DMA54
|    C                     MOVE MA55      DMA55
|    C                     MOVE MA56      DMA56
|    C                     Z-ADDMA37      DMA37
|    C****                 Z-ADDMA50      DMA50
|    C                     MOVE MA57      DMA57
|    C                     Z-ADDMA38      DMA38
|    C                     Z-ADDMA25      DMA25
|    C                     MOVE MA58      DMA58
|    C                     MOVE MA23      DMA23
|    C                     MOVE MA24      DMA24
|    C           MA01      CHAINMX0                  49
| 01-C           *IN49     IFEQ '0'
|   C                     MOVE MX54      DMX54
|   C                     MOVE MX55      DMX55
| 01*C                     ELSE
|   C                     MOVE *BLANK    DMX54
|   C                     MOVE *BLANK    DMX55
| 01-C                     END
|    C**
|    C*M001M     $EGYMD    IFLT MA39
| 02-C           $EG8      IFLT MA39
|   C                     Z-ADDMA40      DMA45
|   C                     Z-ADDMA41      DMA46
|   C*M003D               Z-ADDMA42      DMA47            移作他用
| 02*C                     ELSE
|   C                     Z-ADDMA45      DMA45
|   C                     Z-ADDMA46      DMA46
|   C*M003D               Z-ADDMA47      DMA47            移作他用
| 02-C                     END
|    C**
|    C                     Z-ADD0         PI05
|    C                     Z-ADD0         PE05
|    C                     MOVE *HIVAL    WPI05
|    C           KEYPI     SETLLPI0
|    C           MA01      REDPEPI0                      45
|    C           KEYPI     SETLLPE0
|    C           MA01      REDPEPE0                      45
|    C**
| 03-C           PE05      IFGT PI05
|   C                     Z-ADDPE05      PI05
| 03-C                     END
|    C*
|    C                     Z-ADDPI05      WWPI05  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
|    C*M001M               PARM PI05      S001I2  80
|    C                     PARM WWPI05    S001I2  60
|    C*M001M     DMA51     PARM           S001O1  80
|    C           DMA51     PARM           S001O1  60
|    C**
|    C                     Z-ADD0         SF25
|    C           MA01      CHAINSF0                  40
|    C                     Z-ADDSF25      WSF25   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
|    C*M001M               PARM SF25      S001I2  80
|    C                     PARM WSF25     S001I2  60
|    C*M001M     DMA50     PARM           S001O1  80
|    C           DMA50     PARM           S001O1  60
|    C**
|    C*                    CALL 'RES001'
|    C*                    PARM 'YMD'     S001I1  3
|    C*                    PARM MA52      S001I2  60
|    C*          DMA52     PARM           S001O1  60
|    C**
|    C                     Z-ADDMA53      WMA53   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
|    C*M001M               PARM MA53      S001I2  80
|    C                     PARM WMA53     S001I2  60
|    C*M001M     DMA53     PARM           S001O1  80
|    C           DMA53     PARM           S001O1  60
|    C**
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'ID      '#A01
|    C                     MOVELDMA08     #A02
|    C           KEY#A     CHAIN#A0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DID
| 04*C                     ELSE
|   C                     MOVEL#A03      DID
| 04-C                     END
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'BRAND   '#A01
|    C                     MOVELDMA10     #A02
|    C           KEY#A     CHAIN#A0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DBRAND
| 05*C                     ELSE
|   C                     MOVEL#A03      DBRAND
| 05-C                     END
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'COMPANY '#A01
|    C                     MOVELDMA07     #A02
|    C           KEY#A     CHAIN#A0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DCMP
| 06*C                     ELSE
|   C                     MOVEL#A03      DCMP
| 06-C                     END
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'GROUP   '#A01
|    C                     MOVELDMA09     #A02
|    C           KEY#A     CHAIN#A0                  40
| 07-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DGROUP
| 07*C                     ELSE
|   C                     MOVEL#A03      DGROUP
| 07-C                     END
|    C*
|    C           DMA12     CHAINMB0                  40
| 08-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DMB03
| 08*C                     ELSE
|   C                     MOVELMB03      DMB03
| 08-C                     END
|    C*
|    C           DMA19     CHAINMC0                  40
| 09-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DMC02
| 09*C                     ELSE
|   C                     MOVELMC02      DMC02
| 09-C                     END
|    C*
|    C           DMA15     MULT DMA16     DMA15C
|    C*
18===CSR                   ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
19===CSR         RTN253    BEGSR
|    C*
|    C                     MOVE DMA01     MA01
|    C                     MOVE DMA02     MA02
|    C                     MOVE DMA03     MA03
|    C                     MOVE DMA04     MA04
|    C                     MOVE DMA05     MA05
|    C                     MOVE DMA06     MA06
|    C                     MOVE DMA07     MA07
|    C                     MOVE DMA08     MA08
|    C                     MOVE DMA09     MA09
|    C                     MOVE DMA10     MA10
|    C                     MOVE DMA11     MA11
|    C                     MOVE DMA12     MA12
|    C                     MOVE DMA13     MA13
|    C                     MOVE DMA14     MA14
|    C                     Z-ADDDMA15     MA15
|    C                     Z-ADDDMA16     MA16
|    C                     MOVE DMA17     MA17
|    C                     Z-ADDDMA18     MA18
|    C                     MOVE DMA19     MA19
|    C                     MOVE DMA20     MA20
|    C                     Z-ADDDMA21     MA21
|    C*                    Z-ADDDMA22     MA22
|    C                     MOVE DMA23     MA23
|    C                     MOVE DMA24     MA24
|    C                     Z-ADDDMA25     MA25
|    C*                    Z-ADDDMA31     MA31
|    C*                    Z-ADDDMA32     MA32
|    C*                    Z-ADDDMA33     MA33
|    C*                    Z-ADDDMA34     MA34
|    C                     Z-ADDDMA35     MA35
|    C                     Z-ADDDMA36     MA36
|    C                     Z-ADDDMA47     MA47
|    C                     Z-ADDDMA37     MA37
|    C                     Z-ADDDMA38     MA38
|    C**                   Z-ADDDMA50     MA50
|    C**                   Z-ADDDMA51     MA51
|    C**                   Z-ADDDMA52     MA52
|    C*M001D               Z-ADDDMA53     MA53
|    C                     MOVE DMA54     MA54
|    C                     MOVE DMA55     MA55
|    C                     MOVE DMA56     MA56
|    C                     MOVE DMA57     MA57
|    C                     MOVE DMA58     MA58
|    C                     MOVE DMA59     MA59
|    C                     MOVE DMX54     MX54
|    C                     MOVE DMX55     MX55
|    C                     MOVE DMA01     MX01
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C*M001M               PARM DMA53     S001I2  80
|    C                     PARM DMA53     S001I2  60
|     *CVR5008 sev.50 The converter tool cannot handle op-code PARM
|     *   involving not-expanded and expanded date fields requiring
|     *   add/remove century. Code must be adjusted manually
|    C*M001M     MA53      PARM           S001O1  80
|    C           WMA53     PARM           S001O1  60
|    C                     MOVE WMA53     HB2@F6  6
|    C                     EXSR HB@68L
|    C                     MOVE HB2@T8    MA53    80
|    C**
|    C*M001D               CALL 'RES001'
|    C*M001D               PARM 'MDY'     S001I1  3
|    C*M001D               PARM $EGMDY    S001I2  80
|     *CVR5008 sev.50 The converter tool cannot handle op-code PARM
|     *   involving not-expanded and expanded date fields requiring
|     *   add/remove century. Code must be adjusted manually
|    C*M001D     MAXX      PARM           S001O1  80
|    C**
|    C                     Z-ADD$EG8      MAXX
|    C                     TIME           MAYY
|    C                     MOVE $USER     MAZZ
|    C                     MOVELMAXX      MXXX
|    C                     MOVELMAYY      MXYY
|    C                     MOVELMAZZ      MXZZ
|    C*
19===CSR                   ENDSR
      *==============================================================*
      *          RTN254....FOR COPY
      *==============================================================*
20===CSR         RTN254    BEGSR
|    C*
|    C                     MOVE *BLANKS   DMA01
|    C                     MOVE MA02      DMA02
|    C                     MOVE MA03      DMA03
|    C                     MOVE MA04      DMA04
|    C                     MOVE MA05      DMA05
|    C                     MOVE MA06      DMA06
|    C                     MOVE MA07      DMA07
|    C                     MOVE *BLANKS   DMA08
|    C                     MOVE MA09      DMA09
|    C                     MOVE *BLANKS   DMA10
|    C                     MOVE MA11      DMA11
|    C                     MOVE MA12      DMA12
|    C                     MOVE MA13      DMA13
|    C                     MOVE MA14      DMA14
|    C                     Z-ADDMA15      DMA15
|    C                     Z-ADDMA16      DMA16
|    C                     MOVE MA17      DMA17
|    C                     Z-ADDMA18      DMA18
|    C                     MOVE MA19      DMA19
|    C                     MOVE MA20      DMA20
|    C                     Z-ADDMA21      DMA21
|    C*                    Z-ADDMA22      DMA22
|    C                     MOVE MA23      DMA23
|    C                     MOVE MA24      DMA24
|    C                     Z-ADDMA25      DMA25
|    C                     Z-ADD0         MA26
|    C                     Z-ADD0         MA27
|    C                     Z-ADD0         MA28
|    C                     Z-ADD0         MA29
|    C                     Z-ADD0         MA30
|    C                     Z-ADD0         DMA31
|    C                     Z-ADD0         DMA32
|    C                     Z-ADD0         DMA33
|    C                     Z-ADD0         DMA34
|    C                     Z-ADD0         MA31
|    C                     Z-ADD0         MA32
|    C                     Z-ADD0         MA33
|    C                     Z-ADD0         MA34
|    C                     Z-ADDMA35      DMA35
|    C                     Z-ADDMA36      DMA36
|    C                     Z-ADDMA47      DMA47
|    C                     Z-ADDMA37      DMA37
|    C                     Z-ADDMA38      DMA38
|    C                     Z-ADD0         MA39
|    C                     Z-ADD0         MA40
|    C                     Z-ADD0         MA41
|    C                     Z-ADD0         MA42
|    C                     Z-ADD0         MA43
|    C                     Z-ADD0         MA44
|    C                     Z-ADD0         MA45
|    C                     Z-ADD0         MA46
|    C*M003D               Z-ADD0         MA47
|    C                     Z-ADD0         MA48
|    C                     Z-ADD0         DMA45
|    C                     Z-ADD0         DMA46
|    C*M003D               Z-ADD0         DMA47
|    C                     Z-ADD0         MA49
|    C                     Z-ADD0         DMA50
|    C                     Z-ADD0         DMA51
|    C                     Z-ADD$EGMDY    DMA53
|    C                     MOVE MA54      DMA54
|    C                     MOVE MA55      DMA55
|    C                     MOVE MA56      DMA56
|    C                     MOVE MA57      DMA57
|    C                     MOVE MA58      DMA58
|    C**
|    C           MA01      CHAINMX0                  49
| 01-C           *IN49     IFEQ '0'
|   C                     MOVE MX54      DMX54
|   C                     MOVE MX55      DMX55
| 01*C                     ELSE
|   C                     MOVE *BLANK    DMX54
|   C                     MOVE *BLANK    DMX55
| 01-C                     END
|    C                     Z-ADD0         PI05
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'ID      '#A01
|    C                     MOVELDMA08     #A02
|    C           KEY#A     CHAIN#A0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DID
| 02*C                     ELSE
|   C                     MOVEL#A03      DID
| 02-C                     END
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'BRAND   '#A01
|    C                     MOVELDMA10     #A02
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DBRAND
| 03*C                     ELSE
|   C                     MOVEL#A03      DBRAND
| 03-C                     END
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'COMPANY '#A01
|    C                     MOVELDMA07     #A02
|    C           KEY#A     CHAIN#A0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DCMP
| 04*C                     ELSE
|   C                     MOVEL#A03      DCMP
| 04-C                     END
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'GROUP   '#A01
|    C                     MOVELDMA09     #A02
|    C           KEY#A     CHAIN#A0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DGROUP
| 05*C                     ELSE
|   C                     MOVEL#A03      DGROUP
| 05-C                     END
|    C*
|    C           DMA12     CHAINMB0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DMB03
| 06*C                     ELSE
|   C                     MOVELMB03      DMB03
| 06-C                     END
|    C*
|    C           DMA19     CHAINMC0                  40
| 07-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DMC02
| 07*C                     ELSE
|   C                     MOVELMC02      DMC02
| 07-C                     END
|    C*
|    C           DMA15     MULT DMA16     DMA15C
|    C*
20===CSR                   ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' SCREEN
     C*==============================================================*
21===CSR         RTN280    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '3'
|   C*
| 02-C           DMA01     IFEQ *BLANK
|   C                     SETON                     609899
| 02*C                     ELSE
|   C           DMA01     SETLLMA0                      41
| 03-C           *IN41     IFEQ '1'
|   C                     SETON                     609799
| 03-C                     END
| 02-C                     END
|   C   99                GOTO END280
|   C*新增判斷產品開頭為E或O，產品歸屬為K
| 04-C           DOPT1     IFEQ '1'
| 05-C           DMA01L    IFEQ 'E'
|   C           DMA01L    OREQ 'O'
|   C                     MOVEL'K'       DMA07
     C                     Z-ADD500       DMA21
| 05*C                     ELSE
|   C                     MOVEL'R'       DMA07
| 05-C                     END
| 04-C                     END
|   C   99                GOTO END280
|   C*新增判斷產品歸屬來決定採購單位
| 06-C           DMA07     IFEQ 'R'
|   C                     MOVEL*BLANK    DMA14
|   C                     MOVEL'CASE'    DMA14
| 06*C                     ELSE
|   C                     MOVEL*BLANK    DMA14
|   C                     MOVEL'BOTTLE'  DMA14
| 06-C                     ENDIF
|   C*
|   C                     MOVE *BLANKS   #A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVEL'ID      '#A01
|   C                     MOVELDMA08     #A02
|   C           KEY#A     CHAIN#A0                  40
| 07-C           *IN40     IFEQ '1'
|   C                     SETON                     609699
| 07*C                     ELSE
|   C                     MOVEL#A03      DID
| 07-C                     END
|   C   99                GOTO END280
|   C*
|   C                     MOVE *BLANKS   #A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVEL'BRAND   '#A01
|   C                     MOVELDMA10     #A02
|   C           KEY#A     CHAIN#A0                  40
| 08-C           *IN40     IFEQ '1'
|   C                     SETON                     609699
| 08*C                     ELSE
|   C                     MOVEL#A03      DBRAND
|   C***                  MOVE WMA10     DMA10
| 08-C                     END
|   C   99                GOTO END280
|   C*
| 01-C                     END
|    C*
| 09-C           DMA03     IFEQ *BLANKS
|   C                     CALL 'P65'
|   C                     PARM DMA02     P6501I 80
|   C                     PARM 17        P6502I  30
|   C           DMA03     PARM           P6501O 80
|   C                     PARM           P6502O 80
| 09-C                     END
|    C*
| 10-C           DMA06     IFEQ *BLANKS
|   C                     MOVELDMA04     DMA06
| 10-C                     END
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'COMPANY '#A01
|    C                     MOVELDMA07     #A02
|    C           KEY#A     CHAIN#A0                  40
| 11-C           *IN40     IFEQ '1'
|   C                     SETON                     619699
| 11*C                     ELSE
|   C                     MOVEL#A03      DCMP
| 11-C                     END
|    C   99                GOTO END280
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'GROUP   '#A01
|    C                     MOVELDMA09     #A02
|    C           KEY#A     CHAIN#A0                  40
| 12-C           *IN40     IFEQ '1'
|   C                     SETON                     629699
| 12*C                     ELSE
|   C                     MOVEL#A03      DGROUP
| 12-C                     END
|    C   99                GOTO END280
|    C*
| 13-C           DMA07     IFEQ 'R'
|   C           DMA11     ANDEQ*BLANKS
|   C                     SETON                     689899
| 13-C                     END
|    C   99                GOTO END280
|    C*
| 14-C           DMA13     IFEQ *BLANKS
|   C                     SETON                     639899
| 14-C                     END
|    C   99                GOTO END280
|    C*
|    C           DMA12     CHAINMB0                  40
| 15-C           *IN40     IFEQ '1'
|   C                     SETON                     649699
|   C                     MOVE *BLANKS   DMB03
| 15*C                     ELSE
|   C                     MOVELMB03      DMB03
| 15-C                     END
|    C   99                GOTO END280
|    C*
| 16-C           DMA14     IFEQ *BLANKS
|   C                     SETON                     659899
| 16-C                     END
|    C   99                GOTO END280
|    C*
|    C           DMA19     CHAINMC0                  40
| 17-C           *IN40     IFEQ '1'
|   C                     SETON                     669699
|   C                     MOVE *BLANKS   DMC02
| 17*C                     ELSE
|   C                     MOVELMC02      DMC02
| 17-C                     END
|    C   99                GOTO END280
|    C*
| 18-C           DMA16     IFEQ 0
|   C                     SETON                     679899
| 18-C                     END
|    C   99                GOTO END280
|    C*
|    C                     SETOF                     439499
| 19-C           DMA01L    IFNE 'O'
|   C           DMA21     ANDEQ0
|   C                     SETON                     439499
| 19-C                     END
|    C   99                GOTO END280
|    C*
|    C                     SETOF                     429499
      *判斷產品歸屬為K或R
| 20-C           DMA01L    IFNE 'O'
| 20-C           DMA01L    ANDNE'E'
|   C           DMA35     ANDEQ0
|   C                     SETON                     429499
| 20-C                     END
| 21-C           DMA01L    IFNE 'O'
| 20-C           DMA01L    ANDNE'E'
|   C           DMA36     ANDEQ0
|   C                     SETON                     429499
| 21-C                     END
| 22-C           DMA01L    IFNE 'O'
| 20-C           DMA01L    ANDNE'E'
|   C           DMA47     ANDEQ0
|   C                     SETON                     429499
| 22-C                     END
|    C   99                GOTO END280
|    C*
| 23-C           DMA16     IFNE 1
|   C           DMA13     ANDEQDMA14
|   C                     SETON                     636595
|   C                     SETON                     99
| 23-C                     END
|    C   99                GOTO END280
|    C*
|    C*組拆碼為Ｙ，禮盒碼或ON-PACK CODE要等於Ｙ
|    C*
| 24-C           DMA54     IFEQ 'Y'
| 25-C           DMX54     IFEQ ' '
|   C           DMX55     ANDEQ' '
|   C                     SETON                     699399
| 25-C                     END
| 24-C                     END
|    C   99                GOTO END280
|    C*
|    C           DMA15     MULT DMA16     DMA15C
|    C*
| 26-C           DOPT1     IFEQ '1'
| 27-C           DMA07     IFEQ 'R'
|   C                     MOVEL'Y'       DMA57
| 27*C                     ELSE
|   C                     MOVEL*BLANK    DMA57
| 27-C                     END
| 26-C                     END
|    C*
21===CSR         END280    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
22===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
|    C********************
|    C*  FOR  SCR002     *
|    C********************
| 01-C           APPSCR    IFEQ 'SCR002'
|   C**
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE54
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS012'
|   C                     PARM 'COMPANY 'PARMI1
|   C           DMA07     PARM DMA07     PARMO1
|   C                     GOTO ENDF4
| 02-C                     END
|   C*START新增時
| 03-C           DOPT1     IFEQ '1'
|   C*
| 04-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE2
|   C           D#COL     ANDLE13
|   C                     CALL 'WDS012'
|   C                     PARM 'ID      'PARMI1
|   C           DMA08     PARM DMA08     PARMO1
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE2
|   C           D#COL     ANDLE13
|   C                     CALL 'WDS012'
|   C                     PARM 'BRAND   'PARMI1
|   C           DMA10     PARM DMA10     PARMO1
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
|   C*END新增時
| 03-C                     END
|   C*
| 06-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE54
|   C           D#COL     ANDLE55
|   C                     CALL 'WDS012'
|   C                     PARM 'GROUP   'PARMI1
|   C           DMA09     PARM DMA09     PARMO1
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE45
|   C                     CALL 'WDS002'
|   C           DMA12     PARM DMA12     PARMO1
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 08-C           D#ROW     IFEQ 13
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS005'
|   C           DMA19     PARM DMA19     PARMO1
|   C                     GOTO ENDF4
| 08-C                     END
|   C** SCR002
| 01-C                     END
|    C*
22===C           ENDF4     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
23===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
24===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     2899
|    C*
24===C                     ENDSR'*DETC'
      *==============================================================*
      *          RTN353....MOVE SCREEN DATA TO MTMHPF
      *==============================================================*
25===CSR         RTN353    BEGSR
|    C*
|    C                     MOVE DMA01     MA01
|    C                     MOVE DMA02     MA02
|    C                     MOVE DMA03     MA03
|    C                     MOVE DMA04     MA04
|    C                     MOVE DMA05     MA05
|    C                     MOVE DMA06     MA06
|    C                     MOVE DMA07     MA07
|    C                     MOVE DMA08     MA08
|    C                     MOVE DMA09     MA09
|    C                     MOVE DMA10     MA10
|    C                     MOVE DMA11     MA11
|    C                     MOVE DMA12     MA12
|    C                     MOVE DMA13     MA13
|    C                     MOVEL'BOTTLE'  MA14
|    C                     Z-ADDDMA15     MA15
|    C                     Z-ADD1         MA16
|    C                     MOVE DMA17     MA17
|    C                     Z-ADDDMA18     MA18
|    C                     MOVE DMA19     MA19
|    C                     MOVE DMA20     MA20
|    C                     Z-ADDDMA21     MA21
|    C*                    Z-ADDDMA22     MA22
|    C                     MOVE DMA23     MA23
|    C                     MOVE DMA24     MA24
|    C                     Z-ADDDMA25     MA25
|    C*M001D               Z-ADDDMA53     MA53
|    C                     MOVE DMA54     MA54
|    C                     MOVE DMA55     MA55
|    C                     MOVE DMA56     MA56
|    C                     MOVE DMA57     MA57
|    C                     MOVE DMA58     MA58
|    C                     MOVE DMA59     MA59
|    C                     Z-ADDDMA35     MA35
|    C                     Z-ADDDMA36     MA36
|    C                     Z-ADDDMA47     MA47
|    C**
| 01-C           DOPT1     IFEQ '1'
|   C                     Z-ADD0         MA25
|   C                     Z-ADD0         MA31
|   C                     Z-ADD0         MA32
|   C                     Z-ADD0         MA33
|   C                     Z-ADD0         MA34
|   C*M003D               Z-ADD0         MA35
|   C*M003D               Z-ADD0         MA36
|   C                     Z-ADD0         MA37
|   C                     Z-ADD0         MA38
|   C                     Z-ADD0         MA39
|   C                     Z-ADD0         MA40
|   C                     Z-ADD0         MA41
|   C                     Z-ADD0         MA42
|   C                     Z-ADD0         MA43
|   C                     Z-ADD0         MA44
|   C                     Z-ADD0         MA45
|   C                     Z-ADD0         MA46
|   C*M003D               Z-ADD0         MA47
|   C                     Z-ADD0         MA48
|   C                     Z-ADD0         MA49
| 01-C                     END
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C*M001M               PARM DMA53     S001I2  80
|    C                     PARM DMA53     S001I2  60
|     *CVR5008 sev.50 The converter tool cannot handle op-code PARM
|     *   involving not-expanded and expanded date fields requiring
|     *   add/remove century. Code must be adjusted manually
|    C*M001M     MA53      PARM           S001O1  80
|    C           WMA53     PARM           S001O1  60
|    C                     MOVE WMA53     HB2@F6  6
|    C                     EXSR HB@68L
|    C                     MOVE HB2@T8    MA53    80
|    C**
|    C*M001D               CALL 'RES001'
|    C*M001D               PARM 'MDY'     S001I1  3
|    C*M001D               PARM $EGMDY    S001I2  80
|     *CVR5008 sev.50 The converter tool cannot handle op-code PARM
|     *   involving not-expanded and expanded date fields requiring
|     *   add/remove century. Code must be adjusted manually
|    C*M001D     MAXX      PARM           S001O1  80
|    C**
|    C                     Z-ADD$EG8      MAXX
|    C                     TIME           MAYY
|    C                     MOVE $USER     MAZZ
|    C*
25===CSR                   ENDSR
     C* FOR NEW INPUT
      *===============================================================*
      *          RTNF42....F4 HELP
      *===============================================================*
26===C           RTNF42    BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
|    C********************
|    C*  FOR  SCR002     *
|    C********************
| 01-C           APPSCR    IFEQ 'SCR002'
|   C**
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE17
|   C           D#COL     ANDLE18
|   C                     CALL 'WDS038'
|   C           DBE02     PARM DBE02     PARMI1
|   C                     GOTO ENDF42
| 02-C                     END
|   C*M005D START新增時
|   C*M005D     DOPT1     IFEQ '1'
|   C*原品牌
| 03-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE17
|   C           D#COL     ANDLE18
|   C                     CALL 'WDS012'
|   C                     PARM 'BRAND   'PARMI1
|   C           DBE03     PARM DBE03     PARMO1
|   C                     GOTO ENDF42
| 03-C                     END
|   C*
|   C*新產品種類代碼
| 04-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE17
|   C           D#COL     ANDLE18
|   C                     CALL 'WDS039'
|   C           DBE04     PARM DBE04     PARMI1
|   C                     GOTO ENDF42
| 04-C                     END
|   C*附屬品牌
| 05-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE17
|   C           D#COL     ANDLE18
|   C                     CALL 'WDS012'
|   C                     PARM 'BRAND   'PARMI1
|   C           DBE05     PARM DBE05     PARMO1
|   C                     GOTO ENDF42
| 05-C                     END
|   C*END新增時
|   C*M005D               END
|   C*
|   C** SCR002
| 01-C                     END
|    C*
26===C           ENDF42    ENDSR
     C*==============================================================*
      *          RTN552....MOVE DATA TO SCREEN
      *==============================================================*
27===CSR         RTN552    BEGSR
|    C*
| 01-C           *IN48     IFEQ '1'
|   C                     MOVEL*BLANK    DBE02
|   C                     MOVELDMA10     DBE03
|   C                     MOVEL*BLANK    DBE04
|   C                     MOVELDMA10     DBE05
|   C                     MOVEL*BLANK    DBE06
| 01*C                     ELSE
|   C                     MOVELBE02      DBE02
|   C                     MOVELBE03      DBE03
|   C                     MOVELBE04      DBE04
|   C                     MOVELBE05      DBE05
|   C                     MOVELBE06      DBE06
| 01-C                     END
|    C           DBE02     CHAINBN0                  48
| 02-C           *IN48     IFEQ '0'
|   C                     MOVELBN02      DBN02
| 02*C                     ELSE
|   C                     MOVE *BLANK    DBN02
| 02-C                     END
|    C                     MOVEL'BRAND   '#A012
|    C                     MOVELDBE03     #A022
|    C           KEY#A2    CHAIN#A0                  48
| 03-C           *IN48     IFEQ '1'
|   C                     MOVE *BLANKS   DB1
| 03*C                     ELSE
|   C                     MOVEL#A03      DB1
| 03-C                     END
|    C                     MOVEL'BRAND   '#A012
|    C                     MOVELDBE05     #A022
|    C           KEY#A2    CHAIN#A0                  47
| 04-C           *IN47     IFEQ '1'
|   C                     MOVE *BLANKS   DB2
| 04*C                     ELSE
|   C                     MOVEL#A03      DB2
| 04-C                     END
|    C                     MOVELDBE04     D#702  10
|    C           D#702     CHAIN#70                  46
| 05-C           *IN46     IFEQ '1'
|   C                     MOVE *BLANKS   D#703
| 05*C                     ELSE
|   C                     MOVEL#703      D#703
| 05-C                     END
|    C                     MOVELDBE03     D1
|    C                     MOVELDBE04     D2
|    C                     MOVELDMA10R    DSIZE
27===CSR                   ENDSR
      *==============================================================*
     C*          RTN553....MOVE SCREEN DATA TO FILE
      *==============================================================*
28===CSR         RTN553    BEGSR
|    C*
|    C                     MOVELDMA01     BE01
|    C                     MOVELDBE02     BE02
|    C                     MOVELDBE03     BE03
|    C                     MOVELDBE04     BE04
|    C                     MOVELDBE05     BE05
|    C                     MOVELDBE06     BE06
|    C                     MOVELMAXX      BEXX
|    C                     MOVELMAYY      BEYY
|    C                     MOVELMAZZ      BEZZ
28===CSR                   ENDSR
     C*==============================================================*
      *          RTN554....FOR COPY
      *==============================================================*
29===CSR         RTN554    BEGSR
|    C*
|    C                     MOVELBE02      DBE02
|    C                     MOVELDMA10     DBE03
|    C                     MOVELBE04      DBE04
|    C                     MOVELDMA10     DBE05
|    C                     MOVELBE06      DBE06
|    C           BE02      CHAINBN0                  48
| 01-C           *IN48     IFEQ '0'
|   C                     MOVELBN02      DBN02
| 01*C                     ELSE
|   C                     MOVE *BLANK    DBN02
| 01-C                     END
|    C                     MOVEL'BRAND   '#A012
|    C                     MOVELDBE03     #A022
|    C           KEY#A2    CHAIN#A0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DB1
| 02*C                     ELSE
|   C                     MOVEL#A03      DB1
| 02-C                     END
|    C                     MOVEL'BRAND   '#A012
|    C                     MOVELDBE05     #A022
|    C           KEY#A2    CHAIN#A0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DB2
| 03*C                     ELSE
|   C                     MOVEL#A03      DB2
| 03-C                     END
|    C                     MOVELDBE04     D#702  10
|    C           D#702     CHAIN#70                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   D#703
| 04*C                     ELSE
|   C                     MOVEL#703      D#703
| 04-C                     END
29===CSR                   ENDSR
     C*==============================================================*
     C*          RTN580....CHECK 'SC02' SCREEN
     C*==============================================================*
30===CSR         RTN580    BEGSR
|    C*
|    C           DBE02     CHAINBN0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     SETON                     799299
| 01*C                     ELSE
|   C                     MOVELBN02      DBN02
| 01-C                     END
|    C   99                GOTO END580
|    C*
|    C                     MOVE *BLANKS   #A012
|    C                     MOVE *BLANKS   #A022
|    C                     MOVEL'BRAND   '#A012
|    C                     MOVELDBE03     #A022
|    C           KEY#A2    CHAIN#A0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     SETON                     789299
| 02*C                     ELSE
|   C                     MOVEL#A03      DB1
| 02-C                     END
|    C   99                GOTO END580
|    C*
|    C                     MOVELDBE04     D#702  10
|    C           D#702     CHAIN#70                  40
| 03-C           *IN40     IFEQ '1'
|   C                     SETON                     779299
| 03*C                     ELSE
|   C                     MOVEL#703      D#703
| 03-C                     END
|    C   99                GOTO END580
|    C*
|    C                     MOVE *BLANKS   #A012
|    C                     MOVE *BLANKS   #A022
|    C                     MOVEL'BRAND   '#A012
|    C                     MOVELDBE05     #A022
|    C           KEY#A2    CHAIN#A0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     SETON                     769299
| 04*C                     ELSE
|   C                     MOVEL#A03      DB2
| 04-C                     END
|    C   99                GOTO END580
|    C*
|    C                     MOVELDBE03     D1
|    C                     MOVELDBE04     D2
|    C                     MOVELDMA10R    DSIZE
30===CSR         END580    ENDSR
     C*==============================================================*
      ***************************
      ****  CONVERSION START  ***
      ***************************
     C/COPY HBP2CVTR
      ***************************
      *****  CONVERSION END  ****
      ***************************
**
新增修改新增刪除查詢
