      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTA0043                                       *
      * AUTHER       : 910074 JANET                                  *
      * CREATE DATE  : 86/10/15                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收系統                                     *
     A*===============================================================
     A* CODE  |  AUTHOR.  |   DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001  | MICHELLE  | 98.11.04| Y2K MODIFY
     A*---------------------------------------------------------------
     A* M002  | MICHELLE   99.01.29| CALL P20之前先把日期轉成中國年
     A*---------------------------------------------------------------
      ****************************************************************
     FMTMEPF  UF  E           K        DISK
     FREW400  UF  E           K        DISK                      A
     I           UDS
     I                                      119 1240$EGMDY
     I                                      997 9990DAYNO
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C*          *ENTRY    PLIST
     C*                    PARM DAYNO     DAYNO   30
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     Z-ADD0         YDATE   60
     C                     Z-ADD0         DAY     90
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM $EGMDY    S001I2  60
|    C           YDATE     PARM           S001O1  60
     C*
     C                     EXSR RTN100
     C                     EXSR RTN200
     C                     RETRN
     C*
     C           RTN100    BEGSR
     C           *LOVAL    SETLLME0
     C                     READ ME0                      51
     C           *IN51     DOWEQ'0'
M002AC           ME18      SUB  19110000  WME18   60       轉成中國年
M001AC                     MOVE YDATE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    W8      80
M002AC           W8        SUB  19110000  WYDATE  60       轉成中國年
     C                     CALL 'P20'
B2MODC                     PARM WME18     P2001I  60
     C*M002M               PARM YDATE     P2002I  60       *確認日
M002MC                     PARM WYDATE    P2002I  60       *確認日
     C           DAY       PARM           P2011O  90
     C           DAY       IFLT DAYNO
     C                     MOVEL'A'       REMARK  1
     C                     ELSE
     C                     MOVEL'I'       REMARK
     C                     END
     C           ME01      CHAINWF400                41
     C           *IN41     IFEQ '1'
     C                     MOVELME01      WF4000
     C                     MOVELREMARK    WF4001
     C                     WRITEWF400
     C                     END
     C           *IN41     IFEQ '0'
     C           WF4001    IFEQ 'A'
     C                     ELSE
     C                     MOVE REMARK    WF4001
     C                     UPDATWF400
     C                     END
     C                     END
     C  N51                READ ME0                      51
     C                     END
     C                     ENDSR
     C*
     C* UPDATE MTMEPF WITH STATUS
     C*
     C           RTN200    BEGSR
     C           *LOVAL    SETLLWF400
     C                     READ WF400                    51
     C           *IN51     DOWEQ'0'
     C           WF4000    SETLLME0
     C           WF4000    READEME0                      61
     C           *IN61     DOWEQ'0'
     C                     MOVE WF4001    ME20
     C                     UPDATME0
     C  N61      WF4000    READEME0                      61
     C                     END
     C  N51                READ WF400                    51
     C                     END
     C                     ENDSR
M001AC/COPY HBP2CVTR
