     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : MTA005                                     *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    DATE WRITTEN : 81/01/16                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :主檔資料維護子系統                        *
     A*    PROCEDURE    :員工資料建立 (A/U/D/I)                    *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.05 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     FMTMCLF  IF  E           K        DISK
     F            MC0                               KRENAMEMC0L
     FMTMCPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FPA#APF  IF  E           K        DISK
     FMTA005D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     F                                              KINFDS DSPFDS
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        5  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I**                                    140 140 $RMK02
 @   I**                                    141 141 $RMK03
     I**                                    162 1620$EVR
     I**                                    125 1270$CPY
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I                                      506 506 $PURID
     I                                      507 508 $TRNID
     I                                      509 513 $APAUT
     I                                      514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C                     Z-ADD0         HRRN    40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C           *LIKE     DEFN MC01      OBGN1            *START KEY
     C*  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN MC01      BMC01            *SUBFIL BUTTOM
     C                     MOVE *BLANK    WBOTOM  1
     C           *LIKE     DEFN RRN       WRRN
     C           *LIKE     DEFN RRN       WPRCD
     C           *LIKE     DEFN RRN       DSPRCD
M001AC                     Z-ADD0         WMC08   60
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
     C*
     C                     MOVE *ALL'0'   *IN,60
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN04     CASEQ'1'       RTNF4
    C           *IN06     CASEQ'1'       RTN120
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN120....F6(ADD)
      *==============================================================*
02===C           RTN120    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9099
| 01-C                     END
|    C  N99                EXSR RTN200
| 02-C           DRRN      IFGT 0
|   C           DRRN      SUB  1         HRRN
| 02-C                     END
|    C                     EXSR RTN191
|    C                     EXSR RTN192
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C                     Z-ADD0         HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN       HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR                  4040*NF
| 01-C           *IN40     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN       DRRN
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           UPD       TAG
|   C*
|   C                     UPDATSFLSR
|   C                     READCSFLSR                    40*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     98
| 05-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
| 01-C                     END
|    C   99                GOTO END180
|    C*
05===C           END180    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         WRRN
|    C                     Z-ADD12        WPRCD
|    C                     Z-ADD0         DSPRCD
|    C           HRRN      DIV  WPRCD     DSPRCD
|    C                     MULT WPRCD     DSPRCD
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR
|    C                     SETOF                     52
|    C           DBGN1     SETLLMC0L
|    C                     MOVE DBGN1     BMC01
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     97    *LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
| 02-C           BMC01     IFNE DBGN1
|   C           BMC01     SETGTMC0L
| 02-C                     END
|   C                     EXSR RTN193
|   C                     MOVE MC01      BMC01
|   C           *LOVAL    SETLLMC0L
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANK    DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN      RRN
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN       DOWLTDSPRCD
|   C                     READ MC0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*
|   C                     MOVE *BLANKS   #A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVEL'CENTER  '#A01
|   C                     MOVELMC03      #A02
|   C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DCENTR
| 03*C                     ELSE
|   C                     MOVEL#A03      DCENTR
| 03-C                     END
|   C*
M001AC                     Z-ADDMC06      WMC06   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WMC06     S001I2  60
B2MODC           DMC06     PARM           S001O1  60
|    C*
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN       DRRN
|    C                     Z-ADDRRN       WRRN
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN       IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     96    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C           *LOVAL    SETLLMC0
|    C                     MOVE 'SCR001'  APPSCR
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
11===C           RTN210    BEGSR
|    C*
|    C                     SETON                     3031  *ADD MSG
|    C                     EXSR RTN251                     *CLR FIELD
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C                     EXSR RTN253
|   C                     WRITEMC0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
12===C           RTN220    BEGSR
|    C*
|    C           MC01      CHAINMC0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     30
|   C                     SETON                     31    *CAN INPUT
|   C                     EXFMTDSPD2
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C***        DMC01     CHAINMC0                  41
|   C                     EXSR RTN253
|   C                     UPDATMC0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
13===C           RTN230    BEGSR
|    C*
|    C           MC01      CHAINMC0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     3031  *NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 03-C           DLTFLG    IFEQ 'Y'
|   C***        D#B01     CHAIN#B0                  41
|   C                     DELETMC0
| 03-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
14===C           RTN240    BEGSR
|    C*
|    C           MC01      CHAINMC0L                 40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     3031  *NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     Z-ADDRRN       DRRN
| 02-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
15===CSR         RTN251    BEGSR
|    C*
|    C                     MOVE *BLANK    DMC01
|    C                     MOVE *BLANK    DMC02
|    C                     MOVE *BLANK    DMC03
|    C                     MOVE *BLANK    DMC04
|    C                     Z-ADD0         DMC05
|    C                     Z-ADD0         DMC06
|    C                     MOVE *BLANK    DMC07
|    C                     Z-ADD0         DMC08
|    C                     MOVE *BLANK    DMC09
|    C                     MOVE *BLANK    DMC10
|    C                     MOVE *BLANK    DMC11
|    C                     MOVE *BLANK    DMC12
|    C                     MOVE *BLANK    DMC13
B2000C                     Z-ADD$EGMDY    DMC14
|    C                     MOVE *BLANK    DMC15
|    C                     MOVE *BLANK    DMC16
|    C                     MOVE *BLANK    DMC17
|    C                     MOVE *BLANK    DMC18
|    C                     MOVE *BLANK    DMC19
|    C                     MOVE *BLANK    DMC20
|    C                     MOVE *BLANK    DMC21
|    C                     MOVE *BLANK    DMC22
|    C                     MOVE *BLANK    DMC23
|    C                     MOVE *BLANK    DMC24
|    C                     MOVE *BLANK    DMC25
|    C                     Z-ADD0         DMC26
B2000C                     Z-ADD$EGMDY    DMCXX
|    C                     MOVE $USER     DMCZZ
|    C                     MOVE *BLANK    DCENTR
|    C                     MOVE *BLANK    DSTOR
|    C*
15===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
16===CSR         RTN252    BEGSR
|    C*
|    C                     MOVE MC01      DMC01
|    C                     MOVE MC02      DMC02
|    C                     MOVE MC03      DMC03
|    C                     MOVE MC04      DMC04
|    C                     MOVE MC07      DMC07
B2TRCC                     Z-ADDMC08      DMC08
|    C                     MOVE MC09      DMC09
|    C                     MOVE MC10      DMC10
|    C                     MOVE MC11      DMC11
|    C                     MOVE MC12      DMC12
|    C                     MOVE MC13      DMC13
|    C                     MOVE MC15      DMC15
|    C                     MOVE MC16      DMC16
|    C                     MOVE MC17      DMC17
|    C                     MOVE MC18      DMC18
|    C                     MOVE MC19      DMC19
|    C                     MOVE MC20      DMC20
|    C                     MOVE MC21      DMC21
|    C                     MOVE MC22      DMC22
|    C                     MOVE MC23      DMC23
|    C                     MOVE MC24      DMC24
|    C                     MOVE MC25      DMC25
|    C                     Z-ADDMC26      DMC26
|    C                     MOVE MCZZ      DMCZZ
|    C**
M001AC                     Z-ADDMC05      WMC05   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WMC05     S001I2  60
B2MODC           DMC05     PARM           S001O1  60
|    C**
M001AC                     Z-ADDMC06      WMC06   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WMC06     S001I2  60
B2MODC           DMC06     PARM           S001O1  60
|    C**
M001AC                     Z-ADDMC08      WMC08   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WMC08     S001I2  60
B2MODC           DMC08     PARM           S001O1  60
|    C**
M001AC                     Z-ADDMC14      WMC14   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WMC14     S001I2  60
B2MODC           DMC14     PARM           S001O1  60
|    C**
M001AC                     Z-ADDMCXX      WMCXX   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WMCXX     S001I2  60
B2MODC           DMCXX     PARM           S001O1  60
|    C**
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'CENTER  '#A01
|    C                     MOVELDMC03     #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DCENTR
| 01*C                     ELSE
|   C                     MOVEL#A03      DCENTR
| 01-C                     END
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'STORAGE '#A01
|    C                     MOVELDMC15     #A02
|    C           KEY#A     CHAIN#A0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   DSTOR
| 02*C                     ELSE
|   C                     MOVEL#A03      DSTOR
| 02-C                     END
|    C*
16===CSR                   ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
17===CSR         RTN253    BEGSR
|    C*
|    C                     MOVE DMC01     MC01
|    C                     MOVE DMC02     MC02
|    C                     MOVE DMC03     MC03
|    C                     MOVE DMC04     MC04
|    C                     MOVE DMC07     MC07
|    C                     MOVE DMC09     MC09
|    C                     MOVE DMC10     MC10
|    C                     MOVE DMC11     MC11
|    C                     MOVE DMC12     MC12
|    C                     MOVE DMC13     MC13
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*M001D               MOVE DMC14     MC14
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     MOVE DMC15     MC15
|    C                     MOVE DMC16     MC16
|    C                     MOVE DMC17     MC17
|    C                     MOVE DMC18     MC18
|    C                     MOVE DMC19     MC19
|    C                     MOVE DMC20     MC20
|    C                     MOVE DMC21     MC21
|    C                     MOVE DMC22     MC22
|    C                     MOVE DMC23     MC23
|    C                     MOVE DMC24     MC24
|    C                     MOVE DMC25     MC25
|    C                     Z-ADDDMC26     MC26
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DMC05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WMC05     PARM           S001O1  60
M001AC                     MOVE WMC05     HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    MC05
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DMC06     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WMC06     PARM           S001O1  60
M001AC                     MOVE WMC06     HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    MC06
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DMC08     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WMC08     PARM           S001O1  60
M001AC                     MOVE WMC08     HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    MC08
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DMC14     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WMC14     PARM           S001O1  60
M001AC                     MOVE WMC14     HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    MC14
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DMCXX     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WMCXX     PARM           S001O1  60
M001AC                     MOVE WMCXX     HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    MCXX
|    C**
B2000C                     TIME           MCYY
|    C                     MOVE $USER     MCZZ
|    C*
17===CSR                   ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' SCREEN
     C*==============================================================*
18===CSR         RTN280    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '1'
| 02-C           DMC01     IFEQ *BLANK
|   C                     SETON                     609899
| 02*C                     ELSE
|   C           DMC01     SETLLMC0                      41
| 03-C           *IN41     IFEQ '1'
|   C                     SETON                     609799
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END280
|    C*
| 04-C           DMC02     IFEQ *BLANKS
|   C                     SETON                     629899
| 04-C                     END
|    C   99                GOTO END280
|    C*
|    C                     MOVE *BLANKS   #A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL'CENTER  '#A01
|    C                     MOVELDMC03     #A02
|    C           KEY#A     CHAIN#A0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     SETON                     629699
| 05*C                     ELSE
|   C                     MOVEL#A03      DCENTR
| 05-C                     END
|    C   99                GOTO END280
|    C*
B2CHKC           DMC05     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     639699
| 06*C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DMC05     P0901I  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     639599
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END280
|    C*
B2CHKC           DMC06     IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     CALL 'P09'
B2???C                     PARM DMC06     P0901I  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0901O  1
| 09-C           P0901O    IFEQ 'N'
|   C                     SETON                     649599
| 09-C                     END
| 08-C                     END
|    C   99                GOTO END280
|    C*
|    C                     CALL 'P02'
|    C                     PARM DMC07     P0201I 10
|    C                     PARM           P0201O  1
|    C           DMC23     PARM           P0202O  1
| 10-C           P0201O    IFEQ 'N'
|   C                     SETON                     659699
| 10-C                     END
|    C   99                GOTO END280
|    C*
B2CHKC           DMC08     IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     CALL 'P09'
B2???C                     PARM DMC08     P0901I  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     669599
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END280
|    C*
| 13-C           DMC15     IFEQ *BLANKS
|   C                     MOVE *BLANKS   DSTOR
| 13*C                     ELSE
| 14-C           DMC15     IFEQ '*ALL '
|   C                     MOVE *BLANKS   DSTOR
|   C                     MOVEL'全部'  DSTOR
| 14*C                     ELSE
|   C                     MOVE *BLANKS   #A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVELDMC15     #A02
|   C           KEY#A     CHAIN#A0                  40
| 15-C           *IN40     IFEQ '1'
|   C                     SETON                     679699
| 15*C                     ELSE
|   C                     MOVEL#A03      DSTOR
| 15-C                     END
| 14-C                     END
| 13-C                     END
     C*
     C           DOPT1     IFEQ '1'
     C           DMC11     ANDEQ*BLANK
     C                     MOVE DMC10     DMC11
     C                     END
|    C*
18===CSR         END280    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
19===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C**
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE9
|   C           D#COL     ANDLE14
|   C                     CALL 'WDS005'
|   C           DBGN1     PARM DBGN1     PARMI1
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
| 03-C           APPSCR    IFEQ 'SCR002'
|   C**
| 04-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE14
|   C           D#COL     ANDLE17
|   C                     CALL 'WDS012'
|   C                     PARM 'CENTER  'PARMI1
|   C           DMC03     PARM DMC03     PARMO1
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE14
|   C           D#COL     ANDLE18
|   C                     CALL 'WDS012'
|   C                     PARM 'STORAGE 'PARMI1
|   C           DMC15     PARM DMC15     PARMO1
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 02-C           D#ROW     IFEQ 13
|   C           D#COL     ANDGE63
|   C           D#COL     ANDLE64
|   C                     CALL 'WDS011'
|   C           DMC26     PARM DMC26     S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C                     END
|    C*
19===C           ENDF4     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
20===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
21===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     2899
|    C*
21===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
**
新增修改      刪除查詢
