     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : MTA004                                     *
     A*    AUTHOR       :                                            *
     A*    DATE WRITTEN : 81/01/31                                   *
     A*    UPDATE DATE  : 81/01/31 BY STEPHANIE                      *
     A*    UPDATE DATE  : 81/03/10 BY PHILIP                         *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :基本資料建檔子系統                        *
     A*    REMARK       :客戶分店基本資料維護 (A/U/D/I)            *
     A*===============================================================
     A* CODE  |  AUTHOR.  |   DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001  | MICHELLE  | 98.11.04| Y2K MODIFY
     A*---------------------------------------------------------------
     A****************************************************************
     FMTMEPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMELF  IF  E           K        DISK
     F            ME0                               KRENAMEME0L
     FMTMCPF  IF  E           K        DISK
     FMTMDLF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
     FPA#EPF  IF  E           K        DISK
     FMTA0041DCF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     F                                              KINFDS DSPFDS
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        5  1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
M001AI                                      201 2080$EG8
 @   I**                                    140 140 $RMK02
 @   I**                                    141 141 $RMK03
     I**                                    162 1620$EVR
     I**                                    125 1270$CPY
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I                                      506 506 $PURID
     I                                      507 508 $TRNID
     I                                      509 513 $APAUT
     I                                      514 521 $#101
     I            DS
     I                                        1   2 OEOF
     I                                        1   1 OE
     I                                        2   2 OF
     I*
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I*
     I            DS
     I                                        1  48 SME03
     I                                        1   1 SME030
     I                                        1  18 SME031
     I*
     I            DS
     I                                        1  18 SME04
     I                                       18  18 SME041
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN    40
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE ''      OEOF
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BUTTOM
     C                     MOVE *BLANK    WBOTOM  1
     C           *LIKE     DEFN RRN       WRRN
     C           *LIKE     DEFN RRN       WPRCD
     C           *LIKE     DEFN RRN       DSPRCD
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEY#ME    KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C*
     C           KEY#M2    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
      *
     C           KEY#E0    KLIST
     C                     KFLD           #E01
     C                     KFLD           #E02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     MOVE *ALL'0'   *IN,60
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C*          *IN06     CASEQ'1'       RTN120
    C           *IN25     CASEQ'1'       RTN192
    C           *IN04     CASEQ'1'       RTNF4
    C           *IN08     CASEQ'1'       RTNF8
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $ADD      WA01,3
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
|    C                     Z-ADD0         DATE    60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM $EGMDY    S001I2  60
|    C           DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN120....F6(ADD)
      *==============================================================*
02===C           RTN120    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9099
| 01-C                     END
|    C  N99                EXSR RTN200
| 02-C           DRRN      IFGT 0
|   C           DRRN      SUB  1         HRRN
| 02-C                     END
|    C                     EXSR RTN191
|    C                     EXSR RTN192
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C                     Z-ADD0         HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN       HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR                  4040*NF
|    C*
| 01-C           *IN40     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN       DRRN
|   C                     EXSR RTN200                     *PROC SCRN2
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           UPD       TAG
|   C*
|   C                     UPDATSFLSR
|   C                     READCSFLSR                    40*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     98
| 05-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
|   C                     Z-ADDRRN       DRRN
| 01-C                     END
|    C   99                GOTO END180
|    C*
05===C           END180    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         WRRN
|    C                     Z-ADD10        WPRCD
|    C*                    Z-ADD0         DSPRCD
|    C           HRRN      DIV  WPRCD     DSPRCD
|    C                     MULT WPRCD     DSPRCD
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR
|    C                     SETOF                     52
|    C           KEY#M2    SETLLME0L
|    C                     MOVE DBGN1     BBGN1
|    C                     MOVE DBGN2     BBGN2
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     97    *LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
| 02-C*          BBGN1     IFNE DBGN1
|   C*          BBGN2     ORNE DBGN2
|   C*          KEY#ME    SETGTME0L
| 02-C*                    END
|   C                     EXSR RTN193
|   C*                    MOVE ME01      BBGN1
|   C*                    MOVE ME02      BBGN1
|   C*          *LOVAL    SETLLME0L
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANK    DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN      RRN
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN       DOWLTDSPRCD
|   C                     READ ME0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C           ME15      CHAINMC0                  41
|   C   41                MOVE *BLANK    MC02
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN       DRRN
|    C                     Z-ADDRRN       WRRN
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN       IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     96    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC11
|    C                     EXFMTSFLCR
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'3'       RTN225           *CPY
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C           *LOVAL    SETLLME0
|    C                     MOVE 'SCR001'  APPSCR
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
11===C           RTN210    BEGSR
|    C*
|    C                     EXSR RTN251                     *CLR FIELD
|    C                     SETON                     3031
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPC2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C**********************
|   C*  F4 PROMPT PROCESS *
|   C**********************
| 03-C           *IN04     IFEQ '1'
|   C                     EXSR RTNF4
|   C                     EXSR RCHAIN                     *CHAIN DATA
|   C                     SETOF                     04
| 03*C                     ELSE
|   C                     EXSR RTN280                     .CHECK      ?
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR RTN253
|   C                     WRITEME0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
12===C           RTN220    BEGSR
|    C*
|    C           KEY#ME    CHAINME0                  40
     C           *LOVAL    SETLLME0
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     30
|   C                     SETON                     31
|   C                     EXFMTDSPC2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
| 03-C           *IN04     IFEQ '1'
|   C**********************
|   C*  F4 PROMPT PROCESS *
|   C**********************
|   C                     EXSR RTNF4
|   C                     EXSR RCHAIN                     *CAHIN DATA
|   C                     SETOF                     04
| 03*C                     ELSE
|   C                     EXSR RTN280                     .CHECK      ?
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           KEY#ME    CHAINME0                  41
|   C                     EXSR RTN253
|   C                     UPDATME0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN225....COPY ADD DATA
      *==============================================================*
12===C           RTN225    BEGSR
|    C*
|    C                     EXSR RTN251                     *CLR FIELD
|    C           KEY#ME    CHAINME0                  40
     C           *LOVAL    SETLLME0
|    C                     EXSR RTN254                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETON                     3031
|   C                     EXFMTDSPC2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
| 03-C           *IN04     IFEQ '1'
|   C**********************
|   C*  F4 PROMPT PROCESS *
|   C**********************
|   C                     EXSR RTNF4
|   C                     EXSR RCHAIN                     *CAHIN DATA
|   C                     SETOF                     04
| 03*C                     ELSE
|   C                     EXSR RTN280                     .CHECK      ?
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR RTN253
|   C                     WRITEME0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
13===C           RTN230    BEGSR
|    C*
|    C           KEY#ME    CHAINME0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
     C           *LOVAL    SETLLME0
|    C                     SETOF                     3031  *NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPC2
|   C                     MOVEA*ALL'0'   *IN,60
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 03-C           DLTFLG    IFEQ 'Y'
|   C           KEY#ME    CHAINME0                  41
|   C                     DELETME0
| 03-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
14===C           RTN240    BEGSR
|    C*
|    C           KEY#ME    CHAINME0L                 40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     3031  *NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPC2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     Z-ADDRRN       DRRN
| 02-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
15===CSR         RTN251    BEGSR
|    C*
|    C                     MOVE *BLANK    SME01
|    C                     MOVE *BLANK    SME02
|    C                     MOVE *BLANK    SME03
|    C                     MOVE *BLANK    SME04
|    C                     MOVE *BLANK    SME05
|    C                     MOVE *BLANK    SME06
|    C                     MOVE *BLANK    SME07
|    C                     MOVE *BLANK    SME08
|    C                     MOVE *BLANK    SME09
|    C                     MOVE *BLANK    SME10
|    C                     MOVE *BLANK    SME11
|    C                     MOVE *BLANK    SME12
|    C                     MOVE *BLANK    SME13
|    C                     MOVE *BLANK    SME14
|    C                     MOVE *BLANK    SME15
|    C                     MOVE *BLANK    SME16
|    C                     MOVE *BLANK    SME17
|    C                     Z-ADD0         DME18
B2000C                     Z-ADDUDATE     DME19
|    C                     MOVE *BLANK    DME04
|    C                     MOVE *BLANK    DME20
|    C                     MOVE *BLANK    #D02
|    C                     MOVE *BLANK    #E03
|    C                     MOVE *BLANK    MC02
|    C*
15===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
16===CSR         RTN252    BEGSR
|    C*
|    C                     MOVE ME01      SME01
|    C                     MOVE ME02      SME02
|    C                     MOVE ME03      SME03
|    C                     MOVE ME04      SME04
|    C                     MOVE ME05      SME05
|    C                     MOVE ME06      SME06
|    C                     MOVE ME07      SME07
|    C                     MOVE ME08      SME08
|    C                     MOVE ME09      SME09
|    C                     MOVE ME10      SME10
|    C                     MOVE ME11      SME11
|    C                     MOVE ME12      SME12
|    C                     MOVE ME13      SME13
|    C                     MOVE ME14      SME14
|    C                     MOVE ME15      SME15
|    C                     MOVE ME16      SME16
|    C                     MOVE ME17      SME17
|    C                     MOVE ME04      DME04
|    C                     MOVE ME20      DME20
|    C*
|    C                     EXSR RCHAIN                     *CAHIN DATA
|    C*
M001AC                     Z-ADDME18      WME18   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM WME18     S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DME18     PARM           S001O1  60
|    C*
M001AC                     Z-ADDME19      WME19   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM WME19     S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DME19     PARM           S001O1  60
|    C*
16===CSR                   ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
17===CSR         RTN253    BEGSR
|    C*
|    C                     MOVE SME01     ME01
|    C                     MOVE SME02     ME02
|    C                     MOVE SME03     ME03
|    C                     MOVE SME04     ME04
|    C                     MOVE SME05     ME05
|    C                     MOVE SME06     ME06
|    C                     MOVE SME07     ME07
|    C                     MOVE SME08     ME08
|    C                     MOVE SME09     ME09
|    C                     MOVE SME10     ME10
|    C                     MOVE SME11     ME11
|    C                     MOVE SME12     ME12
|    C                     MOVE SME13     ME13
|    C                     MOVE SME14     ME14
|    C                     MOVE SME15     ME15
|    C                     MOVE SME16     ME16
|    C                     MOVE SME17     ME17
B2???C*M001D               MOVE DME18     ME18
B2INF *CVR5011 sev.50 Field DME18 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C*
M001AC                     CALL 'RES001'
M001AC                     PARM 'MDY'     S001I1  3
M001AC                     PARM DME18     S001I2  60
B2???C           WME18     PARM           S001O1  60
M001AC                     MOVE WME18     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    ME18    80
     C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DME19     S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2???C           WME19     PARM           S001O1  60
M001AC                     MOVE WME19     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    ME19    80
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C                     MOVE DME20     ME20
|    C*
M001MC                     Z-ADD$EG8      MEXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           MEYY
|    C                     MOVE $USER     MEZZ
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN254....MOVE DATA TO SCREEN
      *==============================================================*
16===CSR         RTN254    BEGSR
|    C*
|    C                     MOVE ME01      SME01
|    C                     MOVE ME02      SME02
|    C                     MOVE ME03      SME03
|    C                     MOVE ME04      SME04
|    C                     MOVE ME05      SME05
|    C                     MOVE ME06      SME06
|    C                     MOVE ME07      SME07
|    C                     MOVE ME08      SME08
|    C                     MOVE ME09      SME09
|    C                     MOVE ME10      SME10
|    C                     MOVE ME11      SME11
|    C                     MOVE ME12      SME12
|    C                     MOVE ME13      SME13
|    C                     MOVE ME14      SME14
|    C                     MOVE ME15      SME15
|    C                     MOVE ME16      SME16
|    C                     MOVE ME17      SME17
|    C                     MOVE ME20      DME20
     C                     Z-ADD0         ME19
     C                     Z-ADD0         ME18
     C                     Z-ADD$EGMDY    DME19
|    C*
|    C                     EXSR RCHAIN                     *CAHIN DATA
|    C*
M001AC                     Z-ADDME18      WME18   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM WME18     S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DME18     PARM           S001O1  60
|    C*
16===CSR                   ENDSR
      *==============================================================*
      *          RTN280....CHECK 'SC02' SCREEN
      *==============================================================*
18===CSR         RTN280    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '1'
| 01-C           DOPT1     OREQ '3'
|   C*
| 02-C           SME01     IFEQ *BLANK
|   C                     SETON                     609899
| 02*C                     ELSE
|   C                     MOVE SME01     ME01
|   C                     MOVE *BLANK    ME02
|   C           KEY#ME    CHAINME0L                 40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME04
| 03*C                     ELSE
|   C                     MOVELME04      DME04
| 03-C                     END
| 02-C                     END
|   C   99                GOTO END280
|   C*
|   C           SME01     SETLLMD0                      70
|   C  N70                SETON                     609799
|   C   99                GOTO END280
|   C*
| 04-C           SME02     IFEQ *BLANK
|   C                     SETON                     619899
|   C   99                GOTO END280
| 04-C                     END
| 01-C                     END
|    C*
| 05-C           SME03     IFEQ *BLANK
|   C                     SETON                     629899
|   C   99                GOTO END280
| 05-C                     END
|    C*
| 02-C           DME20     IFEQ *BLANK
|   C                     SETON                     669899
| 05-C                     END
|   C   99                GOTO END280
      *
| 06-C           SME04     IFEQ *BLANK
|   C                     MOVELSME031    SME04
| 07-C           SME030    IFEQ OE
|   C           OF        SCAN SME04     RESULT  20     95
| 08-C           *IN95     IFEQ '0'
|   C                     MOVE OF        SME041
| 08-C                     END
| 07-C                     END
| 06-C                     END
|    C*
| 09-C           SME07     IFEQ *BLANK
|   C                     SETON                     639899
| 09*C                     ELSE
|   C           SME07     CHAIN#D0                  41
| 10-C           *IN41     IFNE '0'
|   C                     SETON                     639799
|   C                     MOVE *BLANK    #D02
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END280
|    C*
| 11-C           SME08     IFEQ *BLANK
|   C*                    SETON                     649899
| 11*C                     ELSE
|   C                     MOVE SME07     #E01
|   C                     MOVE SME08     #E02
|   C           KEY#E0    CHAIN#E0                  41
| 12-C           *IN41     IFNE '0'
|   C                     SETON                     649799
|   C                     MOVE *BLANK    #E03
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END280
|    C*
| 13-C           SME15     IFEQ *BLANK
|   C                     SETON                     659899
| 13*C                     ELSE
|   C           SME15     CHAINMC0                  41
| 14-C           *IN41     IFNE '0'
|   C                     SETON                     659799
|   C                     MOVE *BLANK    MC02
| 14-C                     END
| 13-C                     END
|    C   99                GOTO END280
|    C*
| 15-C           *IN05     IFEQ *ON
|   C********************
|   C*  GET ROW,COL     *
|   C********************
| 16-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 16-C                     END
|   C                     SETON                     99
| 15-C                     END
|    C*
18===CSR         END280    ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
19===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
19===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
20===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           APPSCR    IFEQ 'SCR001'
|   C**
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE4
|   C           D#COL     ANDLE13
|   C                     CALL 'WDS003'
|   C                     PARM           S003O1  9
|   C                     MOVE S003O1    DBGN2
|   C                     MOVELS003O1    DBGN1
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
| 03-C           APPSCR    IFEQ 'SCR002'
|   C*
| 04-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE13
|   C           D#COL     ANDLE14
|   C                     CALL 'WDS007'
|   C           SME07     PARM SME07     S007O1  2
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE13
|   C           D#COL     ANDLE14
|   C                     CALL 'WDS010'
|   C                     PARM SME07     S010I1  2
|   C           SME08     PARM           S010O1  2
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 06-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE13
|   C           D#COL     ANDLE18
|   C                     CALL 'WDS005'
|   C           SME15     PARM SME15     S005O1  6
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 03-C                     END
|    C*
20===C           ENDF4     ENDSR
      *===============================================================*
      *          RTNF8 ....F8 HELP
      *===============================================================*
20===C           RTNF8     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           APPSCR    IFEQ 'SCR001'
|   C**
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE4
|   C           D#COL     ANDLE13
|   C                     CALL 'WDS024'
|   C           DBGN1     PARM DBGN1     PBGN1   5
|   C           DBGN2     PARM DBGN2     PBGN2   4
|   C                     GOTO ENDF8
| 02-C                     END
|   C*
| 03-C                     END
|    C*
20===C           ENDF8     ENDSR
      *===============================================================*
      *          RCHAIN....CHAIN DATA
      *===============================================================*
21===C           RCHAIN    BEGSR
|    C*
|    C           SME07     CHAIN#D0                  41
|    C   41                MOVE *BLANK    #D02
|    C                     SETOF                     41
|    C*
|    C                     MOVE SME07     #E01
|    C                     MOVE SME08     #E02
|    C           KEY#E0    CHAIN#E0                  41
|    C   41                MOVE *BLANK    #E03
|    C                     SETOF                     41
|    C*
|    C           SME15     CHAINMC0                  41
|    C   41                MOVE *BLANK    MC02
|    C                     SETOF                     41
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
22===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     2899
|    C*
22===C                     ENDSR'*DETC'
M001AC/COPY HBP2CVTR
**
新增修改拷備刪除查詢
