     FBRBELF01IP  E           K        DISK
     FSOS5PF  UF  E           K        DISK                      A
     FS#SUPF  IF  E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      187 1920$EGYMD
     I                                      201 2080$EG8
     C*==============================================================*
     C*                 MAIN ROUTINE
     C*==============================================================*
     C                     MOVEL*BLANKS   K5      5
     C                     MOVELBE06      K5
     C           K5        CHAINS50                  48
     C           *IN48     IFEQ '1'
     C                     MOVEL*BLANKS   S501
     C                     MOVELBE06      S501
     C                     Z-ADD$EG8      S5XX
     C                     Z-ADD$EG8      S505
     C                     Z-ADD$EG8      S502
     C                     Z-ADD0         S503
     C                     Z-ADD0         S504
     C                     TIME           S5YY
     C                     MOVEL$USER     S5ZZ
     C           $USER     CHAINSU0                  47
     C           *IN47     IFEQ '0'
     C                     MOVELSU04      S506
     C                     ELSE
     C                     MOVEL*BLANKS   S506
     C                     END
     C                     WRITES50
     C                     END
     C           *LOVAL    SETLLS50
      *
     CLR                   RETRN
