      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0481                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/08/26                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶簡明表                                   *
     A*===============================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 01.01.29 |增加大區域選項
     F*----------------------------------------------------------------
      ****************************************************************
     FMTMEPF  IP  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
M001AFPA#LPF  IF  E           K        DISK
M001AFPA#MPF  IF  E           K        DISK
     F*PA#EPF  IF  E           K        DISK
     FMTR048P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DME01S
     I                                      606 610 DME01E
     I                                      611 612 DME07S
     I                                      613 614 DME07E
     I                                      615 616 DMD08S
     I                                      617 618 DMD08E
     I                                      621 621 DMD07S
     I                                      622 622 DMD07E
     I                                      623 624 DME08S
     I                                      625 626 DME08E
     I                                      631 636 DME15S
     I                                      641 646 DME15E
     I                                      655 658 DMC03S
     I                                      659 662 DMC03E
M001A *大區域別
M001AI                                      700 701 D#L01S
M001AI                                      710 711 D#L01E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
M001AC           KEY#M     KLIST
M001AC                     KFLD           K#M01   2
M001AC                     KFLD           K#M02   2
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *SET INIT
    C                     SETON                     10
  01-C                     END
     C*
     C                     EXSR RTN100                     *CHK MD0
M001AC                     EXSR RTN300                     *CHK #L0
     C*
  02-C           *IN99     IFEQ '0'
    C                     EXSR RTN200                     *CHAIN OTHPF
    C                     WRITEPD1
    C   39                EXSR RTN900                     *OVRFLOW
  02-C                     END
     C*
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CHECK DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*通路＆型態
|    C           ME01      CHAINMD0                  40
| 01-C           *IN40     IFEQ '1'
|   C           MD07      ORLT DMD07S
|   C           MD07      ORGT DMD07E
|   C           MD08      ORLT DMD08S
|   C           MD08      ORGT DMD08E
|   C                     MOVE *BLANK    MD07
|   C                     MOVE *BLANK    MD08
|   C                     SETON                     99
| 01*C                     ELSE
|   C           ME15      CHAINMC0                  44
| 02-C           MC03      IFLT DMC03S
|   C           MC03      ORGT DMC03E
|   C                     SETON                     99
| 01*C                     ELSE
|   C                     SETOF                     99
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....CHAIN PF
      *==============================================================*
03===C           RTN200    BEGSR
|    C*********
|    C*業務員
|    C*********
|    C           ME15      CHAINMC0                  44
|    C*
|    C   44                MOVE *BLANK    MC02
|    C*
03===C                     ENDSR
      *==============================================================*
M001A *          RTN300....CHECK大區域
      *==============================================================*
02===C           RTN300    BEGSR
     C*
M001AC           *IN99     IFNE '1'
M001AC           D#L01S    SETLL#L0
M001AC                     READ #L0                      55
M001AC           *IN55     DOWEQ'0'
M001AC           #L01      IFGE D#L01S
M001AC           #L01      ANDLED#L01E
M001AC                     MOVE #L01      K#M01
M001AC                     MOVE ME07      K#M02
M001AC           KEY#M     CHAIN#M0                  56
M001AC           *IN56     IFEQ '0'
M001AC           ME07      ANDEQ#M02
M001AC*
M001AC                     SETOF                     99
M001AC                     LEAVE
M001AC                     ELSE
M001AC                     SETON                     99
M001AC                     END
M001AC                     ELSE
M001AC                     SETON                     99
M001AC                     END
M001AC                     READ #L0                      55
M001AC                     END
M001AC                     END
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....ENDPGM
      *==============================================================*
04===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
|    C*
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
05===C                     ENDSR
