      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0521                                       *
      * AUTHER       : D910074 TINA                                  *
      * CREATE DATE  : 81/09/23                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :收款用客戶明細表                             *
      ****************************************************************
     FMTMDPF  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTR052P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 605 DMD01S
     I                                      606 610 DMD01E
     I                                      611 611 DMD07S
     I                                      612 612 DMD07E
     I                                      613 614 DME07S
     I                                      615 616 DME07E
     I                                      621 626 DME15S
     I                                      631 636 DME15E
     I                                      640 641 DMD08S
     I                                      642 643 DMD08E
     I                                      644 647 DMC03S
     I                                      648 651 DMC03E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....WRITEPD1
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           MD01      CHAINME0                  45
| 01-C           ME15      IFGE DME15S
|   C           ME15      ANDLEDME15E
| 02-C           ME02      IFEQ '    '
|   C           ME20      ANDNE'I'
|   C           ME15      CHAINMC0                  44
| 03-C           MC03      IFGE DMC03S
|   C           MC03      ANDLEDMC03E
|   C*信用期限
| 04-C           MD23      CASEQ'C'       RTN10
|   C           MD23      CASEQ'D'       RTN20
|   C           MD23      CASEQ'M'       RTN30
| 04-C                     END
     C   39                EXSR RTN900
|   C                     WRITEPD1
| 03-C                     END
| 02-C                     END
| 01-C                     END
02===C                     ENDSR
      *==============================================================*
      *          RTN10 ....C---現金
      *==============================================================*
03===C           RTN10     BEGSR
|    C                     MOVE '現金'  PMD23
03===C                     ENDSR
      *==============================================================*
      *          RTN20 ....D---交貨
      *==============================================================*
04===C           RTN20     BEGSR
|    C                     MOVE '交貨'  PMD23
04===C                     ENDSR
      *==============================================================*
      *          RTN30 ....M---月結
      *==============================================================*
05===C           RTN30     BEGSR
|    C                     MOVE '月結'  PMD23
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTNLR ....ENDPGM
      *==============================================================*
07===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPE9
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
07===C                     ENDSR
      *==============================================================*
