      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0451                                       *
      * AUTHER       : A1087 JOYCE                                   *
      * CREATE DATE  : 81/01/21                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :員工清冊列印                                 *
      ****************************************************************
     FMTMCPF  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
B2CHKFMTR045P O   E             39     PRINTER
B2INF *CVR3010 sev.30 PRINTER file MTR045P must be converted, because file
B2INF *   MC05 (and more) are shared by name with other database fields
B2INF *   which require to be expanded. Please convert MTR045P, enlarging
B2INF *   all involved fields prior to compilation, or manually insert in
B2INF *   this source the proper RENAME and MOVE statements to avoid name
B2INF *   sharing
     IMC0
     I                                              MC03  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 604 DMC03S
     I                                      605 608 DMC03E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C   L1 10             WRITEPE3
     C   L1                EXSR RTN010
     C*
     C   39                EXSR RTN900
     C*
M001AC                     Z-ADDMC05      WMC05   60
     C                     CALL 'RES001'
     C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WMC05     S001I2  60
B2MODC           LMC05     PARM           S001O1  60
     C*
M001AC                     Z-ADDMC08      WMC08   60
     C                     CALL 'RES001'
     C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM WMC08     S001I2  60
B2MODC           LMC08     PARM           S001O1  60
     C*
     C                     WRITEPD1
     C*
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'CENTER'  #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELMC03      #A02
|    C           KEY#A     CHAIN#A0                  41
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
02===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE2
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
03===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE1
03===C                     ENDSR
