      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0511                                       *
      * AUTHER       : 0070  JUDY                                    *
      * CREATE DATE  : 81/09/19                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :產品簡明表                                   *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.16 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FMTMAPF  IP  E           K        DISK
     FMTR051P O   E             39     PRINTER
     IMA0
     I                                              MA07  L2
     I                                              MA08  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      187 1920$EGYMD
     I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
M001AI                                      201 2080EG8
     I                                      601 609 DMA01S
     I                                      610 618 DMA01E
     I                                      619 619 DMA07S
     I                                      620 620 DMA07E
     I                                      621 621 DMA58
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900
     C*
     C                     EXSR RTN100
     C                     WRITEPD1
     C                     SETON                     31
     C*
     CL1 10                SETOF                     31
     CL2 10                SETON                     39
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CHECK  MA39  MA41 MA46
      *==============================================================*
02===C           RTN100    BEGSR
B2000C*M001M     $EGYMD    IFLT MA39
M001MC           EG8       IFLT MA39
|   C                     Z-ADDMA41      PMA41
| 01*C                     ELSE
|   C                     Z-ADDMA46      PMA41
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....ENDPGM
      *==============================================================*
03===C           RTNLR     BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     WRITEPE9
     C                     END
     C*
     C                     WRITEPE2
     C*
     C                     ENDSR
      *==============================================================*
