      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0432  ---*USE MTR043BP                     *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶清冊－依地區別排序                       *
      ****************************************************************
     FREWF33  IP  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTR043BPO   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DME01S
     I                                      606 610 DME01E
     I                                      611 612 DME07S
     I                                      613 614 DME07E
     I                                      621 621 DMD07S
     I                                      622 622 DMD07E
     I                                      631 636 DME15S
     I                                      641 646 DME15E
     I                                      615 615 DCH
     I                                      617 618 DMD08S
     I                                      619 620 DMD08E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *SET INIT
     C*
     C                     EXSR RTN100                     *CHK MD0
     C*
     C                     WRITEPD1
     C   39                EXSR RTN900                     *OVRFLOW
     C                     WRITEPD2
     C*
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
     C*
|    C                     EXSR RTN900
     C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CHECK DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
     C*員工姓名　
     C           ME15      CHAINMC0                  42
     C           *IN42     IFEQ '1'
     C                     MOVE *BLANK    MC02
     C                     END
     C*
02===C                     ENDSR
      *==============================================================*
      *          RTNLR ....ENDPGM
      *==============================================================*
03===C           RTNLR     BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     WRITEPE9
     C                     END
     C                     WRITEPE2
     C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     SETON                     10
     C                     SETOF                     39
     C                     END
     C*
     C           *IN39     IFEQ '1'
     C                     WRITEPE1
     C                     WRITEPH1
     C                     SETOF                     39
     C                     END
     C*
03===C                     ENDSR
