     F*===============================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 01.02.01 |增加大區域選項
     F*----------------------------------------------------------------
     FREWF33  IP  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
     FPA#EPF  IF  E           K        DISK
M001AFPA#LPF  IF  E           K        DISK
M001AFPA#MPF  IF  E           K        DISK
     FMTR047BPO   E             39     PRINTER
     IMD0
     I                                              MD07  L4
     I                                              MD08  L3
     I                                              ME07  L2
     I                                              ME08  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      125 1270$CPY
     I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      598 5990$PRTID
     I                                      601 601 DMD07S
     I                                      602 602 DMD07E
     I                                      611 612 DMD08S
     I                                      613 614 DMD08E
     I                                      621 622 DME07S
     I                                      623 624 DME07E
     I                                      625 626 DME08S
     I                                      627 628 DME08E
     I                                      629 634 DME15S
     I                                      635 640 DME15E
     I                                      641 641 DOPT
     I                                      642 645 DMC03S
     I                                      646 649 DMC03E
M001A *大區域別
M001AI                                      700 701 D#L01S
M001AI                                      710 711 D#L01E
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C*
     C           KEY#C     KLIST
     C                     KFLD           MD07
     C                     KFLD           MD08
     C           KEY#E     KLIST
     C                     KFLD           ME07
     C                     KFLD           ME08
M001AC           KEY#M     KLIST
M001AC                     KFLD           K#M01   2
M001AC                     KFLD           K#M02   2
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010                     *SET INIT
     C*
M001AC           D#L01S    SETLL#L0
M001AC                     READ #L0                      55
M001AC           *IN55     DOWEQ'0'
M001AC           #L01      IFGE D#L01S
M001AC           #L01      ANDLED#L01E
M001AC                     MOVE #L01      K#M01
M001AC                     MOVE ME07      K#M02
M001AC           KEY#M     CHAIN#M0                  56
M001AC           *IN56     IFEQ '0'
M001AC           ME07      ANDEQ#M02
M001AC*
     C                     EXSR RTN100                     *CHAIN SC0
     C                     SETON                     3132
     C                     SETON                     3334
M001AC                     LEAVE
M001AC                     END
M001AC                     END
M001AC                     READ #L0                      55
M001AC                     END
     C*
     CL1 10                SETOF                     34
     CL2 10                SETOF                     33
     CL3 10                SETOF                     32
     CL4 10                SETOF                     31
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....SET INIT
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....CHAIN #A0
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*業務員
|    C           ME15      CHAINMC0                  40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C           MC03      ANDGEDMC03S
|   C           MC03      ANDLEDMC03E
|   C*通路
|   C                     MOVE *BLANK    #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVEL'DISTRUBT'#A01
|   C                     MOVELMD07      #A02
|   C*
|   C           KEY#A     CHAIN#A0                  40
|   C*
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #A03
| 02-C                     END
|   C*型態
|   C           KEY#C     CHAIN#C0                  40
|   C*
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #C03
| 03-C                     END
|   C*地區
|   C           ME07      CHAIN#D0                  40
|   C*
| 04-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #D02
| 04-C                     END
|   C*
|   C*區域
|   C           KEY#E     CHAIN#E0                  40
|   C*
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #E03
| 05-C                     END
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPD1
| 01-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN900....PROC SKIP
     C*==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
04===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|    C                     WRITEPH1
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
04===C                     ENDSR
