      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0431  ---*USE MTR043AP                     *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶清冊                                     *
      ****************************************************************
     FREWF33  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTR043APO   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DME01S
     I                                      606 610 DME01E
     I                                      611 612 DME07S
     I                                      613 614 DME07E
     I                                      621 621 DMD07S
     I                                      622 622 DMD07E
     I                                      631 636 DME15S
     I                                      641 646 DME15E
     I                                      615 615 DCH
     I                                      617 618 DMD08S
     I                                      619 620 DMD08E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100
     C*
     C                     READ MD0                      46
 B1--C           *IN46     DOWEQ'0'
     C                     EXSR RTN200
     C*
     C                     WRITEPD1
     C                     SETON                         10
     C   39                EXSR RTN900                     *OVRFLOW
     C                     WRITEPD2
     C*
     C                     READ MD0                      46
 E1--C                     END
     C*
     C  N10                WRITEPE9
     C                     WRITEPE2
     C                     SETON                         LR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     WRITEPH1
01===C                     ENDSR
      *==============================================================*
      *          RTN200....CHECK DETAIL
      *==============================================================*
02===C           RTN200    BEGSR
     C*員工　　　
     C           ME15      CHAINMC0                  40
     C           *IN40     IFEQ '1'
     C                     MOVE *BLANK    MC02
     C                     END
     C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
