      ****************************************************************
      *                                                              *
      * PROGRAM NAME : MTR050                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/09/22                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :新增產品一覽表                               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.02 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 123199 = 123129
     A*---------------------------------------------------------------
      ****************************************************************
     FMTR050D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*歸屬，產品代號，建檔日期
     I                                      601 601 DMA07S
     I                                      602 602 DMA07E
     I                                      603 611 DMA01S
     I                                      612 620 DMA01E
     I*MM/DD/YY
     I                                      621 6260DMA53S
     I                                      627 6320DMA53E
     I*YY/MM/DD
     I                                      633 6400WMA53S
     I                                      641 6480WMA53E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DMA01S
|    C                     MOVE *BLANK    DMA01E
|    C                     MOVE *BLANK    DMA07S
|    C                     MOVE *BLANK    DMA07E
|    C                     Z-ADD0         DMA53S
|    C                     Z-ADD0         DMA53E
|    C                     Z-ADD0         WMA53S
|    C                     Z-ADD0         WMA53E
|    C                     Z-ADD0         WWS     60
|    C                     Z-ADD0         WWE     60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C***********
|    C*產品代號
|    C***********
| 04-C           DMA01S    IFEQ *BLANKS
|   C                     MOVE 010192    DMA01S
| 04-C                     END
|    C*
| 05-C           DMA01E    IFEQ *BLANKS
|   C                     MOVE 123129    DMA01E
| 05-C                     END
|    C*
| 06-C           DMA01S    IFGT DMA01E
|   C                     SETON                     6162
|   C                     SETON                     9399
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*******
|    C*歸屬
|    C*******
| 07-C           DMA07S    IFEQ *BLANKS
|   C                     MOVE 010192    DMA07S
|   C                     MOVE 123129    DMA07E
|   C                     ELSE
|   C                     MOVE DMA07S    DMA07E
| 07-C                     END
|    C*
|    C   99                GOTO END100
|    C*
|    C***********
|    C*建檔日期
|    C***********
| 08-C           DMA53S    IFEQ 0
M002MC                     Z-ADD010192    DMA53S
| 14*C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DMA53S    P0901I  60
|   C                     PARM           P0901O  1
| 09-C           P0901O    IFEQ 'N'
|   C                     SETON                     639499
| 09-C                     END
| 08-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DMA53S    S001I2  60
|    C           WWS       PARM           S001O1  60
M001AC                     MOVE WWS       HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WMA53S  80
|    C*
| 10-C           DMA53E    IFEQ 0
M002MC                     Z-ADD123129    DMA53E
| 10*C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DMA53E    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     649499
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DMA53E    S001I2  60
|    C           WWE       PARM           S001O1  60
M001AC                     MOVE WWE       HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WMA53E  80
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*產品代號
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C*
| 08-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 08-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
