     FMTR049D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 605 DMA12S
     I                                      606 610 DMA12E
     I                                      611 619 DMA01S
     I                                      620 628 DMA01E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I            DS
     I                                        1   60DAT
     I                                        1   20DATY
     I                                        3   60DATMD
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DMA12S
|    C                     MOVE *BLANK    DMA12E
|    C                     MOVE *BLANK    DMA01S
|    C                     MOVE *BLANK    DMA01E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           DMA12S    IFEQ *BLANKS
|   C                     MOVEL*LOVAL    DMA12S
     C                     END
|   C           DMA12E    IFEQ *BLANKS
|   C                     MOVEL*HIVAL    DMA12E
| 01-C                     END
|    C*
| 09-C           DMA12S    IFGT DMA12E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 10-C           DMA01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA01S
| 10-C                     END
|    C*
| 11-C           DMA01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMA01E
| 11-C                     END
|    C*
| 12-C           DMA01S    IFGT DMA01E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 12-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*供應商
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS002'
|   C                     PARM           DMA12S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS002'
|   C                     PARM           DMA12E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C*產品代號
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE55
|   C           D#COL     ANDLE63
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
