      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : MTR0551                                       *
      * AUTHER       : MERCURY                                       *
      * CREATE DATE  : 82/10/29                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶搭贈清冊                                 *
      ****************************************************************
     FMTMEPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTR055P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DME01S
     I                                      606 610 DME01E
     I                                      611 612 DME07S
     I                                      613 614 DME07E
     I                                      621 621 DMD07S
     I                                      622 622 DMD07E
     I                                      623 624 DMD08S
     I                                      625 626 DMD08E
     I                                      631 636 DME15S
     I                                      641 646 DME15E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100
     C*
     C                     READ ME0                      46
  01-C           *IN46     DOWEQ'0'
    C                     EXSR RTN200
     C*
     C           *IN99     IFEQ '0'
    C   39                EXSR RTN900                     *OVRFLOW
    C                     WRITEPD1
     C                     SETON                         10
     C                     END
    C*
    C                     READ ME0                      46
  01-C                     END
     C*
     C                     EXSR RTNLR
     C                     SETON                         LR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     WRITEPH1
01===C                     ENDSR
      *==============================================================*
      *          RTN200....CHECK DETAIL
      *==============================================================*
02===C           RTN200    BEGSR
|    C*通路＆型態
|    C           ME01      CHAINMD0                  40
| 01-C           *IN40     IFEQ '1'
     C           MD07      ORLT DMD07S
     C           MD07      ORGT DMD07E
     C           MD08      ORLT DMD08S
     C           MD08      ORGT DMD08E
|   C                     MOVE *BLANK    MD07
|   C                     MOVE *BLANK    MD08
     C                     SETON                     99
     C                     ELSE
     C           ME15      CHAINMC0                  41
     C           *IN41     IFEQ '1'
     C                     MOVE *BLANK    MC02
     C                     END
     C                     SETOF                     99
| 01-C                     END
     C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....ENDPGM
      *==============================================================*
03===C           RTNLR     BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPE9
     C                     END
     C*
     C                     WRITEPE2
     C*
     C                     ENDSR
      *==============================================================*
