     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.16 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     FREWF33  IP  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FMTR053P O   E             39     PRINTER
     IMD0
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      125 1270$CPY
     I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      598 5990$PRTID
     I*
     I                                      601 601 DMD07S
     I                                      602 602 DMD07E
     I                                      603 604 DMD08S
     I                                      605 606 DMD08E
     I                                      607 611 DMD01S
     I                                      612 616 DMD01E
     I                                      621 622 DME07S
     I                                      623 624 DME07E
     I                                      625 626 DME08S
     I                                      627 628 DME08E
     I                                      629 634 DME15S
     I                                      635 640 DME15E
     I                                      642 645 DMC03S
     I                                      646 649 DMC03E
     I                                      650 6550DME19S
     I                                      656 6610DME19E
M001MI*                                     662 6670YME19S
M001MI*                                     668 6730YME19E
M001MI                                      662 6690YME19S
M001MI                                      670 6770YME19E
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C*
     C           KEY#C     KLIST
     C                     KFLD           MD07
     C                     KFLD           MD08
     C           KEY#E     KLIST
     C                     KFLD           ME07
     C                     KFLD           ME08
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           ME15      CHAINMC0                  40
     C*
  01-C           *IN40     IFEQ '0'
    C           MC03      ANDGEDMC03S
    C           MC03      ANDLEDMC03E
     C  N10                EXSR RTN010                     *SET INIT
    C                     EXSR RTN100                     *CHAIN SC0
    C                     SETOF                     11
  01-C                     END
     C*
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....SET INIT
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|   C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....CHAIN #A0
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*業務員
|    C           ME15      CHAINMC0                  40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C           MC03      ANDGEDMC03S
|   C           MC03      ANDLEDMC03E
|   C*通路
|   C                     MOVE *BLANK    #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVEL'DISTRUBT'#A01
|   C                     MOVELMD07      #A02
|   C*
|   C           KEY#A     CHAIN#A0                  40
|   C*
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #A03
| 02-C                     END
|   C*型態
|   C           KEY#C     CHAIN#C0                  40
|   C*
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #C03
| 03-C                     END
     C*
|   C                     MOVEL*BLANKS   ME056
| 06-C           ME05      IFNE *BLANKS
|   C                     MOVELME05      ME056
| 06*C                     ELSE
|   C                     MOVELME06      ME056
| 06-C                     END
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPD1
| 01-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN900....PROC SKIP
     C*==============================================================*
03===C           RTN900    BEGSR
|    C*
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....ENDPGM
      *==============================================================*
03===C           RTNLR     BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     WRITEPE9
     C                     END
     C*
     C                     WRITEPE2
     C*
     C                     ENDSR
      *==============================================================*
