      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0411                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/01/18                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :產品清冊列印                               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.05 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FMTMAPF  IP  E           K        DISK
     FPOPILF02IF  E           K        DISK
     FPOPELF02IF  E           K        DISK
     FMTR041P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
B2MODI                                      187 1920$EGYMD
     I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
M001AI                                      201 2080$EG8
B2MODI                                      601 609 DMA01S
B2MODI                                      610 618 DMA01E
B2MODI                                      619 619 DMA07S
B2MODI                                      620 620 DMA07E
B2MODI                                      621 621 DMA58
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYPI     KLIST
     C                     KFLD           MA01
     C                     KFLD           WPI05
     C*
B2000C           *LIKE     DEFN PI05      WPI05
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900
     C*(CHECK MA51--進貨日期(PI05 OR PE05)取最大者
     C                     EXSR RTN100
     C*
     C                     WRITEPD1
     C*
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
| 01-C           $RMK01    IFEQ 'Y'
|   C                     SETON                     33
| 01-C                     END
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CHECK  MA51  MA41 MA41 MA42
      *==============================================================*
02===C           RTN100    BEGSR
B2000C*M001M     $EGYMD    IFLT MA39
M001MC           $EG8      IFLT MA39
|   C                     Z-ADDMA40      PMA40
|   C                     Z-ADDMA41      PMA41
|   C                     Z-ADDMA42      PMA42
| 01*C                     ELSE
|   C                     Z-ADDMA45      PMA40
|   C                     Z-ADDMA46      PMA41
|   C                     Z-ADDMA47      PMA42
| 01-C                     END
|    C**
|    C                     Z-ADD0         PI05
|    C                     Z-ADD0         PE05
B2000C                     MOVE *HIVAL    WPI05
B2000C           KEYPI     SETLLPI0
|    C           MA01      REDPEPI0                      45
B2000C           KEYPI     SETLLPE0
|    C           MA01      REDPEPE0                      45
|    C**
B2000C           PE05      IFGT PI05
B2TRCC                     Z-ADDPE05      PMA51
| 02*C                     ELSE
B2TRCC                     Z-ADDPI05      PMA51
| 02-C                     END
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM PMA51     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           PMA51     PARM           S001O1  60
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
04===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
04===C                     ENDSR
