      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR043                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶清冊                                     *
      ****************************************************************
     FMTR043D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 605 DME01S
     I                                      606 610 DME01E
     I                                      611 612 DME07S
     I                                      613 614 DME07E
     I                                      621 621 DMD07S
     I                                      622 622 DMD07E
     I                                      631 636 DME15S
     I                                      641 646 DME15E
     I                                      615 615 DCH
     I                                      616 616 DSEL
     I                                      617 618 DMD08S
     I                                      619 620 DMD08E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DME01S
|    C                     MOVE *BLANK    DME01E
|    C                     MOVE *BLANK    DME07S
|    C                     MOVE *BLANK    DME07E
|    C                     MOVE *BLANK    DME15S
|    C                     MOVE *BLANK    DME15E
|    C                     MOVE *BLANK    DMD07S
|    C                     MOVE *BLANK    DMD07E
|    C                     MOVE *BLANK    DMD08S
|    C                     MOVE *BLANK    DMD08E
|    C                     MOVE 'A'       DCH
|    C                     MOVE 'N'       DSEL
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**通路
| 04-C           DMD07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMD07S
| 04-C                     END
|    C*
| 05-C           DMD07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMD07E
| 05-C                     END
|    C*
| 06-C           DMD07S    IFGT DMD07E
|   C                     SETON                     6667
|   C                     SETON                     9399
| 06-C                     END
|    C   99                GOTO END100
|    C**地區
| 04-C           DME07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DME07S
| 04-C                     END
|    C*
| 05-C           DME07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DME07E
| 05-C                     END
|    C*
| 06-C           DME07S    IFGT DME07E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK型態
| 04-C           DMD08S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMD08S
| 04-C                     END
|    C*
| 05-C           DMD08E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMD08E
| 05-C                     END
|    C*
| 06-C           DMD08S    IFGT DMD08E
|   C                     SETON                     686893
|   C                     SETON                     99
|   C                     GOTO END100
| 06-C                     END
|    C*
|    C   99                GOTO END100
|    C**業務員
| 04-C           DME15S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DME15S
| 04-C                     END
|    C*
| 05-C           DME15E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DME15E
| 05-C                     END
|    C*
| 06-C           DME15S    IFGT DME15E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 06-C                     END
|    C   99                GOTO END100
|    C**客戶代號
| 01-C           DME01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DME01S
| 01-C                     END
|    C*
| 02-C           DME01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DME01E
| 02-C                     END
|    C*
| 03-C           DME01S    IFGT DME01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| B1-C           APPSCR    IFEQ 'SCR001'
|   C*
| B2-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C           DME01S    PARM *BLANKS   W003    9
|   C                     GOTO ENDF4
| E2-C                     END
|   C*
| B3-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE47
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS003'
|   C           DME01E    PARM *BLANKS   W003    9
|   C                     GOTO ENDF4
| E3-C                     END
     C*
| B4-C           D#ROW     IFEQ 5
| B5-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C           DMD07S    PARM DMD07S    PMD07   1
|   C                     GOTO ENDF4
| E5 C                     END
|   C*
| B6-C           D#COL     IFEQ 47
|   C                     CALL 'WDS018'
|   C           DMD07E    PARM DMD07E    PMD07
|   C                     GOTO ENDF4
| E6 C                     END
|   C*
| E4 C                     END
|   C*
| B7-C           D#ROW     IFEQ 7
| B8-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS007'
|   C           DME07S    PARM DME07S    PME07   2
|   C                     GOTO ENDF4
| E8 C                     END
|   C*
| B9-C           D#COL     IFGE 47
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS007'
|   C           DME07E    PARM DME07E    PME07
|   C                     GOTO ENDF4
| E9 C                     END
| E9 C                     END
|   C*
| B10C           D#ROW     IFEQ 9
| B11C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
     C*                    PARM DMD07S    PMD07
|   C           DMD08S    PARM DMD08S    PMD08   2
|   C                     GOTO ENDF4
| E11C                     END
|   C*
| B12C           D#COL     IFGE 47
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS009'
     C*                    PARM DMD07E    PMD07
|   C           DMD08E    PARM DMD08E    PMD08
|   C                     GOTO ENDF4
| E12C                     END
| E10C                     END
|   C*
|B13-C           D#ROW     IFEQ 11
|B14-C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C           DME15S    PARM DME15S    PME15   6
|   C                     GOTO ENDF4
|E14 C                     END
|   C*
|B15-C           D#COL     IFGE 47
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS015'
|   C           DME15E    PARM DME15E    PME15
|   C                     GOTO ENDF4
|E15 C                     END
|E13 C                     END
|   C*
|B16 C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
|E16 C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     TAG
     C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
