      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0441                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/01/22                                      *
      * UPDATE DATE  : 81/01/22                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :報價逾期表                                   *
      ****************************************************************
     FMTMFPF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTR046P O   E             39     PRINTER
     IMF0
     I                                              MF01  L2
     I                                              MF02  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 609 DMF01S
     I                                      610 618 DMF01E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN100
     C   L2                SETON                     30
     C   39                EXSR RTN900                     *OVRFLW
     C                     EXSR RTN200
     C                     WRITEPD1
     C                     SETOF                         30
     C*(NO DATA)
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     WRITEPH1
|    C                     SETON                     10
01===C                     ENDSR
      *==============================================================*
      *          RTN200....CHECK DETAIL
      *==============================================================*
02===C           RTN200    BEGSR
|    C*禮盒簡稱
|    C           MF01      CHAINMA0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVE MA03      PMA031
| 01*C                     ELSE
|   C                     MOVE *BLANK    PMA031
| 01-C                     END
|    C*產品簡稱
|    C           MF02      CHAINMA0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVE MA03      PMA032
| 02*C                     ELSE
|   C                     MOVE *BLANK    PMA032
| 02-C                     END
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
04===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN100
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
04===C                     ENDSR
