     FS#SUPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FNOM000D CF  E                    WORKSTN
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      113 1160$CHMD
     I                                      119 1240$EGMDY
     I                                      123 1240$EGY
M001AI                                      201 2040EG4
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010
     C           *IN20     IFEQ '1'
    C                     EXFMTDSPC1
     C                     ELSE
    C                     EXFMTDSPC2
     C                     END
    C                     MOVEA*ALL'0'   *IN,60
     C                     SETON                     LR
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    SU02
     C           $USER     CHAINSU0                  40
     C           *IN40     IFEQ '0'
     C           SU04      CHAINMC0                  40
     C           *IN40     IFEQ '0'
B2CHKC                     MOVE MC08      BIRMD   40
B2INF *CVR0001 sev.00 Field BIRMD is not a date or year
B2INF *CVR0003 sev.00 Assumed to be extraction of part (not containing
B2INF *   year) of a date-field
B2MODC                     MOVELMC08      BIRY    40
B2CHKC*M001M     $EGY      SUB  BIRY      YEAR1
M001MC           EG4       SUB  BIRY      YEAR1
B2INF *CVR0001 sev.00 Field $EGY is not a date or year
B2INF *CVR0001 sev.00 Field YEAR1 is not a date or year
     C           YEAR1     IFLE 0
     C                     ADD  100       YEAR1
     C                     END
     C                     Z-ADDYEAR1     YEAR2
     C                     Z-ADDYEAR1     YEAR3
     C           BIRMD     IFEQ $CHMD
     C                     SETON                     20
     C                     END
     C                     END
     C                     END
|    C*
01===C                     ENDSR
