     A*  80/11/19  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : PAA006                                     *
     A*    AUTHOR       : A1005  ROGER CHIEN                         *
     A*    DATE WRITTEN : 80/11/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :基本資料建檔子系統                        *
     A*    PROCEDURE    :產品每箱標準容積建立                      *
     A****************************************************************
     FPAA006D CF  E                    WORKSTN
     IDA01        DS
     I                                        1   4 CHK
     I                                        1   42PADA01
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *NAMVAR   DEFN           DA01
     C           *LOCK     IN   DA01
  01-C           CHK       IFEQ *BLANKS
    C                     Z-ADD0         PADA01
  01-C                     END
     C                     Z-ADDPADA01    DDA01
     C                     EXFMTDSPC1                                  L
      *
  02-C           *IN03     IFEQ '0'
    C                     Z-ADDDDA01     PADA01
  02-C                     END
     C                     OUT  DA01
     C                     SETON                     LR
