      ****************************************************************
      *   人頭馬寰盛洋酒股份有限公司－版權所有                     *
      *                                                              *
      * PROGRAM NAME : PAR0181                                       *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 90/05/29                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬寰盛                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :新產品種類代碼列印                           *
      ****************************************************************
     FPA#7PF  IP  E           K        DISK
     FPAR018P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 610 D#702S
     I                                      611 620 D#702E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900
     C                     WRITEPD1
     C*
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
02===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNLR ....ENDPGM
      *==============================================================*
03===C           RTNLR     BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     WRITEPE9
     C                     END
     C*
     C                     WRITEPE2
     C*
     C                     ENDSR
      *==============================================================*
