      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PAR0031                                       *
      * AUTHER       : A1005 ROGER CHIEN                             *
      * CREATE DATE  : 80/11/20                                      *
      * UPDATE DATE  : 81/01/14 BY STEPHANIE                         *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :試飲Ａ＆Ｐ資料列印                           *
      ****************************************************************
     FPA#5PF  IP  E           K        DISK
     FNPNALF01IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPAR012P O   E             39     PRINTER
     I*40
     I*                                             #401  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      601 602 D#501S
     I                                      603 604 D#501E
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C*                    KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C   39                EXSR RTN900
     C*  77                WRITEPD2
     C                     MOVEL'STOCK'   #A01
     C                     MOVEL#501      #A02
     C           KEY#A     CHAIN#A0                  55
     C           *IN55     IFEQ '1'
     C                     MOVE *BLANK    #A03
     C                     END
    C                     MOVEL#502      NA02
    C           NA02      CHAINNA0                  41
  02-C           *IN41     IFEQ '1'
    C                     MOVEL*BLANK    NA03
  02-C                     END
     C                     WRITEPD1
     C* N77                SETON                     77
      *
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*                    SETOF                     77
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
01===C           RTN900    BEGSR
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*                    SETOF                     77
01===C                     ENDSR
      *==============================================================*
      *          RTNLR ....ENDPGM
      *==============================================================*
03===C           RTNLR     BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     WRITEPE9
     C                     END
     C*
     C                     WRITEPE2
     C*
     C                     ENDSR
      *==============================================================*
