      ****************************************************************
      * PROGRAM NAME : PAR0191                                       *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 91/08/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬寰盛                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :ＡＭＰ代碼列印                               *
      ****************************************************************
     FNPNGPF  IP  E           K        DISK
     FPAR019P O   E             39     PRINTER
     E*: NG04 DESCRIPTION
     E                    WB0     1   2 20
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 606 DNG02S
     I                                      611 616 DNG02E
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100
     C                     WRITEPD1
     C*
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....SFL DTL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVEL*BLANKS   DESC
|    C           NG04      IFEQ 'A'
|    C                     MOVELWB0,1     DESC
|    C                     ELSE
|    C                     MOVELWB0,2     DESC
|    C                     END
|    C*
|    C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
02===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNLR ....ENDPGM
      *==============================================================*
03===C           RTNLR     BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     WRITEPE9
     C                     END
     C*
     C                     WRITEPE2
     C*
     C                     ENDSR
      *==============================================================*
**
AMP
SELLING COST
