      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PIA002                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/04/23                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
     A*    SUBSYSTEM    :盤點系統                                  *
     A*    REMARK       :盤點資料輸入                              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.16 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FIMIOLF03UF  E           K        DISK
     F                                              KINFSR ERRSR
     FIMIOLF  IF  E           K        DISK
     F            IO0                               KRENAMEIO0L
     FIMIOLF01IF  E           K        DISK
     F            IO0                               KRENAMEIOL1
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     F*PA#BPF IF  E           K        DISK
     FPA#FLF  IF  E           K        DISK
     F                                              KINFDS #FRCDN
     F            #A0                               KRENAME#F0L
     F            MD0                               KRENAMEMD0L
     FPIA002D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     E*: A/U/D/I AUT
     E                    WA01        5  1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
M001AI                                      201 2080DATE
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I                                      501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I                                      513 513 $WRHTY
     I*                                     509 513 $APAUT
     I*                                     514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I            DS
     I                                        1   5 DIO02
     I                                        1   1 DIO02L
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I#FRCDN      DS
     I                                     *RECORD  RCDN
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYIO1    KLIST
     C                     KFLD           DIO02
     C                     KFLD           DIO03S
     C*                    KFLD           DIO01
     C           KEYIO2    KLIST
     C                     KFLD           DIO02
     C*                    KFLD           DIO01
     C           KEYIO3    KLIST
     C                     KFLD           DIO02
     C                     KFLD           DIO01
     C                     KFLD           DIO04
     C           KEYIO4    KLIST
     C                     KFLD           DIO02
     C                     KFLD           DIO03
     C*                    KFLD           DIO01
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C*          KEY#B     KLIST
     C*                    KFLD           DIO01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRM
     C*
  01-C           *IN03     DOWEQ'0'
    C*
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C*
    C                     EXSR RTN100                     *CHECK SCR01?
  02-C           *IN03     IFEQ '0'
    C           *IN99     ANDEQ'0'
    C                     EXSR RTN200                     *PROCESS    ?
    C                     SETOF                     5412              ?
    C                     SETON                     95                ?
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C**                   MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C**                   MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
|    C*
|    C                     MOVE *BLANK    DIO01
|    C                     MOVE *BLANK    DIO02
|    C                     MOVE *BLANK    DIO03S
|    C                     MOVE *BLANK    DIO03E
|    C                     Z-ADD0         DIO08
|    C*
B2MODC*M001D               Z-ADD0         DATE    80
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
B2???C*                    PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC*M001D     DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司別檢查
| 01-C*          DIO01     IFEQ *BLANK
|   C*                    SETON                     609399
| 01*C*                    ELSE
|   C*                    MOVE *BLANKS   #A01
|   C*                    MOVE *BLANKS   #A02
|   C*                    MOVEL'COMPANY' #A01
|   C*                    MOVELDIO01     #A02
|   C*          KEY#A     CHAIN#A0                  40
| 02-C*          *IN40     IFEQ '1'
|   C*                    SETON                     609299
| 02-C*                    END
| 01-C*                    END
|    C*  99                GOTO END100
|    C*物流點檢查
| 03-C           DIO02     IFEQ *BLANK
|   C                     SETON                     619599
| 03-C                     END
|    C   99                GOTO END100
      *
     C           $WRHUS    IFNE '*ALL  '
     C           $WRHUS    IFNE *BLANKS
     C           DIO02     IFNE $WRHUS
     C                     SETON                     619699
     C                     END
     C                     ELSE
     C           DIO02L    IFNE $WRHTY
     C                     SETON                     619699
     C                     END
     C                     END
     C                     END
     C*物流點不可是'BXXXX'
     C           DIO02L    IFEQ 'B'
|   C                     SETON                     618899
     C                     END
|    C   99                GOTO END100
|    C*
|    C*盤點單號起迄檢查
| 03-C           DIO03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIO03S
| 03-C                     END
| 04-C           DIO03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DIO03E
| 04-C                     END
| 05-C           DIO03S    IFGT DIO03E
|   C                     SETON                     626388
|   C                     SETON                     99
| 05-C                     END
|    C*日期檢查
B2CHKC           DIO08     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     649399
| 06*C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DIO08     P0901I  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0911O  1
| 07-C           P0911O    IFEQ 'N'
|   C                     SETON                     649099
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTN200....UPD DATA --- SFLSR
      *===============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN292                     *READ
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C  N03                EXSR RTN295
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C***        *IN04     CASEQ'1'       RTN381
|   C           *IN25     CASEQ'1'       RTN292
|   C           *IN05     CASEQ'1'       RTN260
|   C                     CAS            RTN280            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN25     ANDEQ'0'
|   C                     EXSR RTN29S                      SAVE
|   C  N99                MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLIO0L
|   C           *LOVAL    SETLLIOL1
|   C           *LOVAL    SETLLIO0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN260....F5 -- 參考資料
     C*==============================================================*
04===CSR         RTN260    BEGSR
|    C*
|    C                     EXSR RTN280
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 01-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 01-C                     END
|    C                     SETON                     99
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' --- SFLSR
     C*==============================================================*
05===C           RTN280    BEGSR
|    C*
|    C*CHK SCREEN
|    C                     SETON                     54
|    C                     READCSFLSR1                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C           *IN99     ANDEQ'0'
|   C*
|   C                     SETOF                     6061
|   C                     SETOF                     6263
|   C*                                  DATA ENTRY & *IN99 OFF ->CHECK
|   C                     SETON                     313233
| 02-C           HIO10     IFEQ '1'
|   C                     SETOF                     32    *PROTECT FIELD
| 02*C                     ELSE
|   C                     SETON                     32
| 02-C                     END
| 03-C           HIO09     IFEQ 'V'
|   C                     SETOF                     313233*PROTECT FIELD
| 03-C                     END
|   C   99                GOTO UPD
|   C*
|   C* CHK AUT *
| 04-C           DOPT1     IFNE *BLANKS
|   C           WA01,WNUM ANDNE'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 04-C                     END
|   C   99                GOTO DSP
|   C*****
|   C*
|   C* WDS000 SHARE OPEN ---> DON'T WRITE
|   C***                  SETON                     37    *FORCE DATA
|   C***                  WRITEDSPC3
|   C***                  WRITESFLCR2
|   C***                  SETOF                     37
|   C*****
| 04-C*代入盤點日期　
B2000C                     Z-ADDDIO08     WIO08
|   C* CHK 產品代號
| 05-C           DOPT1     IFEQ '2'
|   C           HIO10     ANDEQ'2'
|   C           DIO04     ANDNEHIO04
|   C           DIO04     ANDNE*BLANKS
|   C*
|   C           KEYIO3    CHAINIOL1                 40
|   C  N40                SETON                     6061
|   C  N40                SETON                     9199
| 05-C                     END
|   C   99                GOTO DSP
|   C*
|   C                     MOVE *BLANKS   MA03
| 06-C           DOPT1     IFEQ '2'
     C           DIO04     ANDNE*BLANKS
|   C           DIO04     CHAINMA0                  40
|   C   40                SETON                     618999
| |  C           DIO01     IFNE MA07
| |  C                     SETON                     618899
     C                     END
| 06-C                     END
|   C   99                GOTO DSP
|   C*****
|   C*
|   C   99                GOTO DSP
|   C*
|   C           DSP       TAG
|   C   99                Z-ADDRRN1      DRRN1
|   C*
|   C           UPD       TAG
|   C                     UPDATSFLSR1
|   C  N99                READCSFLSR1                   57
|   C* READC DOW LOOP
| 01-C                     END
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 07-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 07-C                     END
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
05===C           END280    ENDSR
     C*==============================================================*
     C*          RTN291....INIT 'SC02' -- SFLSR1
     C*==============================================================*
06===C           RTN291    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     MOVE *BLANKS   DCHK
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  40       *PAG RCD
|    C                     Z-ADD0         DSPRC1  40       *SFL SIZE
|    C                     MOVE 'N'       WBOTM1  1        *BOTTOM
|    C*
|    C***                  SETOF                     53    *SFLEND
|    C                     SETON                     5254  *SFLCLR
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C*
|    C           KEYIO1    SETLLIO0L
|    C*
|    C* GET公司別
|    C*          KEY#B     CHAIN#B0                  40
|   C*                    MOVE *BLANKS   #A01
|   C*                    MOVE *BLANKS   #A02
|   C*                    MOVEL'COMPANY' #A01
|   C*                    MOVELDIO01     #A02
|   C*          KEY#A     CHAIN#A0                  40
|    C*  40                MOVE *BLANKS   #A03
|    C* GET物流點
|    C           DIO02     CHAINPA#FLF               40
| 01-C           RCDN      IFEQ 'MD0L'
|   C           DIO02     CHAINME0                  40
|   C   40                MOVE *BLANKS   DSTOR
|   C  N40                MOVELME04      DSTOR
| 01*C                     ELSE
|   C                     MOVE *BLANKS   #A01
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELDIO02     #A02
|   C           KEY#A     CHAIN#A0                  40
|   C   40                MOVE *BLANKS   DSTOR
|   C  N40                MOVEL#A03      DSTOR
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN292 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN292    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN293
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN293 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN293    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C           KEYIO2    READEIO0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C           IO03      ANDLEDIO03E
|   C*
|   C                     EXSR RTN294
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C***                  SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *=========================================================*
      *          RTN294 .. DATA PROCESS
      *=========================================================*
09===C           RTN294    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     MOVE IO01      DIO01
|    C                     MOVE IO03      DIO03
|    C                     MOVE IO04      DIO04
|    C                     MOVE IO04      HIO04
|    C*
|    C           DIO04     CHAINMA0                  40
|    C   40                MOVE *BLANKS   MA03
|    C                     Z-ADDIO06      DIO06
|    C                     Z-ADDIO07      DIO07
|    C                     Z-ADDIO05      DIO05
|    C* 轉換日期
M001AC                     Z-ADDIO08      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           WIO08     PARM           S001O1  60
|    C                     MOVE IO09      HIO09
|    C                     MOVE IO10      HIO10
| 01-C           IO10      IFEQ '1'
|   C           IO10      OREQ '2'
|   C           IO04      ANDNE*BLANKS
|   C                     MOVE 'Y'       DCHK
| 01*C                     ELSE
|   C                     MOVE *BLANKS   DCHK
| 01-C                     END
|    C*
|    C                     SETON                     313233
| 02-C           IO10      IFEQ '1'
|   C                     SETOF                     32
| 02*C                     ELSE
|   C                     SETON                     32
| 02-C                     END
|    C*
| 03-C           IO09      IFEQ 'V'
|   C                     SETOF                     313233
| 03-C                     END
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN295... EXFMT SFL                                 *
      *==============================================================*
10===C           RTN295    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     94    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC2
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN29S....SAVE
     C*==============================================================*
11===C           RTN29S    BEGSR
|    C*****************
|    C* UPDATE IMIOPF *
|    C*****************
|    C                     READCSFLSR1                 5757
| 01-C           *IN57     DOWEQ'0'
|   C           *IN99     ANDEQ'0'
|   C*
| 02-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
|   C                     SETON                     313233
|   C           KEYIO3    CHAINIOL1                 40
|   C* CHK
| 03-C*          *IN40     IFEQ '0'
|   C*          DOPT1     ANDEQ'2'
|   C*          HIO10     ANDEQ'2'
|   C*          DIO04     ANDNEHIO04
|   C*                    SETON                     9199              ILE
|   C*                    SETON                     6061              ILE
|   C*                    SETON                     6263              ILE
|   C*                    Z-ADDRRN1      DRRN1                        ILE
| 03-C*                    END
|   C* SAVE
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR RTN29D                                 ILE
|   C                     UPDATIO0
| 04-C                     END
| 02-C                     END
|   C*
|   C                     UPDATSFLSR1
|   C  N99                READCSFLSR1                 5757
| 01-C                     END
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          RTN29D....SCREEN TO FILE
     C*==============================================================*
12===C           RTN29D    BEGSR
|    C*** IMIOPF
|    C           KEYIO4    CHAINIO0                  40
|    C*
| 01-C           DOPT1     IFEQ '2'
|   C                     SETOF                     32
|   C                     MOVE 'Y'       DCHK
|   C                     MOVE DIO04     IO04
|   C                     MOVE DIO04     HIO04
     C           DIO04     IFNE *BLANKS
|   C                     Z-ADDDIO06     IO06
|   C                     Z-ADDDIO07     IO07
B2000C                     Z-ADDDIO08     WIO08
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM WIO08     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    IO08
     C                     ELSE
     C                     Z-ADD0         IO06
     C                     Z-ADD0         IO07
     C                     Z-ADD0         DIO06
     C                     Z-ADD0         DIO07
     C                     Z-ADD0         IO08
     C                     Z-ADD0         DIO08
     C                     END
|   C           DIO06     ADD  DIO07     DIO05
|   C                     Z-ADDDIO05     IO05
| 01*C                     ELSE
|   C                     SETOF                     313233
|   C                     MOVE 'V'       HIO09
|   C                     MOVE 'V'       IO09
| 01-C                     END
|    C                     MOVE *BLANKS   DOPT1
|    C**
B2000C                     Z-ADDDATE      IOXX
B2000C                     TIME           IOYY
|    C                     MOVE $USER     IOZZ
|    C*
| 02-C           HIO10     IFEQ '1'
|   C                     SETOF                     32    *PROTECT FIELD
| 02*C                     ELSE
|   C                     SETON                     32
| 02-C                     END
| 03-C           HIO09     IFEQ 'V'
|   C                     SETOF                     313233*PROTECT FIELD
| 03-C                     END
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
13===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
14===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
14===C                     ENDSR'*DETC'
M001AC/COPY HBP2CVTR
