      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PIR0411                                       *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/04/24                                      *
      * UPDATE DATE  : 11/17/92 JUDY                                 *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :盤點系統                                     *
      * REMARK       :盤點單                                       *
      ****************************************************************
     FIMIOPF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#FLF  IF  E           K        DISK
     F                                              KINFDS #FRCDN
     F            #A0                               KRENAME#F0L
     F            MD0                               KRENAMEMD0L
     FPIR041P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*                                     601 601 DIO01
     I                                      601 605 DIO02
     I                                      606 6070DNUM
     I*                                     606 6070DNUM0
     I#FRCDN      DS
     I                                     *RECORD  RCDN
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYMA     KLIST
     C                     KFLD           IO04
     C           KEYME     KLIST
     C                     KFLD           IO02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C  N10                EXSR RTN010                     *INIT VALUE
     C                     EXSR RTN100                     *WRITE DETAIL
     C*
      *==============================================================*
     C*          RTN010....INIT VALUE
      *==============================================================*
01===C           RTN010    BEGSR
|    C                     Z-ADD1         PNUM    20
|    C                     SETON                     10                L
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....WRITE DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* GET公司名稱
|    C*          KEY#B     CHAIN#B0                  40
|    C*  40                MOVE *BLANKS   #B03
|    C                     MOVE *BLANKS   #A01
| 01-C           PNUM      DOUGTDNUM
|   C                     MOVE *BLANKS   #A02
|   C                     MOVEL'COMPANY' #A01
|   C                     MOVELIO01      #A02
|   C           KEY#A     CHAIN#A0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   D#A03
| 02*C                     ELSE
|   C                     MOVEL#A03      D#A03
| 02-C                     END
|   C* GET物流點
|   C           IO02      CHAINPA#FLF               40
| 03-C           RCDN      IFEQ 'MD0L'
|   C           KEYME     CHAINME0                  40
|   C   40                MOVE *BLANKS   DSTOR
|   C  N40                MOVELME04      DSTOR
| 03*C                     ELSE
|   C                     MOVE *BLANKS   #A01
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELIO02      #A02
|   C           KEY#A     CHAIN#A0                  40
|   C   40                MOVE *BLANKS   DSTOR
|   C  N40                MOVEL#A03      DSTOR
| 03-C                     END
|   C*
|   C* GET 產品名稱／單位／容積
|   C           KEYMA     CHAINMA0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   MA02
|   C                     MOVE *BLANKS   MA13
|   C                     Z-ADD0         MA15
| 04-C                     END
|   C*
|   C                     WRITEPD1
|   C*
|   C                     ADD  1         PNUM
|   C                     ENDDO
|   C                     Z-ADD1         PNUM
|   C*
02===C                     ENDSR
