     FIMIXLF02IP  E           K        DISK
     FIMI1PF  IF  E           K        DISK
     F            IX0                               KRENAMEI10
     FIMIYLF01IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPIR046APO   E             39     PRINTER
     IIX0
     I                                              IX01  L1
     I                                              IX01A L2
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I                                      601 6040DIX11
     I                                      601 6020MM
     I                                      603 6040YY
     I                                      605 609 DIY02S
     I                                      610 614 DIY02E
     I                                      615 623 DIX01S
     I                                      624 632 DIX01E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYIY     KLIST
     C                     KFLD           IX11
     C                     KFLD           IX01
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *HEADING
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CLR                   EXSR RTNLR
      *==============================================================*
     C*          RTN010....INIT VALUE
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         IXTOT
|    C                     Z-ADD0         TOT06
|    C                     Z-ADD0         TOT07
|    C                     Z-ADD0         TOT08
|    C                     Z-ADD0         TOT09
|    C                     Z-ADD0         TOT10
|    C                     Z-ADD0         TOTTO
|    C                     Z-ADD0         TOT16
|    C                     Z-ADD0         TOT17
|    C                     Z-ADD0         TOT18
|    C                     Z-ADD0         TOT19
|    C                     Z-ADD0         TOT20
|    C                     Z-ADD0         T1T06
|    C                     Z-ADD0         T1T07
|    C                     Z-ADD0         T1T08
|    C                     Z-ADD0         T1T09
|    C                     Z-ADD0         T1T10
|    C                     Z-ADD0         T1TTO
|    C                     Z-ADD0         T1T16
|    C                     Z-ADD0         T1T17
|    C                     Z-ADD0         T1T18
|    C                     Z-ADD0         T1T19
|    C                     Z-ADD0         T1T20
|    C                     Z-ADD0         T2T06
|    C                     Z-ADD0         T2T07
|    C                     Z-ADD0         T2T08
|    C                     Z-ADD0         T2T09
|    C                     Z-ADD0         T2T10
|    C                     Z-ADD0         T2TTO
|    C                     Z-ADD0         T2T16
|    C                     Z-ADD0         T2T17
|    C                     Z-ADD0         T2T18
|    C                     Z-ADD0         T2T19
|    C                     Z-ADD0         T2T20
|    C                     WRITEPH1
|    C*
|    C                     SETON                     10                L
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....READ
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
     C           IX01      CHAINMA0                  40
     C           MA07      IFEQ 'K'
     C           KEYIY     CHAINI10                  40
     C                     ENDIF
|    C*
|    C                     Z-ADDIX08      IXTOT
|    C                     ADD  IX09      IXTOT
|    C                     ADD  IX10      IXTOT
|    C*產品簡稱
|    C           IX01      CHAINMA0                  43
|    C   43                MOVE *BLANKS   MA03
|    C  N43                MOVE MA03      MA03
|    C*
|    C   39                EXSR RTN900
|    C                     ADD  IX06      TOT16
|    C                     ADD  IX07      TOT17
|    C                     ADD  IX08      TOT18
|    C                     ADD  IX09      TOT19
|    C                     ADD  IX10      TOT20
|    C                     ADD  IXTOT     TOTTO
| 01-C           IX06      IFNE 0
|   C           IX07      ORNE 0
|   C           IXTOT     ORNE 0
|   C                     WRITEPD1
|   C                     SETOF                     2122
| 01-C                     END
|    C                     EXSR RTN110
|    C*
02===C                     ENDSR
      *==============================================================*
     C*          RTN110....READ IMIYPF
      *==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C*READ IMIYPF
B2000C           KEYIY     SETLLIY0
B2000C           KEYIY     READEIY0                      42
| 01-C           *IN42     DOWEQ'0'
|   C*
| 02-C           IY02      IFGE DIY02S
|   C           IY02      ANDLEDIY02E
|   C* GET物流點
|   C           IY02      CHAINME0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELME04      DME04
| 03*C                     ELSE
|   C                     MOVE *BLANKS   #A01
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELIY02      #A02
|   C           KEY#A     CHAIN#A0                  41
|   C   41                MOVE *BLANKS   DME04
|   C  N41                MOVEL#A03      DME04
| 03-C                     END
|   C*
|   C                     ADD  IY06      TOT06
|   C                     ADD  IY07      TOT07
|   C                     ADD  IY08      TOT08
|   C                     ADD  IY09      TOT09
|   C                     ADD  IY10      TOT10
|   C*
|   C   39 22             EXSR RTN900
| 04-C           IY06      IFNE 0
|   C                     WRITEPD2
|   C                     SETON                     22
| 04-C                     END
| 02-C                     END
|   C*
B2000C           KEYIY     READEIY0                      42
| 01-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN200....PT1
     C*==============================================================*
04===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
| 01-C           TOT16     IFNE 0
|   C           TOT17     ORNE 0
|   C           TOTTO     ORNE 0
|   C           TOT06     ORNE 0
|   C                     WRITEPT1
|   C                     ADD  TOT06     T1T06
|   C                     ADD  TOT07     T1T07
|   C                     ADD  TOT08     T1T08
|   C                     ADD  TOT09     T1T09
|   C                     ADD  TOT10     T1T10
|   C                     ADD  TOT16     T1T16
|   C                     ADD  TOT17     T1T17
|   C                     ADD  TOT18     T1T18
|   C                     ADD  TOT19     T1T19
|   C                     ADD  TOT20     T1T20
|   C                     ADD  TOTTO     T1TTO
|   C                     Z-ADD0         TOT06
|   C                     Z-ADD0         TOT07
|   C                     Z-ADD0         TOT08
|   C                     Z-ADD0         TOT09
|   C                     Z-ADD0         TOT10
|   C                     Z-ADD0         TOTTO
|   C                     Z-ADD0         TOT16
|   C                     Z-ADD0         TOT17
|   C                     Z-ADD0         TOT18
|   C                     Z-ADD0         TOT19
|   C                     Z-ADD0         TOT20
|   C                     SETON                     21
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN300....PT2
     C*==============================================================*
05===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
| 01-C           T1T16     IFNE 0
|   C           T1T17     ORNE 0
|   C           T1TTO     ORNE 0
|   C           T1T06     ORNE 0
|   C                     WRITEPT2
|   C                     ADD  T1T06     T2T06
|   C                     ADD  T1T07     T2T07
|   C                     ADD  T1T08     T2T08
|   C                     ADD  T1T09     T2T09
|   C                     ADD  T1T10     T2T10
|   C                     ADD  T1T16     T2T16
|   C                     ADD  T1T17     T2T17
|   C                     ADD  T1T18     T2T18
|   C                     ADD  T1T19     T2T19
|   C                     ADD  T1T20     T2T20
|   C                     ADD  T1TTO     T2TTO
|   C                     Z-ADD0         T1T06
|   C                     Z-ADD0         T1T07
|   C                     Z-ADD0         T1T08
|   C                     Z-ADD0         T1T09
|   C                     Z-ADD0         T1T10
|   C                     Z-ADD0         T1TTO
|   C                     Z-ADD0         T1T16
|   C                     Z-ADD0         T1T17
|   C                     Z-ADD0         T1T18
|   C                     Z-ADD0         T1T19
|   C                     Z-ADD0         T1T20
|   C                     SETON                     21
| 01-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
07===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01*C                     ELSE
|   C   39                EXSR RTN900
| 02-C           T2T16     IFNE 0
|   C           T2T17     ORNE 0
|   C           T2TTO     ORNE 0
|   C           T2T06     ORNE 0
|   C                     WRITEPT3
| 02-C                     END
| 01-C                     END
|    C                     WRITEPE2
|    C*
07===C                     ENDSR
