     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : POA004                                     *
     A*    AUTHOR       : A1118  PHILIP                              *
     A*    DATE WRITTEN : 81/01/21                                   *
     A*    UPDATE DATE  : 81/04/16                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購資料建檔子系統                        *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :國外採購完稅處理 (A/U/D/I)                *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 010101 = *LOVAL/123199=123129
     A*---------------------------------------------------------------
     A*                                                              *
     A****************************************************************
     FPOPFPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FPOPFLF1 IF  E           K        DISK
     F            PF0                               KRENAMEPF0L
     FPOPGPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMAPF  IF  E           K        DISK
     FIMIAPF  UF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
B2CHKFPOA004D CF  E                    WORKSTN
B2INF *CVR3009 sev.30 DISPLAY file POA004D must be converted, because
B2INF *   field PF04 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert POA004D, enlarging PF04
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E                    WFUN    6   6  6
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
M001AI                                      201 2080DATE
 @   I*                                     139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I*  FOR (A/U/D/I)                      514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I**   SCR002 CHANGE (Y/N)
     I            DS
     I                                        1  16 SCR2CN
     I                                        1   60DPF04
     I* FOR UPDATE 完稅日期年份不能修改
     I                                        5   60PF045N
     I* FOR UPDATE 完稅日期年月須＞結案日期
     I                                        1   20PF04M
     I*保稅物流點
     I                                        7  11 DPF06
     I                                        7   7 DPF06T
     I*完稅物流點
     I                                       12  16 DPF07
     I                                       12  12 DPF07W
     I*單別第一碼讀取
     I            DS
     I                                        1   2 DPF03
     I                                        1   1 W#201
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6        *CTL
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C                     MOVE *BLANK    WQUERY  1
     C           *LIKE     DEFN DBGN0     OBGN0            *START KEY
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN0     BBGN0            *SUBFIL BUTTOM
     C*
B2MODC           *LIKE     DEFN PF04      SBGN0            *START KEY
B2MODC           *LIKE     DEFN PF04      TBGN0            *START KEY
B2MODC           *LIKE     DEFN PF04      UPF04            *START KEY
     C*
B2MODC           *LIKE     DEFN PF04      WPF04            *DATE CHK
     C           *LIKE     DEFN PG05      WPG05            *完稅量檢核
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYPF     KLIST
     C                     KFLD           DPF02
     C           KEYPF1    KLIST
     C                     KFLD           SBGN0
     C                     KFLD           DBGN1
     C           KEYPF2    KLIST
     C                     KFLD           TBGN0
     C                     KFLD           BBGN1
     C           KEYPF4    KLIST
     C                     KFLD           UPF04
     C                     KFLD           PF02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#2     KLIST
     C                     KFLD           W#201
     C                     KFLD           DPF03
     C           KEYPG1    KLIST
     C                     KFLD           DPF02
     C           KEYPG     KLIST
     C                     KFLD           DPF02
     C                     KFLD           DPG03
     C           KEYIA     KLIST
     C                     KFLD           IA01
     C                     KFLD           IA02
     C                     KFLD           IA03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN110
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $INQ      WA01,6
|    C                     MOVE 'SCR001'  APPSCR
|    C*
M002MC                     Z-ADD123129    DBGN0
M002MC                     Z-ADD123129    OBGN0
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DBGN0     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SBGN0
|    C* 日期轉換
|    C* M001D              Z-ADD0         DATE    60
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
|    C*                    PARM $EGMDY    S001I2  60
|    C*          DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9099
| 01*C                     ELSE
|   C                     EXSR RTN200
| 02-C           DRRN1     IFGT 0
|   C           DRRN1     SUB  1         HRRN1
| 02-C                     END
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 01-C                     END
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*
| 01-C           DBGN0     IFNE OBGN0
| 01-C           DBGN1     ORNE OBGN1
|    C*
     C           DBGN0     IFEQ 0
M002MC                     Z-ADD123129    DBGN0
     C                     END
|    C*
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN0     OBGN0
|   C                     MOVE DBGN1     OBGN1
| 01*C                     ELSE
| 02-C           WRRN1     IFGT 0
|   C                     EXSR RTN171
| 03-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                   57*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   57*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     96
| 05-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
| 01-C                     END
|    C   99                GOTO END180
|    C*
| 02-C           DOPT1     IFNE '1'
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C*M001M               PARM PF04      S001I2  60
M001MC                     PARM LPF04     S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    UPF04
B2???C           KEYPF4    CHAINPF0L                 40
B2INF *CVR5011 sev.50 Field UPF04 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
| 02-C                     END
|    C*
| 03-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
|   C*確認日期檢查
B2CHKC           PF11      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     608899
| 04-C                     END
|   C*結案碼檢查
| 05-C           HPF13     IFEQ 'V'
|   C                     SETON                     608799
| 05-C                     END
| 03-C                     END
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DBGN0     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SBGN0
     C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
B2???C           KEYPF1    SETLLPF0L
B2INF *CVR5011 sev.50 Field SBGN0 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR0001 sev.00 Field DBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field PF02 is not a date or year
|    C                     MOVE DBGN0     BBGN0
|    C                     MOVE DBGN1     BBGN1
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
| 02-C           BBGN0     IFNE DBGN0
| 02-C           BBGN1     ORNE DBGN1
     C*
     C           DBGN0     IFEQ 0
M002MC                     Z-ADD123129    DBGN0
     C                     END
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM BBGN0     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    TBGN0
     C*
B2???C           KEYPF2    SETGTPF0L
B2INF *CVR5011 sev.50 Field TBGN0 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR0001 sev.00 Field BBGN1 is not a date or year
B2INF *CVR0001 sev.00 Field PF02 is not a date or year
| 02-C                     END
|   C                     EXSR RTN193
B2???C*M001M               MOVE PF04      BBGN0
M001MC                     MOVE LPF04     BBGN0
B2INF *CVR5011 sev.50 Field BBGN0 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C                     MOVE PF02      BBGN1
B2000C           *LOVAL    SETLLPF0L
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANK    DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ PF0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     ADD  1         RRN1
|   C* 日期轉換
M001AC                     Z-ADDPF04      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2???C*M001M     PF04      PARM           S001O1  60
M001MC           LPF04     PARM           S001O1  60
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
     C*
M001AC                     Z-ADDPF11      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C           DPF11     PARM           S001O1  60
|   C*MOVE 結案碼 HIDDEN FIELD
|   C                     MOVE PF13      HPF13
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     95    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
|   C           DOPT1     CASEQ'6'       RTN250           *完稅明細
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLPF0
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
11===C           RTN210    BEGSR
|    C*
|    C                     SETON                     3031  *ADD MSG
|    C                     EXSR RTN261                     *CLR FIELD
|    C                     MOVE 'I2'      DPF03
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C****                 EXSR RTN263
|   C****                 WRITE#B0
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 04-C                     END
|   C*
| 02*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
|   C*FOR DATA LOCK RELEASE
|   C           *LOVAL    SETLLIA0
| 02-C                     END
|   C*
| 01-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
12===C           RTN220    BEGSR
|    C*
|    C                     SETOF                     30
|    C                     SETON                     31    *CAN INPUT
|    C           PF02      CHAINPF0                  40
     C           *LOVAL    SETLLPF0
|    C                     EXSR RTN262                     *FIEL->SCRN
|    C                     MOVE SCR2CN    SCR2CO 16        *FOR SCR2 CHANGE
|    C                     Z-ADDPF045N    PF045O  20       * FOR 年份
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'
|   C**         D#B01     CHAIN#B0                  41
|   C**                   EXSR RTN263
|   C**                   UPDAT#B0
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
|   C*FOR DATA LOCK RELEASE
|   C           *LOVAL    SETLLIA0
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
13===C           RTN230    BEGSR
|    C*
|    C                     SETOF                     3031  *NO INPUT
|    C           PF02      CHAINPF0                  40
     C           *LOVAL    SETLLPF0
|    C                     EXSR RTN262                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
|   C*FOR DATA LOCK RELEASE
|   C           *LOVAL    SETLLIA0
| 03-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
14===C           RTN240    BEGSR
|    C*
|    C                     SETOF                     3031  *NO INPUT
     C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C*M001M               PARM PF04      S001I2  60
M001MC                     PARM LPF04     S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    UPF04
     C*
B2???C           KEYPF4    CHAINPF0L                 40
B2INF *CVR5011 sev.50 Field UPF04 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C                     EXSR RTN262                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
|   C*FOR DATA LOCK RELEASE
|   C           *LOVAL    SETLLIA0
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN250....完稅明細
      *==============================================================*
15===C           RTN250    BEGSR
|    C*
|    C                     SETOF                     303132*NO INPUT
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C*M001M               PARM PF04      S001I2  60
M001MC                     PARM LPF04     S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    UPF04
B2???C           KEYPF4    CHAINPF0L                 40
B2INF *CVR5011 sev.50 Field UPF04 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C                     EXSR RTN262                     *FIEL->SCRN
|    C                     MOVE 'SCR003'  APPSCR
|    C                     EXSR RTN300
|    C                     MOVE 'SCR001'  APPSCR
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN261....CLEAR SCREEN DATA
      *==============================================================*
16===CSR         RTN261    BEGSR
|    C*
|    C                     MOVE *BLANK    DPF01
|    C                     MOVE *BLANK    DPF02
|    C                     MOVE *BLANK    DPF03
|    C                     Z-ADD$EGMDY    DPF04
|    C                     MOVE *BLANK    DPF05
|    C                     MOVE *BLANK    DPF06
|    C                     MOVE *BLANK    DPF07
|    C                     MOVE *BLANK    DPF08
|    C                     MOVE *BLANK    DPF09
|    C                     Z-ADD0         DPF10
|    C                     Z-ADD0         DPF11
|    C*
|    C                     MOVE *BLANKS   #B03
|    C                     MOVE *BLANKS   #2031
|    C                     MOVE *BLANKS   #A031
|    C                     MOVE *BLANKS   #A032
|    C*
16===CSR                   ENDSR
      *==============================================================*
      *          RTN262....MOVE DATA TO SCREEN
      *==============================================================*
17===CSR         RTN262    BEGSR
|    C*
|    C                     MOVE PF01      DPF01
|    C                     MOVE PF02      DPF02
|    C                     MOVE PF03      DPF03
|    C** DATE              Z-ADDPF04      DPF04
|    C                     MOVE PF05      DPF05
|    C                     MOVE PF06      DPF06
|    C                     MOVELPF06      DPF06T           第一碼
|    C                     MOVE PF07      DPF07
|    C                     MOVELPF07      DPF07W           第一碼
|    C                     MOVE PF08      DPF08
|    C                     MOVE PF09      DPF09
|    C                     Z-ADDPF10      DPF10
|    C** DATE              Z-ADDPF11      DPF11
|    C                     MOVE PF06      HPF06
|    C* 日期轉換
M001AC                     Z-ADDPF04      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DPF04     PARM           S001O1  60
|    C*
M001AC                     Z-ADDPF11      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DPF11     PARM           S001O1  60
|    C*
|    C* GET 公司代號
|    C           DPF01     CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B03
|    C* GET 單別
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#203      #2031
| 01*C                     ELSE
|   C                     MOVE *BLANK    #2031
| 01-C                     END
|    C* GET 保稅物流點
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELDPF06     #A02
|    C           KEY#A     CHAIN#A0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A031
| 02*C                     ELSE
|   C                     MOVE *BLANK    #A031
| 02-C                     END
|    C* GET 完稅物流點
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELDPF07     #A02
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A032
| 03*C                     ELSE
|   C                     MOVE *BLANK    #A032
| 03-C                     END
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN263....MOVE SCREEN DATA TO FILE
      *==============================================================*
18===C**         RTN263    BEGSR
|    C*
|    C*
18===C**                   ENDSR
      *==============================================================*
      *          RTN270....F5 -- 參考資料
      *==============================================================*
19===CSR         RTN270    BEGSR
|    C*
|    C                     EXSR RTN280
|    C                     SETON                     99
|    C*
19===C                     ENDSR
      *==============================================================*
      *          RTN280....CHECK 'SC02' SCREEN
      *==============================================================*
20===CSR         RTN280    BEGSR
|    C* CHK 公司
| 01-C           DPF01     IFEQ *BLANK
|   C                     SETON                     609499
| 01*C                     ELSE
|   C           DPF01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #B03
|   C                     SETON                     608999
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END280
|    C* CHK 完稅日期
| 03-C           DPF04     IFEQ 0
|   C                     SETON                     629499
| 03*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DPF04     P0901I  60
|   C                     PARM           P0901O  1
| 04-C           P0901O    IFEQ 'N'
|   C                     SETON                     629199
| 04-C                     END
| 03-C                     END
|    C   99                GOTO END280
|    C* UPDATE -- 年份不得變更
| 05-C           DOPT1     IFEQ '2'
|   C           PF045N    ANDNEPF045O
|   C                     SETON                     628899
| 05-C                     END
|    C   99                GOTO END280
|    C* UPDATE -- 年月須＞結案日期
| 06-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '2'
|   C*M001M               MOVELPF045N    PF04YM  40       * 結案年月
|   C*M001M               MOVE PF04M     PF04YM  40       * 結案年月
M001AC                     MOVE PF045N    HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    FYY4    40
M001MC                     MOVELFYY4      PF04YM  60       * 月結年月
M001MC                     MOVE PF04M     PF04YM  60       * 月結年月
|   C           DPF01     CHAIN#B0                  40
B2???C           *IN40     IFEQ '0'
B2INF *CVR5011 sev.50 Field PF04YM is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C           PF04YM    ANDLE#B16
|   C                     SETON                     628499
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END280
|    C*  日期存檔變數
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DPF04     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WPF04
|    C*保稅物流點第一碼須等於�洘犕�
| 08-C           DPF06T    IFNE 'T'
|   C                     SETON                     638799
| 08-C                     END
|    C   99                GOTO END280
|    C*完稅物流點第一碼須等於�洘暪�
| 09-C           DPF07W    IFNE 'W'
|   C                     SETON                     648699
| 09-C                     END
|    C   99                GOTO END280
|    C**
|    C* GET 保稅物流點
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELDPF06     #A02
|    C           KEY#A     CHAIN#A0                  40
| 10-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A031
| 10*C                     ELSE
|   C                     MOVE *BLANK    #A031
|   C                     SETON                     638999
| 10-C                     END
|    C   99                GOTO END280
|    C**
|    C* GET 完稅物流點
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'STORAGE' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELDPF07     #A02
|    C           KEY#A     CHAIN#A0                  40
| 11-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A032
| 11*C                     ELSE
|   C                     MOVE *BLANK    #A032
|   C                     SETON                     648999
| 11-C                     END
|    C   99                GOTO END280
|    C**
|    C*物流點改變，檢查可用量是否足夠
| 12-C           DOPT1     IFEQ '2'
|   C           DPF06     ANDNEHPF06
|   C                     EXSR RTN281
| 12-C                     END
|    C   99                GOTO END280
|    C*
20===CSR         END280    ENDSR
      *==============================================================*
      *          RTN281....CHECK 'SC02' SCREEN -2
      *==============================================================*
21===CSR         RTN281    BEGSR
|    C*
|    C           KEYPG1    SETLLPG0
|    C           KEYPG1    READEPG0                      44*NF/EOF
| 01-C           *IN44     DOWEQ'0'
     C                     MOVELDPF01     IA01
|   C                     MOVE DPF06     IA02
|   C                     MOVE PG03      IA03
|   C           KEYIA     CHAINIA0                  40
     C           *LOVAL    SETLLIA0
| 02-C           *IN40     IFEQ '1'
|   C                     SETON                     638599
| 02*C                     ELSE
|   C           IA10      SUB  PG05      IA10
| 03-C           IA10      IFLT 0
|   C                     SETON                     638599
| 03-C                     END
|   C   99                GOTO END281
| 02-C                     END
|   C*
|   C           KEYPG1    READEPG0                      44*NF/EOF
| 01-C                     END
     C           *LOVAL    SETLLPG0
|    C*DATA LOCK RELEASE
|    C           *LOVAL    SETLLIA0
|    C*
21===CSR         END281    ENDSR
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
22===C           RTN300    BEGSR
|    C*
     C                     Z-ADDDPF10     HPF10
     C                     Z-ADDDPF10     XPF10
|    C*
| 01-C           DOPT1     CASEQ'1'       RTN310           *ADD
|   C           DOPT1     CASEQ'2'       RTN320           *UPD
|   C           DOPT1     CASEQ'4'       RTN330           *DLT
|   C           DOPT1     CASEQ'5'       RTN340           *INQ
|   C           DOPT1     CASEQ'6'       RTN340           *完稅明細
| 01-C                     END
|    C   12                SETOF                     12
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          RTN310....ADD DATA --- SFLSR
     C*==============================================================*
23===C           RTN310    BEGSR
|    C*
|    C                     SETON                     3233
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN397                     *READ BLANK
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C                     EXSR RTN39S                     *SAVE
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLPG0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*          RTN320....UPD DATA --- SFLSR
     C*==============================================================*
24===C           RTN320    BEGSR
|    C*
|    C                     SETON                     33
|    C                     SETOF                     32
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA
|    C                     EXSR RTN397                     *READ BLANK
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C                     EXSR RTN39S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLPG0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
24===C                     ENDSR
     C*==============================================================*
     C*          RTN330....DEL DATA --- SFLSR2
     C*==============================================================*
25===C           RTN330    BEGSR
|    C*
|    C                     SETOF                     3233  *NO INPUT
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 06-C           DLTFLG    IFEQ 'Y'
|   C                     EXSR RTN39T                      DLT D
| 06-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLPG0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
25===C                     ENDSR
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR2
     C*==============================================================*
26===C           RTN340    BEGSR
|    C*
|    C                     SETOF                     3233  *NO INPUT
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLPG0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
26===C                     ENDSR
     C*==============================================================*
     C*          RTN380....CHECK 'SC03' --- SFLSR
     C*==============================================================*
27===C           RTN380    BEGSR
     C*
     C                     Z-ADDHPF10     XPF10
|    C*
|    C*CHK SCREEN
|    C                     SETON                     54
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*
|   C                     SETOF                     606162
|   C                     SETOF                     63
|   C*                                  DATA ENTRY & *IN99 OFF ->CHECK
| 02-C           DCHK      IFEQ 'Y'
|   C                     SETOF                     32
| 02*C                     ELSE
|   C                     SETON                     32
| 02-C                     END
|   C   99                GOTO UPD
|   C*
| 03-C           DCHK      IFEQ 'Y'
| 04-C           DOPT2     IFEQ '1'
|   C                     SETON                     609299
| 04-C                     END
| 03*C                     ELSE
| 05-C           DOPT2     IFEQ '2'
|   C           DOPT2     OREQ '4'
|   C                     SETON                     609399
| 05-C                     END
| 03-C                     END
|   C   99                GOTO DSP
|   C*產品代號檢查
| 06-C           DOPT2     IFNE *BLANK
| 07-C           DPG03     IFEQ *BLANK
|   C                     SETON                     619499
| 07*C                     ELSE
|   C* GET 產品名稱
|   C           DPG03     CHAINMA0                  40
|   C   40                MOVE *BLANK    MA06
|   C   40                MOVE *BLANK    MA13
|   C   40                Z-ADD0         MA16
     C                     MOVELDPF01     IA01
|   C                     MOVE DPF06     IA02
|   C                     MOVE DPG03     IA03
|   C           KEYIA     CHAINIA0                  40
     C           *LOVAL    SETLLIA0
| 08-C           *IN40     IFEQ '1'
|   C                     SETON                     618999
| 08-C                     END
| 07-C                     END
| 06-C                     END
|   C   99                GOTO DSP
|   C*
|   C* CHK 完稅量 IA10(可用量) GET FROM 產品代號檢核
| 09-C           DOPT2     IFNE *BLANK
|   C           DPG03     ANDNE*BLANK
| 10-C           DPG05     IFEQ 0
| 11-C           DOPT2     IFNE '4'
|   C                     SETON                     628799
| 11-C                     END
| 10*C                     ELSE
|   C                     Z-ADD0         WPG05
|   C           HPG05     SUB  DPG05     WPG05
|   C           IA10      ADD  WPG05     IA10
| 12-C           IA10      IFLT 0
|   C                     SETON                     628899
| 12-C                     END
| 10-C                     END
| 09-C                     END
|   C   99                GOTO DSP
|   C* 公賣利益IF =0  **
| 13-C           DPG06     IFEQ 0
|   C           DPG03     CHAINMA0                  40
| 14-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         MA25
| 14-C                     END
|   C           MA25      MULT DPG05     DPG06   80H
| 13-C                     END
|   C*
|   C           DSP       TAG
|   C   99                Z-ADDRRN2      DRRN2
|   C*
|   C           UPD       TAG
|   C                     UPDATSFLSR2
     C*
     C           KEYPG     CHAINPG0                  49
     C           *LOVAL    SETLLPG0
     C*
     C           DOPT2     IFEQ '1'
     C                     ADD  DPG06     XPF10
     C                     END
     C*
     C           DOPT2     IFEQ '2'
     C                     ADD  DPG06     XPF10
     C                     SUB  PG06      XPF10
     C                     END
     C*
     C           DOPT2     IFEQ '4'
     C                     SUB  DPG06     XPF10
     C                     END
     C*
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
|    C*
|    C* FOR DATA LOCK
|    C           END380    TAG
|    C           *LOVAL    SETLLIA0
|    C********************
| 15-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 15-C                     END
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
27===C                     ENDSR
     C*==============================================================*
     C*          RTN381....CHECK 'SC03' --- SFLSR
     C*==============================================================*
28===C           RTN381    BEGSR
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
|    C*CHK SCREEN
|    C                     SETOF                     38
|    C                     SETON                     54
|    C                     SETOF                     606162
|    C                     SETOF                     63
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*
| 02-C           DCHK      IFEQ 'Y'
|   C                     SETOF                     32
| 02*C                     ELSE
|   C                     SETON                     32
| 02-C                     END
|   C*挑選產品代號
|   C                     MOVELDPG03     WQUERY
| 03-C           WQUERY    IFEQ '?'
|   C                     CALL 'WDS001'
|   C           DPG03     PARM DPG03     SD01O1  9
|   C                     SETON                     38
|   C                     MOVELDPG03     WQUERY
| 04-C           WQUERY    IFEQ '?'
|   C                     MOVEL' '       DPG03
| 04-C                     END
| 03-C                     END
|   C   38                GOTO UPD1
|   C*
|   C           UPD1      TAG
|   C                     UPDATSFLSR2
|   C*
| 05-C           *IN38     IFEQ '1'
|   C                     SETON                     37
|   C                     WRITEDSPC3
|   C                     WRITESFLCR2
|   C                     SETOF                     3738
| 05-C                     END
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
|    C*
|    C                     SETON                     99
|    C*
28===C           END381    ENDSR
     C*==============================================================*
     C*          RTN391....INIT 'SC03' -- SFLSR2
     C*==============================================================*
29===C           RTN391    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD160       DSPRC2  40
|    C                     Z-ADD8         WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     5250
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYPG1    SETLLPG0
|    C*
29===C                     ENDSR
     C*==============================================================*
     C*          RTN397....FILE TO SCREEN --- SFLSR(FOR ADD OR UPD)
     C*==============================================================*
30===C           RTN397    BEGSR
|    C*
|    C                     SETOF                     54    *45 FOR BLANK LOOP
|    C                     SETON                     32
|    C                     EXSR RTN39A                     *INIT SFLDTA
|    C*
| 01-C           RRN2      DOWLTDSPRC2
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
| 01-C                     END
|    C*
|    C                     SETON                     50
|    C*
30===C                     ENDSR
     C*==============================================================*
     C*          RTN398....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
31===C           RTN398    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '2'
|   C           SCR2CN    ANDNESCR2CO
|   C           DOPT1     OREQ '2'
|   C           DPF06     ANDNEHPF06
|   C                     SETON                     54
| 01*C                     ELSE
|   C                     SETOF                     54
| 01-C                     END
|    C*
|    C           KEYPG1    READEPG0                      44*NF/EOF
|    C*
| 02-C           *IN44     DOWEQ'0'
|   C                     EXSR RTN39B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           KEYPG1    READEPG0                      44*NF/EOF
| 02-C                     END
|    C*
|   C           *LOVAL    SETLLPG0
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
| 03-C           DOPT1     IFEQ '5'
|   C           DOPT1     OREQ '6'
|   C           *LOVAL    SETLLPG0
| 03-C                     END
|    C*RELEASE DATA LOCK
|    C           *LOVAL    SETLLIA0
|    C*
31===C                     ENDSR
     C*==============================================================*
     C*          RTN39A....INIT 'SC03' -- SFLSR(DTA)
     C*==============================================================*
32===C           RTN39A    BEGSR
|    C*
|    C                     MOVE *BLANK    DCHK
|    C                     MOVE *BLANKS   DOPT2
|    C                     MOVE *BLANKS   DPG03
|    C                     MOVE *BLANKS   MA06
|    C                     MOVE *BLANKS   MA13
|    C                     Z-ADD0         MA16
|    C                     Z-ADD0         IA10
|    C                     Z-ADD0         DPG05
|    C                     Z-ADD0         DPG06
|    C                     Z-ADD0         HPG05
|    C*
32===C                     ENDSR
     C*==============================================================*
     C*          RTN39B....FILE TO SCREEN --- MOVE
     C*==============================================================*
33===C           RTN39B    BEGSR
|    C*
|    C                     MOVE 'Y'       DCHK
|    C                     MOVE *BLANKS   DOPT2
|    C                     MOVE PG03      DPG03
|    C                     Z-ADDPG05      DPG05
|    C                     Z-ADDPG05      HPG05
|    C                     Z-ADDPG06      DPG06
|    C*
|    C* GET 產品名稱
|    C           DPG03     CHAINMA0                  40
|    C   40                MOVE *BLANK    MA06
|    C   40                MOVE *BLANK    MA13
|    C   40                Z-ADD0         MA16
     C                     MOVELDPF01     IA01
|    C                     MOVE DPF06     IA02
|    C                     MOVE DPG03     IA03
|    C           KEYIA     CHAINIA0                  40
     C           *LOVAL    SETLLIA0
|    C   40                Z-ADD0         IA10
|    C* GET 保稅量 物流點改變則保稅量須先扣除完稅量
| 01-C           *IN40     IFEQ '0'
|   C           DPF06     ANDNEHPF06
|   C           IA10      SUB  DPG05     IA10
| 01-C                     END
|    C*
33===C                     ENDSR
     C*==============================================================*
     C*          RTN39C....SCREEN TO FILE --- H
     C*==============================================================*
34===C           RTN39C    BEGSR
|    C*
|    C                     MOVE DPF01     PF01
|    C                     MOVE DPF02     PF02
|    C                     MOVE DPF03     PF03
B2???C                     Z-ADDWPF04     PF04
B2INF *CVR5011 sev.50 Field WPF04 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C                     MOVE DPF05     PF05
|    C                     MOVE DPF06     PF06
|    C                     MOVE DPF07     PF07
|    C                     MOVE DPF08     PF08
|    C                     MOVE DPF09     PF09
|    C                     Z-ADDDPF10     PF10
|    C*DATE                Z-ADDDPF11     PF11
| 01-C           DOPT1     IFEQ '1'
|   C                     MOVE 'I2'      PF03
|   C                     Z-ADD0         PF11
|   C                     MOVE *BLANK    PF12
|   C                     MOVE *BLANK    PF13
| 01-C                     END
|    C*
B2???C                     Z-ADDDATE      PFXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           PFYY
|    C                     MOVE $USER     PFZZ
|    C*
34===C                     ENDSR
     C*==============================================================*
     C*          RTN39D....SCREEN TO FILE --- D
     C*==============================================================*
35===C           RTN39D    BEGSR
|    C*
| 01-C           DOPT2     IFNE *BLANK
|   C                     MOVE DPG03     PG03
|   C                     Z-ADDDPG05     PG05
|   C                     Z-ADDDPG06     PG06
| 02-C           DOPT2     IFEQ '1'
|   C                     MOVE DPF01     PG01
|   C                     MOVE DPF02     PG02
|   C                     Z-ADD0         PG07
|   C                     Z-ADD0         PG08
|   C                     MOVE *BLANK    PG09
| 02-C                     END
| 01-C                     END
B2???C                     Z-ADDWPF04     PG04
B2INF *CVR5011 sev.50 Field WPF04 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C                     MOVE DPF06     PG10
|    C                     MOVE DPF07     PG11
|    C           DPG03     CHAINMA0                  42
     C           *IN42     IFEQ '0'
     C           PG05      MULT MA31      PG12      H
     C           PG05      MULT MA32      PG13      H
     C                     ELSE
     C                     Z-ADD0         PG12
     C                     Z-ADD0         PG13
     C                     END
|    C*
B2???C                     Z-ADDDATE      PGXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           PGYY
|    C                     MOVE $USER     PGZZ
|    C*
35===C                     ENDSR
     C*==============================================================*
     C*          RTN39F....UPDATE OTHER FILE
     C*==============================================================*
36===C           RTN39F    BEGSR
|    C*
|    C*庫存異動存檔
|    C*****************
|    C* UPDATE IMIAPF *
|    C*****************
|    C*
|    C*刪除時，將原出貨物流點數量還原
| 01-C           DOPT1     IFEQ '4'                          3
|   C           DOPT2     OREQ '4'
     C                     MOVELDPF01     IA01
|   C                     MOVE HPF06     IA02
|   C                     MOVE PG03      IA03
|   C           KEYIA     CHAINIA0                  40
| 02-C           *IN40     IFEQ '0'                          4
|   C                     SUB  PG05      IA09
|   C                     ADD  PG05      IA10
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
|   C                     UPDATIA0
| 02-C                     END                              4
| 01-C                     END                              3
|    C********
| 03-C           DPF06     IFEQ HPF06                        1
|   C*保稅物流點未變，庫存資料不移轉
| 04-C           DOPT2     IFEQ '1'                          2
|   C           DOPT2     OREQ '2'
     C                     MOVELDPF01     IA01
|   C           KEYIA     CHAINIA0                  40
| 05-C           *IN40     IFEQ '0'                          3
|   C                     SUB  PG05      IA09
|   C                     ADD  PG05      IA10
|   C                     ADD  DPG05     IA09
|   C                     SUB  DPG05     IA10
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
|   C                     UPDATIA0
| 05-C                     END                               3
| 04*C                     ELSE                              2E
|   C*
| 04-C                     END                              2
|   C****
| 03*C                     ELSE                             1E
|   C*保稅物流點改變，庫存資料全部移轉
| 06-C           DOPT1     IFEQ '2'
|   C           DOPT2     ANDNE'4'
| 07-C           DOPT2     IFNE '1'
     C                     MOVELDPF01     IA01
|   C                     MOVE HPF06     IA02
|   C                     MOVE DPG03     IA03
|   C           KEYIA     CHAINIA0                  40
| 08-C           *IN40     IFEQ '0'
|   C                     SUB  PG05      IA09
|   C                     ADD  PG05      IA10
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
|   C                     UPDATIA0
| 08-C                     END
| 07-C                     END
     C                     MOVELDPF01     IA01
|   C                     MOVE DPF06     IA02
|   C                     MOVE DPG03     IA03
|   C           KEYIA     CHAINIA0                  40
| 09-C           *IN40     IFEQ '0'
|   C*產品代號重複，完稅量加舊數量減新數量
| 10-C           DOPT2     IFEQ '1'
|   C                     SUB  PG05      IA09
|   C                     ADD  PG05      IA10
| 10-C                     END
|   C                     ADD  DPG05     IA09
|   C                     SUB  DPG05     IA10
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
|   C                     UPDATIA0
| 09-C                     END
| 06-C                     END
| 11-C           DOPT1     IFEQ '1'
     C                     MOVELDPF01     IA01
|   C                     MOVE DPF06     IA02
|   C                     MOVE DPG03     IA03
|   C           KEYIA     CHAINIA0                  40
| 12-C           *IN40     IFEQ '0'
|   C                     SUB  PG05      IA09
|   C                     ADD  PG05      IA10
|   C                     ADD  DPG05     IA09
|   C                     SUB  DPG05     IA10
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
|   C                     UPDATIA0
| 12-C                     END
| 11-C                     END
| 03-C                     END
|    C*********
36===C                     ENDSR
     C*==============================================================*
     C*          RTN39S....SAVE D
     C*==============================================================*
37===C           RTN39S    BEGSR
|    C* GET 驗收單號
| 01-C           DOPT1     IFEQ '1'
|   C                     CALL 'RES003'
|   C                     PARM DPF01     S003I1  2
|   C                     PARM DPF03     S003I2  2
|   C                     PARM PF045N    S003I3  20
|   C           DPF02     PARM           S003O1 12
| 01-C                     END
|    C*公賣利益重新合計
|    C******               Z-ADD0         DPF10
|    C                     Z-ADD0         PG06
|    C*****************
|    C* UPDATE POPGPF *
|    C*****************
|    C                     READCSFLSR2                   57
| 02-C           *IN57     DOWEQ'0'
|   C*庫存檔
|   C                     MOVE DPF06     IA02
|   C                     MOVE DPG03     IA03
|   C*
| 03-C           DOPT2     IFEQ '1'
|   C           KEYPG     CHAINPG0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     EXSR RTN39F
|   C*公賣利益重新計算（個別產品）
|   C                     SUB  PG06      DPF10
|   C                     EXSR RTN39D
|   C                     ADD  DPG06     DPF10
|   C                     UPDATPG0
| 04*C                     ELSE
|   C                     Z-ADD0         PG05
|   C                     ADD  DPG06     DPF10
|   C                     EXSR RTN39F
|   C                     EXSR RTN39D
|   C                     WRITEPG0
| 04-C                     END
| 03-C                     END
|   C*
| 05-C           DOPT2     IFEQ '2'
|   C           KEYPG     CHAINPG0                  40
| 06-C           *IN40     IFEQ '0'
|   C                     SUB  PG06      DPF10
|   C                     ADD  DPG06     DPF10
|   C                     EXSR RTN39F
|   C                     EXSR RTN39D
|   C                     UPDATPG0
| 06-C                     END
| 05-C                     END
|   C*
| 07-C           DOPT2     IFEQ '4'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 08-C           DLTFLG    IFEQ 'Y'
|   C           KEYPG     CHAINPG0                  40
| 09-C           *IN40     IFEQ '0'
|   C                     SUB  PG06      DPF10
|   C                     EXSR RTN39F
|   C                     DELETPG0
| 09-C                     END
| 08*C                     ELSE
|   C******               ADD  DPG06     DPF10
| 08-C                     END
|   C                     SETON                     37
|   C                     WRITEDSPC3
|   C                     WRITESFLCR2
|   C                     SETOF                     37
| 07-C                     END
|   C*完稅日期，保稅物流點，完稅物點更動，明細資料全部更動
| 10-C           DOPT1     IFEQ '2'
|   C           DOPT2     ANDEQ*BLANK
|   C           SCR2CN    ANDNESCR2CO
|   C           KEYPG     CHAINPG0                  40
| 11-C           *IN40     IFEQ '0'
|   C                     EXSR RTN39D
|   C                     UPDATPG0
| 11-C                     END
| 10-C                     END
|   C*CHANGE MODE
|   C*保稅物流點改變，庫存資料全部更動
| 12-C           DOPT1     IFEQ '2'
|   C           DPF06     ANDNEHPF06
|   C           DOPT2     ANDEQ' '
|   C           KEYPG     CHAINPG0                  40
     C           *LOVAL    SETLLPG0
| 13-C           *IN40     IFEQ '0'
|   C                     EXSR RTN39F
| 13-C                     END
| 12-C                     END
|   C*
|   C*公賣利益合計 －刪除時不累加
| 14-C****       DOPT2     IFNE '4'
|   C*                    ADD  PG06      DPF10
|   C*                    Z-ADD0         PG06
| 14-C***                  END
|   C*
|   C                     READCSFLSR2                   57
| 02-C                     END
|    C*****************
|    C* UPDATE POPFPF *
|    C*****************
| 15-C           DOPT1     IFEQ '1'
|   C                     EXSR RTN39C
B2???C                     Z-ADDDATE      PFXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           PFYY
|   C                     MOVE $USER     PFZZ
|   C                     WRITEPF0
|   C                     SETON                     80
| 15-C                     END
|    C*
| 16-C           DOPT1     IFEQ '2'
|   C           KEYPF     CHAINPF0                  40
|   C                     EXSR RTN39C
B2???C                     Z-ADDDATE      PFXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           PFYY
|   C                     MOVE $USER     PFZZ
|   C                     UPDATPF0
| 16-C                     END
|    C*
37===C                     ENDSR
     C*==============================================================*
     C*          RTN39T....DLT D
     C*==============================================================*
38===C           RTN39T    BEGSR
|    C* DLT DETAIL
|    C           KEYPG1    SETLLPG0
|    C           KEYPG1    READEPG0                      44
| 01-C           *IN44     DOWEQ'0'
|   C                     EXSR RTN39F
|   C                     DELETPG0
|   C           KEYPG1    READEPG0                      44
| 01-C                     END
|    C* DLT HEADER
|    C           KEYPF     CHAINPF0                  40
|    C                     DELETPF0
|    C*
38===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
39===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
39===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
40===C           RTNF4     BEGSR
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C********************
|    C*  FOR  SCR002     *
|    C********************
| 01-C           APPSCR    IFEQ 'SCR002'
|   C**
| 02-C           D#ROW     IFEQ 14
|   C           D#COL     ANDGE16
|   C           D#COL     ANDLE20
|   C                     CALL 'WDS012'
|   C                     PARM 'STORAGE' PARMI1
|   C           DPF06     PARM DPF06     PARMO1
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 15
|   C           D#COL     ANDGE16
|   C           D#COL     ANDLE20
|   C                     CALL 'WDS012'
|   C                     PARM 'STORAGE' PARMI1
|   C           DPF07     PARM DPF07     PARMO1
| 03-C                     END
|   C*
|   C** SCR002
| 01-C                     END
|    C*
|    C                     SETON                     99
|    C*
40===C           ENDF4     ENDSR
     C*
     C*
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
41===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
41===C                     ENDSR'*DETC'
M001AC/COPY HBP2CVTR
**
新增修改      刪除查詢完稅
