      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POA008                                        *
      * AUTHER       : A1118 PHILIP                                  *
      * CREATE DATE  : 81/01/14                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購資料子系統                               *
      * REMARK       :採購單批次結案                               *
      ****************************************************************
     FPOPBPF  UP  E           K        DISK
     FPOPCPF  UF  E           K        DISK
     I           UDS
     I                                      601 606 WPB04
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100
     C*
     C   LR                RETRN
     C*==============================================================*
     C*          RTN100....GET HEADING  FILE
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*設結案檢查SWITCH (WCHKSW)  1=可結案  0=不可結案
|    C                     Z-ADD1         WCHKSW  10
|    C*檢查該採購單是否全部產品之採購量＝己收量
|    C*若相等，表可結案 WCHKSW = 1
|    C                     EXSR RTN110                       *CHK RTN
|    C*
| 01-C           WCHKSW    IFEQ 1
|   C*採購明細檔資料結案
|   C                     EXSR RTN200
|   C*採購主檔資料結案
|   C                     MOVE 'V'       PB19
|   C                     UPDATPB0
| 01-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....CHECK DATA
      *==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C           PB02      SETLLPC0
|    C           PB02      READEPC0                      41
|    C*
| 01-C           *IN41     DOWEQ'0'
| 02-C           PC06      IFNE PC11
|   C                     Z-ADD0         WCHKSW
|   C                     GOTO CHKEND
| 02-C                     END
|   C           PB02      READEPC0                      41
| 01-C                     END
     C           *LOVAL    SETLLPC0
|    C*
02===C           CHKEND    ENDSR
      *==============================================================*
      *          RTN200....GET DETAIL  FILE
      *==============================================================*
03===C           RTN200    BEGSR
|    C*採購明細檔資料結案
|    C*
|    C           PB02      SETLLPC0
|    C           PB02      READEPC0                      41
| 01-C           *IN41     DOWEQ'0'
|   C                     MOVE 'V'       PC12
|   C                     UPDATPC0
|   C           PB02      READEPC0                      41
| 01-C                     END
|    C*
03===C                     ENDSR
