     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : POA006                                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/01/22                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購資料建檔子系統                        *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :採購單人工結案                            *
     A*                                                              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.10.19 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     FPOPBPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FPOPCPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FPOPBLF1 IF  E           K        DISK
     F            PB0                               KRENAMEPB0L
     FMTMAPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
     FMTMBLF  IF  E           K        DISK
B2CHKFPOA006D CF  E                    WORKSTN
B2INF *CVR3010 sev.30 DISPLAY file POA006D must be converted, because file
B2INF *   PB04 (and more) are shared by name with other database fields
B2INF *   which require to be expanded. Please convert POA006D, enlarging
B2INF *   all involved fields prior to compilation, or manually insert in
B2INF *   this source the proper RENAME and MOVE statements to avoid name
B2INF *   sharing
     F*                                             KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        5  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I*                                     139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I*                                     514 521 $#101
M001AI                                      201 2080$EG8
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP ARRAY
     I*           DS
     I*                                       1  40 F4A
     I*                                       1   3 DPA08
     I*                                      11  12 DPA07
     I*                                      21  22 DPA10
     I*                                      31  32 DPA11
     I* FOR F4 HELP -- GET CURSOR POSITION
     I*DSPFDS      DS
     I*                                   B 370 3710#CSR
     I**   SCR002 CHANGE (Y/N)
     I*           DS
     I*                                       1  21 SCR2CN
     I*                                       1   60DPA04
     I*                                       7   9 WPA08
     I*                                      10  11 WPA07
     I*                                      12  13 WPA10
     I*                                      14  15 WPA11
     I*                                      16  210DPA06
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C                     MOVE *BLANKS   APPSCR  6
     C*                    MOVE *BLANK    WQUERY  1
M001MC           *LIKE     DEFN DBGN0     OBGN0            *START KEY
     C           *LIKE     DEFN DBGN      OBGN             *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
M001MC           *LIKE     DEFN DBGN0     BBGN0            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN      BBGN             *SUBFIL BUTTOM
     C*
B2MODC           *LIKE     DEFN DBGN0     SBGN0 + 2        *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN0     TBGN0 + 2        *SUBFIL BUTTOM
B2000C*M001D     *LIKE     DEFN PB04      SPB04            *SUBFIL BUTTOM
     C*
M001AC           *LIKE     DEFN DBGN0     WSBGN0           *SUBFIL BUTTOM
M001AC           *LIKE     DEFN DBGN0     WTBGN0           *SUBFIL BUTTOM
     C*
     C                     MOVE *ZEROS    TPC12   60       *TOTAL RCD  OM
     C                     MOVE *ZEROS    VPC12   60       *'V' RCD    OM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYPB1    KLIST
     C                     KFLD           SBGN0
     C                     KFLD           DBGN
M001DC*          KEYPB2    KLIST
M001DC*                    KFLD           SPB04
M001DC*                    KFLD           PB02
     C           KEYPB3    KLIST
     C                     KFLD           TBGN0
     C                     KFLD           BBGN
     C           KEYPB4    KLIST
     C                     KFLD           PB02
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYPC     KLIST
     C                     KFLD           PB02
     C                     KFLD           PC03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*                    MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C*                    MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M001MC                     Z-ADD123192    OBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2CHKC                     Z-ADD123192    DBGN0
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M001MC           DBGN0     IFNE OBGN0
M001MC           DBGN      ORNE OBGN
B2INF *CVR0001 sev.00 Field DBGN is not a date or year
B2INF *CVR0001 sev.00 Field OBGN is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C*
B2CHKC           DBGN0     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     Z-ADD123192    DBGN0
     C                     END
     C*
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M001MC                     MOVE DBGN0     OBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN      OBGN
| 01*C                     ELSE
| 02-C           WRRN1     IFGT 0
|   C                     EXSR RTN171
| 03-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C*          UPD       TAG
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     97
| 05-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C   99                GOTO END180
|    C*
04===C           END180    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C*                    PARM DBGN0     S001I2  80
M001MC                     PARM DBGN0     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC*M001M     SBGN0     PARM           S001O1  80
M001MC           WSBGN0    PARM           S001O1  60
M001AC                     MOVE WSBGN0    HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    SBGN0
     C*
B2000C           KEYPB1    SETLLPB0L
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M001MC                     MOVE DBGN0     BBGN0
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     MOVE DBGN      BBGN
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M001MC           BBGN0     IFNE DBGN0
M001MC           BBGN      ORNE DBGN
B2INF *CVR0001 sev.00 Field BBGN is not a date or year
B2INF *CVR0001 sev.00 Field DBGN is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2MODC*M001                PARM BBGN0     S001I2  80
M001MC                     PARM BBGN0     S001I2  60
B2MODC*M001      TBGN0     PARM           S001O1  80
M001MC           WTBGN0    PARM           S001O1  60
M001AC                     MOVE WTBGN0    HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    TBGN0
     C*
B2000C           KEYPB3    SETGTPB0L
| 02-C                     END
|   C                     EXSR RTN193
B2MODC*                    Z-ADD0         PB041   80
M001MC                     Z-ADD0         PB041   60
|   C* 日期轉換
M001AC                     Z-ADDPB04      WPB04   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001                PARM PB04      S001I2  80
M001MC                     PARM WPB04     S001I2  60
B2MODC*M001      PB041     PARM           S001O1  80
M001MC           PB041     PARM           S001O1  60
     C*
B2000C                     MOVE PB041     BBGN0
|   C                     MOVE PB02      BBGN
B2000C           *LOVAL    SETLLPB0L
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ PB0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*
|   C           PB05      CHAINMB0                  40
|   C* 日期轉換
M001AC                     Z-ADDPB04      WPB04   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001                PARM PB04      S001I2  80
M001MC                     PARM WPB04     S001I2  60
B2MODC*          DPB04     PARM           S001O1  80
M001MC           DPB04     PARM           S001O1  60
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
|   C*          KEYPB2    SETGTPB0L
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     96    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
09===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C*          DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C*          DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLPB0
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
10===C           RTN220    BEGSR
|    C*
|    C           PB02      CHAINPB0                  40
     C           *LOVAL    SETLLPB0
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C*
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN14     CASEQ'1'       RTN29S
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'
|   C           *IN14     ANDEQ'0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
11===C           RTN240    BEGSR
|    C*
|   C* 日期轉換
|   C*M001D               CALL 'RES001'
|   C*M001D               PARM 'MDY'     S001I1  3
B2MODC*M001D               PARM PB04      S001I2  80
B2MODC*M001D     SPB04     PARM           S001O1  80
|   C*
|    C           KEYPB4    CHAINPB0                  40
     C           *LOVAL    SETLLPB0
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
12===CSR         RTN252    BEGSR
|    C* GET 公司代號
|    C           PB01      CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B03
|    C* GET 單別
|    C                     MOVELPB03      #201
|    C                     MOVELPB03      #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#203      DOC
| 01*C                     ELSE
|   C                     MOVE *BLANK    DOC
| 01-C                     END
|    C*
M001AC                     Z-ADDPB04      WPB04   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001                PARM PB04      S001I2  80
M001MC                     PARM WPB04     S001I2  60
B2MODC*          PB04      PARM           S001O1  80
M001MC           DPB042    PARM           S001O1  60
|    C*
M001AC                     Z-ADDPB06      WPB06   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001                PARM PB06      S001I2  80
M001MC                     PARM WPB06     S001I2  60
B2MODC*          PB06      PARM           S001O1  80
M001MC           DPB06     PARM           S001O1  60
|    C* GET 供應商代號
|    C           PB05      CHAINMB0                  40
|    C   40                MOVE *BLANK    MB02
|    C* GET 幣別
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'CURRENCY'#A01
|    C                     MOVELPB07      #A02
|    C           KEY#A     CHAIN#A0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DCURR
| 02*C                     ELSE
|   C                     MOVE *BLANK    DCURR
| 02-C                     END
|    C* GET 付款條件
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'PAYMENT' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELPB09      #A02
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DPAY
| 03*C                     ELSE
|   C                     MOVE *BLANK    DPAY
| 03-C                     END
|    C* GET 價格條件
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'PRICE'   #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELPB10      #A02
|    C           KEY#A     CHAIN#A0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DPRICE
| 04*C                     ELSE
|   C                     MOVE *BLANK    DPRICE
| 04-C                     END
|    C* GET 運輸方式
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'DELIVERY'#A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELPB12      #A02
|    C           KEY#A     CHAIN#A0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DELIV
| 05*C                     ELSE
|   C                     MOVE *BLANK    DELIV
| 05-C                     END
|    C*
M001AC                     Z-ADDPB14      WPB14   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001                PARM PB14      S001I2  80
M001MC                     PARM WPB14     S001I2  60
B2MODC*M001      PB14      PARM           S001O1  80
M001MC           DPB14     PARM           S001O1  60
|    C*
M001AC                     Z-ADDPB15      WPB15   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001                PARM PB15      S001I2  80
M001MC                     PARM WPB15     S001I2  60
B2MODC*M001      PB15      PARM           S001O1  80
M001MC           DPB15     PARM           S001O1  60
|    C*
12===CSR                   ENDSR
      *==============================================================*
      *          RTN29S....F14-- 整張結案
      *==============================================================*
13===CSR         RTN29S    BEGSR
|    C*
|    C           PB02      CHAINPB0                  40
|    C                     EXSR RTN39C
|    C                     MOVE 'V'       PB19
|    C                     UPDATPB0
|    C*
|    C           PB02      SETLLPC0
|    C           PB02      READEPC0                      44
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C                     MOVE 'V'       PC12
B2000C                     TIME           PCYY
|   C                     UPDATPC0
|   C           PB02      READEPC0                      44
| 01-C                     END
|    C*
|    C                     MOVE 'SCR001'  APPSCR
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
14===C           RTN300    BEGSR
|    C*
| 01-C*          DOPT1     CASEQ'1'       RTN310           *ADD
|   C           DOPT1     CASEQ'2'       RTN320           *UPD
|   C*          DOPT1     CASEQ'4'       RTN330           *DLT
|   C           DOPT1     CASEQ'5'       RTN340           *UPD
| 01-C                     END
|    C   12                SETOF                     12
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN320....UPD DATA --- SFLSR
     C*==============================================================*
15===C           RTN320    BEGSR
|    C*
|    C                     SETON                     33
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN14     CASEQ'1'       RTN29S
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'
|   C           *IN14     ANDEQ'0'
|   C                     EXSR RTN39S
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLPB0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR
     C*==============================================================*
16===C           RTN340    BEGSR
|    C*
|    C                     SETOF                     33
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLPB0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
16===C                     ENDSR
     C*==============================================================*
      *          RTN391....INIT 'SC03' -- SFLSR2                     *
     C*==============================================================*
17===C           RTN391    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT2
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD0         DRENO
|    C                     Z-ADD0         VPC12
|    C                     Z-ADD0         TPC12
|    C                     Z-ADD0         WRRN2   40
|    C*                    Z-ADD10        WPRCD2  40       *PAG RCD
|    C*                    MOVE 'N'       WBOTM2  1        *BOTTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR2
|    C                     SETOF                     52
|    C                     SETON                     51
|    C*
|    C           PB02      SETLLPC0
|    C*
17===C                     ENDSR
      *==============================================================*
      *          RTN398... READ DATA                                 *
      *==============================================================*
18===C           RTN398    BEGSR
|    C*
|    C           PB02      SETLLPC0
|    C           PB02      READEPC0                      44
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C* GET 產品名稱
|   C           PC03      CHAINMA0                  40
|   C   40                MOVE *BLANK    MA06
|   C* GET 供應商代號
|   C           PB05      CHAINMB0                  40
|   C   40                MOVE *BLANK    MB02
|   C*
|   C           PC06      SUB  PC11      DRENO
| 02-C           PC12      IFEQ 'V'
|   C                     ADD  1         VPC12
| 02-C                     END
|   C*
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           PB02      READEPC0                      44
| 01-C                     END
     C           *LOVAL    SETLLPC0
|    C*
|    C                     Z-ADDRRN2      TPC12
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
18===C                     ENDSR
      *==============================================================*
      *          RTN39C....SCREEN --> FILE (POPBPF)
      *==============================================================*
19===CSR         RTN39C    BEGSR
|    C*
|    C           PB02      CHAINPB0                  40
|    C*M001D               CALL 'RES001'
|    C*M001D               PARM 'MDY'     S001I1  3
B2???C*M001D               PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC*M001D     PBXX      PARM           S001O1  80
|    C*
M001AC                     Z-ADD$EG8      PBXX
B2000C                     TIME           PBYY
|    C                     MOVE $USER     PBZZ
|    C*
|    C*M001D               CALL 'RES001'
|    C*M001D               PARM 'MDY'     S001I1  3
B2???C*M001D               PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC*M001D     PCXX      PARM           S001O1  80
|    C*
M001AC                     Z-ADD$EG8      PCXX
|    C                     MOVE $USER     PCZZ
|    C*
19===CSR                   ENDSR
     C*==============================================================*
     C*          RTN39S....SAVE
     C*==============================================================*
20===C           RTN39S    BEGSR
|    C*****************
|    C* UPDATE POPCPF *
|    C*****************
|    C                     EXSR RTN39C
|    C                     READCSFLSR2                   57
| 01-C           *IN57     DOWEQ'0'
|   C*
B2000C                     TIME           PCYY
| 02-C           DOPT2     IFEQ '2'
|   C           KEYPC     CHAINPC0                  40
| 03-C           PC12      IFNE 'V'
|   C                     MOVE 'V'       PC12
|   C                     ADD  1         VPC12
| 03-C                     END
|   C                     UPDATPC0
| 02-C                     END
|   C*
| 04-C           DOPT2     IFEQ '4'
|   C           KEYPC     CHAINPC0                  40
| 05-C           PC12      IFNE ' '
|   C                     MOVE ' '       PC12
|   C                     SUB  1         VPC12
| 05-C                     END
|   C                     UPDATPC0
| 04-C                     END
|   C*
|   C                     READCSFLSR2                   57
| 01-C                     END
|    C*****************
|    C* UPDATE POPBPF *
|    C*****************
|    C           PB02      CHAINPB0                  40
B2000C                     TIME           PBYY
| 06-C           VPC12     IFEQ TPC12
|   C                     MOVE 'V'       PB19
| 06*C                     ELSE
|   C                     MOVE ' '       PB19
| 06-C                     END
|    C                     UPDATPB0
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
21===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
22===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     8099
|    C*
22===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
**
      結案            查詢
