     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : POI026                                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/01/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :供應商子系統                              *
     A*    PROCEDURE    :供應商產品報價查詢                        *
     A*    REMARK       :                                            *
     A*                                                              *
     A****************************************************************
     FMTMAPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMBLF  IF  E           K        DISK
     FPOPALF03IF  E           K        DISK
B2CHKFPOI026D CF  E                    WORKSTN
B2INF *CVR3010 sev.30 DISPLAY file POI026D must be converted, because file
B2INF *   PA04 (and more) are shared by name with other database fields
B2INF *   which require to be expanded. Please convert POI026D, enlarging
B2INF *   all involved fields prior to compilation, or manually insert in
B2INF *   this source the proper RENAME and MOVE statements to avoid name
B2INF *   sharing
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: A/U/D/I AUT
     E                    WA01        5  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I*                                     514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C*                    MOVE *BLANK    WQUERY  1
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*          KEYBG     KLIST
     C*                    KFLD           DMB01
     C           KEYBG1    KLIST
     C                     KFLD           DBGN1
     C           KEYBG2    KLIST
     C                     KFLD           BBGN1
     C           KEYBG3    KLIST
     C                     KFLD           MB01
     C           KEYPA     KLIST
     C                     KFLD           MB01
     C                     KFLD           PA03
     C                     KFLD           PA04
     C                     KFLD           PA02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN04     CASEQ'1'       RTNF4
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001AC                     PARM $EGMDY    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*                    PARM           DATE    80
M001AC                     PARM           DATE    60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
| 01*C                     ELSE
| 02-C           WRRN1     IFGT 0
|   C                     EXSR RTN171
| 03-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C*          UPD       TAG
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   57*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     97
| 05-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C   99                GOTO END180
|    C*
04===C           END180    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C           KEYBG1    SETLLMB0
|    C                     MOVE DBGN1     BBGN1
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
| 02-C           BBGN1     IFNE DBGN1
|   C           KEYBG2    SETGTMB0
| 02-C                     END
|   C                     EXSR RTN193
|   C                     MOVE MB01      BBGN1
|   C           *LOVAL    SETLLMB0
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ MB0                      46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
|   C***        KEYBG3    SETGTMB0
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     96    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
09===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
| 01-C*          DOPT1     CASEQ'1'       RTN210           *ADD
|   C*          DOPT1     CASEQ'2'       RTN220           *UPD
|   C*          DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLMB0
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
     C*==============================================================*
     C*          RTN240....INQ DATA --- SFLSR
     C*==============================================================*
10===C           RTN240    BEGSR
|    C*
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN292                     *READ NEXT PAGE
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
| 01-C           RRN2      IFLE *ZEROS
|   C                     SETON                     96    *NODATA
| 01-C                     END
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
|   C   25                EXSR RTN292
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN25     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
|   C           *LOVAL    SETLLPA0
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLPA0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
10===C                     ENDSR
      *=========================================================*
      *          RTN291....INITIAL SFL2                         *
      *=========================================================*
11===C           RTN291    BEGSR
|    C*
|    C                     Z-ADD0         DRRN2
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD12        WPRCD2  30
|    C                     Z-ADD0         DSPRC2  40
|    C                     MOVE 'N'       WBOTM2  1
|    C                     MOVE *BLANK    PA03
|    C                     Z-ADD0         PA04
|    C                     MOVE *BLANK    PA02
|    C                     SETOF                     53
|    C                     SETON                     525051
|    C                     WRITESFLCR2
|    C                     SETOF                     52
|    C***        KEYBG3    SETLLMB0
|    C           KEYBG3    SETLLPA0
|    C*
11===C                     ENDSR
      *=========================================================*
      *          RTN292 .. ROLLUP MAIN ROUTINE
      *=========================================================*
12===C           RTN292    BEGSR
|    C*
| 01-C           WBOTM2    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN2      DRRN2
| 01*C                     ELSE
| 02-C**         BBGN1     IFNE DBGN1
|   C**         KEYBG2    SETGTMB0
| 02-C**                   END
|   C                     EXSR RTN293
|   C**                   MOVE MB01      BBGN1
|   C**         *LOVAL    SETLLMB0
| 01-C                     END
|    C*
12===C                     ENDSR
      *=========================================================*
      *          RTN293 .. ADD SUBFILE DATA
      *=========================================================*
13===C           RTN293    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     Z-ADDWRRN2     RRN2
|    C                     ADD  WPRCD2    DSPRC2
|    C*
|    C* GET 系統日期
|    C*
| 01-C           RRN2      DOWLTDSPRC2
|   C*
|   C           KEYBG3    READEPA0                      46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*
M001AC                     MOVE DATE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DATEX   80
B2000C           DATEX     IFGE PA04
|   C           DATEX     ANDLEPA06
|   C                     EXSR RTN252                     *FILE -> SCR
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
| 03-C                     END
|   C           KEYPA     SETGTPA0
|   C*
| 02*C                     ELSE
|   C                     Z-ADDRRN2      DSPRC2
|   C                     MOVE 'Y'       WBOTM2
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN2      DRRN2      50
|    C                     Z-ADDRRN2      WRRN2
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN295... EXFMT SFL                                 *
      *==============================================================*
14===C           RTN295    BEGSR
|    C*
| 01-C           RRN2      IFLE *ZEROS
|   C                     SETON                     96    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC2
|    C                     EXFMTSFLCR2
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
15===C           RTN252    BEGSR
|    C*
|    C* GET 產品名稱／單位
|    C           PA03      CHAINMA0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELMA14      DOC
| 01*C                     ELSE
|   C                     MOVE *BLANK    MA06
|   C                     MOVE *BLANK    DOC
| 01-C                     END
|    C* GET 價格條件
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'PRICE'   #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELPA10      #A02
|    C           KEY#A     CHAIN#A0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DPRICE
| 02*C                     ELSE
|   C                     MOVE *BLANK    DPRICE
| 02-C                     END
|    C* GET 付款條件
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'PAYMENT' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELPA07      #A02
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DPAY
| 03*C                     ELSE
|   C                     MOVE *BLANK    DPAY
| 03-C                     END
|    C* GET 單價
|    C                     Z-ADDPA09      DPA09
|    C* 日期轉換
M001AC                     Z-ADDPA04      DPA04   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PA04      S001I2  80
M001AC                     PARM DPA04     S001I2  60
M001DC*          PA04      PARM           S001O1  80
M001AC           DPA04     PARM           S001O1  60
|    C* 日期轉換
M001AC                     Z-ADDPA06      DPA06   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PA06      S001I2  80
M001AC                     PARM DPA06     S001I2  60
M001DC*          PA06      PARM           S001O1  80
M001AC           DPA06     PARM           S001O1  60
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
16===C**         RTN253    BEGSR
|    C*
|    C*
16===C**                   ENDSR
      *==============================================================*
      *          RTN260....F5 -- 參考資料
      *==============================================================*
      *==============================================================*
      *          RTN280....CHECK 'SC02' SCREEN
      *==============================================================*
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
     C*==============================================================*
     C*          RTN310....ADD DATA --- SFLSR
     C*==============================================================*
     C*==============================================================*
     C*          RTN320....UPD DATA --- SFLSR
     C*==============================================================*
     C*==============================================================*
     C*          RTN330....DEL DATA --- SFLSR2
     C*==============================================================*
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR2
     C*==============================================================*
     C*==============================================================*
     C*          RTN380....CHECK 'SC03' --- SFLSR
     C*==============================================================*
     C*==============================================================*
     C*          RTN381....F4 --- SFLSR
     C*==============================================================*
     C*==============================================================*
     C*          RTN391....INIT 'SC03' -- SFLSR2
     C*==============================================================*
     C*==============================================================*
     C*          RTN397....FILE TO SCREEN --- SFLSR(FOR ADD OR UPD)
     C*==============================================================*
     C*==============================================================*
     C*          RTN398....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
     C*==============================================================*
     C*          RTN39A....INIT 'SC03' -- SFLSR(DTA)
     C*==============================================================*
     C*==============================================================*
     C*          RTN39B....FILE TO SCREEN --- MOVE
     C*==============================================================*
     C*==============================================================*
     C*          RTN39C....SCREEN TO FILE --- H
     C*==============================================================*
     C*==============================================================*
     C*          RTN39D....SCREEN TO FILE --- D
     C*==============================================================*
     C*==============================================================*
     C*          RTN39S....SAVE D
     C*==============================================================*
     C*==============================================================*
     C*          RTN39T....DLT D
     C*==============================================================*
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
17===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
17===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
18===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C*
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C**
| 02-C           D#ROW     IFEQ 20
|   C           D#COL     ANDGE15
|   C           D#COL     ANDLE19
|   C                     CALL 'WDS002'
|   C           DBGN1     PARM DBGN1     PARMI1
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
18===C           ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
19===C           ERRSR     BEGSR
|    C*
|    C*                    CALL 'P50'
|    C*          DMSG      PARM           P5001O 78
|    C*                    SETON                     8099
|    C*
19===C*                    ENDSR'*DETC'
*ERR*C                     ENDSR
     C/COPY HBP2CVTR
