     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : POA006                                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/01/22                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購資料建檔子系統                        *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :採購單人工結案                            *
     A*                                                              *
     A****************************************************************
     FPOPKPF  IF  E           K        DISK
     FPOPLPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMBLF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
B2CHKFPOI024D CF  E                    WORKSTN
B2INF *CVR3010 sev.30 DISPLAY file POI024D must be converted, because file
B2INF *   PB04 (and more) are shared by name with other database fields
B2INF *   which require to be expanded. Please convert POI024D, enlarging
B2INF *   all involved fields prior to compilation, or manually insert in
B2INF *   this source the proper RENAME and MOVE statements to avoid name
B2INF *   sharing
     F*                                             KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E*                   WFUN    5   5  6
     E*: A/U/D/I AUT
     E*                   WA01        5  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I*                                     135 135 $ADD
 @   I*                                     136 136 $UPD
 @   I*                                     137 137 $DLT
 @   I*                                     138 138 $INQ
 @   I*                                     139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I*                                     514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I*                                       1   10WNUM
     I* FOR F4 HELP ARRAY
     I*           DS
     I*                                       1  40 F4A
     I*                                       1   3 DPA08
     I*                                      11  12 DPA07
     I*                                      21  22 DPA10
     I*                                      31  32 DPA11
     I* FOR F4 HELP -- GET CURSOR POSITION
     I*DSPFDS      DS
     I*                                   B 370 3710#CSR
     I**   SCR002 CHANGE (Y/N)
     I*           DS
     I*                                       1  21 SCR2CN
     I*                                       1   60DPA04
     I*                                       7   9 WPA08
     I*                                      10  11 WPA07
     I*                                      12  13 WPA10
     I*                                      14  15 WPA11
     I*                                      16  210DPA06
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C                     MOVE *BLANKS   APPSCR  6
     C*                    MOVE *BLANK    WQUERY  1
     C           *LIKE     DEFN DBGN      OBGN             *START KEY
     C*  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN      BBGN             *SUBFIL BUTTOM
     C                     MOVE *ZEROS    TPC12   60       *TOTAL RCD  OM
     C                     MOVE *ZEROS    VPC12   60       *'V' RCD    OM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYPC     KLIST
     C                     KFLD           PB02
     C                     KFLD           PC03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*                    MOVE $ADD      WA01,1
|    C*                    MOVE $UPD      WA01,2
|    C*                    MOVE $DLT      WA01,4
|    C*                    MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN      IFNE OBGN
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN      OBGN
| 01*C                     ELSE
| 02-C           WRRN1     IFGT 0
|   C                     EXSR RTN171
| 03-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     Z-ADDRRN1      DRRN1
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C*          UPD       TAG
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   57*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     97
| 05-C                     END
|    C*
03===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
04===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C           DBGN      SETLLPB0
|    C                     MOVE DBGN      BBGN
|    C*
04===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
05===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
| 02-C           BBGN      IFNE DBGN
|   C           BBGN      SETGTPB0
| 02-C                     END
|   C                     EXSR RTN193
|   C                     MOVE PB02      BBGN
|   C           *LOVAL    SETLLPB0
| 01-C                     END
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
06===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ PB0                      46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*
|   C           PB05      CHAINMB0                  40
|   C* 日期轉換
M001AC                     Z-ADDPB04      DPB04   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PB04      S001I2  80
M001AC                     PARM DPB04     S001I2  60
M001DC*          PB04      PARM           S001O1  80
M001AC           DPB04     PARM           S001O1  60
|   C*ADD BY STEPHANIE 03/02/92 START
M001AC                     Z-ADDPB06      DPB06   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PB06      S001I2  80
M001AC                     PARM DPB06     S001I2  60
M001DC*          PB06      PARM           S001O1  80
M001AC           DPB06     PARM           S001O1  60
|   C*ADD-------------------------END
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
|   C           PB02      SETGTPB0
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
07===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     96    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
08===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
| 01-C           DOPT1     CASEQ'5'       RTN210           *INQ
|   C           DOPT1     CASEQ'6'       RTN300           *DETAIL
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLPB0
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN210....INQ DATA
      *==============================================================*
09===C           RTN210    BEGSR
|    C*
|    C           PB02      CHAINPB0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN340
|   C                     SETOF                     12
| 02-C                     END
|   C*
| 01-C                     END
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
10===CSR         RTN252    BEGSR
|    C* GET 公司代號
|    C           PB01      CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B03
|    C* GET 單別
|    C                     MOVELPB03      #201
|    C                     MOVELPB03      #202
|    C           KEY#2     CHAIN#20                  40
|    C*
M001AC                     Z-ADDPB04      DPB04
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PB04      S001I2  80
M001AC                     PARM DPB04     S001I2  60
M001DC*          PB04      PARM           S001O1  80
M001AC           DPB04     PARM           S001O1  60
|    C*
M001AC                     Z-ADDPB06      DPB06
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PB06      S001I2  80
M001AC                     PARM DPB06     S001I2  60
M001DC*          PB06      PARM           S001O1  80
M001AC           DPB06     PARM           S001O1  60
|    C* GET 供應商代號
|    C           PB05      CHAINMB0                  40
|    C   40                MOVE *BLANK    MB02
|    C* GET 幣別
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'CURRENCY'#A01
|    C                     MOVELPB07      #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A031
| 01*C                     ELSE
|   C                     MOVE *BLANK    #A031
| 01-C                     END
|    C* GET 付款條件
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'PAYMENT' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELPB09      #A02
|    C           KEY#A     CHAIN#A0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A032
| 02*C                     ELSE
|   C                     MOVE *BLANK    #A032
| 02-C                     END
|    C* GET 價格條件
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'PRICE'   #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELPB10      #A02
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A034
| 03*C                     ELSE
|   C                     MOVE *BLANK    #A034
| 03-C                     END
|    C* GET 運輸方式
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'DELIVERY'#A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELPB12      #A02
|    C           KEY#A     CHAIN#A0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      #A033
| 04*C                     ELSE
|   C                     MOVE *BLANK    #A033
| 04-C                     END
|    C*
M001AC                     Z-ADDPB14      DPB14   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PB14      S001I2  80
M001AC                     PARM DPB14     S001I2  60
M001DC*          PB14      PARM           S001O1  80
M001AC           DPB14     PARM           S001O1  60
|    C*
M001AC                     Z-ADDPB15      DPB15   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PB15      S001I2  80
M001AC                     PARM DPB15     S001I2  60
M001DC*          PB15      PARM           S001O1  80
M001AC           DPB15     PARM           S001O1  60
|    C*
10===CSR                   ENDSR
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
11===C           RTN300    BEGSR
|    C*
|    C                     MOVE 'SCR003'  APPSCR
| 01-C           DOPT1     CASEQ'6'       RTN340           *INQ
| 01-C                     END
|    C   12                SETOF                     12
|    C*
11===C                     ENDSR
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR
     C*==============================================================*
12===C           RTN340    BEGSR
|    C*
|    C                     SETOF                     33
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLPB0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
12===C                     ENDSR
     C*==============================================================*
      *          RTN391....INIT 'SC03' -- SFLSR2                     *
     C*==============================================================*
13===C           RTN391    BEGSR
|    C*
|    C*                    MOVE *BLANKS   DOPT2
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD0         VPC12
|    C                     Z-ADD0         TPC12
|    C                     Z-ADD0         WRRN2   40
|    C*                    Z-ADD10        WPRCD2  40       *PAG RCD
|    C*                    MOVE 'N'       WBOTM2  1        *BOTTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR2
|    C                     SETOF                     52
|    C                     SETON                     51
|    C*
|    C           PB02      SETLLPC0
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN398... READ DATA                                 *
      *==============================================================*
14===C           RTN398    BEGSR
|    C*
|    C           PB02      SETLLPC0
|    C           PB02      READEPC0                      44
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C* GET 產品名稱
|   C           PC03      CHAINMA0                  40
|   C   40                MOVE *BLANK    MA06
|   C* GET 供應商代號
|   C           PB05      CHAINMB0                  40
|   C   40                MOVE *BLANK    MB02
|   C*
| 02-C           PC12      IFEQ 'V'
|   C                     ADD  1         VPC12
| 02-C                     END
|   C*
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           PB02      READEPC0                      44
| 01-C                     END
|    C*
|    C                     Z-ADDRRN2      TPC12
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN39C....SCREEN --> FILE (POPBPF)
      *==============================================================*
15===CSR         RTN39C    BEGSR
|    C*
|    C           PB02      CHAINPB0                  40
M001AC                     Z-ADD0         XPBXX   60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001AC                     PARM $EGMDY    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          PBXX      PARM           S001O1  80
M001AC           XPBXX     PARM           S001O1  60
|    C*
M001AC                     MOVE XPBXX     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    PBXX
B2000C                     TIME           PBYY
|    C                     MOVE $USER     PBZZ
|    C*
M001AC                     Z-ADD0         XPCXX   60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001AC                     PARM $EGMDY    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
M001DC*          PCXX      PARM           S001O1  80
M001AC           XPCXX     PARM           S001O1  60
M001AC                     MOVE XPCXX     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    PCXX
B2000C                     TIME           PBYY
|    C                     MOVE $USER     PBZZ
|    C*
|    C                     MOVE $USER     PCZZ
|    C*
15===CSR                   ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
16===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
17===C           ERRSR     BEGSR
|    C*
|    C*                    CALL 'P50'
|    C*          DMSG      PARM           P5001O 78
|    C*                    SETON                     8099
|    C*
17===C*                    ENDSR'*DETC'
*ERR*C                     ENDSR
     C/COPY HBP2CVTR
