      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *--------------------------------------------------------------*
      *    PROGRAM ID   : POI027                                     *
      *    AUTHOR       : AN MING HSIA                               *
      *    DATE WRITTEN : 01/18/94                                   *
      *    UPDATE DATE  :                                            *
      *    SYSTEM       :人頭馬匯東                                *
      *    SUBSYSTEM    :採購系統                                  *
      *    REMARK       :採購單／驗收單查詢                        *
      ****************************************************************
     FPOPOLF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     F                                              KINFDS SIRCDN
     FPOPBPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMBPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FPOI027D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN   KSFILE SFLSR1
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     I*SDS        SDS
     I*                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     ISIRCDN      DS
     I                                     *RECORD  RCDN
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     MOVE *BLANKS   APPSCR  6
     C                     Z-ADD0         HRRN    40
     C                     MOVE *BLANK    WBOTOM  1
     C*
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BOTTOM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYPB2    KLIST
     C                     KFLD           DBGN1
     C           KEYPB3    KLIST
     C                     KFLD           BBGN1
     C           KEYPO     KLIST
     C                     KFLD           PB02
     C                     KFLD           DPO02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
     C*
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $RMK01    WA01,6
|    C*
|    C                     MOVE 'SCR001'  APPSCR
|    C                     Z-ADD0         DATE    60
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001AC                     PARM $EGMDY    S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|    C           DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C                     Z-ADD0         HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN       HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C           *IN03     ANDEQ'0'
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C           *IN12     ANDEQ'0'
|   C                     EXSR RTN180                     *CHK
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN       DRRN
|   C*
| 05-C           DOPT1     IFEQ '5'
|   C                     CALL 'POI0271'
|   C                     PARM           PB02   12
|   C                     PARM           DPB04   60
|   C                     PARM           IN03    1
| 05-C                     END
|   C*
|   C*驗收單空白
| 06-C           DOPT1     IFEQ '6'
|   C                     CALL 'POI0272'
|   C                     PARM           PB02   12
|   C                     PARM           PO02   12
|   C                     PARM           IN03    1
| 06-C                     END
|   C*
|   C                     MOVE *BLANKS   DOPT1
|   C*
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN       CHAINSFLSR1               40
|   C*
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *57 END
| 07-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 07-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN180....CHECK 'SC01' SCREEN
     C*==============================================================*
04===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
| 02-C           DOPT1     IFEQ '6'                         WNUM = DOPT
|   C           PO02      ANDEQ*BLANK
|   C                     SETON                     999160
| 02-C                     END
|    C   99                GOTO END180
|    C*
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN       DRRN
04===C                     ENDSR
     C*==============================================================*
     C*          RTN190....INITIAL
     C*==============================================================*
05===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         WRRN    40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN      DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C                     MOVE *BLANK    DPO02  12
|    C           KEYPB2    SETLLPB0
|    C                     READ PB0                      46
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
06===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
     C           *IN25     IFEQ '1'
     C                     SETON                     11
     C                     END
|   C                     EXSR RTN193
| 01-C                     END
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
07===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADDWRRN      RRN
|    C                     ADD  WPRCD1    DSPRC1
|    C*
| 01-C           RRN       DOWLTDSPRC1
|   C**
| 02-C           *IN46     IFEQ '0'
|   C*
|   C*客戶簡稱
|   C           PB05      CHAINMB0                  40
|   C   40                MOVE *BLANK    MB03
|   C* 採購日期
M001AC                     Z-ADDPB04      DPB04   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PB04      S001I2  80
M001AC                     PARM DPB04     S001I2  60
|   C           DPB04     PARM           S001O1  60
|   C*
|   C                     MOVE *BLANK    MPO02  12
|   C*
|   C           KEYPO     SETLLPOPOLF
|   C           PB02      READEPOPOLF                   40
| 04-C           *IN40     IFEQ '0'
| 05-C           RRN       DOWLTDSPRC1
|   C           *IN40     ANDEQ'0'
|   C                     MOVE PO02      DPO02
|   C*
|   C*驗收單不同寫入
| 06-C           MPO02     IFNE PO02
|   C* 驗收日期
M001AC                     Z-ADDPO05      DPO05   60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM PO05      S001I2  80
M001AC                     PARM DPO05     S001I2  60
|   C           DPO05     PARM           S001O1  60
|   C*
|   C                     MOVE PO02      MPO02
|   C  N11                ADD  1         RRN
|   C  N11                WRITESFLSR1
     C                     SETOF                     11
| 06-C                     END
|   C           PB02      READEPOPOLF                   40
| 05-C                     END
| 04*C                     ELSE
|   C                     MOVE *BLANK    PO02
|   C                     Z-ADD0         DPO05
|   C  N11                ADD  1         RRN
|   C  N11                WRITESFLSR1
| 04-C                     END
|   C*
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRC1
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 07-C           RRN       IFLT DSPRC1
|   C                     READ PB0                      46
|   C                     MOVE *BLANK    DPO02
     C                     SETOF                     11
| 07-C                     END
|   C*
| 01-C                     END
|    C                     Z-ADDRRN       DRRN       50
|    C                     Z-ADDRRN       WRRN
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
08===C           RTN195    BEGSR
|    C*
| 01-C           RRN       IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
09===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
09===C                     ENDSR'*DETC'
