     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : POI997                                     *
     H*    PROGRAM NAME :供應商基本資料視窗查詢                    *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 2008.12.10                                 *
     H*    UPDATE DATE  :
     H*    SYSTEM       :                                            *
     F****************************************************************
     FMTMBPF  IF  E           K        DISK
     FPOI997D CF  E                    WORKSTN      KINFDS DSPFDS
     F                                        RRN3  KSFILE SFLSR3
     E*---------------------------------------------------------------*
     E                    @A1       999  5
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN3
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      152 161 $USERN
     I*DEFIND STRAT KEY
     I            DS
     I                                        1   5 @KEYO
     I            DS
     I                                        1   5 @KEYN
     I                                        1   5 KMB01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN RRN3      @DRCD            DSP REC NUM
     C           *LIKE     DEFN RRN3      @PRCD            PAGE REC
     C*==============================================================*
     C*                    *ENTRY PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           KMB01     PARM           P101I1  5        *代碼欄位
     C                     PARM           @A1
     C                     PARM           @RTNC   2          FUN KEY
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYMB     KLIST
     C                     KFLD           KMB01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INIT
     C*
  01-C           @RTNC     DOWEQ*BLANK
    C                     EXSR R1000                      *SCR PROCESS
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C* INIT VALUE SET *---------------------------------------------*
|    C                     MOVEL*BLANK    @RTNC   2
|    C                     Z-ADD6         @PRCD            .PAGE SIZE
|    C*--------------------------------------------------------------*
|    C                     EXSR R1A00                      .SFL INIT
|    C                     WRITESFLCR3
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....SCREEN  PROCESS
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     WRITEDSPD1
|    C                     EXFMTSFLCR3
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     MOVEL'03'      @RTNC
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN12     IFEQ '1'                        *PREVIOUS
|   C                     MOVEL'03'      @RTNC
|   C                     GOTO E1000
|   C                     SETON                     03
| 02-C                     END
|    C*
| 03-C           *IN25     IFEQ '1'                        *NEXT PAGE
|   C                     EXSR R1N00
|   C                     GOTO E1000
| 03-C                     END
|    C*
| 04-C           *IN26     IFEQ '1'                        *TOP  PAGE
|   C                     SETON                     96    *BOP
|   C*                    MOVEL'CPF5203' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C                     Z-ADD1         DRRN3
|   C                     GOTO E1000
| 04-C                     END
|    C*
| 05-C           @KEYO     IFNE @KEYN                      *START KEY
|   C                     EXSR R1A00                      *SFL INIT
|   C                     GOTO E1000
| 05-C                     END
|    C*
|    C                     EXSR R1C00                      *OPTION
|    C*
02===C           E1000     ENDSR
     C*=============================================================*
     C*          R1A00 ....SUBFILE INIT PREPARE
     C*=============================================================*
03===C           R1A00     BEGSR
|    C*
|    C                     Z-ADD0         DRRN3
|    C                     Z-ADD0         RRN3
|    C                     Z-ADD0         @DRCD            *DSP RCD
|    C                     MOVEL'N'       @BOTOM  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR3
|    C                     SETOF                     52
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     SETOF                     5053  *SFLDSP,END
|    C*
|    C*                    EXSR R1A20                      *SFL HEAD
|    C*  99                GOTO E1A00
|    C* <<SFL INITIAITAL DATA ADD>>
|    C                     MOVEL@KEYN     @KEYO            *KEY SAVE
|    C*
|    C*------------------------------------------------------------***
|    C           KEYMB     SETLLMB0
|    C*------------------------------------------------------------***
|    C*
|    C                     EXSR R1A10                      *ADD SFL DTA
|    C*
| 01-C           RRN3      IFGT 0
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     99    *NO DTA
|   C*                    MOVEL'UPT2050' ERRID
|   C*                    MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
03===C           E1A00     ENDSR
     C*=============================================================*
     C*          R1A10 .... ADD SUBFILE DATA
     C*=============================================================*
04===C           R1A10     BEGSR
|    C*
|    C                     ADD  @PRCD     @DRCD
| 01-C           RRN3      DOWLT@DRCD
|   C*------------------------------------------------------------***
|   C                     READ MB0                      46
|   C*------------------------------------------------------------***
|   C*
| 02-C           *IN46     IFEQ '0'
|    *
|   C                     MOVELMB01      X1      2
|    *
| 03-C           X1        IFEQ 'LR'
|    *
|   C                     EXSR R1A11                      *WRITE SFL
|    *
| 03-C                     ENDIF
|    *
| 02*C                     ELSE                            *EOF
|   C                     Z-ADDRRN3      @DRCD
|   C                     MOVE 'Y'       @BOTOM
|   C                     SETON                     9653  *SFLEND
|   C*                    MOVEL'CPF5203' ERRID
|   C*                    MOVEL'PTMF'    ERRF
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN3      DRRN3
|    C*
04===C                     ENDSR
     C*=============================================================*
     C*          R1A11 .... WRITE SUBFILE DATA
     C*=============================================================*
05===C           R1A11     BEGSR
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C* << SUBFILE DATA VALUE SET >>
|    C                     ADD  1         RRN3
|    C                     SETON                     54
|    C*
|    C                     WRITESFLSR3
|    C*
05===C                     ENDSR
     C*=============================================================*
     C*          R1A20 .... SFL HEADING (SFL CONTROL DATA PREPARE)
     C*=============================================================*
06===C           R1A20     BEGSR
|    C*
|    C*
06===C                     ENDSR
     C*=============================================================*
     C*          R1C00 ....挑選資料
     C*=============================================================*
07===C           R1C00     BEGSR
|    C*
|    C                     Z-ADD1         I       30
|    C                     MOVE *BLANKS   @A1
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR3                 4242
| 01-C           *IN42     DOWEQ'0'
|   C*
| 02-C           SEL       IFEQ '/'
|   C* <<SET OUTPUT PARM>>++++++++++++++++++++++++++++++++++++++++++++
|   C                     MOVELMB01      @A1,I
|   C                     ADD  1         I
|   C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|   C                     MOVEL'00'      @RTNC
|   C*                    SETON                     42
| 02-C                     END
|   C*
|   C  N42                READCSFLSR3                   42
| 01-C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
     C*=============================================================*
     C*          R1N00 ....ROLLUP MAIN ROUTINE
     C*=============================================================*
08===C           R1N00     BEGSR
|    C*
| 01-C           @BOTOM    IFEQ 'Y'                        *EOF
|   C                     SETON                         96*LST PAG
|   C                     Z-ADDRRN3      DRRN3
|   C*                    MOVEL'CPF5203' ERRID
|   C*                    MOVEL'PTMF'    ERRF
|   C                     SETON                     99
| 01*C                     ELSE
|   C                     EXSR R1A10                      *ADD SFL DTA
| 01-C                     END
|    C*
08===C                     ENDSR
     C*==============================================================*
