      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : POR0661                                       *
      * AUTHOR       : A1491 EASON                                   *
      * CREATE DATE  : 03/11/08                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購資料系統                                 *
      * REMARK       :國內供應商採購明細表                         *
      ****************************************************************
     FPOPBPF  IF  E           K        DISK
     FPOPCPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMBPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FREWFQ1  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I*
     I                                      601 605 DPB05S
     I                                      606 610 DPB05E
     I                                      611 619 DPC03S
     I                                      621 629 DPC03E
     I                                      630 634 DPB16S
     I                                      635 639 DPB16E
     I*           DS
B2MODI*                                       1   80PH04
B2MODI*                                       1   60WF9104
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF01
     C                     KFLD           WF03
     C                     KFLD           WF05
     C                     KFLD           WF06
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*驗收主檔
     C                     READ PB0                      45
  01-C           *IN45     DOWEQ'0'
    C*供應商代號
    C                     MOVE PB05      WF01
    C           WF01      CHAINMB0                  40
    C  N40                MOVELMB03      WF02
    C   40                MOVEL*BLANK    WF02
    C*採購日期
    C                     Z-ADDPB04      WF05
    C*物流點代號
    C                     MOVELPB16      WF06
    C           WF06      CHAINME0                  40
    C  N40                MOVELME04      WF07
    C   40                MOVEL*BLANK    WF07
    C*驗收明細檔
    C           PB02      SETLLPC0                  40
    C           PB02      READEPC0                      40
  02-C           *IN40     DOWEQ'0'                          新增
    C*產品代號
    C                     MOVE PC03      WF03
     *
  03-C           WF03      IFGE DPC03S
    C           WF03      ANDLEDPC03E
    C*
    C           KEYWF     CHAINWF0                  41
  04-C           *IN41     IFEQ '1'
    C                     EXSR RTN200
  04*C                     ELSE
    C                     EXSR RTN300
  04-C                     END
     *
  03-C                     END
    C           PB02      READEPC0                      40
  02-C                     END
    C*
    C                     READ PB0                      45
  01-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN200....WRITE WORK FILE
      *==============================================================*
01===C           RTN200    BEGSR
|    C*產品簡稱/單位
|    C           WF03      CHAINMA0                  40
|    C  N40                MOVELMA03      WF04
|    C  N40                MOVELMA14      WF08
|    C   40                MOVEL*BLANK    WF04
|    C   40                MOVEL*BLANK    WF08
|    C*數量
|    C                     Z-ADDPC06      WF09
|    C*單價
|    C                     Z-ADDPC07      WF10
|    C*金額
|    C                     Z-ADDPC08      WF11
|    C                     ADD  PC13      WF11
|    C*
|    C                     WRITEWF0
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN300....UPDATE WORK FILE
      *==============================================================*
02===C           RTN300    BEGSR
|    C*
|    C                     ADD  PC06      WF09
|    C                     ADD  PC08      WF11
|    C                     ADD  PC13      WF11
|    C*
|    C                     UPDATWF0
|    C*
02===C                     ENDSR
