      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:7313250    *
      * PROGRAM NAME : POR0621                                       *
      * AUTHER       :                                               *
      * CREATE DATE  :  03/21/97                                     *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      *  REMARK      :國外採購成本差異                             *
      ****************************************************************
     FPOPDPF  IF  E           K        DISK
     FPOPEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FREW109  O   E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*日期
     I                                      612 6170DPD04
     I                                      622 6270WPD04
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C*                    KFLD           WF902
     C                     KFLD           WF905
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     READ PD0                      45
  01-C           *IN45     DOWEQ'0'
    C*
    C           PD02      SETLLPE0
    C           PD02      READEPE0                      46
  02-C           *IN46     DOWEQ'0'
    C*
    C                     MOVELPD01      WF901
    C                     MOVELPE02      WF902
B2000C                     MOVELPD04      WF903
    C                     MOVELPD07      WF904
    C                     MOVELPE04      WF905
    C                     Z-ADDPE06      WF906
    C                     Z-ADDPE07      WF907
    C*
    C                     EXSR RTN300
    C*
    C                     WRITEWF109
    C*
    C           PD02      READEPE0                      46
  02-C                     END
    C*
    C                     READ PD0                      45
  01-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWF55
      *==============================================================*
01===C           RTN300    BEGSR
|    C*
|    C                     Z-ADD0         TEMPX
|    C                     Z-ADD0         WF908
|    C           PE04      CHAINMA0                  44
|    C           PE06      MULT MA16      TEMPX   80
|    C           PE07      DIV  TEMPX     WF908
|    C                     Z-ADDMA16      WF9XX
|    C*
01===C                     ENDSR
