      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR055                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 05/11/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :供應商到貨完稅狀況表                         *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.07  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FPOR055D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I                                      601 605 DPD07S
     I                                      606 610 DPD07E
     I*(MM/YY)
     I                                      611 6140DPD04S
     I                                      611 6120DPD4SM
     I                                      613 6140DPD4SY
     I                                      615 6180DPD04E
     I                                      615 6160DPD4EM
     I                                      617 6180DPD4EY
     I*(YY/MM)
     I                                      619 6220YPD04S
     I                                      619 6200YPD4SY
     I                                      621 6220YPD4SM
     I                                      623 6260YPD04E
     I                                      623 6240YPD4EY
     I                                      625 6260YPD4EM
     I                                      627 635 DPE04S
     I                                      636 644 DPE04E
M001AI                                      651 656 X6S
M001AI                                      661 666 X6E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     Z-ADD0         DPD04S
|    C                     Z-ADD0         DPD04E
|    C                     MOVE *BLANK    DPD07S
|    C                     MOVE *BLANK    DPD07E
|    C                     MOVE *BLANK    DPE04S
|    C                     MOVE *BLANK    DPE04E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*供應商代號
| 01-C           DPD07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPD07S
| 01-C                     END
|    C*
| 02-C           DPD07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPD07E
| 02-C                     END
|    C*
| 03-C           DPD07S    IFGT DPD07E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*產品代號
| 04-C           DPE04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPE04S
| 04-C                     END
| 05-C           DPE04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPE04E
| 05-C                     END
|    C*
| 06-C           DPE04S    IFGT DPE04E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*進貨年月
| 07-C           DPD4SM    IFLT 1
|   C           DPD4SM    ORGT 12
|   C                     SETON                     629399
| 07-C                     END
|    C   99                GOTO END100
|    C*
| 08-C           DPD4EM    IFLT 1
|   C           DPD4EM    ORGT 12
|   C                     SETON                     639399
| 08-C                     END
|    C   99                GOTO END100
|    C*
|    C                     Z-ADDDPD4SY    YPD4SY
|    C                     Z-ADDDPD4SM    YPD4SM
|    C                     Z-ADDDPD4EY    YPD4EY
|    C                     Z-ADDDPD4EM    YPD4EM
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE YPD04S    HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     X6S
|    C*
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE YPD04E    HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     X6E
     C*
| 09-C*M001M     YPD04S    IFGT YPD04E
M001MC           X6S       IFGT X6E
|   C                     SETON                     6263
|   C                     SETON                     9992
| 09-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C**
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS002'
|   C                     PARM           DPD07S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C**
| 03-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS002'
|   C                     PARM           DPD07E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE47
|   C                     CALL 'WDS001'
|   C                     PARM           DPE04S
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
|   C**
| 05-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS001'
|   C                     PARM           DPE04E
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 06-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
