      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0451                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/01/23                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :供應商採購彙總表                             *
      ****************************************************************
     FPOPCPF  IP  E           K        DISK
     FMTMBLF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPOR045P O   E             39     PRINTER
     IPC0
     I                                              PC05  L2
     I                                              PC03  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 602 DPC01S
     I                                      603 604 DPC01E
     I                                      605 6080DPC04S
     I                                      609 6120DPC04E
     I                                      613 614 DMA08S
     I                                      615 616 DMA08E
M001MI*                                     621 6260SPC04S
M001MI*                                     627 6320SPC04E
M001MI                                      617 6200SPC04S
M001MI                                      621 6240SPC04E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN100                     *HEADING
     C*
     C   39                EXSR RTN900                     *OVRFLW-THE SAME
     C                     EXSR RTN200                     *CHAIN       SAME PRO
     C*
     CL1 10                EXSR RTN777
     CL2 10                EXSR RTN888
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     WRITEPH1
|    C                     SETON                     10
|    C                     SETON                     30
01===C                     ENDSR
      *==============================================================*
      *          RTN200....CHECK DETAIL
      *==============================================================*
02===C           RTN200    BEGSR
|    C*供應商名稱
|    C           PC05      CHAINMB0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MB03
| 01-C                     END
|    C*產品名稱
|    C           PC03      CHAINMA0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA03
| 02-C                     END
|    C*採購量
| 03-C           PC12      IFEQ 'V'
|   C                     ADD  PC11      TEMP    70
| 03*C                     ELSE
|   C                     ADD  PC06      TEMP    70
| 03-C                     END
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN777....(L1)
      *==============================================================*
04===C           RTN777    BEGSR
|    C*
|    C                     Z-ADDTEMP      TOTAL
|    C*
|    C                     WRITEPD1
|    C                     SETOF                         30
|    C*CLEAR TEMP
|    C                     Z-ADD0         TEMP
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN888....(L2)
      *==============================================================*
05===C           RTN888    BEGSR
|    C                     SETON                       30
05===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
06===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN100
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
06===C                     ENDSR
