      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR0561                                       *
      * AUTHER       : D910074                                       *
      * CREATE DATE  : 82/07/16                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :國內驗收金額月彙總表                         *
      ****************************************************************
     FPOPHPF  IP  E           K        DISK
     FMTMBPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPOR056P O   E             39     PRINTER
     I*
     IPH0
     I                                              PH06  L2
     I                                              PH05  L1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 601 DPH01S
     I                                      602 602 DPH01E
     I                                      603 6060DDATES
     I                                      603 6040MMS
     I                                      605 6060YYS
     I                                      607 610 YYMMS
     I                                      611 6140DDATEE
     I                                      611 6120MME
     I                                      613 6140YYE
     I                                      615 618 YYMME
     I                                      620 624 DPH05S
     I                                      625 629 DPH05E
     I                                      630 634 DPH06S
     I                                      635 639 DPH06E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN000
     C*
     C                     EXSR RTN100                     *READE PG0
     C*
     CL1 10                EXSR RTNL1                      *WRITE PD2
     CL2 10                EXSR RTNL2                      *WRITE PD2
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN000....GET HEADING
     C*==============================================================*
01===C           RTN000    BEGSR
|    C*
|    C                     Z-ADD0         AMT1
|    C                     Z-ADD0         AMT2
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T2TOT1
|    C                     Z-ADD0         T2TOT2
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....READ DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
     C*
     C                     ADD  PH11      AMT1
     C                     ADD  PH12      AMT2
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTNL1  ...WRITE PD1
     C*==============================================================*
04===C           RTNL1     BEGSR
     C*
|    C           PH06      CHAINMB0                  40
|    C           *IN40     IFEQ '1'
|    C                     MOVEL*BLANKS   MB03
     C                     END
     C*
     C                     MOVELPH05      ME01
     C                     MOVEL*BLANK    ME02
|    C           KEYME     CHAINME0                  41
|    C           *IN41     IFEQ '1'
|    C                     MOVEL*BLANKS   ME04
     C                     END
     C*
|   C   39                EXSR RTN900                     *PROC SKIP
|   C                     WRITEPD1
     C                     SETON                     30
     C                     ADD  AMT1      T1TOT1
     C                     ADD  AMT2      T1TOT2
     C                     Z-ADD0         AMT1
     C                     Z-ADD0         AMT2
     C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTNL2  ...WRITE PT1
     C*==============================================================*
04===C           RTNL2     BEGSR
     C*
|   C   39                EXSR RTN900                     *PROC SKIP
|   C                     WRITEPT1
     C                     SETOF                     30
     C                     ADD  T1TOT1    T2TOT1
     C                     ADD  T1TOT2    T2TOT2
     C                     Z-ADD0         T1TOT1
     C                     Z-ADD0         T1TOT2
     C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTNLR  ...WRITE PE9
     C*==============================================================*
04===C           RTNLR     BEGSR
|    C*
|   C   39                EXSR RTN900                     *PROC SKIP
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     WRITEPE9
     C                     END
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
08===C           RTN900    BEGSR
|    C*
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
08===C                     ENDSR
