      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR060                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 84/03/21                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :完稅產品空瓶重量表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.07  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FPOR060D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DPF01S
     I                                      603 604 DPF01E
     I                                      611 6160DATES
     I                                      621 6260DATEE
M001AI                                      701 7080X8S
M001AI                                      711 7180X8E
     I                                      631 635 DMA12S
     I                                      636 640 DMA12E
     I                                      650 650 IN20
     I                                      661 6660DPF04S
     I                                      671 6760DPF04E
     I                                      681 6860DPF11S
     I                                      691 6960DPF11E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DPF01S
|    C                     MOVE *BLANK    DPF01E
|    C                     MOVE *BLANK    DMA12S
|    C                     MOVE *BLANK    DMA12E
|    C                     Z-ADD0         DPF04S
|    C                     Z-ADD0         DPF04E
|    C                     Z-ADD0         DPF11S
|    C                     Z-ADD0         DPF11E
M001AC                     Z-ADD0         X8S
M001AC                     Z-ADD0         X8E
|    C                     MOVE *BLANK    IN20
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           DPF01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPF01S
| 01-C                     END
|    C*
| 02-C           DPF01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPF01E
| 02-C                     END
|    C*
| 03-C           DPF01S    IFGT DPF01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*供應商代號
| 01-C           DMA12S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA12S
| 01-C                     END
|    C*
| 02-C           DMA12E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMA12E
| 02-C                     END
|    C*
| 03-C           DMA12S    IFGT DMA12E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*完稅日期和入庫日期僅能擇一輸入
| 13-C           DPF04S    IFNE 0
|   C           DPF04E    ORNE 0
| 14-C           DPF11S    IFNE 0
|   C                     SETON                     669199
| 14-C                     END
| 15-C           DPF11E    IFNE 0
|   C                     SETON                     679199
| 15-C                     END
| 13-C                     END
|    C   99                GOTO END100
|    C*
| 14-C*M001D     DPF11S    IFEQ 0
     C*M001D     DPF11E    ANDEQ0
|   C*M001D               SETON                     666799
| 14-C*M001D               END
M001DC*M001D  99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 16-C           DPF04S    IFNE 0
M001AC           DPF04E    ORNE 0
|   C                     CALL 'P09'
|   C                     PARM DPF04S    P0901I  60
|   C                     PARM           P0901O  1
| 17-C           P0901O    IFEQ 'N'
|   C                     SETON                     629499
| 17-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DPF04E    P0901I  60
|   C                     PARM           P0901O  1
| 18-C           P0901O    IFEQ 'N'
|   C                     SETON                     639499
| 18-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DPF04S    S001I2  60
M001MC           DATES     PARM           S001O1  60
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    X8S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DPF04E    S001I2  60
M001MC           DATEE     PARM           S001O1  60
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    X8E
|   C**
| 19-C           X8S       IFGT X8E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 19-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 16*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DPF11S    P0901I  60
|   C                     PARM           P0901O  1
| 20-C           P0901O    IFEQ 'N'
|   C                     SETON                     669499
| 20-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DPF11E    P0901I  60
|   C                     PARM           P0901O  1
| 21-C           P0901O    IFEQ 'N'
|   C                     SETON                     679499
| 21-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DPF11S    S001I2  60
|   C           DATES     PARM           S001O1  60
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    X8S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DPF11E    S001I2  60
|   C           DATEE     PARM           S001O1  60
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    X8E
|   C**
| 22-C*M001M     DATES     IFGT DATEE
M001MC           X8S       IFGT X8E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 22-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 16-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C**
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS002'
|   C                     PARM           DMA12S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C**
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS002'
|   C                     PARM           DMA12E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
