      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : POR0582                                       *
      * AUTHOR       : AN MING HSIA                                  *
      * CREATE DATE  : 10/26/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購資料系統                                 *
      * REMARK       :國內供應商進貨明細表                         *
      ****************************************************************
     FREWF91  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMBPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPOR058P O   E             39     PRINTER
     IWF910
     I                                              WF9103L1
     I                                              WF9102L2
     I                                              WF9101L3
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I*
     I                                      601 605 DPH06S
     I                                      606 610 DPH06E
     I                                      611 619 DPI04S
     I                                      621 629 DPI04E
     I                                      630 634 DPH05S
     I                                      635 639 DPH05E
     I*(MM/YY)
     I                                      650 6530DPH04S
     I                                      650 6510PH04SM
     I                                      652 6530PH04SY
     I                                      654 6570DPH04E
     I                                      654 6550PH04EM
     I                                      656 6570PH04EY
     I            DS
B2MODI                                        1   60WF9104
B2MODI                                        1   40WF04YY
B2MODI                                        5   60WF04MM
     I            DS
     I                                        1   40D9104
     I                                        1   20D04MM
     I                                        3   40D04YY
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*          KEY#A     KLIST
     C*                    KFLD           #A01
     C*                    KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C                     SETON                     10
     C*
     C                     EXSR RTN100
     C*
     CL1                   EXSR RTN200
     CL2                   SETOF                       3132
     CL2                   SETOF                     303132
     CLR                   EXSR RTN999
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*進貨物流點
|    C           WF9101    CHAINME0                  40
|    C   40                MOVE *BLANK    ME04
|    C*
|    C*供應商簡稱
|    C           WF9102    CHAINMB0                  40
|    C   40                MOVE *BLANK    MB03
|    C*
|    C*
| 01-C           $RMK01    IFEQ 'Y'
|   C                     SETON                     34
| 01*C                     ELSE
| 01-C           WF9102    IFNE 'LR000'
|   C                     SETON                     34
| 01*C                     ELSE
|   C                     SETOF                     34
| 01-C                     END
| 01-C                     END
|    C*
|    C*
|    C*產品名稱
|    C           WF9103    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA14
|   C                     MOVE *BLANK    MA03
| 01-C                     END
|    C*
|    C*進貨日期
B2TRCC                     Z-ADDWF04YY    D04YY
|    C                     Z-ADDWF04MM    D04MM
|    C*
|    C   39                EXSR RTN900
|    C*
|    C                     WRITEPD1
     C*
     C                     SETON                     303132
|    C                     ADD  WF9106    T0T06
|    C                     ADD  WF9107    T0T07
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....TOTAL
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C*
|    C                     WRITEPT1
     C*
     C                     SETOF                     32
|    C*
|    C                     Z-ADD0         T0T06
|    C                     Z-ADD0         T0T07
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN999
      *==============================================================*
05===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C                     WRITEPE2
|    C*
05===C                     ENDSR
