      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : POR0581                                       *
      * AUTHOR       : AN MING HSIA                                  *
      * CREATE DATE  : 10/26/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購資料系統                                 *
      * REMARK       :國內供應商進貨明細表                         *
      ****************************************************************
     FPOPHPF  IF  E           K        DISK
     FPOPIPF  IF  E           K        DISK
     FREWF91  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I*
     I                                      601 605 DPH06S
     I                                      606 610 DPH06E
     I                                      611 619 DPI04S
     I                                      621 629 DPI04E
     I                                      630 634 DPH05S
     I                                      635 639 DPH05E
     I            DS
B2MODI                                        1   80PH04
B2MODI                                        1   60WF9104
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF9101
     C                     KFLD           WF9102
     C                     KFLD           WF9103
     C                     KFLD           WF9104
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
|    C*驗收主檔
|    C                     READ PH0                      45
| 01-C           *IN45     DOWEQ'0'
|   C                     MOVE PH05      WF9101
|   C                     MOVE PH06      WF9102
|   C*驗收明細檔
|   C           PH02      SETLLPI0                  40
|   C           PH02      READEPI0                      40
| 02-C           *IN40     DOWEQ'0'                          新增
|   C*
     C                     MOVE PI04      WF9103
| 03-C           WF9103    IFGE DPI04S
|   C           WF9103    ANDLEDPI04E
|   C*
|   C           KEYWF     CHAINWF910                41
| 04-C           *IN41     IFEQ '1'
|   C                     EXSR RTN200
| 04*C                     ELSE
|   C                     EXSR RTN300
| 04-C                     END
| 04-C                     END
|   C           PH02      READEPI0                      40
| 03-C                     END
|   C*
|   C                     READ PH0                      45
| 02-C                     END
|   C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN200....WRITE WORK FILE
      *==============================================================*
02===C           RTN200    BEGSR
     C*
|   C                     Z-ADDPI06      WF9106
|   C                     Z-ADDPI09      WF9107
|   C                     ADD  PI10      WF9107
|   C*
|   C                     WRITEWF910
|   C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....UPDATE WORK FILE
      *==============================================================*
03===C           RTN300    BEGSR
|   C*
|   C                     ADD  PI06      WF9106
|   C                     ADD  PI09      WF9107
|   C                     ADD  PI10      WF9107
|   C*
|   C                     UPDATWF910
|   C*
03===C                     ENDSR
