      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR0621                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 03/21/97                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :國外採購成本差異表　　                       *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.07  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREW109  IP  E           K        DISK
     FPOPELF02IF  E           K        DISK
     FMTMALF  IF  E           K        DISK
     FMTMBLF  IF  E           K        DISK
     FPOR062P O   E             39     PRINTER
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      612 6170DPD04
     I                                      622 6270WPD04
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF905
     C                     KFLD           WF903
     C                     KFLD           WF902
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     WRITEPH1
    C                     SETON                     10
  01-C                     END
     C*
     C                     EXSR RTN010
     C                     EXSR RTN100
     C*
     C   39                EXSR RTN900
     C*
     C                     WRITEPD1
     C*
     CLR                   EXSR RTNLR
     C*
     C*==============================================================*
     C*          RTN010....GET 供應商
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C* 供應商名稱
|    C           WF904     CHAINMB0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MB03
| 02-C                     END
|    C* 產品名稱
|    C           WF905     CHAINMA0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MB03
| 03-C                     END
|    C*
|    C                     Z-ADD0         TEMP
|    C                     MOVE *BLANK    PF902
|    C                     Z-ADD0         PF908
|    C                     Z-ADD0         PF903
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*找上一筆驗收明細
|    C*
B2000C           KEYWF     CHAINPE0                  44
|    C                     READPPE0                      47
|    C*
| 01-C           *IN47     IFEQ '0'
| 02-C           WF905     IFEQ PE04
|   C*
|   C*數量*單位轉換
|   C           PE06      MULT WF9XX     TEMPX   80
|   C*
|   C* F.O.B / 總數量=F.O.B 單位成本
|   C           PE07      DIV  TEMPX     PF908
|   C                     MOVELPE02      PF902
|    C           WF908     SUB  PF908     TEMP
|   C*
|   C*日期轉換
M001AC                     Z-ADDPE05      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM PE05      S001I2  80
M001MC                     PARM W6        S001I2  60
|   C           PF903     PARM           S001O1  60
|   C*
| 02-C                     END
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
04===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01*C                     ELSE
|   C                     WRITEPE2
|   C                     ENDIF
04===C                     ENDSR
