      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR0501                                       *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/01/27                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :驗收單明細表                                 *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FREWF01  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPOPBPF  IF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
B2CHKFPOR050APO   E             39     PRINTER
B2INF *CVR3010 sev.30 PRINTER file POR050AP must be converted, because
B2INF *   file PI05 (and more) are shared by name with other database
B2INF *   fields which require to be expanded. Please convert POR050AP,
B2INF *   enlarging all involved fields prior to compilation, or manually
B2INF *   insert in this source the proper RENAME and MOVE statements to
B2INF *   avoid name sharing
     IPI0
     I                                              PI05  L3
     I                                              PI02  L2
     I                                              PI03  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DPI01
     I                                      603 604 DDOC
     I                                      605 6100DPI05S
     I                                      611 6160DPI05E
     I                                      618 622 DPH06S
     I                                      623 627 DPH06E
     I                                      617 617 DATA
M001AI                                      631 6380DATES
M001AI                                      641 6480DATEE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEY#B     KLIST
     C                     KFLD           DPI01
     C           KEYMA     KLIST
     C                     KFLD           PI04
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900
     C*
     C           PI03      CHAINPB0                  41
     C*
     C           *IN41     IFEQ '1'
     C                     Z-ADD0         PB04
     C                     END
     C* GET轉換日期
M001AC                     Z-ADDPB04      W6      60
     C                     CALL 'RES001'
     C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM PB04      S001I2  80
M001MC                     PARM W6        S001I2  60
B2MODC*M001M     PB04      PARM           S001O1  80
M001MC           LPB04     PARM           S001O1  60
     C* GET轉換日期
M001AC                     Z-ADDPI05      W6      60
     C                     CALL 'RES001'
     C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM PI05      S001I2  80
M001MC                     PARM W6        S001I2  60
B2MODC*M001M     PI05      PARM           S001O1  80
M001MC           LPI05     PARM           S001O1  60
     C* GET 產品簡稱／單位
     C           KEYMA     CHAINMA0                  40
     C   40                MOVE *BLANK    MA06
     C   40                MOVE *BLANK    MA14
     C*
     C                     WRITEPD1
     C                     SETOF                     303132
     C*
     CL1                   SETON                     32
     CL2                   SETON                     3132
     CL3                   SETON                     303132
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C* GET公司別
|    C           KEY#B     CHAIN#B0                  40
|    C   40                MOVE *BLANK    #B03
|    C* GET單別
|    C                     MOVELDDOC      #201
|    C                     MOVELDDOC      #202
|    C           KEY#2     CHAIN#20                  40
|    C   40                MOVE *BLANK    #203
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     10
|    C                     SETON                     303132
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
02===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETON                     303132
|    C                     SETOF                     39
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
03===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
03===C                     ENDSR
