      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR059                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/12/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購分析系統                                 *
      * REMARK       :國外到貨統計年報                             *
      ****************************************************************
     FPOR059D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      600 601 DPD01S
     I                                      602 603 DPD01E
     I                                      610 614 DPD07S
     I                                      615 619 DPD07E
     I                                      620 628 DPE04S
     I                                      630 638 DPE04E
      *MM//YY
     I                                      641 6440DPD04
     I                                      641 6420DPD04M
     I                                      643 6440DPD04Y
     I*往前一年
     I                                      650 6530PD04S
     I                                      650 6510PD04SY
     I                                      652 6530PD04SM
     I                                      654 6570PD04E
     I                                      654 6550PD04EY
     I                                      656 6570PD04EM
M001AI*(YYYY/MM/DD)
M001AI                                      850 855 YMD8S
M001AI                                      858 863 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DPD01S
|    C                     MOVE *BLANK    DPD01E
|    C                     MOVE *BLANK    DPD07S
|    C                     MOVE *BLANK    DPD07E
|    C                     MOVE *BLANK    DPE04S
|    C                     MOVE *BLANK    DPE04E
|    C                     Z-ADD0         DPD04
|    C                     Z-ADD0         PD04E
|    C                     Z-ADD0         PD04S
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *
|    C*公司
| 01-C           DPD01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DPD01S
| 01-C                     END
|    C*
| 02-C           DPD01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DPD01E
| 02-C                     END
|    C*
| 03-C           DPD01S    IFGT DPD01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*供應商
| 01-C           DPD07S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DPD07S
| 01-C                     END
|    C*
| 02-C           DPD07E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DPD07E
| 02-C                     END
|    C*
| 03-C           DPD07S    IFGT DPD07E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*產品
| 01-C           DPE04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DPE04S
| 01-C                     END
|    C*
| 02-C           DPE04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DPE04E
| 02-C                     END
|    C*
| 03-C           DPE04S    IFGT DPE04E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*驗收年月
| 04-C           DPD04     IFNE 0
      *
| 06-C           DPD04M    IFGT 12
|   C           DPD04M    ORLT 1
|   C                     SETON                     669399
| 06-C                     END
|   C   99                GOTO END100
      *年月YY/MM
|   C                     Z-ADDDPD04Y    PD04EY
|   C                     Z-ADDDPD04M    PD04EM
| 07-C                     END
      *去年下月OR本年一月
|    C           PD04EM    ADD  1         PD04SM
| 08-C           PD04SM    IFEQ 13
|   C                     Z-ADD1         PD04SM
|   C                     Z-ADDPD04EY    PD04SY
| 08*C                     ELSE
M001AC                     MOVE PD04EY    HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    XD04EY  40
M001DC*          PD04EY    SUB  1         PD04SY
M001AC           XD04EY    SUB  1         PD04SY
| 08-C                     END
|    C*
M001AC                     MOVE PD04S     YMD8S
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE PD04S     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8S
|    C*
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE PD04E     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8E
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 40
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS002'
|   C                     PARM           DPD07S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS002'
|   C                     PARM           DPD07E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 9
| 03-C           D#COL     IFGE 40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS001'
|   C                     PARM           DPE04S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS001'
|   C                     PARM           DPE04E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C                     SETON                     99
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
