      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR047                                        *
      * AUTHER       : A1118 PHILP TSAI                              *
      * CREATE DATE  : 81/01/17                                      *
      * UPDATE DATE  : 81/01/24                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購資料子系統                               *
      * REMARK       :國外採購到貨明細表                           *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.16 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FPOR047D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DPD01S
     I                                      603 604 DPD01E
     I                                      605 616 DPD02S
     I                                      617 628 DPD02E
     I*(MM/DD/YY)
     I                                      631 6360DPD04S
     I                                      641 6460DPD04E
     I*
     I                                      651 655 DPD07S
     I                                      656 660 DPD07E
     I*(YY/MM/DD)
M001MI*                                     661 6660WPD04S
M001MI*                                     671 6760WPD04E
M001MI                                      661 6680WPD04S
M001MI                                      671 6780WPD04E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DPD01S
|    C                     MOVE *BLANK    DPD01E
|    C                     MOVE *BLANK    DPD02S
|    C                     MOVE *BLANK    DPD02E
     C                     MOVE *BLANK    DPD07S
     C                     MOVE *BLANK    DPD07E
     C                     Z-ADD0         DPD04S
     C                     Z-ADD0         DPD04E
     C                     Z-ADD0         WPD04S
     C                     Z-ADD0         WPD04E
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
     C*
     C*********
|    C*公司別
     C*********
| 01-C           DPD01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPD01S
| 01-C                     END
|    C*
| 02-C           DPD01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPD01E
| 02-C                     END
|    C*
| 05-C           DPD01S    IFGT DPD01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 05-C                     END
|    C   99                GOTO END100
|    C*
     C***********
|    C*驗收單號
     C***********
| 03-C           DPD02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPD02S
| 03-C                     END
|    C*
| 04-C           DPD02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPD02E
| 04-C                     END
|    C*
|   C           DPD02S    IFGT DPD02E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 06-C                     END
|    C   99                GOTO END100
|    C*
     C*********
|    C*供應商
     C*********
|    C*
     C           DPD07S    IFEQ *BLANK
     C                     MOVE *LOVAL    DPD07S
     C                     END
|    C*
     C           DPD07E    IFEQ *BLANK
     C                     MOVE *HIVAL    DPD07E
     C                     END
     C*
     C           DPD07S    IFGT DPD07E
     C                     SETON                     646599
     C                     SETON                     93
     C                     END
     C*
|    C   99                GOTO END100
     C***********
|    C*進貨日期
     C***********
     C*
     C           DPD04S    IFEQ 0
M001MC*                    Z-ADD010101    DPD04S
M001MC                     Z-ADD010192    DPD04S
     C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DPD04S    P0901I  60
|   C                     PARM           P0901O  1
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     669299
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
| 06-C           DPD04E    IFEQ 0
M001MC*                    Z-ADD123199    DPD04E
M001MC                     Z-ADD123129    DPD04E
     C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DPD04E    P0901I  60
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     679299
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DPD04S    S001I2  60
|    C*M001M     WPD04S    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WPD04S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DPD04E    S001I2  60
|    C*M001M     WPD04E    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WPD04E
|    C*
| 09-C           WPD04S    IFGT WPD04E
|   C                     SETON                     6667
|   C                     SETON                     9399
| 09-C                     END
     C*
|    C   99                GOTO END100
     C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
