      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR0631                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 03/21/97                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :匯東進貨成本一覽表　　                       *
      ****************************************************************
     FMTMAPF  IP  E           K        DISK
     FPOPELF02IF  E           K        DISK
     FPOPCPF  IF  E           K        DISK
     F*MIALF01IF  E           K        DISK
     FPOR063P O   E             39     PRINTER
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I*產品組別
     I                                      612 613 DMA11
     I                                      614 615 WMA11S
     I                                      616 617 WMA11E
     I*產品代號
     I                                      621 629 DMA01S
     I                                      631 639 DMA01E
     I            DS
     I                                        1   9 MA01
     I                                        1   1 PRDFST
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA111
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           MA01
     C           KEYPC     KLIST
     C                     KFLD           PE03
     C                     KFLD           PE04
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     WRITEPH1
    C                     SETON                     10
  01-C                     END
     C*
     C                     EXSR RTN100
     C*
     C   39                EXSR RTN900
     C*
     C           TEMP      IFGT 1
     C                     WRITEPD1
     C                     END
     C*
     CLR                   EXSR RTNLR
     C*
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     Z-ADD0         TEMP
|    C                     Z-ADD0         TEMPX
|    C                     Z-ADD0         TEMPY
|    C*找上一筆驗收明細
|    C*
|    C           MA01      SETGTPE0                  44
|    C                     READPPE0                      47
|    C*
     C           *IN47     IFEQ '0'
  03-C           MA01      ANDEQPE04
     C           MA111     ANDEQ'3'
|   C                     EXSR RTN110
     C                     ELSE
| 02-C*          *IN47     IFEQ '0'
  03-C*          MA01      ANDEQPE04
     C*          MA111     ANDNE'3'
|   C*          MA34      MULT 1.1       TEMP
| 03 C*                    ELSE
| 04-C*          MA34      IFNE 0
     C*          PRDFST    ANDEQ'O'
|   C*          MA34      MULT 1.1       TEMP
| 03 C*                    ELSE
| 04-C           MA34      IFNE 0
     C*          MA54      ANDEQ'Y'
     C           MA30      ANDNE0
|   C           MA34      MULT 1.1       TEMP
| 04-C                     END
| 04-C                     END
| 04-C*                    END
| 02-C*                    END
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN0110....GET 　　　
     C*==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C*數量*單位轉換
     C           KEYPC     CHAINPC0                  40
     C           *IN40     IFEQ '0'
     C           PE06      MULT PC10      TEMPX
     C                     ELSE
     C           PE06      MULT MA16      TEMPX   80
     C                     END
|    C*
|    C* F.O.B + FREIGHT +HANDLE =成本
|    C                     ADD  PE08      PE07
|    C                     ADD  PE09      PE07
|    C*
|    C* 成本 / 總數量=F.O.B 單位成本
|    C           PE07      DIV  TEMPX     TEMPY   92
|    C           TEMPY     ADD  MA25      TEMP
     C                     MULT 1.1       TEMP
|    C*
     C           ENDTAG    TAG
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
04===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C*                    EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01*C                     ELSE
|   C                     WRITEPE2
|   C                     ENDIF
04===C                     ENDSR
