      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR0431                                       *
      * AUTHER       : A1118 PHILIP TSAI                             *
      * CREATE DATE  : 81/04/23                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購資料子系統                               *
      * REMARK       :採購單列印                                   *
      ****************************************************************
     FPOPBPF  UP  E           K        DISK
     FPOPCPF  IF  E           K        DISK
     FPOPJPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMBLF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPOR043P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 602 DPB01S
     I                                      603 604 DPB01E
     I                                      605 616 DPB02S
     I                                      617 628 DPB02E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     SETON                     1020
     C*表頭列印
     C                     EXSR RTN100
     C*明細列印
     C                     EXSR RTN200
     C*表尾列印
     C                     EXSR RTN300
     C*
     C*R 20                WRITEPH1
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*
M001AC                     Z-ADDPB04      XPB04   60
|    C                     CALL 'P51'
M001DC*                    PARM PB04      P5101I  80
M001AC                     PARM XPB04     P5101I  60
|    C                     PARM 'YMD'     P5102I  3
|    C                     PARM '1'       P5103I  1
|    C           WPB04     PARM           P5111O 13
|    C**
|    C*供應商名稱
|   C                     MOVE *BLANK    MB041
|   C                     MOVE *BLANK    MB042
|   C                     MOVE *BLANK    MB043
|   C                     MOVE *BLANK    MB044
|   C                     MOVE *BLANK    MB045
|   C                     MOVE *BLANK    MB046
|    C           PB05      CHAINMB0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MB02
|   C                     MOVE *BLANK    MB06
|   C                     MOVE *BLANK    MB07
|   C                     MOVE *BLANK    MB08
|   C                     MOVE *BLANK    MB09
|   C                     MOVE *BLANK    MB10
     C                     ELSE
      *
     C           MB06      IFEQ *BLANKS
     C                     MOVELMB04      MB041
     C                     ELSE
     C           MB07      IFEQ *BLANKS
     C                     MOVELMB04      MB042
     C                     ELSE
     C           MB08      IFEQ *BLANKS
     C                     MOVELMB04      MB043
     C                     ELSE
     C           MB09      IFEQ *BLANKS
     C                     MOVELMB04      MB044
     C                     ELSE
     C           MB10      IFEQ *BLANKS
     C                     MOVELMB04      MB045
     C                     ELSE
     C                     MOVELMB04      MB046
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
      *
| 01-C                     END
|    C*PAGE
|    C                     Z-ADD1         WPAGE
|    C*幣別
|    C                     MOVE *BLANK    #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVE 'CURRENCY'#A01
|    C                     MOVELPB07      #A02
|    C           KEY#A     CHAINPA#APF               40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #A031
| 02*C                     ELSE
|   C                     MOVE #A03      #A031
| 02-C                     END
|    C*付款條件
|    C                     MOVE *BLANK    #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVE 'PAYMENT '#A01
|    C                     MOVELPB09      #A02
|    C           KEY#A     CHAINPA#APF               40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #A032
| 03*C                     ELSE
|   C                     MOVE #A03      #A032
| 03-C                     END
|    C*價格條件
|    C                     MOVE *BLANK    #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVE 'PRICE   '#A01
|    C                     MOVELPB10      #A02
|    C           KEY#A     CHAINPA#APF               40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #A033
| 04*C                     ELSE
|   C                     MOVE #A03      #A033
| 04-C                     END
|    C*運輸方式
|    C                     MOVE *BLANK    #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVE 'DELIVERY'#A01
|    C                     MOVELPB12      #A02
|    C           KEY#A     CHAINPA#APF               40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #A034
| 05*C                     ELSE
|   C                     MOVE #A03      #A034
| 05-C                     END
|    C*ETD
|    C*
     C                     MOVEL*BLANKS   WPB14
B2CHKC           PB14      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001AC                     Z-ADDPB14      XPB14   60
|    C                     CALL 'P51'
M001DC*                    PARM PB14      P5101I  80
M001AC                     PARM XPB14     P5101I  60
|    C                     PARM 'YMD'     P5102I  3
|    C                     PARM '1'       P5103I  1
|    C           WPB14     PARM           P5111O 13
     C                     END
|    C*ETA
     C                     MOVEL*BLANKS   WPB15
B2CHKC           PB15      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
M001AC                     Z-ADDPB15      XPB15   60
|    C                     CALL 'P51'
M001DC*                    PARM PB15      P5101I  80
M001AC                     PARM XPB15     P5101I  60
|    C                     PARM 'YMD'     P5102I  3
|    C                     PARM '1'       P5103I  1
|    C           WPB15     PARM           P5111O 13
     C                     END
|    C*
|    C                     SETOF                     10
|    C                     EXSR RTN900
|    C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN200....GET DETAIL
     C*==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C           PB02      SETLLPC0
|    C           PB02      READEPC0                      41
|    C*
|    C                     Z-ADD1         RECCNT
| 01-C           *IN41     DOWEQ'0'
|   C*GET DESCRIPTION & PACKAGE
|   C           PC03      CHAINMA0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA024
|   C                     MOVE *BLANK    MA05
|   C                     MOVE *BLANK    MA17
| 02*C                     ELSE
|   C*DESCRIPTION CONTROL PRINTING
|   C                     SELEC
|   C           PB03      WHEQ 'P1'
|   C                     MOVELMA04      MA024
|   C                     SETON                     30
|   C           PB03      WHEQ 'P2'
|   C                     MOVELMA02      MA024
|   C                     SETOF                     30
|   C                     OTHER
|   C                     MOVE *BLANK    MA024
|   C                     MOVE *BLANK    MA05
|   C                     ENDSL
| 02-C                     END
|   C*翻頁控制
| 03-C           RECCNT    IFGT 10
|   C                     ADD  1         WPAGE
|   C                     EXSR RTN900
|   C                     Z-ADD1         RECCNT
| 03-C                     END
|   C*明細列印
     C                     ADD  PC06      WQTY
|   C                     WRITEPD1
|   C                     ADD  1         RECCNT  20
|   C           PB02      READEPC0                      41
| 01-C                     END
02===C                     ENDSR
     C*==============================================================*
     C*          RTN300....WRITE FOOT
     C*==============================================================*
03===C           RTN300    BEGSR
|    C**列印總計
     C           PB03      IFEQ 'P2'
     C                     SETON                     80
     C           PB08      ADD  PB22      WAMT
     C                     ELSE
     C                     SETOF                     80
     C                     Z-ADDPB08      WAMT
     C                     END
     C*
|    C                     WRITEPE2
     C                     Z-ADD0         WQTY
|    C*列印備註
|    C           PB13      SETLLPJ0
|    C           PB13      READEPJ0                      41
| 01-C           *IN41     DOWEQ'0'
|   C                     WRITEPE3
|   C           PB13      READEPJ0                      41
| 01-C                     END
|    C*結束行列印
|    C                     WRITEPE4
|    C*更新主檔資料
M001DC*                    Z-ADD0         DATE    80
M001AC                     Z-ADD0         DATE    60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM $EGMDY    S001I2  60
M001DC*          DATE      PARM           S001O1  80
M001AC           DATE      PARM           S001O1  60
|    C*
|    C                     ADD  1         PB21
M001DC*                    Z-ADDDATE      PBXX
M001AC                     MOVE DATE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    PBXX
B2000C                     TIME           PBYY
|    C                     MOVE $USER     PBZZ
|    C                     UPDATPB0
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
| 01-C           *IN10     IFEQ '1'
|   C*續頁行列印
|   C                     WRITEPE1
| 01-C                     END
|    C*表頭列印
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
     C/COPY HBP2CVTR
