      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : POR065D                                       *
      * AUTHOR       : AN MING HSIA                                  *
      * CREATE DATE  : 09/08/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存資料系統                                 *
      * REMARK       :建議產品採購表                               *
      ****************************************************************
     FPOR065D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      119 1200EGMM
     I                                      123 1240EGYY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080YMD8
     I                                      598 5990$PRTID
     I*
     I                                      601 609 DMA01S
     I                                      611 619 DMA01E
     I                                      620 6210DSEL1
     I                                      631 6320DSEL2
     I*                                     633 633 DMA58
     I                                      622 622 DSEL3
     I*採購計算年月
     I                                      623 6260DYM
     I                                      623 6240DYY
     I                                      625 6260DMM
     I                                      627 6300EYM
     I                                      627 6280EYY
     I                                      629 6300EMM
     I*
M001AI*(YYYY/MM/DD)
M001AI                                      850 855 YMD8S
M001AI                                      858 863 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DMA01S
|    C                     MOVE *BLANK    DMA01E
|    C                     Z-ADD0         DSEL1
|    C                     Z-ADD0         DSEL2
|    C                     MOVE 'Y'       DSEL3
|    C*                    MOVE 'A'       DMA58
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*產品代號
| 01-C           DMA01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA01S
| 01-C                     END
|    C*
| 02-C           DMA01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMA01E
| 02-C                     END
|    C*
| 03-C           DMA01S    IFGT DMA01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C           DSEL1     DIV  12        WYY     20
|    C                     MVR            WMM     20
|    C*計算銷售開始年月
M001AC                     MOVE EGYY      HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    EGYYX   40
M001DC*          EGYY      SUB  WYY       EYY
M001AC           EGYYX     SUB  WYY       EYYX    40
M001AC                     Z-ADDEYYX      EYY
|    C           EGMM      SUB  WMM       EMM
| 04-C           EMM       IFLE 0
|   C           EMM       ADD  12        EMM
M001DC*          EYY       SUB  1         EYY
M001AC           EYYX      SUB  1         EYY
| 04-C                     END
|    C*計算銷售結束年月
|    C           EGMM      SUB  1         DMM
| 05-C           DMM       IFLE 0
|   C           DMM       ADD  12        DMM
M001DC*          EGYY      SUB  1         DYY
M001AC           EGYYX     SUB  1         DYY
| 05*C                     ELSE
M001DC*                    Z-ADDEGYY      DYY
M001AC                     Z-ADDEGYYX     DYY
| 05-C                     END
M001AC                     MOVE EYM       YMD8S
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE EYM       HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8S
|    C*
M001AC                     MOVE DYM       YMD8E
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE DYM       HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8E
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品代號
| 02-C           D#ROW     IFEQ 6
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
