      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR0611                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 11/02/96                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :國內進貨報價明細表列印                       *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.07  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FPOPAPF  IP  E           K        DISK
     FMTMBLF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     F*PA#APF  IF  E           K        DISK
B2CHKFPOR061P O   E             39     PRINTER
B2INF *CVR3010 sev.30 PRINTER file POR061P must be converted, because file
B2INF *   PA04 (and more) are shared by name with other database fields
B2INF *   which require to be expanded. Please convert POR061P, enlarging
B2INF *   all involved fields prior to compilation, or manually insert in
B2INF *   this source the proper RENAME and MOVE statements to avoid name
B2INF *   sharing
     IPA0
     I                                              PA01  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      602 606 DPA01S
     I                                      607 611 DPA01E
     I                                      612 6170DDATE
     I                                      622 6270DATEP
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     WRITEPH1
    C                     SETON                     10
  01-C                     END
     C                     EXSR RTN010
     C*
     C   L1                EXSR RTN200
     C*(OVERFLOW)
     C   39                EXSR RTN900
     C*(WRITE DATA)
M001AC                     Z-ADDPA04      DPA04
M001AC                     Z-ADDPA06      DPA06
     C                     WRITEPD1
     C                     Z-ADD0         TEMP1
     C                     Z-ADD0         TEMP2
     C                     Z-ADD0         TEMP3
     C*(NO DATA)
     CLR                   EXSR RTNLR
     C*
     C*==============================================================*
     C*          RTN010....GET 供應商
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C* 供應商名稱
|    C           PA01      CHAINMB0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MB03
| 02-C                     END
|    C*產品名稱
|    C           PA03      CHAINMA0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA03
| 03-C                     END
|    C*
|    C                     EXSR RTN100
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*計算進價
| 01-C           PA14      IFNE 0
|   C           PA09      DIV  PA14      PA09
| 01-C                     END
|    C                     Z-ADDPA09      TEMP1
|    C*毛利
|    C           MA46      SUB  TEMP1     TEMP2
|    C*毛利率
| 02-C           TEMP1     IFNE 0
|   C           TEMP2     DIV  TEMP1     TEMP3
| 02-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN200....SPACEA
      *==============================================================*
04===C           RTN200    BEGSR
|    C*
|    C                     WRITEPD2
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
05===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01*C                     ELSE
|   C                     WRITEPE2
|   C                     ENDIF
05===C                     ENDSR
