      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR062       COPY FROM POR041                 *
      * AUTHER       :                                               *
      * CREATE DATE  : 03/21/97                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :國外採購成本差異表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.07  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FPOR062D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080SDATE
     I                                      598 5990$PRTID
     I                                      612 6170DPD04
     I                                      612 6130MM
     I                                      614 6150DD
     I                                      616 6170YY
     I                                      622 6270WPD04
     I                                      622 6230Y
     I                                      624 6250M
     I                                      626 6270D
M001AI                                      631 6380X8S
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
| 03-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 03-C                     END
|    C                     MOVEL'SCR001'  APPSCR  6
|    C                     Z-ADD0         DPD04
|    C                     Z-ADD0         WPD04
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*(CHECK DATE)
|    C*日期
| 01-C           DPD04     IFEQ 0
|   C                     SETON                     99
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01*C                     ELSE
|   C                     Z-ADDMM        M
|   C                     Z-ADDDD        D
|   C                     Z-ADDYY        Y
M001AC                     MOVE WPD04     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    X8S
|   C                     CALL 'P09'
|   C                     PARM DPD04     P0901I  60
|   C                     PARM           P0911O  1
| 02-C           P0911O    IFEQ 'N'
|   C                     SETON                     6299
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|   C*
| 01-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
