      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR050                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/01/27                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :驗收單明細表                                 *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FPOR050D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 602 DPI01
     I                                      603 604 DDOC
     I                                      605 6100DPI05S
     I                                      611 6160DPI05E
     I                                      618 622 DPH06S
     I                                      623 627 DPH06E
     I                                      617 617 DATA
M001AI                                      631 6380DATES
M001AI                                      641 6480DATEE
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DPI01
|    C                     MOVE *BLANK    DDOC
|    C                     Z-ADD0         DPI05S
|    C                     Z-ADD0         DPI05E
M001DC*                    Z-ADD0         DATES   60
M001DC*                    Z-ADD0         DATEE   60
M001AC                     Z-ADD0         W6      60
|    C                     MOVE *BLANK    DATA
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DPI01     IFEQ *BLANKS
|   C                     SETON                     60
|   C                     SETON                     9699
| 01-C                     END
|    C   99                GOTO END100
|    C**單別
| 02-C           DDOC      IFEQ *BLANKS
|   C                     SETON                     61
|   C                     SETON                     9699
| 02-C                     END
|    C   99                GOTO END100
|    C**供應商代號
| 01-C           DPH06S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPH06S
| 01-C                     END
|    C*
| 02-C           DPH06E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPH06E
| 02-C                     END
|    C*
| 03-C           DPH06S    IFGT DPH06E
|   C                     SETON                     6566
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C**驗收日期
| 03-C           DPI05S    IFEQ 0
|   C*M001M               Z-ADD010101    DPI05S
M001MC                     Z-ADD010192    DPI05S
| 03*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DPI05S    P0901I  60
|   C                     PARM           P0901O  1
| 04-C           P0901O    IFEQ 'N'
|   C                     SETON                     629499
| 04-C                     END
| 03-C                     END
|    C   99                GOTO END100
|    C*
| 05-C           DPI05E    IFEQ 0
M001MC*                    Z-ADD123199    DPI05E
M001MC                     Z-ADD123129    DPI05E
| 05*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DPI05E    P0901I  60
|   C                     PARM           P0901O  1
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     639499
| 06-C                     END
| 05-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DPI05S    S001I2  60
|    C*          DATES     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DATES
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DPI05E    S001I2  60
|    C*          DATEE     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DATEE
|    C*
| 07-C           DATES     IFGT DATEE
|   C                     SETON                     6263
|   C                     SETON                     9399
| 07-C                     END
|    C   99                GOTO END100
|    C**選擇內容
| 08-C           DATA      IFEQ *BLANKS
|   C                     SETON                     64
|   C                     SETON                     9699
| 08-C                     END
|    C   99                GOTO END100
|    C* CHK AUT *
| 09-C           DATA      IFEQ 'B'
|   C           $ADD      ANDNE'Y'
|   C                     SETON                     64
|   C                     SETON                     9099
| 09-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*供應商
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS002'
|   C                     PARM           DPH06S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE48
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS002'
|   C                     PARM           DPH06E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
