      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR041                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/01/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :供應商報價資料列印                           *
      ****************************************************************
     FPOR041D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 601 DPA01
     I                                      602 606 DPA01S
     I                                      607 611 DPA01E
     I                                      612 6170DDATE
     I                                      618 618 DDETAL
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DPA01
|    C                     MOVE *BLANK    DPA01S
|    C                     MOVE *BLANK    DPA01E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C                     MOVE 'L'       DPA01
|    C                     MOVE 'C'       DDETAL
|    C                     Z-ADD0         DDATE
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           DPA01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPA01S
| 01-C                     END
|    C*
| 02-C           DPA01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPA01E
| 02-C                     END
|    C*
| 03-C           DPA01S    IFGT DPA01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)
|    C                     CALL 'P09'
|    C                     PARM DDATE     P0901I  60
|    C                     PARM           P0911O  1
| 04-C           P0911O    IFEQ 'N'
|   C           DDETAL    ANDEQ'C'
|   C                     SETON                     629499
| 04-C                     END
|    C   99                GOTO END100
M001AC                     Z-ADD0         XDATE   60
M001AC                     CALL 'RES001'
M001AC                     PARM 'MDY'     S001I1  3
M001AC                     PARM DDATE     S001I2  60
M001AC           XDATE     PARM           S001O1  60
M001AC                     MOVE XDATE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
