      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR045                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/01/23                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :供應商採購彙總表                             *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.07  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FPOR045D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DPC01S
     I                                      603 604 DPC01E
     I                                      605 6080DPC04S
     I                                      605 6060PC04SM
     I                                      607 6080PC04SY
     I                                      609 6120DPC04E
     I                                      609 6100PC04EM
     I                                      611 6120PC04EY
     I                                      613 614 DMA08S
     I                                      615 616 DMA08E
     I                                      617 6200SPC04S
     I                                      621 6240SPC04E
M001AI                                      631 6360X8S
M001AI                                      641 6460X8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DPC01S
|    C                     MOVE *BLANK    DPC01E
|    C                     Z-ADD0         DPC04S
|    C                     Z-ADD0         DPC04E
|    C                     Z-ADD0         SPC04S
|    C                     Z-ADD0         SPC04E
|    C                     MOVE *BLANK    DMA08S
|    C                     MOVE *BLANK    DMA08E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DPC01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPC01S
| 01-C                     END
|    C*
| 02-C           DPC01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPC01E
| 02-C                     END
|    C*
| 03-C           DPC01S    IFGT DPC01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C**月份起
| 04-C           DPC04S    IFEQ 0
|   C*M001M               Z-ADD101       DPC04S
M001MC                     Z-ADD192       DPC04S
| 04*C                     ELSE
| 05-C           PC04SM    IFGT 12
|   C           PC04SM    OREQ 0
|   C                     SETON                     629499
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*月份迄
| 06-C           DPC04E    IFEQ 0
|   C*M001M               Z-ADD1299      DPC04E
M001MC                     Z-ADD1229      DPC04E
| 06*C                     ELSE
| 07-C           PC04EM    IFGT 12
|   C           PC04EM    OREQ 0
|   C                     SETON                     639499
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C                     MOVE PC04SM    SPC04S
|    C                     MOVELPC04SY    SPC04S
|    C                     MOVE PC04EM    SPC04E
|    C                     MOVELPC04EY    SPC04E
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE SPC04S    HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     X8S
     C*
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE SPC04E    HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     X8E
|    C*
| 08-C*M001M     SPC04S    IFGT SPC04E
M001MC           X8S       IFGT X8E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 08-C                     END
|    C   99                GOTO END100
|    C*
|    C**產品識別
| 09-C           DMA08S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA08S
| 09-C                     END
|    C*
| 10-C           DMA08E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMA08E
| 10-C                     END
|    C*
| 11-C           DMA08S    IFGT DMA08E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 11-C                     END
|    C*
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
