      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR0521                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/08/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :供應商採購明細表                             *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.07  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FPOPCPF  IP  E           K        DISK
     FPOPELF01IF  E           K        DISK
     FPOPILF01IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMBLF  IF  E           K        DISK
     FPOR052P O   E             39     PRINTER
     IPC0
     I                                              PC04  L1
     I                                              PC05  L2
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 602 DPC01S
     I                                      603 604 DPC01E
     I                                      611 615 DPC05S
     I                                      621 625 DPC05E
     I*(MM/DD/YY)
     I                                      631 6360DPC04S
     I                                      641 6460DPC04E
     I*(YY/MM/DD)
     I                                      651 6560WPC04S
     I                                      661 6660WPC04E
     I*
     I            DS
     I                                        1  12 PC02
     I                                        4   4 PC021
      *==============================================================*
      *          KEY LIST
      *==============================================================*
     C           KEYPE     KLIST
     C                     KFLD           PC02
     C                     KFLD           PC03
     C*
     C           KEYPI     KLIST
     C                     KFLD           PC02
     C                     KFLD           PC03
      *==============================================================*
      *          MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *INIT VALUE
     C*
     C                     EXSR RTN100                     *PROC DATA
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....INIT VALUE
      *==============================================================*
     C           RTN010    BEGSR
     C*
     C                     Z-ADD0         PC06D
     C                     Z-ADD0         PC11D
     C                     Z-ADD0         P611D
     C                     Z-ADD0         PC06V
     C                     Z-ADD0         PC11V
     C                     Z-ADD0         P611V
     C                     Z-ADD0         PC06T
     C                     Z-ADD0         PC11T
     C                     Z-ADD0         P611T
     C*
     C                     EXSR RTN900                     *PROC SKIP
     C*
     C                     SETON                     3031
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN100....PROC DATA
      *==============================================================*
     C           RTN100    BEGSR
     C***********
     C*採購日期
     C***********
     C**
M001AC                     Z-ADDPC04      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM PC04      S001I2  80
M001MC                     PARM W6        S001I2  60
B2MODC           PPC04     PARM           S001O1  60
     C*************
     C*供應商簡稱
     C*************
     C**
     C                     EXSR RTN110                     *CHAIN MB0
     C*************
     C*產品簡稱
     C*************
     C**
     C                     EXSR RTN120                     *CHAIN MA0
     C***********
     C*進貨日期
     C***********
     C**
     C                     EXSR RTN130                     *CHAIN PDATE
     C**
     C           PC06      SUB  PC11      P611
     C*
     C                     EXSR RTN900                     *PROC SKIP
     C                     WRITEPD1
     C                     EXSR RTN140                     *ADD DATA
     C*
     C                     SETOF                     3031
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN110....CHAIN MB0
      *==============================================================*
     C           RTN110    BEGSR
     C*
     C           PC05      CHAINMB0                  40
     C*
     C   40                MOVE *BLANK    MB03
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN120....CHAIN MA0
      *==============================================================*
     C           RTN120    BEGSR
     C*
     C           PC03      CHAINMA0                  40
     C*
     C   40                MOVE *BLANK    MA03
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN130....CHAIN PDATE
      *==============================================================*
     C           RTN130    BEGSR
     C*
     C                     Z-ADD0         PDATE
     C*
     C           PC021     IFEQ '1'
     C           KEYPE     CHAINPE0                  40
     C*
     C           *IN40     IFEQ '0'
B2TRCC                     Z-ADDPE05      PDATE
     C                     END
     C*
     C                     END
     C*
     C           PC021     IFEQ '2'
     C           KEYPI     CHAINPI0                  41
     C*
     C           *IN41     IFEQ '0'
B2TRCC                     Z-ADDPI05      PDATE
     C                     END
     C*
     C                     END
     C*
B2CHKC           PDATE     IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM PDATE     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           PDATE     PARM           S001O1  60
     C                     END
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN140....ADD DATA
      *==============================================================*
     C           RTN140    BEGSR
     C*
     C                     ADD  PC06      PC06D
     C                     ADD  PC06      PC06V
     C                     ADD  PC06      PC06T
     C                     ADD  PC11      PC11D
     C                     ADD  PC11      PC11V
     C                     ADD  PC11      PC11T
     C                     ADD  P611      P611D
     C                     ADD  P611      P611V
     C                     ADD  P611      P611T
     C*
     C                     ENDSR
      *==============================================================*
      *          RTNL1.....PROC L1
      *==============================================================*
     C           RTNL1     BEGSR
     C*
     C           *INLR     IFEQ '1'
     C           *INL2     OREQ '1'
     C           *IN39     OREQ '1'
     C                     SETON                     99
     C                     ELSE
     C                     SETOF                     99
     C                     END
     C*
     C                     WRITEPD2
     C                     Z-ADD0         PC06D
     C                     Z-ADD0         PC11D
     C                     Z-ADD0         P611D
     C*
     C                     SETON                     31
     C*
     C                     ENDSR
      *==============================================================*
      *          RTNL2.....PROC L2
      *==============================================================*
     C           RTNL2     BEGSR
     C*
     C           *INLR     IFEQ '1'
     C           *IN39     OREQ '1'
     C                     SETON                     99
     C                     ELSE
     C                     SETOF                     99
     C                     END
     C*
     C                     WRITEPD3
     C                     Z-ADD0         PC06V
     C                     Z-ADD0         PC11V
     C                     Z-ADD0         P611V
     C*
     C                     SETON                     30
     C*
     C                     ENDSR
      *==============================================================*
      *          RTNLR.....PROC LR
      *==============================================================*
     C           RTNLR     BEGSR
     C*
     C  N10                WRITEPH1
     C                     WRITEPE9
     C                     WRITEPE2
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN900....PROC SKIP
      *==============================================================*
     C           RTN900    BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     SETOF                     39
     C                     SETON                     10
     C                     END
     C*
     C           *IN39     IFEQ '1'
     C                     WRITEPE1
     C                     WRITEPH1
     C                     SETOF                     39
     C                     END
     C*
     C                     ENDSR
