      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR054                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/05/11                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購子系統                                   *
      * REMARK       :供應商採購完稅彙總表                         *
      ****************************************************************
     FPOPGPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FREWF72  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 605 DMA12S
     I                                      606 610 DMA12E
     I            DS
     I                                        1   9 PG03
     I                                        1   6 PG03L
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYMA     KLIST
     C                     KFLD           MA12
     C                     KFLD           PG03L
     C                     KFLD           PG03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN100....GET DETAIL
     C*==============================================================*
01===C           RTN100    BEGSR
|    C**發票明細檔讀取
|    C                     READ PG0                      45
| 01-C           *IN45     DOWEQ'0'
|   C           PG03      CHAINMA0                  40
| 02-C           MA12      IFGE DMA12S
|   C           MA12      ANDLEDMA12E
|   C           KEYMA     CHAINWF720                41
| 03-C           *IN41     IFEQ '1'                          新增
|   C                     EXSR RTN200
| 03*C                     ELSE                              修改
|   C                     EXSR RTN300
| 03-C                     END
| 02-C                     END
|   C*
|   C                     READ PG0                      45
| 01-C                     END
01===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE WORK FILE
      *==============================================================*
02===C           RTN200    BEGSR
|    C                     MOVELMA12      WF7201
|    C                     MOVELPG03      WF7202
|    C                     MOVELPG03L     WF7206
|    C                     Z-ADDPG05      WF7203
|    C                     Z-ADDPG06      WF7205
|    C**公升數
|    C           WF7203    MULT MA16      WORK1   70
|    C           WORK1     MULT MA15      WORK2   92H
|    C                     Z-ADDWORK2     WF7204
|    C*WRITE WORK FILE
|    C                     WRITEWF720
|    C***
02===C                     ENDSR
      *==============================================================*
      *          RTN300....UPDATE WORK FILE
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C                     ADD  PG05      WF7203
|    C                     ADD  PG06      WF7205
|    C           WF7202    CHAINMA0                  42
|    C**公升數
|    C           WF7203    MULT MA16      WORK1   70
|    C           WORK1     MULT MA15      WORK2   92H
|    C                     ADD  WORK2     WF7204
|    C*WRITE WORK FILE
|    C                     UPDATWF720
|    C***
03===C                     ENDSR
