      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR043                                        *
      * AUTHER       : A1118 PHILP TSAI                              *
      * CREATE DATE  : 81/04/23                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購資料子系統                               *
      * REMARK       :採購單列印                                   *
      ****************************************************************
     FPOR043D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DPB01
     I                                      605 616 DPB02S
     I                                      617 628 DPB02E
     I                                      629 629 DSEL
     I                                      671 675 DPB05S
     I                                      676 680 DPB05E
     I*(MM/DD/YY)
     I                                      631 6360DPB04S
     I                                      641 6460DPB04E
     I*(YY/MM/DD)
     I                                      651 6560WPB04S
     I                                      661 6660WPB04E
     I*
     I                                      681 6820PNBR
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DPB01
|    C                     MOVE *BLANK    DPB02S
|    C                     MOVE *BLANK    DPB02E
|    C                     MOVE *BLANK    DPB05S
|    C                     MOVE *BLANK    DPB05E
|    C                     MOVE *BLANK    DSEL
     C                     Z-ADD0         DPB04S
     C                     Z-ADD0         DPB04E
     C                     Z-ADD0         PNBR
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
     C***********
     C*公司別
     C***********
|    C*
| 01-C           DPB01     IFEQ *BLANKS
|   C                     SETON                     609699
| 01-C                     END
     C***********
     C*採購日期
     C***********
|    C*
| 04-C           DPB04S    IFEQ 0
M001DC*                    Z-ADD010101    DPB04S
M001AC                     Z-ADD010192    DPB04S
     C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DPB04S    P0901I  60
|   C                     PARM           P0901O  1
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     659299
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
| 06-C           DPB04E    IFEQ 0
M001DC*                    Z-ADD123199    DPB04E
M001AC                     Z-ADD123129    DPB04E
     C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
|   C                     PARM DPB04E    P0901I  60
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     669299
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DPB04S    S001I2  60
|    C           WPB04S    PARM           S001O1  60
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DPB04E    S001I2  60
|    C           WPB04E    PARM           S001O1  60
M001AC                     MOVE WPB04S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
M001AC                     MOVE WPB04E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
M001DC*          WPB04S    IFGT WPB04E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6566
|   C                     SETON                     9399
| 09-C                     END
|    C   99                GOTO END100
     C*************
     C*供應商代號
     C*************
|    C*
| 03-C           DPB05S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPB05S
| 03-C                     END
|    C*
| 04-C           DPB05E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPB05E
| 04-C                     END
|    C*
| 05-C           DPB05S    IFGT DPB05E
|   C                     SETON                     6768
|   C                     SETON                     9399
| 05-C                     END
|    C   99                GOTO END100
     C***********
|    C*列印內容
     C***********
     C*
| 07-C           DSEL      IFEQ *BLANK
|   C                     SETON                     649699
| 07-C                     END
|    C   99                GOTO END100
     C***********
     C*起始頁次
     C***********
|    C*
     C           DSEL      IFEQ 'B'
     C           PNBR      ANDEQ0
     C                     SETON                     699699
     C                     END
     C***********
     C*採購單號
     C***********
|    C*
| 03-C           DPB02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPB02S
| 03-C                     END
|    C*
| 04-C           DPB02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPB02E
| 04-C                     END
|    C*
|   C           DPB02S    IFGT DPB02E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 06-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
