      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : POR049                                        *
      * AUTHER       : A1005 ROGER CHIEN                             *
      * CREATE DATE  : 80/11/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :基本資料子系統                               *
      * REMARK       :國外採購ETD狀況表                          *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FPOR049D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DPB01S
     I                                      603 604 DPB01E
     I*ETD
     I                                      611 6160DPB14S
     I                                      617 6220DPB14E
     I*ETA
M001MI*                                     643 643 DMA11S
M001MI*                                     644 644 DMA11E
M001MI                                      650 650 DMA11S
M001MI                                      651 651 DMA11E
     I*供應商
     I                                      655 659 DPB05S
     I                                      660 664 DPB05E
     I*轉換之日期
M001MI*                                     631 6360DDATES
M001MI*                                     637 6420DDATEE
M001MI                                      631 6380DDATES
M001MI                                      639 6460DDATEE
     I*結案碼
     I                                      699 699 DPB19
     I                                      755 755 IN20
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DPB01S
|    C                     MOVE *BLANK    DPB01E
|    C                     MOVE 'N'       DPB19
|    C                     MOVE *BLANK    DMA11S
|    C                     MOVE *BLANK    DMA11E
|    C                     Z-ADD0         DPB14S
|    C                     Z-ADD0         DPB14E
|    C                     Z-ADD0         DDATES
|    C                     Z-ADD0         DDATEE
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           DPB01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPB01S
| 01-C                     END
|    C*
| 02-C           DPB01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPB01E
| 02-C                     END
|    C*
| 03-C           DPB01S    IFGT DPB01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
| 04-C           DPB14S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DPB14S    P0901I  60
|   C                     PARM           P0901O  1
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DPB14E    P0901I  60
|    C                     PARM           P0901O  1
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 06-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DPB14S    S001I2  60
|    C*          DDATES    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DDATES
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DPB14E    S001I2  60
|    C*M001M     DDATEE    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DDATEE
|    C**
| 07-C           DDATES    IFGT DDATEE
|   C                     SETON                     6263
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*
| 08-C           DMA11S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DMA11S
| 01-C                     END
|    C*
| 02-C           DMA11E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMA11E
| 02-C                     END
|    C*
| 03-C           DMA11S    IFGT DMA11E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C*結案碼
| 09-C           DPB19     IFEQ *BLANK
|   C                     SETON                     669996
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 10-C           DPB05S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DPB05S
| 10-C                     END
|    C*
| 11-C           DPB05E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DPB05E
| 11-C                     END
|    C*
| 12-C           DPB05S    IFGT DPB05E
|   C                     SETON                     6768
|   C                     SETON                     9399
| 12-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS002'
|   C                     PARM           DPB05S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS002'
|   C                     PARM           DPB05E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 04-C                     END
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
