      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTR0441                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/01/22                                      *
      * UPDATE DATE  : 81/01/22                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :報價逾期表                                   *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.07  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FPOPAPF  IP  E           K        DISK
     FMTMBLF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPOR044P O   E             39     PRINTER
     IPA0
     I                                              PA03  L1
     I                                              PA01  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I                                      601 609 DPA03S
     I                                      610 618 DPA03E
     I                                      619 6240DDATE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYPA     KLIST
     C                     KFLD           PA03
     C                     KFLD           PA01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *CHANGE DATE
     CL1 10                EXSR RTN100
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHANGE DATE
      *==============================================================*
01===C           RTN010    BEGSR
B2MODC                     Z-ADD0         DATE    80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C*M001M               PARM DDATE     S001I2  80
M001MC                     PARM DDATE     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC*M001M     DATE      PARM           S001O1  80
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DATE
|    C*
|    C                     SETON                     10
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
02===C           RTN100    BEGSR
B2000C           PA06      IFLT DATE
| 02-C           *IN11     IFEQ '0'
|   C                     WRITEPH1
|   C                     SETON                     11
| 02-C                     END
|   C   39                EXSR RTN900
|   C                     EXSR RTN200
|   C                     WRITEPD1
| 01-C                     END
02===C                     ENDSR
      *==============================================================*
      *          RTN200....CHECK DETAIL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*產品名稱
|    C           PA03      CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA06
| 01-C                     END
|    C*供應商名稱
|    C           PA01      CHAINMB0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MB03
| 02-C                     END
|    C*報價條件
|    C                     MOVE *BLANK    #A02
|    C                     MOVE 'PRICE   '#A01
|    C                     MOVELPA10      #A02
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      P#A031
| 03*C                     ELSE
|   C                     MOVE *BLANK    P#A031
| 03-C                     END
|    C*截止日期
M001AC                     Z-ADDPA06      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM PA06      S001I2  80
M001MC                     PARM W6        S001I2  60
B2MODC           DPA06     PARM           S001O1  60
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
05===C           RTNLR     BEGSR
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
05===C                     ENDSR
M001AC/COPY HBP2CVTR
