     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : POR997                                     *
     A*    PROGRAM NAME :                                            *
     A*    AUTHOR       : A1491 EASON                                *
     A*    CREATE DATE  : 97/12/09                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     FPOR997WFUF  E           K        DISK                      A
     FPOR997LFUF  E           K        DISK
     F            WF0                               KRENAMEWFX
     FMTMBPF  IF  E           K        DISK
     FMTMHPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     F            MA0                               KRENAMEMAX
     FPOPALF08IF  E           K        DISK
     FW2BAPF  IF  E           K        DISK
     FW2BBPF  IF  E           K        DISK
     E*---------------------------------------------------------------*
     E                    POI02I    999  5
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      211 2160DDATE
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      131 1340$WWW
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
      *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     I                                      510 5150S1
     I                                      520 5250S2
     I                                      530 530 RMY
     I            DS
     I                                        1   60S3
     I                                        1   40S3Y
     I                                        5   60S3M
      *
     I            DS
     I                                        1   60S4
     I                                        1   40S4Y
     I                                        5   60S4M
      *
     I            DS
     I                                        1   80BA01
     I                                        1   60BA01YM
      *
     I              '9999999999'          C         @A1
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           POI02I
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPA     KLIST                           *PYEMPF
     C                     KFLD           MA12
     C                     KFLD           MA01
     C                     KFLD           DPA02
     C           KEYPA1    KLIST                           *PYEMPF
     C                     KFLD           MA12
     C                     KFLD           MA01
     C           KEYWFX    KLIST
     C                     KFLD           WF01
     C                     KFLD           WF03
     C                     KFLD           WF05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
     C                     EXSR RTN120
      *
  01-C           RMY       IFEQ 'Y'
    C                     EXSR RTN130
  01-C                     ENDIF
      *
     C                     CALL 'POR997C1'
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
02===C           RTN120    BEGSR
|    C*
|    C                     MOVEL@A1       DPA02  10
|    C*
|    C           *LOVAL    SETLLMA0
|    C                     READ MA0                      46
| 01-C           *IN46     DOWEQ'0'
|    *
| 02-C           MA07      IFEQ 'K'
| 03-C           MA12      IFNE 'LR203'
|   C           KEYPA     SETGTPA0
|   C           KEYPA1    REDPEPA0                      45
| 04-C           *IN45     IFEQ '0'
|    *
|   C           MA12      LOKUPPOI02I                   11
| 05-C           *IN11     IFEQ '1'
|    *
|   C                     MOVELMA12      WF01
|   C           WF01      CHAINMB0                  40
|   C  N40                MOVELMB03      WF02
|   C   40                MOVEL*BLANK    WF02
|   C                     MOVELMA01      WF03
|   C                     MOVELMA03      WF04
|    *
|   C                     Z-ADDS1        S3
|   C                     Z-ADDS2        S4
|    *
| 06-C           S3        DO   S4        S3
|    *
| 07-C           S3M       IFGT 12
|   C                     ADD  1         S3Y
|   C                     SUB  12        S3M
| 07-C                     ENDIF
|    *
|   C                     Z-ADDS3        WF05
|   C                     WRITEWF0
| 06-C                     ENDDO
|    *
| 05-C                     ENDIF
| 04-C                     ENDIF
| 03*C                     ELSE
|   C           MA12      LOKUPPOI02I                   11
| 08-C           *IN11     IFEQ '1'
|    *
|   C                     MOVELMA12      WF01
|   C           WF01      CHAINMB0                  40
|   C  N40                MOVELMB03      WF02
|   C   40                MOVEL*BLANK    WF02
|   C                     MOVELMA01      WF03
|   C                     MOVELMA03      WF04
|    *
|   C                     Z-ADDS1        S3
|   C                     Z-ADDS2        S4
|    *
| 09-C           S3        DO   S4        S3
|    *
| 10-C           S3M       IFGT 12
|   C                     ADD  1         S3Y
|   C                     SUB  12        S3M
| 10-C                     ENDIF
|    *
|   C                     Z-ADDS3        WF05
|   C                     WRITEWF0
| 09-C                     ENDDO
|    *
| 08-C                     ENDIF
| 03-C                     ENDIF
| 02-C                     ENDIF
|    *
|   C                     CLEARWF0
|    *
|   C                     READ MA0                      46
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLWF0
|    C                     READ WF0                 N    46
| 11-C           *IN46     DOWEQ'0'
|    *
|   C           *LOVAL    SETLLBA0
|   C                     READ BA0                      45
| 12-C           *IN45     DOWEQ'0'
|    *
| 13-C           WF05      IFEQ BA01YM
|    *
|   C           BA03      SETLLBB0
|   C           BA03      READEBB0                      47
| 14-C           *IN47     DOWEQ'0'
|    *
| 15-C           WF03      IFEQ BB03
|    *
|   C           KEYWFX    CHAINWFX                  40
|    *
| 16-C           BA02      IFEQ 'B0000'
|   C                     ADD  BB04      B000A
|   C                     ADD  BB07      B000B
| 16-C                     ENDIF
|    *
| 17-C           BA02      IFEQ 'B0001'
|   C                     ADD  BB04      B001A
|   C                     ADD  BB07      B001B
| 17-C                     ENDIF
|    *
| 18-C           BA02      IFEQ 'B0006'
|   C                     ADD  BB04      B006A
|   C                     ADD  BB07      B006B
| 18-C                     ENDIF
|    *
| 19-C           BA02      IFEQ 'B0007'
|   C                     ADD  BB04      B007A
|   C                     ADD  BB07      B007B
| 19-C                     ENDIF
|    *
| 20-C           BA02      IFEQ 'B0011'
|   C                     ADD  BB04      B011A
|   C                     ADD  BB07      B011B
| 20-C                     ENDIF
|    *
| 21-C           BA02      IFEQ 'B0013'
|   C                     ADD  BB04      B013A
|   C                     ADD  BB07      B013B
| 21-C                     ENDIF
|    *
| 22-C           BA02      IFEQ 'B0014'
|   C                     ADD  BB04      B014A
|   C                     ADD  BB07      B014B
| 22-C                     ENDIF
|    *
| 23-C           BA02      IFEQ 'B0015'
|   C                     ADD  BB04      B015A
|   C                     ADD  BB07      B015B
| 23-C                     ENDIF
|    *
| 24-C           BA02      IFEQ 'B0017'
|   C                     ADD  BB04      B017A
|   C                     ADD  BB07      B017B
| 24-C                     ENDIF
|    *
| 25-C           BA02      IFEQ 'B0018'
|   C                     ADD  BB04      B018A
|   C                     ADD  BB07      B018B
| 25-C                     ENDIF
|    *
| 26-C           BA02      IFEQ 'B0019'
|   C                     ADD  BB04      B019A
|   C                     ADD  BB07      B019B
| 26-C                     ENDIF
|    *
| 27-C           BA02      IFEQ 'B0022'
|   C                     ADD  BB04      B022A
|   C                     ADD  BB07      B022B
| 27-C                     ENDIF
|    *
| 28-C           BA02      IFEQ 'B0025'
|   C                     ADD  BB04      B025A
|   C                     ADD  BB07      B025B
| 28-C                     ENDIF
|    *
| 29-C           BA02      IFEQ 'B0026'
|   C                     ADD  BB04      B026A
|   C                     ADD  BB07      B026B
| 29-C                     ENDIF
|    *
| 30-C           BA02      IFEQ 'B0030'
|   C                     ADD  BB04      B030A
|   C                     ADD  BB07      B030B
| 30-C                     ENDIF
|    *
| 31-C           BA02      IFEQ 'B0031'
|   C                     ADD  BB04      B031A
|   C                     ADD  BB07      B031B
| 31-C                     ENDIF
|    *
| 32-C           BA02      IFEQ 'B0032'
|   C                     ADD  BB04      B032A
|   C                     ADD  BB07      B032B
| 32-C                     ENDIF
|    *
| 33-C           BA02      IFEQ 'B0033'
|   C                     ADD  BB04      B033A
|   C                     ADD  BB07      B033B
| 33-C                     ENDIF
|    *
|   C  N40                UPDATWFX
|   C                     EXSR CLEAR
|    *
| 15-C                     ENDIF
|    *
|   C           BA03      READEBB0                      47
| 14-C                     ENDDO
|    *
| 13-C                     ENDIF
|    *
|   C                     READ BA0                      45
| 12-C                     ENDDO
|    *
|   C                     READ WF0                 N    46
| 11-C                     ENDDO
|     *
02===C           END120    ENDSR
     C*==============================================================*
     C*          RTN130.... PROCESS
     C*==============================================================*
03===C           RTN130    BEGSR
|    C*
|    C           *LOVAL    SETLLMAX
|    C                     READ MAX                      46
| 01-C           *IN46     DOWEQ'0'
|    *
| 02-C           MA07      IFEQ 'R'
|   C*          KEYPA     SETGTPA0
|   C*          KEYPA1    REDPEPA0                      45
|   C*          *IN45     IFEQ '0'
|    *
|   C                     MOVELMA12      WF01
|   C           WF01      CHAINMB0                  40
|   C  N40                MOVELMB03      WF02
|   C   40                MOVEL*BLANK    WF02
|   C                     MOVELMA01      WF03
|   C                     MOVELMA03      WF04
|    *
|   C                     Z-ADDS1        S3
|   C                     Z-ADDS2        S4
|    *
| 03-C           S3        DO   S4        S3
|    *
| 04-C           S3M       IFGT 12
|   C                     ADD  1         S3Y
|   C                     SUB  12        S3M
| 04-C                     ENDIF
|    *
|   C                     Z-ADDS3        WF05
|   C                     WRITEWF0
| 03-C                     ENDDO
|    *
| 02-C                     ENDIF
|   C*                    ENDIF
|    *
|   C                     CLEARWF0
|    *
|   C                     READ MAX                      46
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLWF0
|    C                     READ WF0                 N    46
| 05-C           *IN46     DOWEQ'0'
|    *
|   C           WF03      CHAINMA0                  40
| 06-C           *IN40     IFEQ '0'
|   C           MA07      ANDEQ'R'
|    *
|   C           *LOVAL    SETLLBA0
|   C                     READ BA0                      45
| 07-C           *IN45     DOWEQ'0'
|    *
| 08-C           WF05      IFEQ BA01YM
|    *
|   C           BA03      SETLLBB0
|   C           BA03      READEBB0                      47
| 09-C           *IN47     DOWEQ'0'
|    *
| 10-C           WF03      IFEQ BB03
|    *
|   C           KEYWFX    CHAINWFX                  40
|    *
| 11-C           BA02      IFEQ 'B0000'
|   C                     ADD  BB04      B000A
|   C                     ADD  BB07      B000B
| 11-C                     ENDIF
|    *
| 12-C           BA02      IFEQ 'B0001'
|   C                     ADD  BB04      B001A
|   C                     ADD  BB07      B001B
| 12-C                     ENDIF
|    *
| 13-C           BA02      IFEQ 'B0006'
|   C                     ADD  BB04      B006A
|   C                     ADD  BB07      B006B
| 13-C                     ENDIF
|    *
| 14-C           BA02      IFEQ 'B0007'
|   C                     ADD  BB04      B007A
|   C                     ADD  BB07      B007B
| 14-C                     ENDIF
|    *
| 15-C           BA02      IFEQ 'B0011'
|   C                     ADD  BB04      B011A
|   C                     ADD  BB07      B011B
| 15-C                     ENDIF
|    *
| 16-C           BA02      IFEQ 'B0013'
|   C                     ADD  BB04      B013A
|   C                     ADD  BB07      B013B
| 16-C                     ENDIF
|    *
| 17-C           BA02      IFEQ 'B0014'
|   C                     ADD  BB04      B014A
|   C                     ADD  BB07      B014B
| 17-C                     ENDIF
|    *
| 18-C           BA02      IFEQ 'B0015'
|   C                     ADD  BB04      B015A
|   C                     ADD  BB07      B015B
| 18-C                     ENDIF
|    *
| 19-C           BA02      IFEQ 'B0017'
|   C                     ADD  BB04      B017A
|   C                     ADD  BB07      B017B
| 19-C                     ENDIF
|    *
| 20-C           BA02      IFEQ 'B0018'
|   C                     ADD  BB04      B018A
|   C                     ADD  BB07      B018B
| 20-C                     ENDIF
|    *
| 21-C           BA02      IFEQ 'B0019'
|   C                     ADD  BB04      B019A
|   C                     ADD  BB07      B019B
| 21-C                     ENDIF
|    *
| 22-C           BA02      IFEQ 'B0022'
|   C                     ADD  BB04      B022A
|   C                     ADD  BB07      B022B
| 22-C                     ENDIF
|    *
| 23-C           BA02      IFEQ 'B0025'
|   C                     ADD  BB04      B025A
|   C                     ADD  BB07      B025B
| 23-C                     ENDIF
|    *
| 24-C           BA02      IFEQ 'B0026'
|   C                     ADD  BB04      B026A
|   C                     ADD  BB07      B026B
| 24-C                     ENDIF
|    *
| 25-C           BA02      IFEQ 'B0030'
|   C                     ADD  BB04      B030A
|   C                     ADD  BB07      B030B
| 25-C                     ENDIF
|    *
| 26-C           BA02      IFEQ 'B0031'
|   C                     ADD  BB04      B031A
|   C                     ADD  BB07      B031B
| 26-C                     ENDIF
|    *
| 27-C           BA02      IFEQ 'B0032'
|   C                     ADD  BB04      B032A
|   C                     ADD  BB07      B032B
| 27-C                     ENDIF
|    *
| 28-C           BA02      IFEQ 'B0033'
|   C                     ADD  BB04      B033A
|   C                     ADD  BB07      B033B
| 28-C                     ENDIF
|    *
|   C  N40                UPDATWFX
|   C                     EXSR CLEAR
|    *
| 10-C                     ENDIF
|    *
|   C           BA03      READEBB0                      47
| 09-C                     ENDDO
|    *
| 08-C                     ENDIF
|    *
|   C                     READ BA0                      45
| 07-C                     ENDDO
|    *
| 06-C                     ENDIF
|    *
|   C                     READ WF0                 N    46
| 05-C                     ENDDO
|     *
03===C           END130    ENDSR
     C*==============================================================*
     C*          CLEAR ....
     C*==============================================================*
04===C           CLEAR     BEGSR
|     *
|    C                     Z-ADD0         B000A
|    C                     Z-ADD0         B000B
|    C                     Z-ADD0         B001A
|    C                     Z-ADD0         B001B
|    C                     Z-ADD0         B006A
|    C                     Z-ADD0         B006B
|    C                     Z-ADD0         B007A
|    C                     Z-ADD0         B007B
|    C                     Z-ADD0         B011A
|    C                     Z-ADD0         B011B
|    C                     Z-ADD0         B013A
|    C                     Z-ADD0         B013B
|    C                     Z-ADD0         B014A
|    C                     Z-ADD0         B014B
|    C                     Z-ADD0         B015A
|    C                     Z-ADD0         B015B
|    C                     Z-ADD0         B018A
|    C                     Z-ADD0         B018B
|    C                     Z-ADD0         B019A
|    C                     Z-ADD0         B019B
|    C                     Z-ADD0         B022A
|    C                     Z-ADD0         B022B
|    C                     Z-ADD0         B025A
|    C                     Z-ADD0         B025B
|    C                     Z-ADD0         B026A
|    C                     Z-ADD0         B026B
|    C                     Z-ADD0         B030A
|    C                     Z-ADD0         B030B
|    C                     Z-ADD0         B031A
|    C                     Z-ADD0         B031B
|    C                     Z-ADD0         B032A
|    C                     Z-ADD0         B032B
|    C                     Z-ADD0         B033A
|    C                     Z-ADD0         B033B
|     *
04===C                     ENDSR
