     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : POR997                                     *
     A*    PROGRAM NAME :                                            *
     A*    AUTHOR       : A1491 EASON                                *
     A*    CREATE DATE  : 97/12/09                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     FPOR997D CF  E                    WORKSTN
     E*---------------------------------------------------------------*
     E                    POI02I    999  5
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      211 2160DDATE
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      131 1340$WWW
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
      *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     I                                      510 5150S1
     I                                      520 5250S2
      *
     I              '9999999999'          C         @A1
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*          *LIKE     DEFN CM004O    DFMT
     C*          *LIKE     DEFN CM005O    DTYPE
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100                     *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
|    C                     Z-ADD$WWW      SYM
|    C                     Z-ADD$WWW      EYM
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD*ZERO     #LIN
|    C*                    Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO END100
| 01-C                     END
|    C*
|    C                     EXSR RTN110                     *CHK SCREEN1
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
     C                     EXSR RTN120
     C           *IN99     IFEQ '1'
     C                     GOTO END100
     C                     ELSE
     C                     CALL 'POR997C'
     C                     PARM           POI02I
     C                     SETON                     96
     C                     ENDIF
| 02-C                     END
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110....CHECK SCREEN1
     C*==============================================================*
03===C           RTN110    BEGSR
|     *
|    C                     Z-ADD0         S1      60
|    C                     Z-ADD0         S2      60
|    C*---------------------------------------------------------------
| 01-C           SYM       IFEQ 0
|   C                     SETON                     9961
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     ENDIF
|    C   99                GOTO END110
|     *
|    C                     CALL 'P38'
|    C                     PARM SYM       P3801I  60
|    C                     PARM '3'       P3802I  1
|    C                     PARM '1'       P3803I  1
|    C           S1        PARM           P3801O  60
|    C                     PARM           P3811O  1
| 02-C           P3811O    IFEQ 'N'
|   C                     SETON                     9961
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     ENDIF
|    C   99                GOTO END110
|    C*---------------------------------------------------------------
| 03-C           EYM       IFEQ 0
|   C                     SETON                     9962
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     ENDIF
|    C   99                GOTO END110
|     *
|    C                     CALL 'P38'
|    C                     PARM EYM       P3801I  60
|    C                     PARM '3'       P3802I  1
|    C                     PARM '1'       P3803I  1
|    C           S2        PARM           P3801O  60
|    C                     PARM           P3811O  1
| 04-C           P3811O    IFEQ 'N'
|   C                     SETON                     9962
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 04-C                     ENDIF
|    C   99                GOTO END110
|    C*---------------------------------------------------------------
| 05-C           S1        IFGT S2
|   C                     SETON                     996261
|   C                     MOVEL'UPT0041' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 05-C                     ENDIF
|    C   99                GOTO END110
|     *
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN120....CHECK SCREEN1
     C*==============================================================*
03===C           RTN120    BEGSR
|    C                     WRITEDSPC1
|     *
|    C                     MOVE *BLANKS   POI02I
|     *
|    C                     CALL 'POI997'
|    C                     PARM           POI01I  5
|    C                     PARM           POI02I
|    C                     PARM           @RTNC   2
|     *
| 01-C           @RTNC     IFNE '00'
|   C                     SETON                     99
|   C                     MOVEL'UPT0130' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     GOTO END120
| 01-C                     ENDIF
|     *
     C                     OUT  LDA
|     *
03===C           END120    ENDSR
