     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : POR997                                     *
     A*    PROGRAM NAME :                                            *
     A*    AUTHOR       : A1491 EASON                                *
     A*    CREATE DATE  : 97/12/09                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     FPOR997WFUF  E           K        DISK                      A
     FPOR997LFUF  E           K        DISK
     F            WF0                               KRENAMEWFX
     FMTMBPF  IF  E           K        DISK
     FMTMHPF  IF  E           K        DISK
     FPOPALF07IF  E           K        DISK
     FW2BAPF  IF  E           K        DISK
     FW2BBPF  IF  E           K        DISK
     E*---------------------------------------------------------------*
     E                    POI02I    999  5
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      211 2160DDATE
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      131 1340$WWW
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
      *+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
     I                                      510 5150S1
     I                                      520 5250S2
     I            DS
     I                                        1   60S3
     I                                        1   40S3Y
     I                                        5   60S3M
      *
     I            DS
     I                                        1   60S4
     I                                        1   40S4Y
     I                                        5   60S4M
      *
     I            DS
     I                                        1   80BA01
     I                                        1   60BA01YM
      *
     I              '9999999999'          C         @A1
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           POI02I
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPA     KLIST                           *PYEMPF
     C                     KFLD           MA12
     C                     KFLD           MA01
     C                     KFLD           DPA02
     C           KEYPA1    KLIST                           *PYEMPF
     C                     KFLD           MA12
     C                     KFLD           MA01
     C           KEYWFX    KLIST
     C                     KFLD           WF01
     C                     KFLD           WF03
     C                     KFLD           WF05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
     C                     EXSR RTN120
|     *
|    C                     CALL 'POR997C1'
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
02===C           RTN120    BEGSR
|    C*
|    C                     MOVEL@A1       DPA02  10
|    C*
|    C           *LOVAL    SETLLMA0
|    C                     READ MA0                      46
| 01-C           *IN46     DOWEQ'0'
|    *
| 02-C           MA07      IFEQ 'K'
|   C           KEYPA     SETGTPA0
|   C           KEYPA1    REDPEPA0                      45
| 03-C           *IN45     IFEQ '0'
|    *
|   C           MA12      LOKUPPOI02I                   11
| 04-C           *IN11     IFEQ '1'
|    *
|   C                     MOVELMA12      WF01
|   C           WF01      CHAINMB0                  40
|   C  N40                MOVELMB03      WF02
|   C   40                MOVEL*BLANK    WF02
|   C                     MOVELMA01      WF03
|   C                     MOVELMA03      WF04
|    *
|   C                     Z-ADDS1        S3
|   C                     Z-ADDS2        S4
|    *
| 05-C           S3        DO   S4        S3
|    *
| 06-C           S3M       IFGT 12
|   C                     ADD  1         S3Y
|   C                     SUB  12        S3M
| 06-C                     ENDIF
|    *
|   C                     Z-ADDS3        WF05
|   C                     WRITEWF0
| 05-C                     ENDDO
|    *
| 04-C                     ENDIF
| 03-C                     ENDIF
| 02-C                     ENDIF
|    *
|   C                     CLEARWF0
|    *
|   C                     READ MA0                      46
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLWF0
|    C                     READ WF0                 N    46
| 07-C           *IN46     DOWEQ'0'
|    *
|   C           *LOVAL    SETLLBA0
|   C                     READ BA0                      45
| 08-C           *IN45     DOWEQ'0'
|    *
| 09-C           WF05      IFEQ BA01YM
|    *
|   C           BA03      SETLLBB0
|   C           BA03      READEBB0                      47
| 10-C           *IN47     DOWEQ'0'
|    *
     C           WF03      IFEQ BB03
|    *
|   C           KEYWFX    CHAINWFX                  40
|    *
| 11-C           BA02      IFEQ 'B0001'
|   C                     ADD  BB04      WF06A
|   C                     ADD  BB07      WF06B
| 11-C                     ENDIF
|    *
| 12-C           BA02      IFEQ 'B0006'
|   C                     ADD  BB04      WF07A
|   C                     ADD  BB07      WF07B
| 12-C                     ENDIF
|    *
| 13-C           BA02      IFEQ 'B0011'
|   C                     ADD  BB04      WF08A
|   C                     ADD  BB07      WF08B
| 13-C                     ENDIF
|    *
| 14-C           BA02      IFEQ 'B0013'
|   C                     ADD  BB04      WF09A
|   C                     ADD  BB07      WF09B
| 14-C                     ENDIF
|    *
| 15-C           BA02      IFEQ 'B0014'
|   C                     ADD  BB04      WF10A
|   C                     ADD  BB07      WF10B
| 15-C                     ENDIF
|    *
| 16-C           BA02      IFEQ 'B0015'
|   C                     ADD  BB04      WF11A
|   C                     ADD  BB07      WF11B
| 16-C                     ENDIF
|    *
| 17-C           BA02      IFEQ 'B0019'
|   C                     ADD  BB04      WF12A
|   C                     ADD  BB07      WF12B
| 17-C                     ENDIF
|    *
| 18-C           BA02      IFEQ 'B0022'
|   C                     ADD  BB04      WF13A
|   C                     ADD  BB07      WF13B
| 18-C                     ENDIF
|    *
| 19-C           BA02      IFEQ 'B0025'
|   C                     ADD  BB04      WF14A
|   C                     ADD  BB07      WF14B
| 19-C                     ENDIF
|    *
| 20-C           BA02      IFEQ 'B0026'
|   C                     ADD  BB04      WF15A
|   C                     ADD  BB07      WF15B
| 20-C                     ENDIF
|    *
| 21-C           BA02      IFEQ 'B0030'
|   C                     ADD  BB04      WF16A
|   C                     ADD  BB07      WF16B
| 21-C                     ENDIF
|    *
| 22-C           BA02      IFEQ 'B0031'
|   C                     ADD  BB04      WF17A
|   C                     ADD  BB07      WF17B
| 22-C                     ENDIF
|    *
| 23-C           BA02      IFEQ 'B0032'
|   C                     ADD  BB04      WF18A
|   C                     ADD  BB07      WF18B
| 23-C                     ENDIF
|    *
| 24-C           BA02      IFEQ 'B0033'
|   C                     ADD  BB04      WF19A
|   C                     ADD  BB07      WF19B
| 24-C                     ENDIF
|    *
|   C  N40                UPDATWFX
     C                     EXSR CLEAR
|    *
     C                     ENDIF
|    *
|   C           BA03      READEBB0                      47
| 10-C                     ENDDO
|    *
| 09-C                     ENDIF
|    *
|   C                     READ BA0                      45
| 08-C                     ENDDO
|    *
|   C                     READ WF0                 N    46
| 07-C                     ENDDO
|     *
02===C           END120    ENDSR
     C*==============================================================*
     C*          CLEAR ....
     C*==============================================================*
01===C           CLEAR     BEGSR
      *
     C                     Z-ADD0         WF06A
     C                     Z-ADD0         WF06B
     C                     Z-ADD0         WF07A
     C                     Z-ADD0         WF07B
     C                     Z-ADD0         WF08A
     C                     Z-ADD0         WF08B
     C                     Z-ADD0         WF09A
     C                     Z-ADD0         WF09B
     C                     Z-ADD0         WF10A
     C                     Z-ADD0         WF10B
     C                     Z-ADD0         WF11A
     C                     Z-ADD0         WF11B
     C                     Z-ADD0         WF12A
     C                     Z-ADD0         WF12B
     C                     Z-ADD0         WF13A
     C                     Z-ADD0         WF13B
     C                     Z-ADD0         WF14A
     C                     Z-ADD0         WF14B
     C                     Z-ADD0         WF15A
     C                     Z-ADD0         WF15B
     C                     Z-ADD0         WF16A
     C                     Z-ADD0         WF16B
     C                     Z-ADD0         WF17A
     C                     Z-ADD0         WF17B
     C                     Z-ADD0         WF18A
     C                     Z-ADD0         WF18B
     C                     Z-ADD0         WF19A
     C                     Z-ADD0         WF19B
      *
02===C                     ENDSR
