     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM-ID   : POR997                                     *
     A*    PROGRAM NAME :                                            *
     A*    AUTHOR       : A1491 EASON                                *
     A*    CREATE DATE  : 97/12/09                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資系統                              *
     A****************************************************************
     FPOR997WFO   E           K        DISK                      A
     FMTMBPF  IF  E           K        DISK
     FMTMHPF  IF  E           K        DISK
     FPOPALF07IF  E           K        DISK
     FMTMGLF1 IF  E           K        DISK
     E*----------------------------------------------------------------
     E*----------------------------------------------------------------
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
      *
     I              '9999999999'          C         @A1
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYPA     KLIST                           *PYEMPF
     C                     KFLD           MA12
     C                     KFLD           MA01
     C                     KFLD           DPA02
     C           KEYPA1    KLIST                           *PYEMPF
     C                     KFLD           MA12
     C                     KFLD           MA01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     MOVEL@A1       DPA02  10
     C*
     C           *LOVAL    SETLLMA0
     C                     READ MA0                      46
     C           *IN46     DOWEQ'0'
      *
     C           MA07      IFEQ 'K'
     C           KEYPA     SETGTPA0
     C           KEYPA1    REDPEPA0                      45
     C           *IN45     IFEQ '0'
     C           MA01      CHAINMG0                  40
     C           *IN40     IFEQ '0'
      *
     C                     MOVELMA12      WF01
     C           WF01      CHAINMB0                  40
     C  N40                MOVELMB03      WF02
     C   40                MOVEL*BLANK    WF02
     C                     MOVELMA01      WF03
     C                     MOVELMA03      WF04
     C                     WRITEWF0
      *
     C                     ENDIF
     C                     ENDIF
     C                     ENDIF
      *
     C                     READ MA0                      46
     C                     ENDDO
     C*
     C                     SETON                     LR
