     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : F4HELP                                     *
     A*    AUTHOR       : A1092  TAYLOR                              *
     A*    DATE WRITTEN : 81/01/08                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A*    SUBSYSTEM    :                                            *
     A*    PROCEDURE    : (A/U/D/I)                                  *
     A*    REMARK       :                                            *
     A*                                                              *
     A****************************************************************
     FPUBF4L  IF  E           K        DISK
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           APPPGM 10
     C                     PARM           APPSCR  6
     C                     PARM           APPROW  30
     C                     PARM           APPCOL  30
     C                     PARM           N       30
     C                     PARM           APPDTA 50
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           PPARM     PLIST
     C                     PARM           CPARM
     C                     PARM           CPARM2 10
     C           KEYF4     KLIST
     C                     KFLD           APPPGM
     C                     KFLD           APPSCR
     C                     KFLD           APPROW
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           KEYF4     SETLLF4REC                    42
  01-C           *IN42     IFEQ '1'
    C           KEYF4     READEF4REC                    44
  02-C           *IN44     DOWEQ'0'
  03-C           APPCOL    IFGE FPCOLS
    C           APPCOL    ANDLEFPCOLE
    C                     CALL FCPGM     PPARM
    C                     SETON                     44
    C                     Z-ADDSEQ       N
    C                     MOVELCPARM2    APPDTA
  03*C                     ELSE
    C           KEYF4     READEF4REC                    44
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
