     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA808                                     *
     H*    PROGRAM NAME :產品別銷售分析明細表                      *
     H*    AUTHOR       : A1491                                      *
     H*    CREATE DATE  : 97/01/22                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H*    SUBSYSTEM    :                                            *
     H*    PURPOSE      :                                          *
     H****************************************************************
     FPYA808D CF  E                    WORKSTN
     I*------------------------------------------------------------***
     ILDA        UDS
     I                                      101 110 $USER
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      142 142 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      187 1920DDATE
     I                                      201 2080$A8YMD
     I                                      201 2060YMD
     I                                      211 2160$C8YMD
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
      *
     I                                      500 5050SYM
     I                                      520 5230DYM
     I                                      550 550 DOPT
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100                     *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   *NAMVAR
|     *
|    C                     CALL 'P39'
|    C                     PARM YMD       P3901I  60
|    C                     PARM '2'       P3902I  1
|    C                     PARM '1'       P3903I  1
|    C                     PARM '3'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C                     PARM           P3911O  60
|    C*
|    C                     Z-ADDP3911O    DYM
|    C                     Z-ADD0         SYM     60
|    C                     MOVEL'0'       $PENV
|    C                     MOVEL'1'       DOPT
|     *
| 01-C           $PENV     IFNE '2'                        NOT-BATCH
|   C           $DATA     ANDEQ'N'                        NO-DATA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     GOTO E0200
| 01-C                     END
|    C*
01===C           E0200     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO END100
| 01-C                     END
      *
| 01-C           *IN07     IFEQ '1'
|   C                     CALL 'PYA808C2'
|   C                     GOTO END100
| 01-C                     END
|    C*
|    C                     EXSR R1B00
|    C*
| 02-C           *IN13     IFEQ '1'
|   C           *IN99     ANDEQ'0'
|   C                     EXSR RTN120                     *PROCESS
| 02-C                     END
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
03===C           RTN120    BEGSR
|    C*
|    C                     WRITEDSPC1
|    C*
|    C                     OUT  *NAMVAR
| 01-C*          DOPT      IFEQ '1'
|   C                     CALL 'PYA8081C'
| 01*C*                    ELSE
|   C*                    CALL 'PYA8082'
| 01-C*                    ENDIF
|    C*
|    C                     EXSR RTN020
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R1B00.... PROCESS
     C*==============================================================*
04===C           R1B00     BEGSR
|    C*
| 01-C           DYM       IFEQ *ZERO
|   C                     SETON                     6199
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
|    C                     CALL 'P38'
|    C                     PARM DYM       P3801I  60
|    C                     PARM '3'       P3802I  1
|    C                     PARM '1'       P3803I  1
|    C                     PARM           P3801O  60
|    C                     PARM           P3811O  1
| 02-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 02-C                     ENDIF
|    C   99                GOTO E1B00
|     *
|    C                     CALL 'P39'
|    C                     PARM DYM       P3901I  60
|    C                     PARM '3'       P3902I  1
|    C                     PARM '1'       P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           SYM       PARM           P3911O  60
|    C*
| 03-C           DOPT      IFEQ *BLANK
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 03-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
04===C           E1B00     ENDSR
     C*==============================================================*
     C*          RTN020....INITIAL ROUTINE
     C*==============================================================*
05===C           RTN020    BEGSR
|    C*
| 01-C           $PENV     IFEQ '0'                        INQUIRY
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           $PENV     IFEQ '1'                        ON-LINE
|   C                     MOVEL'UPT2140' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
| 03-C           $PENV     IFEQ '2'                        BATCH
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
|    C                     SETON                     99
|    C*
05===C                     ENDSR
