     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYA8083                                    *
     H*    PROGRAM NAME :產品別銷售明細表(按部門)                *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 08/01/26                                   *
     H*    UPDATE DATE  :
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FMTMAWF  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAWF1 O   E           K        DISK                      A
     FPYA8083PO   E             39     PRINTER
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     IWF0
     I                                              WF01  L1
     I*
     I           UDS
     I                                      125 1270$CPY
     I                                      203 2080DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I                                      500 5050SYM
     I                                      510 511 DMG03
     I                                      520 5230DYM
     I*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*PA#APF
     C           KEY#A     KLIST
     C                     KFLD           #A01    8
     C                     KFLD           #A02   10
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     CL1 10                EXSR R3000
     C*
     C*LR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL
     C*==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
|    C                     Z-ADDDYM       PSU02
|    C*
|    C                     MOVELDMG03     PMG03
|    C                     MOVEL'SHOPDEPT'#A01
|    C                     MOVELDMG03     #A02
|    C           KEY#A     CHAIN#A0                  40
|    C   40                MOVEL*BLANK    PMG03N
|    C  N40                MOVEL#A03      PMG03N
|    C*
|    C                     MOVELWF01      PSU04
|    C           PSU04     CHAINMA0                  40
|    C  N40                MOVELMA03      PMA03
|    C  N40                MOVELMA13      PMA13
|    C   40                MOVEL*BLANK    PMA03
|    C   40                MOVEL*BLANK    PMA13
|    C*
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
| 01-C           *INL1     IFEQ '1'
|   C                     MOVELWF01      PSU04
|   C           PSU04     CHAINMA0                  40
|   C  N40                MOVELMA03      PMA03
|   C  N40                MOVELMA13      PMA13
|   C   40                MOVEL*BLANK    PMA03
|   C   40                MOVEL*BLANK    PMA13
|   C                     WRITEPH2
| 01-C                     ENDIF
|     *
|    C                     SETOF                     39
|    C*
|    C*
|    C                     MOVELWF04      PSU01
|    C           PSU01     CHAINME0                  40
|    C  N40                MOVELME04      PME04
|    C   40                MOVEL*BLANK    PME04
|    C                     Z-ADDWF06      PSU06
|    C                     Z-ADDWF07      PSU07
|    C           PSU06     MULT PSU07     PTOT
|     * /* DOWNLOAD */
|    C                     MOVELWF01      WFX1
|    C                     MOVELPMA03     WFX1N
|    C                     Z-ADDWF02      WFX2
|    C                     MOVELWF04      WFX4
|    C                     MOVELPME04     WFX4N
|    C                     MOVELWF05      WFX5
|    C                     Z-ADDWF06      WFX6
|    C                     Z-ADDWF07      WFX7
|     *
|    C                     WRITEWFX
|     *
|    C*------------------------------------------------------------***
|    C                     WRITEPD1
|    C*------------------------------------------------------------***
|    C*
|    C                     ADD  PSU06     PTO01
|    C                     ADD  PSU07     PTO02
|    C                     ADD  PTOT      PTO03
|    C*
|    C                     Z-ADD0         PSU06
|    C                     Z-ADD0         PSU07
|    C                     Z-ADD0         PTOT
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR
     C*==============================================================*
     C*          R8900     BEGSR
     C*
     C*------------------------------------------------------------***
     C*
     C*                    WRITEPT1
     C*                    SETON                     39
     C*
     C*
     C*                    ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
03===C           R8999     BEGSR
|    C*
|    C*          $PENV     IFNE '2'
|    C*                    MOVEL'N'       $DATA
|    C*                    ELSE
|    C                     WRITEPH1
|    C                     WRITEPE9
|    C*                    END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R3000 ... BREAK L1
     C*==============================================================*
04===C           R3000     BEGSR
|     *
|    C                     WRITEPT1
|     *
|    C                     Z-ADD0         PTO01
|    C                     Z-ADD0         PTO02
|    C                     Z-ADD0         PTO03
|     *
|     *
04===C                     ENDSR
