     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PYZ999                                     *
     H*    PROGRAM NAME :西祺，康寧-銀行帳號轉檔               *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 96/06/21                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人事薪資                                  *
     H****************************************************************
     FSOSEPF  IF  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FIMR099F UF  E           K        DISK                      A
     FPYZ999D CF  E                    WORKSTN
     F*---------------------------------------------------------------*
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      211 2160DDATE
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 174 $COR
     I                                      201 2080$A8YMD
     I*
     I            DS
     I                                        1   8 SE22
     I                                        2   2 SE221
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYME     KLIST                           *PYEMPF
     C                     KFLD           ME01
     C                     KFLD           ME02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR R1000                      *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C*
|    C                     SETON                     10
|    C*
|    C                     READ IMR99                    46
| 01-C           *IN46     DOWEQ'0'
|   C                     DELETIMR99
|   C                     READ IMR99                    46
| 01-C                     ENDDO
|    C*
     C                     Z-ADD$A8YMD    DSE06
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1000 ....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 01-C           *IN07     IFEQ '1'
|   C                     CALL 'PYZ999C'
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      *CHK SCREEN1
|    C*
| 02-C           *IN99     IFEQ '0'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR R1200                      *PROCESS
| 02-C                     END
|    C*
02===C           E1000     ENDSR
     C*==============================================================*
     C*          R1200 ....INITIAL VALUE
     C*==============================================================*
03===C           R1200     BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*
|    C                     OUT  LDA
|    C*
|    C           *LOVAL    SETLLSE0
|    C                     READ SE0                      47
| 01-C           *IN47     DOWEQ'0'
|   C*
|   C                     MOVEL*BLANK    ME01
|   C                     MOVEL*BLANK    ME02
|   C                     MOVEL*BLANK    PME042
|   C                     MOVEL*BLANK    PME052
|   C                     MOVEL*BLANK    PME062
|   C*
| 02-C           SE06      IFEQ DSE06
| 03-C           SE221     IFEQ 'A'
|   C           SE221     OREQ 'B'
|   C*
|   C                     MOVELSE06      WSE06
|   C                     MOVE SE10      SE101
|   C           SE02      SETLLSF0
|   C           SE02      READESF0                      46
| 04-C           *IN46     DOWEQ'0'
|   C           SF04      ADD  SF05      SF045   50
|   C                     MOVELSF045     WSF045
|   C           SF03      CHAINMA0                  41
|   C   41                MOVEL*BLANK    MA03
|   C   41                MOVEL*BLANK    MA13
|   C                     MOVELSE10      ME01
|   C                     MOVELSE11      ME02
|   C           KEYME     CHAINME0                  42
|   C  N42                MOVE ME04      PME042
|   C  N42                MOVE ME05      PME052
|   C  N42                MOVE ME06      PME062
|   C*
|   C                     WRITEIMR99
|   C           SE02      READESF0                      46
| 04-C                     ENDDO
|   C*
| 03-C                     ENDIF
| 02-C                     ENDIF
|   C*
|   C                     READ SE0                      47
| 01-C                     ENDDO
|    C*
|    C*
|    C                     SETOF                     96
|    C                     SETON                     93
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R1B00 ....CHECK SCREEN1
     C*==============================================================*
04===C           R1B00     BEGSR
|    C*
| 01-C           DSE06     IFEQ 0
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C   99                GOTO E1B00
|    C*
04===C           E1B00     ENDSR
