     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : RES003                                     *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    DATE WRITTEN : 81/01/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :共用資料維護子系統                        *
     A*    PROCEDURE    :驗收單號採番                              *
     A****************************************************************
     FRE@BPF  UF  E           K        DISK                      A
     IS003O1      DS
     I                                        1   2 WI1
     I                                        3   4 WI2
     I                                        5   60WI3
     I                                        7  120@B04
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WI1       PARM           S003I1  2
     C           WI2       PARM           S003I2  2
     C           WI3       PARM           S003I3  20
     C                     PARM           S003O1 12
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY@B     KLIST
     C                     KFLD           WI1
     C                     KFLD           WI2
     C                     KFLD           WI3
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           KEY@B     CHAIN@B0                  40
  01-C           *IN40     IFEQ '0'
    C                     ADD  1         @B04
    C                     UPDAT@B0
  01*C                     ELSE
    C                     MOVE WI1       @B01
    C                     MOVE WI2       @B02
    C                     Z-ADDWI3       @B03
    C                     Z-ADD1         @B04
    C                     WRITE@B0
  01-C                     END
     C*
     C                     SETON                     LR
