     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : RES006                                     *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    DATE WRITTEN : 81/01/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :共用資料維護子系統                        *
     A*    PROCEDURE    :銷貨退回單號採番                          *
     A****************************************************************
     FRE@EPF  UF  E           K        DISK                      A
     IS006O1      DS
     I                                        1   2 WI1
     I                                        3   4 WI2
     I                                        5   60WI3
     I                                        7  120@E04
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WI1       PARM           S006I1  2
     C           WI2       PARM           S006I2  2
     C           WI3       PARM           S006I3  20
     C                     PARM           S006O1 12
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY@E     KLIST
     C                     KFLD           WI1
     C                     KFLD           WI2
     C                     KFLD           WI3
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           KEY@E     CHAIN@E0                  40
  01-C           *IN40     IFEQ '0'
    C                     ADD  1         @E04
    C                     UPDAT@E0
  01*C                     ELSE
    C                     MOVE WI1       @E01
    C                     MOVE WI2       @E02
    C                     Z-ADDWI3       @E03
    C                     Z-ADD1         @E04
    C                     WRITE@E0
  01-C                     END
     C*
     C                     SETON                     LR
