     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : RES017                                     *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    DATE WRITTEN : 81/05/01                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :共用資料維護子系統                        *
     A*    PROCEDURE    : GET SPOOL FILE'S USER DATA                 *
     A****************************************************************
     FPA#APF  IF  E           K        DISK
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           PRTF   10
     C                     PARM           USRDTA 10
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     MOVEL'USRDTA'  #A01
     C                     MOVELPRTF      #A02
     C           KEY#A     CHAIN#A0                  40
  01-C           *IN40     IFEQ '0'
    C                     MOVEL#A03      USRDTA
  01*C                     ELSE
    C                     MOVEL'*SAME'   USRDTA
  01-C                     END
     C*
     C                     SETON                     LR
