     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : RES014                                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/03/09                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :共用資料維護子系統                        *
     A*    PROCEDURE    :發票號碼採番                              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.10.28 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     FARAAPF  UF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     E*: 字軌英文字母FUNCTION DATA1:
     E                    WFUN1  26  26  1
     E*: 字軌（英文字母）數字FUNCTION DATA2:
     E                    WFUN2  26  26  2 0
     IDA03        DS
     I                                        1   80NUM
     I            DS
     I                                        1   20WT
     I                                        2   20WT01
     I            DS
     I                                        1   4 WO2
     I                                        1   1 P
     I                                        2   20M1
     I                                        3   30M2
     I                                        4   40M3
     I            DS
     I                                        1   2 WKA04
     I                                        1   1 X1
     I                                        2   2 X2
     I            DS
     I                                        1   80WKA07
     I                                        1   10N1
     I                                        3   30N3
     I                                        5   50N5
     I                                        8   80N8
     IS014O1      DS
     I                                        1   2 WAA04
     I                                        3  100WAA07
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN S014I1    WI1
M001MC*          *LIKE     DEFN S014I2    WI2
M001AC           *LIKE     DEFN S014I2    WWI2
M001MC           *LIKE     DEFN S014I2    WI2   + 2
     C           *LIKE     DEFN S014I3    WI3
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WI1       PARM           S014I1  2
M001MC*          WI2       PARM           S014I2  40
M001MC           WWI2      PARM           S014I2  40
      *開立日期YY/MM/DD
     C           WI3       PARM           S014I3  60
     C                     PARM           S014O1 10
     C                     PARM           S014O2  4
     C                     PARM           S014O3  1
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYAA     KLIST
     C                     KFLD           WI1
     C                     KFLD           WI2
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           *NAMVAR   DEFN           DA03
     C           *LOCK     IN   DA03
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE WWI2      HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     H@6N01  60
M001AC                     Z-ADDH@6N01    WI2
     C*
     C           WI1       CHAIN#B0                  40
     C                     MOVE #B17      WI1
     C*
     C           KEYAA     SETLLAA0
     C*
  01-C           *IN10     DOWEQ'0'
    C           KEYAA     READEAA0                      44
  02-C           *IN44     IFEQ '1'
    C                     SETON                     10
  02-C                     END
  03-C           AA08      IFEQ *BLANKS
    C           AA07      ANDLTAA06
    C                     SETON                     10
  03-C                     END
  01-C                     END
     C*
  04-C           *IN44     IFEQ '0'
  05-C           AA07      IFEQ 0
    C                     Z-ADDAA05      AA07
  05*C                     ELSE
    C                     ADD  1         AA07
  05-C                     END
M001MC*                    Z-ADDWI3       AA09
M001AC                     MOVE WI3       HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    AA09
    C                     UPDATAA0
    C*
    C                     MOVE AA04      WAA04
    C                     Z-ADDAA07      WAA07
    C                     MOVE WAA04     WKA04
    C                     Z-ADDWAA07     WKA07
    C                     MOVE *BLANKS   S014O3
    C                     EXSR RTN100
  04*C                     ELSE
    C*
    C                     ADD  1         NUM
    C                     MOVE '**'      WAA04
    C                     Z-ADDNUM       WAA07
    C                     MOVE *BLANKS   S014O2
    C                     MOVE 'E'       S014O3
  04-C                     END
     C*
     C                     OUT  DA03
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....GET 檢查號碼
      *==============================================================*
01===C           RTN100    BEGSR
|    C* GET  X1
|    C                     Z-ADD0         ID      20
| 06-C           ID        DOWLT26
|   C                     ADD  1         ID
| 07-C           X1        IFEQ WFUN1,ID
|   C                     Z-ADDWFUN2,ID  XXN1    20
|   C                     Z-ADD99        ID
| 07-C                     END
| 06-C                     END
|    C* GET  X2
|    C                     Z-ADD0         ID
| 08-C           ID        DOWLT26
|   C                     ADD  1         ID
| 09-C           X2        IFEQ WFUN1,ID
|   C                     Z-ADDWFUN2,ID  XXN2    20
|   C                     Z-ADD99        ID
| 09-C                     END
| 08-C                     END
|    C* GET Y1
|    C                     ADD  XXN1      XXN2
|    C           XXN2      DIV  2         Y1      20
|    C                     MOVE WFUN1,Y1  P
|    C* GET  M1/M2/M3
|    C           10        SUB  N1        N1
|    C           N1        ADD  N8        WT
|    C                     Z-ADDWT01      M1
|    C*
|    C           10        SUB  N3        N1
|    C           N1        ADD  N8        WT
|    C                     Z-ADDWT01      M2
|    C*
|    C           10        SUB  N5        N1
|    C           N1        ADD  N8        WT
|    C                     Z-ADDWT01      M3
|    C*
|    C                     MOVE WO2       S014O2
|    C*
01===C                     ENDSR
     C*==============================================================*
M001AC/COPY HBP2CVTR
**
ABCDEFGHIJKLMNOPQRSTUVWXYZ
**
0102030405060708091011121314151617181920212223242526
