     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : RES009                                     *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    DATE WRITTEN : 81/01/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :共用資料維護子系統                        *
     A*    PROCEDURE    :良壞轉換單號採番                          *
     A****************************************************************
     FRE@HPF  UF  E           K        DISK                      A
     IS009O1      DS
     I                                        1   2 WI1
     I                                        3   4 WI2
     I                                        5   5 WI3
     I                                        6   70WI4
     I                                        8  120@H05
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WI1       PARM           S009I1  2
     C           WI2       PARM           S009I2  2
     C           WI3       PARM           S009I3  1
     C           WI4       PARM           S009I4  20
     C                     PARM           S009O1 12
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY@H     KLIST
     C                     KFLD           WI1
     C                     KFLD           WI2
     C                     KFLD           WI3
     C                     KFLD           WI4
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           KEY@H     CHAIN@H0                  40
  01-C           *IN40     IFEQ '0'
    C                     ADD  1         @H05
    C                     UPDAT@H0
  01*C                     ELSE
    C                     MOVE WI1       @H01
    C                     MOVE WI2       @H02
    C                     MOVE WI3       @H03
    C                     Z-ADDWI4       @H04
    C                     Z-ADD1         @H05
    C                     WRITE@H0
  01-C                     END
     C*
     C                     SETON                     LR
