     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : RES001                                     *
     H*    AUTHOR       : ROBERT LIEN                                *
     H*    CREATE DATE  : 81/01/06                                   *
     H*    UPDATE DATE  :                                            *
     H*    'MMDDYY' <---> 'YYMMDD'
     H****************************************************************
     I            DS
     I                                        1   60WDATE1
     I                                        1   20WMM1
     I                                        3   40WDD1
     I                                        5   60WYY1
     I            DS
     I                                        1   60WDATE2
     I                                        1   20WYY2
     I                                        3   40WMM2
     I                                        5   60WDD2
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           PTYPE   3
     C                     PARM           PDATE1  60
     C                     PARM           PDATE2  60
     C*==============================================================*
     C*=  'MMDDYY' TO 'YYMMDD'
  01-C           PTYPE     IFEQ 'MDY'
    C                     MOVE PDATE1    WDATE1
    C                     MOVE WMM1      WMM2
    C                     MOVE WDD1      WDD2
    C                     MOVE WYY1      WYY2
    C                     MOVE WDATE2    PDATE2
  01-C                     END
     C*=  'YYMMDD' TO 'MMDDYY'
  02-C           PTYPE     IFEQ 'YMD'
    C                     MOVE PDATE1    WDATE2
    C                     MOVE WYY2      WYY1
    C                     MOVE WMM2      WMM1
    C                     MOVE WDD2      WDD1
    C                     MOVE WDATE1    PDATE2
  02-C                     END
     C*
     C                     RETRN
