     FS#SPPF  UP  E           K        DISK
     C           SP02      IFEQ *BLANKS
     C           SP01      ANDNE*BLANKS
     C                     CALL 'S#A141'
     C                     PARM SP01      NAM    10
     C           SP02      PARM SP02      TXT    50
     C           TXT       IFNE *BLANKS
     C                     UPDATSP0
     C                     END
     C                     END
     CLR                   RETRN
