     F****************************************************************
     F*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     F*                                                              *
     F*    PROGRAM NAME : SHA110                                     *
     F*    AUTHOR       : A1062   JEANNY LIN                         *
     F*    CREATE DATE  : 79/06/26                                   *
     F*    UPDATE DATE  :                                            *
     F*    SYSTEM       :程式安全管制系統                          *
     F*    PURPOSE      :使用者基本資料維護                        *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.10.28 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     F****************************************************************
     FS#SUPF  UF  E           K        DISK                      A
     FS#A110D CF  E                    WORKSTN
     E                    WFUN    5   5  6
     IS#DA01      DS
     I                                        1  10 CENTER
     I           UDS
     I                                      101 110 USER
B2MODI*M001M民國年月日                    111 1180DDATE
M001MI                                      111 1160DDATE
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT RTN.
     C           *IN03     DOWEQ'0'
     C*
     C           SCID      CASEQ'SC01'    RTN100
     C           SCID      CASEQ'SC02'    RTN200
     C                     END
     C*
     C                     END
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
     C           RTN010    BEGSR
     C           *NAMVAR   DEFN           S#DA01
     C                     IN   *NAMVAR
     C*GET SCREEN USER NAME
     C           USER      CHAINSU0                  40    *NF
     C   40                MOVE *BLANK    DUSER
     C  N40                MOVE SU02      DUSER
     C           *LOVAL    SETLLSU0
     C*
     C                     MOVE 'SC01'    SCID    4
     C                     MOVE *BLANK    DSU01
     C                     MOVE '1'       DOPT
     C                     ENDSR
     C*==============================================================*
     C*          RTN100....'SC01' SCREEN MAIN ROUTINE
     C*==============================================================*
     C           RTN100    BEGSR
     C                     EXFMTDSPC1
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'                        *03 OFF
     C*
     C           *IN18     IFEQ '1'                        *18 OFF
     C                     CALL 'S#S110'
     C           DSU01     PARM DSU01     S1101I 10
     C           *IN03     PARM *IN03     S1101O  1
     C                     END                             *18 END
     C*
     C                     EXSR RTN110                     *SCR CHK
     C  N99                MOVE 'SC02'    SCID
     C*
     C                     END                             *03 END
     C                     ENDSR
     C*==============================================================*
     C*          RTN110....SCREEN CHECK
     C*==============================================================*
     C           RTN110    BEGSR
     C*已存在之使用者才可執行
     C           USER      IFNE CENTER
     C           USER      CHAINSU0                  40
     C   40                SETON                     9399
     C           *LOVAL    SETLLSU0
     C                     END
     C   99                GOTO END110
     C*須輸入資料
     C           DSU01     IFEQ *BLANK
     C                     SETON                     609899
     C                     END
     C   99                GOTO END110
     C*非管制中心無法使用管制中心資料CENTER='REPGMR   '
     C           USER      IFNE CENTER
     C           DSU01     ANDEQCENTER
     C                     SETON                     609599
     C                     END
     C   99                GOTO END110
     C*檢查基本資料是否存在
     C           DSU01     CHAINSU0                  40    *NF
     C           DOPT      IFEQ '1'
     C  N40                SETON                     609799
     C                     ELSE
     C   40                SETON                     609699
     C                     END
     C           *LOVAL    SETLLSU0
     C   99                GOTO END110
     C*
     C           USER      IFNE CENTER                     *N CENTER
     C           DOPT      ANDNE'1'                        *DOPT<>1
     C*去除無權異動者
     C           USER      IFNE SU03
     C           USER      ANDNESU01
     C                     SETON                     609599
     C                     END
     C   99                GOTO END110
     C*異動者須為授權人
     C           DOPT      IFLE '4'
     C           USER      ANDNESU03
     C                     SETON                     609499
     C                     END
     C*                                                    *DOPT<>1
     C                     END                             *N CENTER
     C*
     C           END110    ENDSR
     C*==============================================================*
     C*          RTN200....'SC02' SCREEN MAIN ROUTINE
     C*==============================================================*
     C           RTN200    BEGSR
     C*
     C                     MOVE DOPT      WNUM    10
     C                     MOVE WFUN,WNUM DFUN
     C*
     C                     EXSR RTN205
     C           DOPT      CASEQ'1'       RTN210           *ADD
     C           DOPT      CASEQ'2'       RTN220           *UPD
     C           DOPT      CASEQ'4'       RTN230           *DEL
     C           DOPT      CASEQ'5'       RTN240           *INQ
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN205....CLEAR FIELDS
     C*==============================================================*
     C           RTN205    BEGSR
     C                     MOVE *BLANK    DSU02
     C                     MOVE *BLANK    DSU03
     C                     MOVE *BLANK    DSU03C
     C                     MOVE *BLANK    DSU04
     C                     MOVE *BLANK    DSU05
     C                     MOVE *BLANK    DSU06
     C                     MOVE *BLANK    DSU07
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDDATE     DSU97
M001AC                     Z-ADDDDATE     DSU97
B2CHKC*M001D               MOVE '008N2'   HB2@FA
B2CHKC*M001D               MOVE DDATE     HB2@F
B2CHKC*M001D               MOVE '000'     HB2@TA
B2CHKC*M001D               EXSR HB@RMV                     REMOVE CENTURY
B2CHKC*M001D               MOVE HB2@T     DSU97
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2000C                     TIME           DSU98
     C                     MOVE USER      DSU99
     C                     ENDSR
     C*==============================================================*
     C*          RTN210....ADD DATA
     C*==============================================================*
     C           RTN210    BEGSR
     C                     SETON                     31    *CAN INPUT
     C*
     C                     MOVE USER      DSU03
     C           DSU03     CHAINSU0                  40    *NF
     C  N40                MOVE SU02      DSU03C
     C   40                MOVE *BLANK    DSU03C
     C           *LOVAL    SETLLSU0
     C*
     C           *IN03     DOWEQ'0'                        *CTL LOOP
     C           SCID      ANDEQ'SC02'
     C                     EXFMTDSPC2
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'                        *03 12 OFF
     C           *IN12     ANDEQ'0'
     C                     EXSR RTN250                     *CHK SCR
     C*
     C           *IN99     IFEQ '0'                        *99 OFF
     C                     EXSR RTN270                     *SRC TO PF
     C                     WRITESU0
     C                     MOVE 'SC01'    SCID
     C                     END                             *99 END
     C*
     C                     END                             *03 12 END
     C*
     C   12                MOVE 'SC01'    SCID
     C                     END                             *LOOP END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN220....UPD DATA
     C*==============================================================*
     C           RTN220    BEGSR
     C                     EXSR RTN260                     *PF TO SCR
     C                     SETON                     31    *CAN INPUT
     C*
     C           *IN03     DOWEQ'0'                        *CTL LOOP
     C           SCID      ANDEQ'SC02'
     C                     EXFMTDSPC2
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'                        *03 12 OFF
     C           *IN12     ANDEQ'0'
     C                     EXSR RTN250                     *CHK SCR
     C*
     C           *IN99     IFEQ '0'                        *99 OFF
     C           DSU01     CHAINSU0                  40    *NF
     C                     EXSR RTN270                     *SRC TO PF
     C                     UPDATSU0
     C                     MOVE 'SC01'    SCID
     C                     END                             *99 END
     C*
     C                     END                             *03 12 END
     C*
     C   12                MOVE 'SC01'    SCID
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN230....DEL DATA
     C*==============================================================*
     C           RTN230    BEGSR
     C*
     C                     EXSR RTN260                     *PF TO SCR
     C                     SETOF                     31    *NO INPUT
     C                     EXFMTDSPC2
     C*
     C           *IN03     IFEQ '0'
     C           *IN12     ANDEQ'0'
     C           DSU01     CHAINSU0                  40    *NF
     C  N40                DELETSU0
     C                     END
     C*
     C  N03                MOVE 'SC01'    SCID
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN240....INQ DATA
     C*==============================================================*
     C           RTN240    BEGSR
     C*
     C                     EXSR RTN260                     *PF TO SCR
     C                     SETOF                     31    *NO INPUT
     C                     EXFMTDSPC2
     C*
     C  N03                MOVE 'SC01'    SCID
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN250....CHECK 'SC02' SCREEN
     C*==============================================================*
     C           RTN250    BEGSR
     C*
     C           DSU02     IFEQ *BLANK
     C                     SETON                     609899
     C                     END
     C*
     C           END250    ENDSR
     C*==============================================================*
     C*          RTN260....PF TO SCREEN
     C*==============================================================*
     C           RTN260    BEGSR
     C*
     C           DSU01     CHAINSU0                  40    *NF
     C                     MOVE SU02      DSU02
     C                     MOVE SU03      DSU03
     C                     MOVE SU04      DSU04
     C                     MOVE SU05      DSU05
     C                     MOVE SU06      DSU06
     C                     MOVE SU07      DSU07
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*M001M民國年月日   Z-ADDSU97      DSU97
M001MC                     Z-ADDSU97      DSU97
B2CHKC*                    MOVE '008N2'   HB2@FA
B2CHKC*                    MOVE SU97      HB2@F
B2CHKC*                    MOVE '000'   HB2@TA
B2CHKC*                    EXSR HB@RMV                     REMOVE CENTURY
B2CHKC*                    MOVE HB2@T     DSU97
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     Z-ADDSU98      DSU98
     C                     MOVE SU99      DSU99
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*M001M民國年月日   Z-ADDSU97      DSU97
M001MC                     Z-ADDSU97      DSU97
B2CHKC*                    MOVE '008N2'   HB2@FA
B2CHKC*                    MOVE SU97      HB2@F
B2CHKC*                    MOVE '000'     HB2@TA
B2CHKC*                    EXSR HB@RMV                     REMOVE CENTURY
B2CHKC*                    MOVE HB2@T     DSU97
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     Z-ADDSU98      DSU98
     C                     MOVE SU99      DSU99
     C           SU03      CHAINSU0                  40    *NF
     C   40                MOVE *BLANK    DSU03C
     C  N40                MOVE SU02      DSU03C
     C           *LOVAL    SETLLSU0                  40    *NF
     C*
     C           DOPT      IFEQ '5'
     C           *LOVAL    SETLLSU0
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN270....SCREEN TO PF
     C*==============================================================*
     C           RTN270    BEGSR
     C*
     C                     MOVE DSU01     SU01
     C                     MOVE DSU02     SU02
     C                     MOVE DSU03     SU03
     C                     MOVE DSU04     SU04
     C                     MOVE DSU05     SU05
     C                     MOVE DSU06     SU06
     C                     MOVE DSU07     SU07
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE DSU97     SU97
B2CHKC*M001D               MOVE '000 U'   HB2@FA
B2CHKC*M001D               MOVE DSU97     HB2@F
B2CHKC*M001D               MOVE '008N2'   HB2@TA
B2CHKC*M001D               EXSR HB@ADD                     ADD CENTURY
B2CHKC*M001D               MOVE HB2@T     SU97
B2INF *CVR3005 sev.30 Converted code may not work properly. Please verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     MOVE DSU98     SU98
     C                     MOVE DSU99     SU99
B2000C                     Z-ADDDDATE     SU97
B2000C                     TIME           SU98
     C                     MOVE USER      SU99
     C*
     C                     ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC* M001D /COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
**
新增修改      刪除查詢
