     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : S#R430                                     *
     H*    AUTHOR       : A1062   JEANNY LIN                         *
     H*    CREATE DATE  : 79/07/03                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :程式安全管制系統                          *
     H*    PURPOSE      :授權清冊                                  *
     H****************************************************************
     FS#R430D CF  E                    WORKSTN
     FS#SUPF  IF  E           K        DISK
     I*--------------------------------------------------------------*
     E                    WARY    1   1 10               *HIVAL INITIAL
     I*--------------------------------------------------------------*
     ILDA        UDS
     I                                      101 110 USER
     I                                      111 1160DDATE
     I                                      501 510 DSU031
     I                                      511 520 DSU032
     C*--------------------------------------------------------------*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           CPY       PARM CPY       CPY     30
     C           PRTID     PARM PRTID     PRTID   10
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN100
     C                     SETON                     99
     C*
     C           *IN03     DOWEQ'0'
     C           *IN99     ANDEQ'1'
     C                     EXFMTDSPC1
     C                     MOVEA*ALL'0'   *IN,60           *CLEAR
     C  N03                EXSR RTN200                     *CHK FIELD  N
     C                     END
     C*
     C           *NAMVAR   DEFN *LDA      LDA
     C                     OUT  *NAMVAR
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*===============================================================*
     C*          RTN100....INIT SCREEN
     C*===============================================================*
     C           RTN100    BEGSR
     C           USER      CHAINSU0                  40    *NF
     C   40                MOVE *BLANK    DUSER
     C  N40                MOVE SU02      DUSER
     C*
     C                     MOVE *BLANK    DSU031
     C                     MOVE WARY,1    DSU032
     C                     SETON                     10
     C                     ENDSR
     C*===============================================================*
     C*          RTN200....CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
     C           RTN200    BEGSR
     C*
     C           DSU032    IFEQ *BLANK
     C                     MOVE *HIVAL    DSU032
     C                     END
     C*
     C           DSU031    IFGT DSU032
     C                     SETON                     606197
     C                     SETON                     99
     C                     END
     C*
     C                     ENDSR
**
9999999999
