     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : SAA001                                     *
     A*    AUTHOR       : A1084  CHARLES                             *
     A*    DATE WRITTEN : 81/05/01                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售資料建檔子系統                        *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :銷售目標達成率設定 (A/U/D/I)              *
     A****************************************************************
     FSOSKPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FSOSKLF  IF  E           K        DISK
     F            SK0                               KRENAMESK0L
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
B2CHKFSAA001D CF  E                    WORKSTN
B2INF *CVR3009 sev.30 DISPLAY file SAA001D must be converted, because
B2INF *   field SK02 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert SAA001D, enlarging SK02
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     E*: FUNCTION DATA :
     E                    WFUN    6   6  6
     E*: A/U/D/I AUT
     E                    WA01        6  1
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
     I                                      513 513 $WRHTY
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *年度
     I            DS
     I                                        1   20DSK02
     I                                        1   20SK021
     I                                        1   20SK022
     I                                        1   20SK023
     I                                        1   20SK024
     I                                        1   20SK025
     I                                        1   20SK026
     I                                        1   20SK027
     I                                        1   20SK028
     I                                        1   20SK029
     I            DS
     I                                        1   20DSK021
     I                                        1   20SK0210
     I                                        1   20SK0211
     I                                        1   20SK0212
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C                     Z-ADD0         DSK02
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6        *CTL
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C                     MOVE *BLANK    WQUERY  1
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
B2MODC           *LIKE     DEFN DBGN2     OBGN2 + 2        *START KEY
     C           *LIKE     DEFN DBGN3     OBGN3            *START KEY
     C           *LIKE     DEFN DBGN4     OBGN4            *START KEY
     C           *LIKE     DEFN DBGN5     OBGN5            *START KEY
     C           *LIKE     DEFN DBGN6     OBGN6            *START KEY
     C           *LIKE     DEFN DBGN7     OBGN7            *START KEY
     C*  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN2     BBGN2 + 2        *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN3     BBGN3            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN4     BBGN4            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN5     BBGN5            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN6     BBGN6            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN7     BBGN7            *SUBFIL BUTTOM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#C     KLIST
     C                     KFLD           #C01
     C                     KFLD           #C02
     C           KEYSK1    KLIST
     C                     KFLD           DSK01
     C                     KFLD           DSK02
     C                     KFLD           DSK07
     C                     KFLD           DSK03
     C                     KFLD           DSK04
     C                     KFLD           DSK05
     C                     KFLD           DSK06
     C           KEYSK2    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C                     KFLD           DBGN3
     C                     KFLD           DBGN4
     C                     KFLD           DBGN5
     C                     KFLD           DBGN6
     C                     KFLD           DBGN7
     C           KEYSK3    KLIST
     C                     KFLD           BBGN1
     C                     KFLD           BBGN2
     C                     KFLD           BBGN3
     C                     KFLD           BBGN4
     C                     KFLD           BBGN5
     C                     KFLD           BBGN6
     C                     KFLD           BBGN7
     C           KEYSK4    KLIST
     C                     KFLD           SK01
     C                     KFLD           SK02
     C                     KFLD           SK07
     C                     KFLD           SK03
     C                     KFLD           SK04
     C                     KFLD           SK05
     C                     KFLD           SK06
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN110
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $INQ      WA01,6
|    C                     MOVE 'SCR001'  APPSCR
|    C*CHANGE DATE MM/DD/YY
B2MODC                     Z-ADD0         DATE    80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM $EGMDY    S001I2  60
B2MODC           DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C           RTN110    BEGSR
|    C*CHECK新增權利
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9099
| 01*C                     ELSE
|   C                     EXSR RTN200
| 02-C           DRRN1     IFGT 0
|   C           DRRN1     SUB  1         HRRN1
| 02-C                     END
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 01-C                     END
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*START KEY
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          DBGN1     IFNE OBGN1
B2OLDC*          DBGN2     ORNE OBGN2
B2OLDC*          DBGN3     ORNE OBGN3
B2OLDC*          DBGN4     ORNE OBGN4
B2OLDC*          DBGN5     ORNE OBGN5
B2OLDC*          DBGN6     ORNE OBGN6
B2OLDC*          DBGN7     ORNE OBGN7
B2NEWC                     MOVE DBGN2     HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4N01  40
B2NEWC           DBGN1     IFNE OBGN1
B2NEWC           H@4N01    ORNE OBGN2
B2NEWC           DBGN3     ORNE OBGN3
B2NEWC           DBGN4     ORNE OBGN4
B2NEWC           DBGN5     ORNE OBGN5
B2NEWC           DBGN6     ORNE OBGN6
B2NEWC           DBGN7     ORNE OBGN7
B2INF *CVR0001 sev.00 Field DBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN5 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN5 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN7 is not a date or year
B2INF *CVR0001 sev.00 Field OBGN7 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
      *KEY START KEY TO OBGN1
|   C                     MOVE DBGN1     OBGN1
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE DBGN2     OBGN2
B2NEWC                     MOVE DBGN2     HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    OBGN2
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN3     OBGN3
|   C                     MOVE DBGN4     OBGN4
|   C                     MOVE DBGN5     OBGN5
|   C                     MOVE DBGN6     OBGN6
|   C                     MOVE DBGN7     OBGN7
| 01*C                     ELSE
| 02-C****       WRRN1     IFGT 0
|   C                     EXSR RTN171
| 03-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 03-C                     END
| 02-C****                 END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   57*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     96
| 05-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SK01' SCREEN
      *==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
| 01-C                     END
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C           KEYSK2    SETLLSK0L
|    C                     MOVE DBGN1     BBGN1
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE DBGN2     BBGN2
B2NEWC                     MOVE DBGN2     HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    BBGN2
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     MOVE DBGN3     BBGN3
|    C                     MOVE DBGN4     BBGN4
|    C                     MOVE DBGN5     BBGN5
|    C                     MOVE DBGN6     BBGN6
|    C                     MOVE DBGN7     BBGN7
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C*SCREEN1 START KEY
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          BBGN1     IFNE DBGN1
B2OLDC*          BBGN2     ORNE DBGN2
B2OLDC*          BBGN3     ORNE DBGN3
B2OLDC*          BBGN4     ORNE DBGN4
B2OLDC*          BBGN5     ORNE DBGN5
B2OLDC*          BBGN6     ORNE DBGN6
B2OLDC*          BBGN7     ORNE DBGN7
B2NEWC                     MOVE DBGN2     HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4N01  40
B2NEWC           BBGN1     IFNE DBGN1
B2NEWC           BBGN2     ORNE H@4N01
B2NEWC           BBGN3     ORNE DBGN3
B2NEWC           BBGN4     ORNE DBGN4
B2NEWC           BBGN5     ORNE DBGN5
B2NEWC           BBGN6     ORNE DBGN6
B2NEWC           BBGN7     ORNE DBGN7
B2INF *CVR0001 sev.00 Field BBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN3 is not a date or year
B2INF *CVR0001 sev.00 Field BBGN5 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN5 is not a date or year
B2INF *CVR0001 sev.00 Field BBGN7 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN7 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C           KEYSK3    SETGTSK0L
| 02-C                     END
|   C                     EXSR RTN193
|   C*KEEP SCREEN1 START KEY TO BBGN1
|   C                     MOVE SK01      BBGN1
B2000C                     Z-ADDSK02      BBGN2
|   C                     MOVE SK07      BBGN3
|   C                     MOVE SK03      BBGN4
|   C                     MOVE SK04      BBGN5
|   C                     MOVE SK05      BBGN6
|   C                     MOVE SK06      BBGN7
|   C           *LOVAL    SETLLSK0L
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ SK0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*GET SFL DATA
|   C                     EXSR RTN194                     *GET DATA
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *=========================================================*
      *          RTN194 .. GET DATA
      *=========================================================*
09===C           RTN194    BEGSR
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
10===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     95    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
11===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLSK0
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
12===C           RTN210    BEGSR
|    C*
|    C                     SETON                     3031  *ADD MSG
|    C                     EXSR RTN261                     *CLR FIELD
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C**IN04 = WINDOW TO HELP
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C*ENTER = PROCESS
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR RTN29S
|   C                     WRITESK0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 02*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 02-C                     END
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
13===C           RTN220    BEGSR
|    C*
|    C                     SETOF                     30
|    C                     SETON                     31    *CAN INPUT
|    C           KEYSK4    CHAINSK0                  40
     C           *LOVAL    SETLLSK0
|    C                     EXSR RTN262                     *FILE->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'
B2???C           KEYSK1    CHAINSK0                  41
B2INF *CVR0001 sev.00 Field SK01 is not a date or year
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields DSK02 and SK02 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
B2INF *CVR0001 sev.00 Field DSK07 is not a date or year
B2INF *CVR0001 sev.00 Field SK07 is not a date or year
B2INF *CVR0001 sev.00 Field DSK03 is not a date or year
B2INF *CVR0001 sev.00 Field SK03 is not a date or year
B2INF *CVR0001 sev.00 Field SK04 is not a date or year
B2INF *CVR0001 sev.00 Field DSK05 is not a date or year
B2INF *CVR0001 sev.00 Field SK05 is not a date or year
B2INF *CVR0001 sev.00 Field DSK06 is not a date or year
B2INF *CVR0001 sev.00 Field SK34 is not a date or year
|   C                     EXSR RTN29S
|   C                     UPDATSK0
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
14===C           RTN230    BEGSR
|    C*
|    C                     SETOF                     3031  *NO INPUT
|    C           KEYSK4    CHAINSK0                  40
     C           *LOVAL    SETLLSK0
|    C                     EXSR RTN262                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 04-C           DLTFLG    IFEQ 'Y'
B2???C           KEYSK1    CHAINSK0                  41
B2INF *CVR0001 sev.00 Field SK01 is not a date or year
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields DSK02 and SK02 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
B2INF *CVR0001 sev.00 Field DSK07 is not a date or year
B2INF *CVR0001 sev.00 Field SK07 is not a date or year
B2INF *CVR0001 sev.00 Field DSK03 is not a date or year
B2INF *CVR0001 sev.00 Field SK03 is not a date or year
B2INF *CVR0001 sev.00 Field SK04 is not a date or year
B2INF *CVR0001 sev.00 Field DSK05 is not a date or year
B2INF *CVR0001 sev.00 Field SK05 is not a date or year
B2INF *CVR0001 sev.00 Field DSK06 is not a date or year
B2INF *CVR0001 sev.00 Field SK34 is not a date or year
|   C                     DELETSK0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
15===C           RTN240    BEGSR
|    C*
|    C                     SETOF                     3031  *NO INPUT
|    C           KEYSK4    CHAINSK0L                 40
|    C                     EXSR RTN262                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     MOVE 'SCR001'  APPSCR
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN261....CLEAR SCREEN DATA
      *==============================================================*
16===CSR         RTN261    BEGSR
|    C*
|    C                     MOVE *BLANK    DSK01
|    C                     Z-ADD0         DSK02
|    C                     Z-ADD0         DSK021
|    C                     MOVE *BLANK    DSK03
|    C                     MOVE *BLANK    DSK04
|    C                     MOVE *BLANK    DSK05
|    C                     MOVE *BLANK    DSK06
|    C                     MOVE *BLANK    DSK07
|    C                     Z-ADD0         DSK08
|    C                     Z-ADD0         DSK09
|    C                     Z-ADD0         DSK10
|    C                     Z-ADD0         DSK11
|    C                     Z-ADD0         DSK12
|    C                     Z-ADD0         DSK13
|    C                     Z-ADD0         DSK14
|    C                     Z-ADD0         DSK15
|    C                     Z-ADD0         DSK16
|    C                     Z-ADD0         DSK17
|    C                     Z-ADD0         DSK18
|    C                     Z-ADD0         DSK19
|    C                     Z-ADD0         DSK20
|    C                     Z-ADD0         DSK21
|    C                     Z-ADD0         DSK22
|    C                     Z-ADD0         DSK23
|    C                     Z-ADD0         DSK24
|    C                     Z-ADD0         DSK25
|    C                     Z-ADD0         DSK26
|    C                     Z-ADD0         DSK27
|    C                     Z-ADD0         DSK28
|    C                     Z-ADD0         DSK29
|    C                     Z-ADD0         DSK30
|    C                     Z-ADD0         DSK31
|    C                     Z-ADD0         DSK32
|    C                     Z-ADD0         DSK33
|    C*REF FIELDS
|    C                     MOVE *BLANKS   #B03
|    C                     MOVE *BLANKS   D#A03
|    C                     MOVE *BLANKS   #C03
|    C                     MOVE *BLANKS   #D02
|    C                     MOVE *BLANKS   ME04
|    C                     MOVE *BLANKS   MA03
|    C*
16===CSR                   ENDSR
      *==============================================================*
      *          RTN262....MOVE DATA TO SCREEN
      *==============================================================*
17===CSR         RTN262    BEGSR
|    C*
|    C                     MOVE SK01      DSK01
B2TRCC                     Z-ADDSK02      DSK02
B2CHKC           DSK02     ADD  1         DSK021
|    C                     MOVE SK03      DSK03
|    C                     MOVE SK04      DSK04
|    C                     MOVE SK05      DSK05
|    C                     MOVE SK06      DSK06
|    C                     MOVE SK07      DSK07
|    C                     Z-ADDSK08      DSK08
|    C                     Z-ADDSK09      DSK09
|    C                     Z-ADDSK10      DSK10
|    C                     Z-ADDSK11      DSK11
|    C                     Z-ADDSK12      DSK12
|    C                     Z-ADDSK13      DSK13
|    C                     Z-ADDSK14      DSK14
|    C                     Z-ADDSK15      DSK15
|    C                     Z-ADDSK16      DSK16
|    C                     Z-ADDSK17      DSK17
|    C                     Z-ADDSK18      DSK18
|    C                     Z-ADDSK19      DSK19
|    C                     Z-ADDSK20      DSK20
|    C                     Z-ADDSK21      DSK21
|    C                     Z-ADDSK22      DSK22
|    C                     Z-ADDSK23      DSK23
|    C                     Z-ADDSK24      DSK24
|    C                     Z-ADDSK25      DSK25
|    C                     Z-ADDSK26      DSK26
|    C                     Z-ADDSK27      DSK27
|    C                     Z-ADDSK28      DSK28
|    C                     Z-ADDSK29      DSK29
|    C                     Z-ADDSK30      DSK30
|    C                     Z-ADDSK31      DSK31
|    C                     Z-ADDSK32      DSK32
|    C                     Z-ADDSK33      DSK33
|    C* GET 公司代號
|    C                     MOVE *BLANK    #B03
|    C           DSK01     CHAIN#B0                  40
|    C* GET 通路
|    C                     MOVE *BLANKS   D#A03
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVELDSK03     #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 01-C                     END
|    C* GET 型態
|    C                     MOVE *BLANK    #C03
|    C                     MOVELDSK03     #C01
|    C                     MOVELDSK04     #C02
|    C           KEY#C     CHAIN#C0                  40
|    C* GET 地區代號
|    C                     MOVE *BLANK    #D02
|    C           DSK07     CHAIN#D0                  40
|    C* GET 客戶代號
|    C                     MOVE *BLANKS   ME04
|    C                     MOVELDSK05     ME01
|    C                     MOVEL*BLANKS   ME02
|    C           KEYME     CHAINME0                  40
|    C* GET 產品
|    C                     MOVE *BLANK    MA03
|    C                     MOVE *BLANK    MA13
|    C           DSK06     CHAINMA0                  40
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN270....F5 -- 參考資料
      *==============================================================*
18===CSR         RTN270    BEGSR
|    C*
|    C                     EXSR RTN280
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 01-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 01-C                     END
|    C                     SETON                     99
|    C*
18===C                     ENDSR
      *==============================================================*
      *          RTN280....CHECK 'SC02' SCREEN
      *==============================================================*
19===CSR         RTN280    BEGSR
|    C* CHK,GET公司
|    C                     MOVE *BLANK    #B03
| 01-C           DSK01     IFEQ *BLANK
|   C                     SETON                     609499
| 01*C                     ELSE
      *公司檔
|   C           DSK01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     SETON                     608999
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END280
      *年度
B2CHKC           DSK02     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     619499
| 03-C                     END
|    C   99                GOTO END280
B2CHKC           DSK02     ADD  1         DSK021
|    C* GET 客戶代號
|    C                     MOVE *BLANKS   ME04
|    C                     MOVE *BLANKS   DSK03
|    C                     MOVE *BLANKS   DSK04
|    C                     MOVE *BLANKS   D#A03
|    C                     MOVE *BLANKS   #C03
|    C                     MOVE *BLANKS   DSK07
|    C                     MOVE *BLANKS   #D02
| 04-C           DSK05     IFEQ *BLANKS
|   C                     SETON                     659499
| 04*C                     ELSE
      *客戶主檔
|   C           DSK05     CHAINMD0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     MOVELMD07      DSK03
|   C                     MOVELMD08      DSK04
|   C* GET 通路
|   C                     MOVEL'DISTRUBT'#A01
|   C                     MOVELDSK03     #A02
|   C           KEY#A     CHAIN#A0                  40
| 06-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 06*C                     ELSE
| 06-C                     END
|   C* GET 型態
|   C                     MOVELDSK03     #C01
|   C                     MOVELDSK04     #C02
|   C           KEY#C     CHAIN#C0                  40
      *
|   C                     MOVELDSK05     ME01
|   C                     MOVEL*BLANKS   ME02
|   C           KEYME     CHAINME0                  40
| 07-C           *IN40     IFEQ '0'
      *地區
|   C                     MOVELME07      DSK07
|   C           DSK07     CHAIN#D0                  40
| 07*C                     ELSE
|   C                     SETON                     658999
| 07-C                     END
| 05*C                     ELSE
|   C                     SETON                     658999
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END280
|    C* GET 產品及單位
|    C                     MOVE *BLANK    MA03
|    C                     MOVE *BLANK    MA13
| 08-C           DSK06     IFEQ *BLANKS
|   C                     SETON                     669499
| 08*C                     ELSE
|   C           DSK06     CHAINMA0                  40
| 09-C           *IN40     IFEQ '1'
|   C                     SETON                     668999
| 09-C                     END
| 08-C                     END
|    C   99                GOTO END280
      *
B2???C           KEYSK1    SETLLSK0                      40
B2INF *CVR0001 sev.00 Field SK01 is not a date or year
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields DSK02 and SK02 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
B2INF *CVR0001 sev.00 Field DSK07 is not a date or year
B2INF *CVR0001 sev.00 Field SK07 is not a date or year
B2INF *CVR0001 sev.00 Field DSK03 is not a date or year
B2INF *CVR0001 sev.00 Field SK03 is not a date or year
B2INF *CVR0001 sev.00 Field SK04 is not a date or year
B2INF *CVR0001 sev.00 Field DSK05 is not a date or year
B2INF *CVR0001 sev.00 Field SK05 is not a date or year
B2INF *CVR0001 sev.00 Field DSK06 is not a date or year
B2INF *CVR0001 sev.00 Field SK34 is not a date or year
| 10-C           DOPT1     IFEQ '1'
| 11-C           *IN40     IFEQ '1'
|   C                     SETON                     606165
|   C                     SETON                     669299
| 11-C                     END
| 10*C                     ELSE
| 12-C           *IN40     IFEQ '0'
|   C                     SETON                     606165
|   C                     SETON                     669399
| 12-C                     END
| 10-C                     END
|    C   99                GOTO END280
      *DSK08
|    C           DSK10     ADD  DSK11     DSK08
|    C                     ADD  DSK12     DSK08
|    C                     ADD  DSK13     DSK08
|    C                     ADD  DSK14     DSK08
|    C                     ADD  DSK15     DSK08
|    C                     ADD  DSK16     DSK08
|    C                     ADD  DSK17     DSK08
|    C                     ADD  DSK18     DSK08
|    C                     ADD  DSK19     DSK08
|    C                     ADD  DSK20     DSK08
|    C                     ADD  DSK21     DSK08
      *DSK09
|    C           DSK22     ADD  DSK23     DSK09
|    C                     ADD  DSK24     DSK09
|    C                     ADD  DSK25     DSK09
|    C                     ADD  DSK26     DSK09
|    C                     ADD  DSK27     DSK09
|    C                     ADD  DSK28     DSK09
|    C                     ADD  DSK29     DSK09
|    C                     ADD  DSK30     DSK09
|    C                     ADD  DSK31     DSK09
|    C                     ADD  DSK32     DSK09
|    C                     ADD  DSK33     DSK09
      *
19===CSR         END280    ENDSR
     C*==============================================================*
     C*          RTN29S....SCREEN TO FILE --- H
     C*==============================================================*
20===C           RTN29S    BEGSR
      *
|    C                     MOVE DSK01     SK01
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDSK02     SK02
B2NEWC                     MOVE DSK02     HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    SK02
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     MOVE DSK03     SK03
|    C                     MOVE DSK04     SK04
|    C                     MOVE DSK05     SK05
|    C                     MOVE DSK06     SK06
|    C                     MOVE DSK07     SK07
|    C                     Z-ADDDSK08     SK08
|    C                     Z-ADDDSK09     SK09
|    C                     Z-ADDDSK10     SK10
|    C                     Z-ADDDSK11     SK11
|    C                     Z-ADDDSK12     SK12
|    C                     Z-ADDDSK13     SK13
|    C                     Z-ADDDSK14     SK14
|    C                     Z-ADDDSK15     SK15
|    C                     Z-ADDDSK16     SK16
|    C                     Z-ADDDSK17     SK17
|    C                     Z-ADDDSK18     SK18
|    C                     Z-ADDDSK19     SK19
|    C                     Z-ADDDSK20     SK20
|    C                     Z-ADDDSK21     SK21
|    C                     Z-ADDDSK22     SK22
|    C                     Z-ADDDSK23     SK23
|    C                     Z-ADDDSK24     SK24
|    C                     Z-ADDDSK25     SK25
|    C                     Z-ADDDSK26     SK26
|    C                     Z-ADDDSK27     SK27
|    C                     Z-ADDDSK28     SK28
|    C                     Z-ADDDSK29     SK29
|    C                     Z-ADDDSK30     SK30
|    C                     Z-ADDDSK31     SK31
|    C                     Z-ADDDSK32     SK32
|    C                     Z-ADDDSK33     SK33
|    C*
B2000C                     Z-ADDDATE      SKXX
B2000C                     TIME           SKYY
|    C                     MOVE $USER     SKZZ
|    C*
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
21===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
21===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
22===C           RTNF4     BEGSR
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C********************
|    C*  FOR  SCR002     *
|    C********************
| 01-C           APPSCR    IFEQ 'SCR002'
|   C** 客戶代號
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE55
|   C           D#COL     ANDLE59
|   C                     CALL 'WDS003'
|   C                     PARM           S003O1  9
|   C                     MOVELS003O1    DSK05
| 02-C                     END
|   C*
|   C** 產品代號
| 03-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE13
|   C           D#COL     ANDLE21
|   C                     CALL 'WDS001'
|   C                     PARM           R001O1  9
|   C                     MOVELR001O1    DSK06
| 03-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     SETON                     99
|    C*
22===C           ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
23===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
23===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
**
新增修改      刪除查詢採購
