      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      * PROGRAM NAME : SAR0642                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/12/18                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :客戶往來產品表                               *
      ****************************************************************
     FREWF57  IP  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSAR064P O   E             39     PRINTER
     E*
     IWF570
     I                                              WF5702L3
     I                                              WF5703L3
     I                                              WF5704L2
     I                                              WF5705L2
     I                                              WF5713L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*辦事處，通路，型態，業務員，客戶，產品
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      603 603 COMP
     I                                      611 611 DSC33S
     I                                      612 612 DSC33E
     I                                      613 614 DSC34S
     I                                      615 616 DSC34E
     I                                      621 629 DSC45S
     I                                      631 639 DSC45E
     I                                      641 649 DSD03S
     I                                      651 659 DSD03E
     I                                      700 705 DSC27S
     I                                      706 711 DSC27E
     I*(MM/DD/YY)
     I                                      661 6660DSC08S
     I                                      671 6760DSC08E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*          KEY#A     KLIST
     C*                    KFLD           #A01
     C*                    KFLD           #A02
     C           KEY#C     KLIST
     C                     KFLD           #C01
     C                     KFLD           #C02
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
  01-C           *IN10     IFEQ '0'
    C                     WRITEPH1
    C                     SETON                     10
  01*C                     ELSE
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                SETOF                     31
     CL2 10                SETOF                     3231
     CL3 10                SETOF                     303132
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C*通路
|    C*                    MOVEL'DISTRUBT'#A01
|    C*                    MOVELWF5702    #A02
|    C*          KEY#A     CHAIN#A0                  40
| 02-C*          *IN40     IFEQ '1'
|   C*                    MOVEL*BLANKS   #A03
| 02-C*                    END
|    C*
|    C*型態
|    C                     MOVELWF5702    #C01
|    C                     MOVELWF5703    #C02
|    C           KEY#C     CHAIN#C0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   #C02
| 03-C                     END
|    C*
|    C*客戶
|    C                     MOVELWF5704    ME01
|    C                     MOVELWF5705    ME02
|    C           KEYME     CHAINME0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   ME04
| 04-C                     END
|    C*產品
|    C           WF5706    CHAINMA0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 05-C                     END
|    C*業務員
|    C           WF5713    CHAINMC0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   MC02A
| 06-C                     ELSE
|   C                     MOVE MC02      MC02A
| 06-C                     END
|    C*業務員
|    C           WF5719    CHAINMC0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   MC02B
| 06-C                     ELSE
|   C                     MOVE MC02      MC02B
| 06-C                     END
|    C*日期轉換
M001AC                     Z-ADDWF5707    XF5707  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF5707    S001I2  80
M001AC                     PARM XF5707    S001I2  60
|    C           D5707     PARM           S001O1  60
|    C*
|    C*日期轉換
B2CHKC           WF5714    IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
     C                     SETON                     34
     C                     ELSE
     C                     SETOF                     34
M001AC                     Z-ADDWF5714    XF5714  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF5714    S001I2  80
M001AC                     PARM XF5714    S001I2  60
|    C           D5714     PARM           S001O1  60
     C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETON                     303132
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
02===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     303132
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN999
      *==============================================================*
03===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPE2
|    C*
03===C                     ENDSR
