      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR047                                        *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品銷售統計表                               *
      ****************************************************************
     FSAR047D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSAR047Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*辦事處
     I                                      600 600 COMP
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      645 645 DSC33S
     I                                      646 646 DSC33E
     I                                      651 652 DSC34S
     I                                      653 654 DSC34E
     I                                      661 664 DSC28S
     I                                      665 668 DSC28E
      *MM//YY
     I                                      611 6140DSC39
     I                                      611 6120DSC39M
     I                                      613 6140DSC39Y
      *YY/MM--------------------------------------------------------
      *本年月
     I                                      615 6180SC39E
     I                                      615 6160SC39EY
     I                                      617 6180SC39EM
      *螢幕上年下月
     I                                      619 6220SC39S
     I                                      619 6200SC39SY
     I                                      621 6220SC39SM
      *
     I                                      623 623 DSEL
     I                                      624 632 DSD03S
     I                                      633 641 DSD03E
     I                                      701 7040DSC08
     I                                      701 7020DSC08M
     I                                      703 7040DSC08Y
     I                                      750 750 IN20
     I                                      705 705 DSEL1
     I                                      706 706 DSEL2
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC28S
|    C                     MOVE *BLANK    DSC28E
|    C                     Z-ADD0         DSC08
|    C                     Z-ADD0         DSC39
|    C                     Z-ADD0         SC39E
|    C                     Z-ADD0         SC39S
|    C                     MOVE 'A'       DSEL
|    C                     MOVE '1'       DSEL1
|    C                     MOVE '1'       DSEL2
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *
|    C* CHK辦事處
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK通路
| 02-C           DSC33S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC33S
| 02-C                     END
|    C*
| 03-C           DSC33E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC33E
| 03-C                     END
|    C*
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     606193
|   C                     SETON                     99
|   C                     GOTO END100
| 04-C                     END
|    C*
|    C   99                GOTO END100
|    C*
|    C* CHK型態
| 05-C           DSC34S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC34S
| 05-C                     END
|    C*
| 06-C           DSC34E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC34E
| 06-C                     END
|    C*
| 07-C           DSC34S    IFGT DSC34E
|   C                     SETON                     626393
|   C                     SETON                     99
|   C                     GOTO END100
| 07-C                     END
|    C*
|    C   99                GOTO END100
|    C*
|    C* CHK組別
| 08-C           DSC28S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC28S
| 08-C                     END
|    C*
| 09-C           DSC28E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC28E
| 09-C                     END
|    C*
| 10-C           DSC28S    IFGT DSC28E
|   C                     SETON                     707193
|   C                     SETON                     99
|   C                     GOTO END100
| 10-C                     END
|    C*
|    C   99                GOTO END100
|    C*客戶
| 11-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 11-C                     END
|    C*
| 12-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 12-C                     END
|    C*
| 13-C           DSD03S    IFGT DSD03E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
|    C*送貨日期或確認日期只輸入一項
| 14-C           DSC08     IFNE 0
|   C           DSC39     ANDNE0
|   C                     SETON                     648999
| 14-C                     END
|    C   99                GOTO END100
|    C*
| 15-C           DSC39     IFNE 0
      *
| 16-C           DSC39M    IFGT 12
|   C           DSC39M    ORLT 1
|   C                     SETON                     629399
| 16-C                     END
|   C   99                GOTO END100
|   C                     MOVE '1'       IN20
|   C*
|   C*(CHANGE TO CHINESE DATE)
      *本年月YY/MM
|   C                     Z-ADDDSC39Y    SC39EY
|   C                     Z-ADDDSC39M    SC39EM
| 15*C                     ELSE
      *
| 17-C           DSC08M    IFGT 12
|   C           DSC08M    ORLT 1
|   C                     SETON                     649399
| 17-C                     END
|   C   99                GOTO END100
|   C                     MOVE '0'       IN20
|   C*
|   C*(CHANGE TO CHINESE DATE)
      *本年月YY/MM
|   C                     Z-ADDDSC08Y    SC39EY
|   C                     Z-ADDDSC08M    SC39EM
| 15-C                     END
      *去年下月OR本年一月
|    C           SC39EM    ADD  1         SC39SM
| 18-C           SC39SM    IFEQ 13
|   C                     Z-ADD1         SC39SM
|   C                     Z-ADDSC39EY    SC39SY
| 18*C                     ELSE
|   C           SC39EY    SUB  1         SC39SY
| 18-C                     END
      *SCREEN LOG
|    C                     OPEN SAR047Z
|    C                     WRITEPH1
|    C                     CLOSESAR047Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 8
| 03-C           D#COL     IFGE 40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
|   C*
| 11-C           D#ROW     IFEQ 5
| 12-C           D#COL     IFEQ 40
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 12-C                     END
|   C*
| 13-C           D#COL     IFEQ 52
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 13-C                     END
|   C*
| 11-C                     END
|   C*
| 08-C           D#ROW     IFEQ 6
| 09-C           D#COL     IFGE 40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33S  1
|   C                     PARM           DSC34S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 52
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33E  1
|   C                     PARM           DSC34E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*
| 05-C           D#ROW     IFEQ 7
| 06-C           D#COL     IFGE 40
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 52
|   C           D#COL     ANDLE55
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C***
|   C*
| 14-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 14-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
