      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR078                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/09/21                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :產品銷售分析週報表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.14  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     ILDA        UDS
     I                                      119 1240$EGMDY
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *公司
     I                                      601 601 DMA07
      *類別
     I                                      602 602 DMA11
      *試飲
     I                                      603 603 DSEL1
      *單瓶
     I                                      604 604 DSEL2
      *專櫃
     I                                      605 605 DSEL3
      *當期
      *MM/DD/YY
     I                                      611 6160DATES
     I                                      611 612 MMS
     I                                      613 6140DDS
     I                                      615 616 YYS
     I                                      621 6260DATEE
     I                                      621 622 MME
     I                                      623 624 DDE
     I                                      625 626 YYE
      *YY/MM/DD
M001MI*                                     631 6360YMDS
M001MI*                                     631 6340YM
M001MI*                                     641 6460YMDE
M001MI                                      631 6380YMDS
M001MI                                      631 6360YM
M001MI                                      641 6480YMDE
M001MI*                                     651 6560F01S
M001MI*                                     651 6540F01YM
M001MI*                                     661 6660F01E
M001MI                                      651 6580F01S
M001MI                                      651 6560F01YM
M001MI                                      661 6680F01E
M001MI*                                     671 6760F02S
M001MI*                                     671 6740F02SYM
M001MI*                                     681 6860F02E
M001MI*                                     681 6840F02EYM
M001MI                                      671 6780F02S
M001MI                                      671 6760F02SYM
M001MI                                      681 6880F02E
M001MI                                      681 6860F02EYM
M001MI*                                     687 6900F02EW
M001MI*                                     691 6940F03S
M001MI*                                     701 7040F03E
M001MI                                      689 6920F02EW
M001MI                                      693 6980F03S
M001MI                                      701 7060F03E
M001MI*                                     711 7160F0201
M001MI*                                     715 716 F0201D
M001MI                                      711 7180F0201
M001MI                                      717 718 F0201D
     I*
     I                                      721 729 DMA01S
     I                                      731 739 DMA01E
     I                                      751 7560D01S
     I                                      751 752 D01SM
     I                                      753 754 D01SD
     I                                      755 756 D01SY
     I                                      761 7660D01E
     I                                      761 762 D01EM
     I                                      765 766 D01EY
     I                                      771 7760D02S
     I                                      771 7720D02SM
     I                                      771 774 D02SMD
     I                                      773 774 D02SD
     I                                      775 7760D02SY
     I                                      773 7760D02SMY
     I                                      781 7860D02E
     I                                      781 7820D02EM
     I                                      783 7860D02EMY
     I                                      785 7860D02EY
     I                                      791 7940D03S
     I                                      791 7920D03SM
     I                                      793 7940D03SY
     I                                      801 8040D03E
     I                                      801 8020D03EM
     I                                      803 8040D03EY
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     .INIT SCREEN
     C                     EXSR RTN100                     .CHECK      ?
     C*
     C                     EXSR OUTLDA
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD1         $CPY
|    C                     MOVEL'01'      $PRTID
|    C                     MOVE 'R'       DMA07
|    C                     MOVE *LOVAL    DMA01S
|    C                     MOVE *HIVAL    DMA01E
|    C                     MOVE 'N'       DSEL1
|    C                     MOVE 'B'       DSEL2
|    C                     MOVE 'A'       DSEL3
|    C                     Z-ADD$EGMDY    DATES
|    C           DDS       SUB  6         DDS
|    C                     Z-ADD$EGMDY    DATEE
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         D01S
|    C                     Z-ADD0         D01E
|    C                     Z-ADD0         D02S
|    C                     Z-ADD0         D02E
|    C                     Z-ADD0         D03S
|    C                     Z-ADD0         D03E
|    C                     Z-ADD0         F01S
|    C                     Z-ADD0         F01E
|    C                     Z-ADD0         F02S
|    C                     Z-ADD0         F02E
|    C                     Z-ADD0         F03S
|    C                     Z-ADD0         F03E
|    C                     Z-ADD0         F0201
M001AC                     Z-ADD0         W6      60
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATES     S001I2  60
|    C*M001M     YMDS      PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDS
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATEE     S001I2  60
|    C*M001M     YMDE      PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDE
|    C**
|    C*當月起訖D01S,D01E
| 01-C           D01S      IFEQ 0
|   C                     MOVELMMS       D01SM
|   C                     MOVEL'01'      D01SD
|   C                     MOVELYYS       D01SY
| 01-C                     END
|    C*
| 02-C           D01E      IFEQ 0
|   C                     Z-ADDDATEE     D01E
| 02-C                     END
      *
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D01S      S001I2  60
|    C*M001M     F01S      PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    F01S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D01E      S001I2  60
|    C*M001M     F01E      PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    F01E
|    C*
|    C*當年起訖D02S,D02E
| 03-C           D02S      IFEQ 0
|   C                     MOVEL'0401'    D02SMD
|   C                     MOVELYYS       D02SY
| 04-C           MMS       IFLT '04'
|   C           D02S      SUB  1         D02S
| 04-C                     END
| 03-C                     END
| 05-C           D02E      IFEQ 0
|   C                     Z-ADDDATEE     D02E
| 05-C                     END
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D02S      S001I2  60
|    C*M001M     F02S      PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    F02S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D02E      S001I2  60
|    C*M001M     F02E      PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    F02E
|    C*
| 06-C           F02SYM    IFNE F02EYM
|   C           F02EYM    SUB  1         F02EW
| 06-C                     END
| 07-C           F02SYM    IFNE F02EYM
|   C                     Z-ADDF02E      F0201
|   C                     MOVEL'01'      F0201D
| 07-C                     END
|    C*去年起訖D03S,D03E
| 08-C           D03S      IFEQ 0
|   C           D02SY     SUB  1         D03SY
|   C                     Z-ADDD02SM     D03SM
| 08-C                     END
| 09-C           D03E      IFEQ 0
|   C           D02EY     SUB  1         D03EY
|   C                     Z-ADDD02EM     D03EM
| 09-C                     END
|    C*
|    C                     MOVE D03SM     F03S
|    C*M001M               MOVELD03SY     F03S
M001AC                     MOVE D03SY     HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    WY4     40
M001MC                     MOVELWY4       F03S
|    C                     MOVE D03EM     F03E
|    C*M001M               MOVELD03EY     F03E
M001AC                     MOVE D03EY     HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    WY4     40
M001MC                     MOVELWY4       F03E
      *
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
