      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR041                                        *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :應收帳款作業                                 *
     A* REMARK       :客戶退貨明細表                               *
     F*================================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE
     F*----------------------------------------------------------------
     F*  M002     | 99.11.11 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
      ****************************************************************
     FSAR041D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSAR041Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 604 DSG12S
     I                                      605 608 DSG12E
     I                                      611 616 DSG11S
     I                                      617 622 DSG11E
     I                                      631 635 DSG04S
     I                                      636 640 DSG04E
     I                                      641 6460DSG06S
     I                                      647 6520DSG06E
     I                                      673 6780DSG26S
     I                                      679 6840DSG26E
     I                                      685 6900DATES
     I                                      691 6960DATEE
     I                                      661 661 DSG03
     I                                      662 662 IN20
     I                                      663 663 DATA1
     I*增加辦事處的挑選
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I*
     I*增加產品挑選
     I                                      701 709 DSH03S
     I                                      711 719 DSH03E
M002A *集團代號
M002AI                                      800 801 DMD06S
M002AI                                      802 803 DMD06E
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
M002AC                     MOVE *BLANK    DMD06S
M002AC                     MOVE *BLANK    DMD06E
|    C                     MOVE *BLANK    DSG12S
|    C                     MOVE *BLANK    DSG12E
|    C                     MOVE *BLANK    DSG11S
|    C                     MOVE *BLANK    DSG11E
|    C                     MOVE *BLANK    DSG04S
|    C                     MOVE *BLANK    DSG04E
|    C                     MOVE *BLANK    DSH03S
|    C                     MOVE *BLANK    DSH03E
|    C                     Z-ADD0         DSG06S
|    C                     Z-ADD0         DSG06E
|    C                     Z-ADD0         DSG26S
|    C                     Z-ADD0         DSG26E
|    C                     Z-ADD0         DATES   60
|    C                     Z-ADD0         DATEE   60
|    C                     MOVE *BLANK    DSG03
|    C                     MOVE *BLANK    IN20
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK組別
| 01-C           DSG12S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG12S
| 01-C                     END
|    C*
| 02-C           DSG12E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG12E
| 02-C                     END
|    C*
| 03-C           DSG12S    IFGT DSG12E
|   C                     SETON                     606193
|   C                     SETON                     99
|   C                     GOTO END100
| 03-C                     END
|    C*
|    C* CHK業務員
| 04-C           DSG11S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG11S
| 04-C                     END
|    C*
| 05-C           DSG11E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG11E
| 05-C                     END
|    C*
| 06-C           DSG11S    IFGT DSG11E
|   C                     SETON                     626393
|   C                     SETON                     99
|   C                     GOTO END100
| 06-C                     END
|    C*
|    C* CHK客戶代號
| 07-C           DSG04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG04S
| 07-C                     END
|    C*
| 08-C           DSG04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG04E
| 08-C                     END
|    C*
| 09-C           DSG04S    IFGT DSG04E
|   C                     SETON                     646593
|   C                     SETON                     99
|   C                     GOTO END100
| 09-C                     END
|    C*
|    C* CHK產品代號
| 10-C           DSH03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSH03S
| 10-C                     END
|    C*
| 11-C           DSH03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSH03E
| 11-C                     END
|    C*
| 12-C           DSH03S    IFGT DSH03E
|   C                     SETON                     727393
|   C                     SETON                     99
|   C                     GOTO END100
| 12-C                     END
M002AC*集團代號
M002AC           DMD06S    IFEQ *BLANK
M002AC                     MOVE *LOVAL    DMD06S
M002AC                     END
M002AC*
M002AC           DMD06E    IFEQ *BLANK
M002AC                     MOVE *HIVAL    DMD06E
M002AC                     END
M002AC*
M002AC           DMD06S    IFGT DMD06E
M002AC                     SETON                     7677
M002AC                     SETON                     9399
M002AC                     END
M002AC   99                GOTO END100
|    C* CHK日期
| 13-C           DSG06S    IFNE 0
|   C           DSG06E    ORNE 0
| 14-C           DSG26S    IFNE 0
|   C                     SETON                     698999
| 14-C                     END
| 15-C           DSG26E    IFNE 0
|   C                     SETON                     708999
| 15-C                     END
| 13-C                     END
|    C   99                GOTO END100
|    C*
| 16-C           DSG06S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSG06S    P0901I  60
|   C                     PARM           P0901O  1
| 17-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 17-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSG06E    P0901I  60
|   C                     PARM           P0901O  1
| 18-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 18-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG06S    S001I2  60
|   C           DATES     PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG06E    S001I2  60
|   C           DATEE     PARM           S001O1  60
|   C**
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C**
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|   C**
M001DC*          DATES     IFGT DATEE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 19-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 16*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSG26S    P0901I  60
|   C                     PARM           P0901O  1
| 20-C           P0901O    IFEQ 'N'
|   C                     SETON                     699399
| 20-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSG26E    P0901I  60
|   C                     PARM           P0901O  1
| 21-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 21-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG26S    S001I2  60
|   C           DATES     PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG26E    S001I2  60
|   C           DATEE     PARM           S001O1  60
|   C**
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C**
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|   C**
M001DC*          DATES     IFGT DATEE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6970
|   C                     SETON                     9299
| 22-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 16-C                     END
|    C**選擇單別
| 23-C           DSG03     IFEQ *BLANKS
|   C                     SETON                     68
|   C                     SETON                     9699
| 23-C                     END
|    C   99                GOTO END100
|    C**試飲與否
| 24-C           DSG03     IFEQ 'B'
|   C           DATA1     ANDEQ*BLANKS
|   C                     SETON                     71
|   C                     SETON                     9699
| 24-C                     END
|    C   99                GOTO END100
|    C***********
|    C* CHK公司
|    C***********
| 25-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 25*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 25-C                     END
|    C*
|    C                     OPEN SAR041Z
|    C                     WRITEPH1
|    C                     CLOSESAR041Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 6
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS016'
|   C                     PARM           DSG12S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 49
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS016'
|   C                     PARM           DSG12E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 7
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C                     PARM           DSG11S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 49
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS015'
|   C                     PARM           DSG11E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
| 08-C           D#ROW     IFEQ 8
| 09-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DSG04S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C                     PARM           DSG04E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*
M002AC*集團代號
M002AC           D#ROW     IFEQ 9
M002AC           D#COL     IFGE 38
M002AC           D#COL     ANDLE39
M002AC                     CALL 'WDS034'
M002AC                     PARM           DMD06S
M002AC                     GOTO ENDF4
M002AC                     END
M002AC*
M002AC           D#COL     IFGE 49
M002AC           D#COL     ANDLE50
M002AC                     CALL 'WDS034'
M002AC                     PARM           DMD06E
M002AC                     GOTO ENDF4
M002AC                     END
M002AC                     END
| 11-C           D#ROW     IFEQ 12
| 12-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSH03S
|   C                     GOTO ENDF4
| 12-C                     END
|   C*
| 13-C           D#COL     IFGE 51
|   C           D#COL     ANDLE59
|   C                     CALL 'WDS001'
|   C                     PARM           DSH03E
|   C                     GOTO ENDF4
| 13-C                     END
|   C*
| 11-C                     END
|   C*
| 14-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 14-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
