      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0462                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :客戶銷售統計表                               *
      ****************************************************************
     FREWF15  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSAR046P O   E             39     PRINTER
     E*
     E*: FUNCTION DATA :
     E                    TEST    1   4 16
     IWF150
     I                                              WF1501L4
     I                                              WF1502L3
     I                                              WF1503L2
     I                                              WF1504L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      671 679 DSC04S
     I                                      681 689 DSC04E
      *MM/DD/YY
     I                                      611 6140DSC39
     I                                      611 6120DSC39M
     I                                      613 6140DSC39Y
      *YY/MM/DD--------------------------------------------------------
      *本年月
     I                                      615 6180SC39E
     I                                      615 6160SC39EY
     I                                      617 6180SC39EM
      *螢幕上年下月
     I                                      619 6220SC39S
     I                                      619 6200SC39SY
     I                                      621 6220SC39SM
      *
     I                                      623 623 DSEL
     I                                      624 624 COMP
     I                                      625 625 DSC33S
     I                                      626 626 DSC33E
     I                                      627 628 DSC34S
     I                                      629 630 DSC34E
     I                                      631 632 DSC31S
     I                                      633 634 DSC31E
     I                                      701 7040DSC08
     I                                      701 7020DSC08M
     I                                      703 7040DSC08Y
     I                                      705 705 DSEL1
     I                                      710 715 DSC27S
     I                                      716 721 DSC27E
     I                                      750 750 IN20
     I            DS
     I                                        1   40YM01
     I                                        1   20YY01
     I                                        3   40MM01
     I            DS
     I                                        1   40YM02
     I                                        1   20YY02
     I                                        3   40MM02
     I            DS
     I                                        1   40YM03
     I                                        1   20YY03
     I                                        3   40MM03
     I            DS
     I                                        1   40YM04
     I                                        1   20YY04
     I                                        3   40MM04
     I            DS
     I                                        1   40YM05
     I                                        1   20YY05
     I                                        3   40MM05
     I            DS
     I                                        1   40YM06
     I                                        1   20YY06
     I                                        3   40MM06
     I            DS
     I                                        1   40YM07
     I                                        1   20YY07
     I                                        3   40MM07
     I            DS
     I                                        1   40YM08
     I                                        1   20YY08
     I                                        3   40MM08
     I            DS
     I                                        1   40YM09
     I                                        1   20YY09
     I                                        3   40MM09
     I            DS
     I                                        1   40YM10
     I                                        1   20YY10
     I                                        3   40MM10
     I            DS
     I                                        1   40YM11
     I                                        1   20YY11
     I                                        3   40MM11
     I            DS
     I                                        1   40YM12
     I                                        1   20YY12
     I                                        3   40MM12
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           WF1501
     C                     KFLD           WF1502
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     WRITEPH1
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL4     IFEQ '1'
    C                     WRITEPH1                        *HEADING
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL2 10                EXSR RTN300
     CL3 10                EXSR RTN400
     CL4 10                EXSR RTN500
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
     C*
|    C                     Z-ADDSC39SY    YY01
|    C                     Z-ADDSC39SM    MM01
|    C                     Z-ADDSC39EY    YY12
|    C                     Z-ADDSC39EM    MM12
|    C                     Z-ADD0         YM02
|    C                     Z-ADD0         YM03
|    C                     Z-ADD0         YM04
|    C                     Z-ADD0         YM05
|    C                     Z-ADD0         YM06
|    C                     Z-ADD0         YM07
|    C                     Z-ADD0         YM08
|    C                     Z-ADD0         YM09
|    C                     Z-ADD0         YM10
|    C                     Z-ADD0         YM11
     C*
| 02-C           COMP      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 02*C                     ELSE
| 03-C           COMP      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 03*C                     ELSE
| 04-C           COMP      IFEQ '3'
|   C                     MOVEL'高雄'  COMPC
| 04*C                     ELSE
|   C                     MOVEL'全部'  COMPC
| 04-C                     END
| 03-C                     END
| 02-C                     END
     C*
| 02-C           DSEL1     IFEQ '1'
|   C                     MOVE TEST,1    TITE
| 02*C                     ELSE
| 03-C           DSEL1     IFEQ '2'
|   C                     MOVE TEST,2    TITE
| 03*C                     ELSE
| 04-C           DSEL1     IFEQ '3'
|   C                     MOVE TEST,3    TITE
| 04*C                     ELSE
|   C                     MOVE TEST,4    TITE
| 04-C                     END
| 03-C                     END
| 02-C                     END
     C*禮盒
|   C                     SETOF                     22
| 02-C           DSEL      IFEQ 'A'
|   C                     SETOF                     22
| 02*C                     ELSE
|   C                     SETON                     22
| 02-C                     END
     C*
|    C           MM01      ADD  1         MM02
| 03-C           MM02      IFGT 12
|   C                     SUB  12        MM02
|   C           YY01      ADD  1         YY02
| 03*C                     ELSE
|   C                     Z-ADDYY01      YY02
| 03-C                     END
|    C*
|    C           MM01      ADD  2         MM03
| 04-C           MM03      IFGT 12
|   C                     SUB  12        MM03
|   C           YY01      ADD  1         YY03
| 04*C                     ELSE
|   C                     Z-ADDYY01      YY03
| 04-C                     END
|    C*
|    C           MM01      ADD  3         MM04
| 05-C           MM04      IFGT 12
|   C                     SUB  12        MM04
|   C           YY01      ADD  1         YY04
| 05*C                     ELSE
|   C                     Z-ADDYY01      YY04
| 05-C                     END
|    C*
|    C           MM01      ADD  4         MM05
| 06-C           MM05      IFGT 12
|   C                     SUB  12        MM05
|   C           YY01      ADD  1         YY05
| 06*C                     ELSE
|   C                     Z-ADDYY01      YY05
| 06-C                     END
|    C*
|    C           MM01      ADD  5         MM06
| 07-C           MM06      IFGT 12
|   C                     SUB  12        MM06
|   C           YY01      ADD  1         YY06
| 07*C                     ELSE
|   C                     Z-ADDYY01      YY06
| 07-C                     END
|    C*
|    C           MM01      ADD  6         MM07
| 08-C           MM07      IFGT 12
|   C                     SUB  12        MM07
|   C           YY01      ADD  1         YY07
| 08*C                     ELSE
|   C                     Z-ADDYY01      YY07
| 08-C                     END
|    C*
|    C           MM01      ADD  7         MM08
| 09-C           MM08      IFGT 12
|   C                     SUB  12        MM08
|   C           YY01      ADD  1         YY08
| 09*C                     ELSE
|   C                     Z-ADDYY01      YY08
| 09-C                     END
|    C*
|    C           MM01      ADD  8         MM09
| 10-C           MM09      IFGT 12
|   C                     SUB  12        MM09
|   C           YY01      ADD  1         YY09
| 10*C                     ELSE
|   C                     Z-ADDYY01      YY09
| 10-C                     END
|    C*
|    C           MM01      ADD  9         MM10
| 11-C           MM10      IFGT 12
|   C                     SUB  12        MM10
|   C           YY01      ADD  1         YY10
| 11*C                     ELSE
|   C                     Z-ADDYY01      YY10
| 11-C                     END
|    C*
|    C           MM01      ADD  10        MM11
| 12-C           MM11      IFGT 12
|   C                     SUB  12        MM11
|   C           YY01      ADD  1         YY11
| 12*C                     ELSE
|   C                     Z-ADDYY01      YY11
| 12-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*客戶名稱
|    C           KEYME     CHAINME0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   ME04
| 01-C                     END
|    C*產品名稱
|    C           WF1504    CHAINMA0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 02-C                     END
      *統計全年數量
|    C           WF1505    ADD  WF1507    WFTOT1
|    C                     ADD  WF1509    WFTOT1
|    C                     ADD  WF1511    WFTOT1
|    C                     ADD  WF1513    WFTOT1
|    C                     ADD  WF1515    WFTOT1
|    C                     ADD  WF1517    WFTOT1
|    C                     ADD  WF1519    WFTOT1
|    C                     ADD  WF1521    WFTOT1
|    C                     ADD  WF1523    WFTOT1
|    C                     ADD  WF1525    WFTOT1
|    C                     ADD  WF1527    WFTOT1
      *統計全年金額
|    C           WF1506    ADD  WF1508    WFTOT2
|    C                     ADD  WF1510    WFTOT2
|    C                     ADD  WF1512    WFTOT2
|    C                     ADD  WF1514    WFTOT2
|    C                     ADD  WF1516    WFTOT2
|    C                     ADD  WF1518    WFTOT2
|    C                     ADD  WF1520    WFTOT2
|    C                     ADD  WF1522    WFTOT2
|    C                     ADD  WF1524    WFTOT2
|    C                     ADD  WF1526    WFTOT2
|    C                     ADD  WF1528    WFTOT2
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
      *IN20 CONTROL型態是否顯示
|    C                     SETON                     20
|    C                     ADD  WF1506    T21506
|    C                     ADD  WF1508    T21508
|    C                     ADD  WF1510    T21510
|    C                     ADD  WF1512    T21512
|    C                     ADD  WF1514    T21514
|    C                     ADD  WF1516    T21516
|    C                     ADD  WF1518    T21518
|    C                     ADD  WF1520    T21520
|    C                     ADD  WF1522    T21522
|    C                     ADD  WF1524    T21524
|    C                     ADD  WF1526    T21526
|    C                     ADD  WF1528    T21528
|    C                     ADD  WFTOT2    T2TOT2
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   SUBTOTAL2
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C*
|    C                     ADD  T21506    T31506
|    C                     ADD  T21508    T31508
|    C                     ADD  T21510    T31510
|    C                     ADD  T21512    T31512
|    C                     ADD  T21514    T31514
|    C                     ADD  T21516    T31516
|    C                     ADD  T21518    T31518
|    C                     ADD  T21520    T31520
|    C                     ADD  T21522    T31522
|    C                     ADD  T21524    T31524
|    C                     ADD  T21526    T31526
|    C                     ADD  T21528    T31528
|    C                     ADD  T2TOT2    T3TOT2
|    C                     Z-ADD0         T21506
|    C                     Z-ADD0         T21508
|    C                     Z-ADD0         T21510
|    C                     Z-ADD0         T21512
|    C                     Z-ADD0         T21514
|    C                     Z-ADD0         T21516
|    C                     Z-ADD0         T21518
|    C                     Z-ADD0         T21520
|    C                     Z-ADD0         T21522
|    C                     Z-ADD0         T21524
|    C                     Z-ADD0         T21526
|    C                     Z-ADD0         T21528
|    C                     Z-ADD0         T2TOT2
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT3   TOTAL
      *==============================================================*
04===C           RTN400    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
     C                     SETOF                     20
|    C*
|    C*
|    C                     ADD  T31506    T41506
|    C                     ADD  T31508    T41508
|    C                     ADD  T31510    T41510
|    C                     ADD  T31512    T41512
|    C                     ADD  T31514    T41514
|    C                     ADD  T31516    T41516
|    C                     ADD  T31518    T41518
|    C                     ADD  T31520    T41520
|    C                     ADD  T31522    T41522
|    C                     ADD  T31524    T41524
|    C                     ADD  T31526    T41526
|    C                     ADD  T31528    T41528
|    C                     ADD  T3TOT2    T4TOT2
|    C                     Z-ADD0         T31506
|    C                     Z-ADD0         T31508
|    C                     Z-ADD0         T31510
|    C                     Z-ADD0         T31512
|    C                     Z-ADD0         T31514
|    C                     Z-ADD0         T31516
|    C                     Z-ADD0         T31518
|    C                     Z-ADD0         T31520
|    C                     Z-ADD0         T31522
|    C                     Z-ADD0         T31524
|    C                     Z-ADD0         T31526
|    C                     Z-ADD0         T31528
|    C                     Z-ADD0         T3TOT2
      *
04===C                     ENDSR
      *==============================================================*
      *          RTN500....WRITE PT3   TOTAL
      *==============================================================*
05===C           RTN500    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT4
|    C*
|    C                     Z-ADD0         T41506
|    C                     Z-ADD0         T41508
|    C                     Z-ADD0         T41510
|    C                     Z-ADD0         T41512
|    C                     Z-ADD0         T41514
|    C                     Z-ADD0         T41516
|    C                     Z-ADD0         T41518
|    C                     Z-ADD0         T41520
|    C                     Z-ADD0         T41522
|    C                     Z-ADD0         T41524
|    C                     Z-ADD0         T41526
|    C                     Z-ADD0         T41528
|    C                     Z-ADD0         T4TOT2
|    C*
| 01-C           *INLR     IFEQ '0'
|   C                     WRITEPE1
| 01-C                     END
      *
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     20
      *
06===C                     ENDSR
      *==============================================================*
      *          RTNLR
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
     C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
      *==============================================================*
**
銷售　　　　　
銷售含搭贈　　
銷售含試飲　　
銷售含搭贈試飲
