      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0621                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :通路產品銷售週報表                           *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FSOSGPF  IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FREWF47  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *產品
     I                                      601 609 DSD03S
     I                                      610 618 DSD03E
     I            DS
     I                                        1   5 SG04
     I                                        1   1 SG04L
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF4704    WORK04
     C           *LIKE     DEFN WF4705    WORK05
     C           *LIKE     DEFN WF4706    WORK06
     C           *LIKE     DEFN WF4707    WORK07
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF4701
     C                     KFLD           WF4702
     C                     KFLD           WF4703
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *銷售
     C                     READ SC0                      45
  01-C           *IN45     DOWEQ'0'
    C                     MOVELSC33      WF4701
    C           SC02      SETLLSD0
    C           SC02      READESD0                      46
  02-C           *IN46     DOWEQ'0'
    C*
  03-C           SD03      IFGE DSD03S
    C           SD03      ANDLEDSD03E
    C*
    C                     MOVELSD03      WF4702
    C                     MOVELSD03      WF4703
    C           KEYWF     CHAINWF470                40
    C                     EXSR RTN100
  03-C                     END
    C*
    C           SC02      READESD0                      46
  02-C                     END
    C*
    C                     READ SC0                      45
  01-C                     END
     C*
     C*銷退
     C                     READ SG0                      45
  04-C           *IN45     DOWEQ'0'
    C                     MOVELSG04L     WF4701
    C           SG02      SETLLSH0
    C           SG02      READESH0                      46
  05-C           *IN46     DOWEQ'0'
    C*
  06-C           SH03      IFGE DSD03S
    C           SH03      ANDLEDSD03E
    C*
    C                     MOVELSH03      WF4702
    C                     MOVELSH03      WF4703
    C           KEYWF     CHAINWF470                40
    C                     EXSR RTN200
  06-C                     END
    C*
    C           SG02      READESH0                      46
  05-C                     END
    C*
    C                     READ SG0                      45
  04-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....WRITE OR UPDATE REWF47
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     Z-ADD0         WORK04
|    C                     Z-ADD0         WORK05
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C*
|    C                     Z-ADDSD04      WORK04
|    C                     Z-ADDSD07      WORK06
|    C*
| 07-C           *IN40     IFEQ '0'
|   C                     ADD  WORK04    WF4704
|   C                     ADD  WORK05    WF4705
|   C                     ADD  WORK06    WF4706
|   C                     ADD  WORK07    WF4707
|   C*
|   C                     UPDATWF470
| 07*C                     ELSE
|   C                     Z-ADDWORK04    WF4704
|   C                     Z-ADDWORK05    WF4705
|   C                     Z-ADDWORK06    WF4706
|   C                     Z-ADDWORK07    WF4707
| 08-C           WF4704    IFNE 0
|   C           WF4705    ORNE 0
|   C                     WRITEWF470
| 08-C                     END
|   C*
| 07-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE OR UPDATE REWF47
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C                     Z-ADD0         WORK04
|    C                     Z-ADD0         WORK05
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C*
|    C                     Z-ADDSH12      WORK05
|    C                     Z-ADDSH07      WORK07
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  WORK04    WF4704
|   C                     ADD  WORK05    WF4705
|   C                     ADD  WORK06    WF4706
|   C                     ADD  WORK07    WF4707
|   C*
|   C                     UPDATWF470
| 01*C                     ELSE
|   C                     Z-ADDWORK04    WF4704
|   C                     Z-ADDWORK05    WF4705
|   C                     Z-ADDWORK06    WF4706
|   C                     Z-ADDWORK07    WF4707
| 02-C           WF4704    IFNE 0
|   C           WF4705    ORNE 0
|   C                     WRITEWF470
| 02-C                     END
|   C*
| 01-C                     END
|    C*
02===C                     ENDSR
