      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266
      *
      * PROGRAM NAME : SAR066
      * AUTHER       : AN MING HSIA
      * CREATE DATE  : 06/10/93
      * UPDATE DATE  :
      * SYSTEM       :人頭馬匯東
      * SUBSYSTEM    :訂單系統
      * REMARK       :通路型態銷售貢獻度分析表
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.12  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSAR066D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
     I                                      609 6140DSC39S
     I                                      615 6200DSC39E
     I                                      621 6260YSC39S
     I                                      627 6320YSC39E
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I                                      633 641 DSD03S
     I                                      642 650 DSD03E
     I                                      651 652 DSC34S
     I                                      653 654 DSC34E
     I                                      671 671 COMP
     I                                      672 672 COMPS
     I                                      673 673 COMPE
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      713 717 DSC04S
     I                                      718 722 DSC04E
     I                                      750 750 IN20
      *產品組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11S
|    C                     MOVE *BLANK    DMA11E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         YSC39S
|    C                     Z-ADD0         YSC39E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK通路　　
| 02-C           DSC33S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC33S
| 02-C                     END
|    C*
| 03-C           DSC33E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC33E
| 03-C                     END
|    C*
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C* CHK型態　
| 05-C           DSC34S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC34S
| 05-C                     END
|    C*
| 06-C           DSC34E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC34E
| 06-C                     END
|    C*
| 07-C           DSC34S    IFGT DSC34E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C* CHK客戶　
| 05-C           DSC04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC04S
| 05-C                     END
|    C*
| 06-C           DSC04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC04E
| 06-C                     END
|    C*
| 07-C           DSC04S    IFGT DSC04E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C* CHK種類
| 02-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
| 02*C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 02-C                     END
     C*
| 08-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 08-C                     END
|    C*
| 09-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 09-C                     END
|    C*
| 10-C           DSD03S    IFGT DSD03E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 10-C                     END
|    C   99                GOTO END100
|    C*送貨日期或確認日期只輸入一項
| 11-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 12-C           DSC39S    IFNE 0
|   C                     SETON                     648999
| 12-C                     END
| 13-C           DSC39E    IFNE 0
|   C                     SETON                     658999
| 13-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK銷售日期
| 14-C           DSC08S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 15-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 15-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 16-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 16-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08S    S001I2  60
|   C           YSC39S    PARM           S001O1  60
M001AC                     MOVE YSC39S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08E    S001I2  60
|   C           YSC39E    PARM           S001O1  60
M001AC                     MOVE YSC39E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|   C**
| 17-C*M001M     YSC39S    IFGT YSC39E
M001MC           YMD8S     IFGT YMD8E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 17-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 14*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 18-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 18-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 19-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 19-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           YSC39S    PARM           S001O1  60
M001AC                     MOVE YSC39S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           YSC39E    PARM           S001O1  60
M001AC                     MOVE YSC39E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|   C**
| 20-C*M001M     YSC39S    IFGT YSC39E
M001MC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 20-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 14-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     ANDEQ38
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 6
|   C           D#COL     ANDEQ50
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 7
| 05-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33   1
|   C           DSC34S    PARM DSC34S    PSC34   2
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 06-C           D#COL     IFGE 50
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33
|   C           DSC34E    PARM DSC34E    PSC34
|   C                     GOTO ENDF4
| 06-C                     END
| 04-C                     END
|   C*
| 08-C           D#ROW     IFEQ 8
| 09-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 50
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*
|   C*產品代號
| 07-C           D#ROW     IFEQ 8
| 08-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 08-C                     END
|   C*
| 09-C           D#COL     IFGE 50
|   C           D#COL     ANDLE68
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 09-C                     END
| 07-C                     END
|   C*
| 10-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
