      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0581                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :通路地區達成率分析表                         *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.12  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSOSKPF  IF  E           K        DISK
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FRES18WF IF  E           K        DISK                           UC
     FREWF21  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 602 DSC31S
     I                                      603 604 DSC31E
      *MM/DD/YY
     I                                      605 6100DSC39
     I                                      605 6060DSC39M
      *----------------------------------------------------------------
      *YY/MM/DD
     I*                                     611 6160WSC39
     I*                                     611 6120WSC39Y
     I*                                     613 6140WSC39M
M001MI                                      711 7180WSC39
M001MI                                      711 7140WSC39Y
M001MI                                      715 7160WSC39M
      *
     I                                      617 617 DSEL
      *螢幕本年月
     I*M001M                                618 6210SCRYM
M001MI                                      721 7260SCRYM
      *螢幕上年
     I*M001M                                622 6250SCRY1
M001MI                                      727 7320SCRY1
      *螢幕上月
     I*M001M                                626 6290SCRM1
     I*M001M                                626 6270SCRYY
     I*M001M                                628 6290SCRMM
M001MI                                      733 7380SCRM1
M001MI                                      733 7360SCRYY
M001MI                                      737 7380SCRMM
      *
M001MI*                                     630 6350KEPDAT
M001MI                                      628 6350KEPDAT
M001MI                                      628 6330KEYYM
     I                                      701 7060DSC08
     I                                      750 750 IN20
      *
     I            DS
B2MODI                                        1   80DATES
B2MODI                                        1   60DATEYM
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF2104    WORK04
     C           *LIKE     DEFN WF2105    WORK05
     C           *LIKE     DEFN WF2106    WORK06
     C           *LIKE     DEFN WF2107    WORK07
     C           *LIKE     DEFN WF2108    WORK08
     C           *LIKE     DEFN WF2109    WORK09
     C           *LIKE     DEFN WF2110    WORK10
     C           *LIKE     DEFN WF2111    WORK11
     C           *LIKE     DEFN WF2112    WORK12
     C           *LIKE     DEFN WF2113    WORK13
     C           *LIKE     DEFN MA41      WAMT
B2MODC           *LIKE     DEFN SC08      WSC08 - 2
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF2101
     C                     KFLD           WF2114
     C                     KFLD           WF2115
     C                     KFLD           WF2102
     C                     KFLD           WF2103
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     READ SK0                      45
  01-C           *IN45     DOWEQ'0'
    C                     MOVELSK03      WF2101
    C                     MOVELSK04      WF2114
    C                     MOVELSK07      WF2115
    C                     MOVELSK06      WF2102
    C                     MOVELSK06      WF2103
    C           KEYWF     CHAINWF210                40
      *月累計銷售數量及金額
    C                     EXSR RTN100
      *
    C                     READ SK0                      45
  01-C                     END
      *分析方式－禮盒(A)
  02-C           DSEL      IFEQ 'A'
    C                     EXSR RTN200
  02-C                     END
      *
      *分析方式－單瓶(B)需拆解禮盒為單瓶
  03-C           DSEL      IFEQ 'B'
    C                     EXSR RTN400
  03-C                     END
      *
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....月銷售數量及金額
      *==============================================================*
01===C           RTN100    BEGSR
      *
| 04-C           WSC39M    IFEQ 4
|   C                     Z-ADDSK10      WORK04
|   C                     Z-ADDSK22      WORK05
| 04*C                     ELSE
| 05-C           WSC39M    IFEQ 5
|   C                     Z-ADDSK11      WORK04
|   C                     Z-ADDSK23      WORK05
| 05*C                     ELSE
| 06-C           WSC39M    IFEQ 6
|   C                     Z-ADDSK12      WORK04
|   C                     Z-ADDSK24      WORK05
| 06*C                     ELSE
| 07-C           WSC39M    IFEQ 7
|   C                     Z-ADDSK13      WORK04
|   C                     Z-ADDSK25      WORK05
| 07*C                     ELSE
| 08-C           WSC39M    IFEQ 8
|   C                     Z-ADDSK14      WORK04
|   C                     Z-ADDSK26      WORK05
| 08*C                     ELSE
| 09-C           WSC39M    IFEQ 9
|   C                     Z-ADDSK15      WORK04
|   C                     Z-ADDSK27      WORK05
| 09*C                     ELSE
| 10-C           WSC39M    IFEQ 10
|   C                     Z-ADDSK16      WORK04
|   C                     Z-ADDSK28      WORK05
| 10*C                     ELSE
| 11-C           WSC39M    IFEQ 11
|   C                     Z-ADDSK17      WORK04
|   C                     Z-ADDSK29      WORK05
| 11*C                     ELSE
| 12-C           WSC39M    IFEQ 12
|   C                     Z-ADDSK18      WORK04
|   C                     Z-ADDSK30      WORK05
| 12*C                     ELSE
| 13-C           WSC39M    IFEQ 1
|   C                     Z-ADDSK19      WORK04
|   C                     Z-ADDSK31      WORK05
| 13*C                     ELSE
| 14-C           WSC39M    IFEQ 2
|   C                     Z-ADDSK20      WORK04
|   C                     Z-ADDSK32      WORK05
| 14*C                     ELSE
| 15-C           WSC39M    IFEQ 3
|   C                     Z-ADDSK21      WORK04
|   C                     Z-ADDSK33      WORK05
| 15-C                     END
| 14-C                     END
| 13-C                     END
| 12-C                     END
| 11-C                     END
| 10-C                     END
| 09-C                     END
| 08-C                     END
| 07-C                     END
| 06-C                     END
| 05-C                     END
| 04-C                     END
| 16-C           *IN40     IFEQ '0'
|   C                     ADD  WORK04    WF2104
|   C                     ADD  WORK05    WF2105
|   C                     UPDATWF210
| 16*C                     ELSE
|   C                     Z-ADDWORK04    WF2104
|   C                     Z-ADDWORK05    WF2105
|   C                     Z-ADD0         WF2106
|   C                     Z-ADD0         WF2107
|   C                     Z-ADD0         WF2108
|   C                     Z-ADD0         WF2109
|   C                     Z-ADD0         WF2110
|   C                     Z-ADD0         WF2111
|   C                     Z-ADD0         WF2112
|   C                     Z-ADD0         WF2113
|   C                     WRITEWF210
| 16-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....月銷售數量及金額
      *==============================================================*
02===C           RTN200    BEGSR
      *
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 02-C           *IN46     DOWEQ'0'
|   C                     MOVELSC33      WF2101
|   C                     MOVELSC34      WF2114
|   C                     MOVELSC31      WF2115
|   C                     MOVELSD03      WF2102
|   C                     MOVELSD03      WF2103
|   C           KEYWF     CHAINWF210                40
|   C                     EXSR RTN300
|   C           SC02      READESD0                      46
| 02-C                     END
      *
|   C                     READ SC0                      45
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWF21
      *==============================================================*
03===C           RTN300    BEGSR
      *
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C                     Z-ADD0         WORK08
|    C                     Z-ADD0         WORK09
|    C                     Z-ADD0         WORK10
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK12
|    C                     Z-ADD0         WORK13
      *
| 01-C           IN20      IFEQ '0'
B2000C                     Z-ADDSC08      DATES
| 01*C                     ELSE
B2000C                     Z-ADDSC39      DATES
| 01-C                     END
      *
B2000C           DATES     IFEQ KEPDAT
      *當日累計數量
|   C                     Z-ADDSD04      WORK06
      *當日累計金額
|   C                     Z-ADDSD07      WORK07
| 02-C                     END
      *
B2000C           DATEYM    IFEQ KEYYM
|   C           SC13      ANDNE'*'
      *當月累計數量
|   C                     Z-ADDSD04      WORK08
      *當月累計金額
|   C                     Z-ADDSD07      WORK09
| 03-C                     END
      *
B2000C           DATEYM    IFEQ SCRM1
|   C           SC13      ANDNE'*'
      *上月累計數量
|   C                     Z-ADDSD04      WORK10
      *上月累計金額
|   C                     Z-ADDSD07      WORK11
| 04-C                     END
      *
B2000C           DATEYM    IFEQ SCRY1
|   C           SC13      ANDNE'*'
      *上年累計數量
|   C                     Z-ADDSD04      WORK12
      *上年累計金額
|   C                     Z-ADDSD07      WORK13
| 05-C                     END
      *
| 06-C           *IN40     IFEQ '0'
|   C                     ADD  WORK06    WF2106
|   C                     ADD  WORK07    WF2107
|   C                     ADD  WORK08    WF2108
|   C                     ADD  WORK09    WF2109
|   C                     ADD  WORK10    WF2110
|   C                     ADD  WORK11    WF2111
|   C                     ADD  WORK12    WF2112
|   C                     ADD  WORK13    WF2113
      *
|   C                     UPDATWF210
| 06*C                     ELSE
|   C                     Z-ADD0         WF2104
|   C                     Z-ADD0         WF2105
|   C                     Z-ADDWORK06    WF2106
|   C                     Z-ADDWORK07    WF2107
|   C                     Z-ADDWORK08    WF2108
|   C                     Z-ADDWORK09    WF2109
|   C                     Z-ADDWORK10    WF2110
|   C                     Z-ADDWORK11    WF2111
|   C                     Z-ADDWORK12    WF2112
|   C                     Z-ADDWORK13    WF2113
|   C                     WRITEWF210
| 06-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN400....禮盒單瓶售價計算數量及金額
      *==============================================================*
04===C           RTN400    BEGSR
      *
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
| 01-C           IN20      IFEQ '0'
B2000C                     Z-ADDSC08      DATES
| 01*C                     ELSE
B2000C                     Z-ADDSC39      DATES
| 01-C                     END
      *
      *
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 03-C           *IN46     DOWEQ'0'
|   C                     MOVELSC33      WF2101
|   C                     MOVELSC34      WF2114
|   C                     MOVELSC31      WF2115
|   C           SD03      CHAINMA0                  42
| 04-C           *IN42     IFEQ '0'
      *禮盒碼
| 05-C           MA54      IFEQ 'Y'
|   C                     EXSR RTN500
|   C                     OPEN RES18WF
|   C                     EXSR RTN600
|   C                     CLOSERES18WF
      *ELSE非禮盒處理同禮盒處禮DSEL='A'
| 05*C                     ELSE
|   C                     MOVELSD03      WF2102
|   C                     MOVELSD03      WF2103
|   C           KEYWF     CHAINWF210                40
|   C                     EXSR RTN300
      *
| 05-C                     END
| 04-C                     END
      *
|   C           SC02      READESD0                      46
| 03-C                     END
      *
|   C                     READ SC0                      45
| 01-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN500....禮盒單瓶成本
      *==============================================================*
05===C           RTN500    BEGSR
      *禮盒拆解為產品
M001AC                     Z-ADDSC07      WSC07   60
|    C                     CALL 'RES018'
|    C                     PARM SD03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM SD02      S08I2  12        訂單號碼
B2MODC*M001M               PARM SC07      S08I3   80       牌價判斷日
M001MC                     PARM WSC07     S08I3   60       牌價判斷日
|    C                     PARM SD04      S08I4   60       禮盒訂購數量
|    C                     PARM SD05      S08I5   60       禮盒搭贈數量
|    C                     PARM SD06      S08I6   90       禮盒金額
      *部份－單位成本－中間
|    C                     PARM SD10      S08I7   82       禮盒成本FOB
|    C                     PARM SD11      S08I8   82       禮盒成本FHI
|    C                     PARM SD12      S08I9   82       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM SD22      S08IA   82       禮盒轉帳成本FOB
|    C                     PARM SD23      S08IB   82       禮盒轉帳成本FHI
|    C                     PARM SD24      S08IC   82       禮盒轉帳成本DUTY
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN600....WRITE OR UPDATE REWF21
      *==============================================================*
06===C           RTN600    BEGSR
      *
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C                     Z-ADD0         WORK08
|    C                     Z-ADD0         WORK09
|    C                     Z-ADD0         WORK10
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK12
|    C                     Z-ADD0         WORK13
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    46
| 01-C           *IN46     DOWEQ'0'
|   C                     MOVELR181      WF2102
|   C                     MOVELR181      WF2103
      *
B2000C           DATES     IFEQ KEPDAT
      *當日累計數量
|   C                     Z-ADDR182      WORK06
      *當日累計金額
|   C                     Z-ADDR184      WORK07
| 02-C                     END
      *
B2000C           DATEYM    IFEQ KEYYM
|   C           SC13      ANDNE'*'
      *當月累計數量
|   C                     Z-ADDR182      WORK08
      *當月累計金額
|   C                     Z-ADDR184      WORK09
| 03-C                     END
      *
B2000C           DATEYM    IFEQ SCRM1
|   C           SC13      ANDNE'*'
      *上月累計數量
|   C                     Z-ADDR182      WORK10
      *上月累計金額
|   C                     Z-ADDR184      WORK11
| 04-C                     END
      *
B2000C           DATEYM    IFEQ SCRY1
|   C           SC13      ANDNE'*'
      *上年累計數量
|   C                     Z-ADDR182      WORK12
      *上年累計金額
|   C                     Z-ADDR184      WORK13
| 05-C                     END
|   C*TOTAL FOB,FHI,DUTY
|   C           KEYWF     CHAINWF210                40
| 06-C           *IN40     IFEQ '1'                          新增
|   C                     EXSR RTN700
| 06*C                     ELSE                              修改
|   C                     EXSR RTN800
| 06-C                     END
|   C                     READ RE18R                    46
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN700....WRITE OR UPDATE REWF21
      *==============================================================*
07===C           RTN700    BEGSR
      *
|    C                     Z-ADD0         WF2104
|    C                     Z-ADD0         WF2105
|    C                     Z-ADDWORK06    WF2106
|    C                     Z-ADDWORK07    WF2107
|    C                     Z-ADDWORK08    WF2108
|    C                     Z-ADDWORK09    WF2109
|    C                     Z-ADDWORK10    WF2110
|    C                     Z-ADDWORK11    WF2111
|    C                     Z-ADDWORK12    WF2112
|    C                     Z-ADDWORK13    WF2113
|    C                     WRITEWF210
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN800....WRITE OR UPDATE REWF21
      *==============================================================*
08===C           RTN800    BEGSR
|    C*
|    C                     ADD  WORK06    WF2106
|    C                     ADD  WORK07    WF2107
|    C                     ADD  WORK08    WF2108
|    C                     ADD  WORK09    WF2109
|    C                     ADD  WORK10    WF2110
|    C                     ADD  WORK11    WF2111
|    C                     ADD  WORK12    WF2112
|    C                     ADD  WORK13    WF2113
      *
|    C                     UPDATWF210
|    C*
08===C                     ENDSR
