      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR0502                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 81/05/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款作業                                 *
      * REMARK       :試飲分析表                                   *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.11  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREWF20  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSAR050BPO   E             39     PRINTER
     ISD0
     I                                              SD16  L4
     I                                              SD03  L3
     I                                              SC04  L2
     I                                              SC05  L2
     I                                              SD02  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      125 1270$CPY
     I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      598 5990$PRTID
     I                                      601 6060DSC07S
     I                                      607 6120DSC07E
     I                                      620 620 DSEL
     I                                      621 629 DCS01S
     I                                      631 639 DCS01E
     I                                      641 649 DSD03S
     I                                      651 659 DSD03E
     I                                      661 662 DSC01S
     I                                      663 664 DSC01E
     I                                      701 7060DSC39S
     I                                      707 7120DSC39E
M001MI*                                     713 7180DATES
M001MI*                                     719 7240DATEE
M001MI                                      713 7200DATES
M001MI                                      721 7280DATEE
     I                                      750 750 IN20
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           MEKEY     KLIST
     C                     KFLD           SC04
     C                     KFLD           SC05
     C*==============================================================*
     C*                    DEFINE FIELD
     C*==============================================================*
     C           *LIKE     DEFN SC05      BSC05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN000                     *SET INIT
     C*
     C                     MOVE SC05      BSC05
     C*
     C                     EXSR RTN100                     *CHAIN MA0
     C                     EXSR RTN200                     *CHAIN ME0
     C                     EXSR RTN300                     *PROC DATA
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CL3 10                EXSR RTNL3
     CL4 10                EXSR RTNL4
     CLR 10                WRITEPE2
     CLRN10                EXSR NODATA
     C*==============================================================*
     C*          RTN000....SET INIT
     C*==============================================================*
10===C           RTN000    BEGSR
      *
     C           IN20      IFEQ '0'
     C                     SETOF                     20
     C                     ELSE
     C                     SETON                     20
     C                     END
     C*
     C*
     C                     Z-ADD0         AMT1
     C                     Z-ADD0         AMT2
     C                     Z-ADD0         AMT21
     C                     Z-ADD0         AMT22
     C                     Z-ADD0         AMT23
     C                     Z-ADD0         PSUM1
     C                     Z-ADD0         PSUM2
     C                     Z-ADD0         PSUM3
     C                     Z-ADD0         PSUM41
     C                     Z-ADD0         PSUM42
     C                     Z-ADD0         PSUM43
     C                     Z-ADD0         PSUM4
     C                     Z-ADD0         CSUM1
     C                     Z-ADD0         CSUM2
     C                     Z-ADD0         CSUM3
     C                     Z-ADD0         CSUM41
     C                     Z-ADD0         CSUM42
     C                     Z-ADD0         CSUM43
     C                     Z-ADD0         CSUM4
     C                     Z-ADD0         PTSUM1
     C                     Z-ADD0         PTSUM2
     C                     Z-ADD0         PTSUM3
     C                     Z-ADD0         P1SUM4
     C                     Z-ADD0         P2SUM4
     C                     Z-ADD0         P3SUM4
     C                     Z-ADD0         PTSUM4
     C                     Z-ADD0         TSUM1
     C                     Z-ADD0         TSUM2
     C                     Z-ADD0         TSUM3
     C                     Z-ADD0         TSUM41
     C                     Z-ADD0         TSUM42
     C                     Z-ADD0         TSUM43
     C                     Z-ADD0         TSUM4
     C                     Z-ADD0         RANK    60
|    C*
| 01-C           $RMK01    IFEQ 'Y'
|   C                     SETOF                     38
     C                     ELSE
     C                     SETON                     38
| 01-C                     END
     C*
     C                     EXSR RTN900                     *PROC SKIP
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN100....CHAIN MA0
     C*==============================================================*
10===C           RTN100    BEGSR
     C*
     C           SD03      CHAINMA0                  51
     C*
     C           *IN51     IFEQ '1'
     C                     MOVE *BLANK    MA03
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN200....CHAIN ME0
     C*==============================================================*
10===C           RTN200    BEGSR
     C*
     C           MEKEY     CHAINME0                  51
     C*
     C           *IN51     IFEQ '1'
     C                     MOVE *BLANK    ME04
     C                     END
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN300....PROC DATA
     C*==============================================================*
10===C           RTN300    BEGSR
     C*
     C*計算搭贈成本
     C*
     C           SD10      ADD  SD11      AMT1A  112
     C                     ADD  SD12      AMT1A
     C           SD05      MULT AMT1A     AMT1
     C           SD22      ADD  SD23      AMT2A  112
     C                     ADD  SD24      AMT2A
     C           SD05      MULT SD22      AMT21
     C           SD05      MULT SD23      AMT22
     C           SD05      MULT SD24      AMT23
     C           SD05      MULT AMT2A     AMT2
     C*
     C*計算產品小計
     C*
     C                     ADD  SD04      PSUM1
     C                     ADD  SD05      PSUM2
     C                     ADD  AMT1      PSUM3
     C                     ADD  AMT21     PSUM41
     C                     ADD  AMT22     PSUM42
     C                     ADD  AMT23     PSUM43
     C                     ADD  AMT2      PSUM4
     C*
     C*計算客戶小計
     C*
     C                     ADD  SD04      CSUM1
     C                     ADD  SD05      CSUM2
     C                     ADD  AMT1      CSUM3
     C                     ADD  AMT21     CSUM41
     C                     ADD  AMT22     CSUM42
     C                     ADD  AMT23     CSUM43
     C                     ADD  AMT2      CSUM4
     C*計算歸屬合計
     C*
     C                     ADD  SD04      PTSUM1
     C                     ADD  SD05      PTSUM2
     C                     ADD  AMT1      PTSUM3
     C                     ADD  AMT21     P1SUM4
     C                     ADD  AMT22     P2SUM4
     C                     ADD  AMT23     P3SUM4
     C                     ADD  AMT2      PTSUM4
     C*
     C*計算總計
     C*
     C                     ADD  SD04      TSUM1
     C                     ADD  SD05      TSUM2
     C                     ADD  AMT1      TSUM3
     C                     ADD  AMT21     TSUM41
     C                     ADD  AMT22     TSUM42
     C                     ADD  AMT23     TSUM43
     C                     ADD  AMT2      TSUM4
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTNL1.....PROC L1 RTN
     C*==============================================================*
10===C           RTNL1     BEGSR
     C*
     C           BSC05     IFEQ *BLANK
     C                     SETON                     37
     C                     ELSE
     C                     SETOF                     37
     C                     END
     C*
     C                     EXSR RTN900                     *PROC SKIP
     C                     WRITEPD1
     C*
     C                     SETON                     293031
     C                     SETOF                     28
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTNL2.....PROC L2 RTN
     C*==============================================================*
10===C           RTNL2     BEGSR
     C*
     C                     EXSR RTN900                     *PROC SKIP
     C                     WRITEPD2
     C                     SETON                     28
     C*
     C                     Z-ADD0         CSUM1
     C                     Z-ADD0         CSUM2
     C                     Z-ADD0         CSUM3
     C                     Z-ADD0         CSUM41
     C                     Z-ADD0         CSUM42
     C                     Z-ADD0         CSUM43
     C                     Z-ADD0         CSUM4
     C*
     C                     SETOF                     31
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTNL3.....PROC L3 RTN
     C*==============================================================*
10===C           RTNL3     BEGSR
     C*
     C                     EXSR RTN900                     *PROC SKIP
     C                     WRITEPD3
     C*
     C                     Z-ADD0         PSUM1
     C                     Z-ADD0         PSUM2
     C                     Z-ADD0         PSUM3
     C                     Z-ADD0         PSUM41
     C                     Z-ADD0         PSUM42
     C                     Z-ADD0         PSUM43
     C                     Z-ADD0         PSUM4
     C*
     C                     SETOF                     30
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTNL4.....PROC L4 RTN
     C*==============================================================*
10===C           RTNL4     BEGSR
     C*
     C                     EXSR RTN900                     *PROC SKIP
     C                     WRITEPT1
     C*
     C                     Z-ADD0         PTSUM1
     C                     Z-ADD0         PTSUM2
     C                     Z-ADD0         PTSUM3
     C                     Z-ADD0         P1SUM4
     C                     Z-ADD0         P2SUM4
     C                     Z-ADD0         P3SUM4
     C                     Z-ADD0         PTSUM4
     C*
     C                     SETOF                     29
     C*
     C                     ENDSR
     C*==============================================================*
     C*          NODATA....PROC NODATA
     C*==============================================================*
10===C           NODATA    BEGSR
     C*
     C                     EXSR RTN900                     *PROC SKIP
     C                     WRITEPE3
     C*
     C                     ENDSR
     C*==============================================================*
     C*          RTN900....PROC SKIP
     C*==============================================================*
10===C           RTN900    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
      *
     C           IN20      IFEQ '0'
     C                     SETOF                     20
     C                     ELSE
     C                     SETON                     20
     C                     END
      *
|   C                     WRITEPH1
|   C                     SETON                     10
|   C                     SETOF                     39
| 01-C                     END
|    C*
| 02-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 02-C                     END
|    C*
10===C                     ENDSR
