      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0782                                       *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/09/22                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品銷售分析週報表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.14  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREW107  IP  E           K        DISK
     FPA#HPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSAR078P O   E             39     PRINTER
     E*
     IW1070
     I                                              W10701L2
     I                                              W10702L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      600 600 DMD07S
     I                                      601 601 DMD07E
      *類別
     I                                      602 602 DMA11
M001AI                                      611 6160DATES
M001AI                                      621 6260DATEE
     I*產品代號
     I                                      721 729 DMA01S
     I                                      731 739 DMA01E
      *單瓶
     I                                      604 604 DSEL2
      *YY/MM/DD
     I                                      631 6360YMDS
     I                                      641 6460YMDE
     I            DS
     I                                        1   9 W10703
     I            DS
     I                                        1   5 W10709
     I                                        1   1 CHANEL
     I            DS
     I                                        1   9 ITEM
     I                                        7   7 PACK
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#H     KLIST
     C                     KFLD           #H01
     C                     KFLD           #H02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200                                 L
     CL2 10                EXSR RTN300                                 L
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
      *
| 02-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'TEXT
| 02*C                     ELSE
| 03-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'TEXT
| 03*C                     ELSE
| 04-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'TEXT
| 04-C                     END
| 03-C                     END
| 02-C                     END
      *
     C                     SETOF                     31
      *
|    C                     WRITEPH1
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           CHANEL    IFEQ 'A'
|    C           W10709    CHAINME0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   ME04
| 01-C                     END
| 01-C                     ELSE
|   C                     MOVEL'DISTRUBT'#A01
|   C                     MOVEL*BLANK    #A02
|   C                     MOVELCHANEL    #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      ME04
| 01-C                     END
| 01-C                     END
|    C*
| 01-C           W10701    IFNE 'RM'
|   C                     MOVEL'BRAND   '#A01
|   C                     MOVEL*BLANK    #A02
|   C                     MOVELW10701    #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      MA03
| 01-C                     END
| 01-C                     ELSE
|   C                     MOVELW10702    ITEM
|   C                     MOVEL'F'       PACK
|    C           ITEM      CHAINMA0                  40
| 01-C                     END
|    C*
|    C                     MOVELW10701    BRAND   2
|    C*
|    C                     MOVEL'STANDARD'#H01
|    C                     MOVELW10701    #H02
|    C           KEY#H     CHAIN#H0                  40
|    C*
| 02-C           #H03      IFNE 0
|   C*
|   C           W10704    DIV  #H03      F8704     H
|   C           W10705    DIV  #H03      F8705     H
|   C           W10704    ADD  W10705    WORK1  132
|   C           WORK1     DIV  #H03      F0405     H
|   C*
|   C           W10706    DIV  #H03      F8706     H
|   C           W10707    DIV  #H03      F8707     H
|   C           W10706    ADD  W10707    WORK1
|   C           WORK1     DIV  #H03      F0607     H
|   C*
|   C           F8704     SUB  F8706     F8708
|   C           F8705     SUB  F8707     F8709
|   C           F0405     SUB  F0607     F0809
|   C*
|   C   39                EXSR RTN900
     C           F0405     IFNE 0
     C           F0607     ORNE 0
|   C                     WRITEPD1
     C                     END
|   C*以各產品標準箱數之合為各小計
     C                     ADD  F8704     T1TOT1
     C                     ADD  F8705     T1TOT2
     C                     ADD  F0405     T1TOT3
     C                     ADD  F8706     T1TOT4
     C                     ADD  F8707     T1TOT5
     C                     ADD  F0607     T1TOT6
     C                     ADD  F8708     T1TOT7
     C                     ADD  F8709     T1TOT8
     C                     ADD  F0809     T1TOT9
|   C                     Z-ADD0         F8704
|   C                     Z-ADD0         F8705
|   C                     Z-ADD0         F0405
|   C                     Z-ADD0         F8706
|   C                     Z-ADD0         F8707
|   C                     Z-ADD0         F0607
|   C                     Z-ADD0         F8708
|   C                     Z-ADD0         F8709
|   C                     Z-ADD0         F0809
| 02-C                     END
|    C*
     C                     SETON                     31
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....SUBTOT
      *==============================================================*
03===C           RTN200    BEGSR
     C*
     C           BRAND     IFEQ 'RM'
|   C   39                EXSR RTN900
     C*
     C           T1TOT3    IFNE 0
     C           T1TOT6    ORNE 0
|   C                     WRITEPT1
     C                     END
| 01-C                     END
     C*
|   C*以各產品標準箱數之合為各小計
     C                     ADD  T1TOT1    T2TOT1
     C                     ADD  T1TOT2    T2TOT2
     C                     ADD  T1TOT3    T2TOT3
     C                     ADD  T1TOT4    T2TOT4
     C                     ADD  T1TOT5    T2TOT5
     C                     ADD  T1TOT6    T2TOT6
     C                     ADD  T1TOT7    T2TOT7
     C                     ADD  T1TOT8    T2TOT8
     C                     ADD  T1TOT9    T2TOT9
     C*
|   C                     Z-ADD0         T1TOT1
|   C                     Z-ADD0         T1TOT2
|   C                     Z-ADD0         T1TOT3
|   C                     Z-ADD0         T1TOT4
|   C                     Z-ADD0         T1TOT5
|   C                     Z-ADD0         T1TOT6
|   C                     Z-ADD0         T1TOT7
|   C                     Z-ADD0         T1TOT8
|   C                     Z-ADD0         T1TOT9
|    C*
     C                     SETOF                     31
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....SUBTOT
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|   C   39                EXSR RTN900
     C           T2TOT3    IFNE 0
     C           T2TOT6    ORNE 0
|   C                     WRITEPT2
     C                     END
|   C                     ADD  T2TOT1    T3TOT1
|   C                     ADD  T2TOT2    T3TOT2
|   C                     ADD  T2TOT3    T3TOT3
|   C                     ADD  T2TOT4    T3TOT4
|   C                     ADD  T2TOT5    T3TOT5
|   C                     ADD  T2TOT6    T3TOT6
|   C                     ADD  T2TOT7    T3TOT7
|   C                     ADD  T2TOT8    T3TOT8
|   C                     ADD  T2TOT9    T3TOT9
|   C                     Z-ADD0         T2TOT1
|   C                     Z-ADD0         T2TOT2
|   C                     Z-ADD0         T2TOT3
|   C                     Z-ADD0         T2TOT4
|   C                     Z-ADD0         T2TOT5
|   C                     Z-ADD0         T2TOT6
|   C                     Z-ADD0         T2TOT7
|   C                     Z-ADD0         T2TOT8
|   C                     Z-ADD0         T2TOT9
|    C*
     C                     SETOF                     31
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR  ...WRITE PT3   SUBTOTAL
      *==============================================================*
05===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     ELSE
|    C*
|    C*  39                EXSR RTN900
     C           T3TOT3    IFNE 0
     C           T3TOT6    ORNE 0
|    C                     WRITEPT3
| 01-C                     END
| 01-C                     END
|    C                     WRITEPE2
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     3139
|    C*
06===C                     ENDSR
