      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SAR083                                        *
      * AUTHER       : TINA WHANGIA                                  *
      * CREATE DATE  : 82/03/15                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :試飲原因統計表依客戶　　　                   *
      ****************************************************************
     FSAR083D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *辦事處
     I                                      601 601 COMPS
     I                                      602 602 COMPE
      *通路
     I                                      603 603 DSC33S
     I                                      604 604 DSC33E
      *原因
     I                                      605 606 DSC10S
     I                                      607 608 DSC10E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      610 6150YMDS
     I                                      616 6210YMDE
     I                                      622 6270DSC39S
     I                                      628 6330DSC39E
     I                                      640 648 DSD03S
     I                                      650 658 DSD03E
     I                                      660 664 DSC04S
     I                                      670 674 DSC04E
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC10S
|    C                     MOVE *BLANK    DSC10E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK辦事處
| 01-C           COMPS     IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
| 01-C                     END
|    C*
| 01-C           COMPE     IFEQ *BLANKS
|   C                     MOVE *HIVAL    COMPE
| 01-C                     END
|    C*
| 04-C           COMPS     IFGT COMPE
|   C                     SETON                     6061
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*試飲原因
| 02-C           DSC10S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC10S
| 02-C                     END
|    C*
| 03-C           DSC10E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC10E
| 03-C                     END
|    C*
| 04-C           DSC10S    IFGT DSC10E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*通路
| 02-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 02-C                     END
|    C*
| 03-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 03-C                     END
|    C*
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 02-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 02-C                     END
|    C*
| 03-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 03-C                     END
|    C*
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*費用單位
| 02-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 02-C                     END
|    C*
| 03-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 03-C                     END
|    C*
| 04-C           DSC04S    IFGT DSC04E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*CHECK確認日期
| 07-C           DSC39S    IFEQ 0
M001AC                     Z-ADD010192    DSC39S
| 07-C                     END
|    C*
| 08-C           DSC39E    IFEQ 0
M001AC                     Z-ADD123129    DSC39E
| 08-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSC39S    P0901I  60
|    C                     PARM           P0901O  1
|    C*
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     689399
| 05*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           YMDS      PARM           S001O1  60
| 05-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSC39E    P0901I  60
|    C                     PARM           P0901O  1
|    C*
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     699399
| 06*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           YMDE      PARM           S001O1  60
| 06-C                     END
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 07-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*試飲原因
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDEQ35
|   C           D#COL     ANDLE36
|   C                     CALL 'WDS012'
|   C                     PARM 'STOCK   'PARMI1 10
|   C           DSC10S    PARM DSC10S    PARMO1 10
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 7
|   C           D#COL     ANDEQ40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS012'
|   C                     PARM 'STOCK   'PARMI1 10
|   C           DSC10S    PARM DSC10S    PARMO1 10
|   C                     GOTO ENDF4
| 03-C                     END
|   C*通路
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDEQ35
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 9
|   C           D#COL     ANDEQ39
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*產品代號
| 02-C           D#ROW     IFEQ 11
| 03-C           D#COL     IFGE 35
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 47
|   C           D#COL     ANDLE55
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
|   C*費用單位
| 02-C           D#ROW     IFEQ 13
| 03-C           D#COL     IFGE 35
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS036'
|   C                     PARM           DSC04S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 43
|   C           D#COL     ANDLE47
|   C                     CALL 'WDS036'
|   C                     PARM           DSC04E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
| 04-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
