      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0511                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :專櫃達成率分析表                             *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FRES18WF IF  E           K        DISK                           UC
     FMTMAPF  IF  E           K        DISK
     FREWF22  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *YY/MM/DD
B2MODI                                      615 6200WSC39
B2MODI                                      615 6180WSC39Y
B2MODI                                      619 6200WSC39M
B2MODI                                      632 640 DSD03S
B2MODI                                      642 650 DSD03E
B2MODI                                      629 629 DSEL
     I            DS
B2MODI                                        1   80SC39
B2MODI                                        1   60SC39YM
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF2204    WORK04
     C           *LIKE     DEFN WF2205    WORK05
     C           *LIKE     DEFN WF2206    WORK06
     C           *LIKE     DEFN WF2207    WORK07
     C           *LIKE     DEFN WF2208    WORK08
     C           *LIKE     DEFN WF2209    WORK09
     C           *LIKE     DEFN MA41      WAMT
B2000C           *LIKE     DEFN SC08      WSC08
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF2201
     C                     KFLD           WF2202
     C                     KFLD           WF2203
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*分析方式－禮盒(A)
  01-C           DSEL      IFEQ 'A'
    C                     EXSR RTN200
  01-C                     END
     C*
     C*分析方式－單瓶(B)需拆解禮盒為單瓶
  02-C           DSEL      IFEQ 'B'
    C                     EXSR RTN400
  02-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN200....月銷售數量及金額
      *==============================================================*
01===C           RTN200    BEGSR
|    C*
|    C                     READ SC0                      45
| 03-C           *IN45     DOWEQ'0'
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 04-C           *IN46     DOWEQ'0'
| 05-C           SD03      IFGE DSD03S
|   C           SD03      ANDLEDSD03E
|   C                     MOVELSC04      WF2201
|   C                     MOVELSD03      WF2202
|   C                     MOVELSD03      WF2203
|   C           KEYWF     CHAINWF220                40
|   C                     EXSR RTN300
| 05-C                     END
|   C           SC02      READESD0                      46
| 04-C                     END
|   C*
|   C                     READ SC0                      45
| 03-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWF22
      *==============================================================*
02===C           RTN300    BEGSR
|    C*
|    C                     Z-ADD0         WORK04
|    C                     Z-ADD0         WORK05
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C                     Z-ADD0         WORK08
|    C                     Z-ADD0         WORK09
|    C                     Z-ADD0         WORK
|    C                     Z-ADD0         WORK1
|    C*訂購＋搭贈WORK1
|    C           SD04      ADD  SD05      WORK   174
|    C*單位成本WORK1
|    C           SD10      ADD  SD11      WORK1  174
|    C                     ADD  SD12      WORK1
|    C*當月
B2000C           WSC39     IFEQ SC39YM
|   C*累計數量
|   C                     Z-ADDSD04      WORK04
|   C*累計金額
|   C                     Z-ADDSD07      WORK05
|   C           WORK      MULT WORK1     WORK06    H
| 01-C                     END
|    C*年累計
|    C*累計數量
|    C                     Z-ADDSD04      WORK07
|    C*累計金額
|    C                     Z-ADDSD07      WORK08
|    C           WORK      MULT WORK1     WORK09    H
|    C*
| 02-C           *IN40     IFEQ '0'
|   C                     ADD  WORK04    WF2204
|   C                     ADD  WORK05    WF2205
|   C                     ADD  WORK06    WF2206
|   C                     ADD  WORK07    WF2207
|   C                     ADD  WORK08    WF2208
|   C                     ADD  WORK09    WF2209
|   C*
|   C                     UPDATWF220
| 02*C                     ELSE
|   C                     Z-ADDWORK04    WF2204
|   C                     Z-ADDWORK05    WF2205
|   C                     Z-ADDWORK06    WF2206
|   C                     Z-ADDWORK07    WF2207
|   C                     Z-ADDWORK08    WF2208
|   C                     Z-ADDWORK09    WF2209
|   C                     WRITEWF220
| 02-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN400....禮盒單瓶售價計算數量及金額
      *==============================================================*
03===C           RTN400    BEGSR
|    C*
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
B2CHKC           SC08      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2000C                     Z-ADDSC08      WSC08
| 02*C                     ELSE
B2000C                     Z-ADDSC07      WSC08
| 02-C                     END
|   C*
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 03-C           *IN46     DOWEQ'0'
| 04-C           SD03      IFGE DSD03S
|   C           SD03      ANDLEDSD03E
|   C           SD03      CHAINMA0                  40
|   C*禮盒碼
| 05-C           MA54      IFEQ 'Y'
|   C*禮盒單瓶售價
|   C                     EXSR RTN500
|   C                     OPEN RES18WF
|   C                     EXSR RTN600
|   C                     CLOSERES18WF
|   C*ELSE非禮盒處理同禮盒處禮DSEL='A'
| 05*C                     ELSE
|   C                     MOVELSC04      WF2201
|   C                     MOVELSD03      WF2202
|   C                     MOVELSD03      WF2203
|   C           KEYWF     CHAINWF220                40
|   C                     EXSR RTN300
|   C*
| 05-C                     END
| 04-C                     END
|   C*
|   C           SC02      READESD0                      46
| 03-C                     END
|   C*
|   C                     READ SC0                      45
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN500....禮盒單瓶售價
      *==============================================================*
04===C           RTN500    BEGSR
      *禮盒拆解為產品
|    C                     CALL 'RES018'
|    C                     PARM SD03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM SD02      S08I2  12        訂單號碼
B2MODC                     PARM SC07      S08I3   80       牌價判斷日
|    C                     PARM SD04      S08I4   60       禮盒訂購數量
|    C                     PARM SD05      S08I5   60       禮盒搭贈數量
|    C                     PARM SD06      S08I6   92       禮盒金額
      *部份－單位成本－中間
|    C                     PARM SD10      S08I7   92       禮盒成本FOB
|    C                     PARM SD11      S08I8   92       禮盒成本FHI
|    C                     PARM SD12      S08I9   92       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM SD22      S08IA   92       禮盒轉帳成本FOB
|    C                     PARM SD23      S08IB   92       禮盒轉帳成本FHI
|    C                     PARM SD24      S08IC   92       禮盒轉帳成本DUTY
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN600....WRITE OR UPDATE REWF93
      *==============================================================*
06===C           RTN600    BEGSR
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    46
| 01-C           *IN46     DOWEQ'0'
|    C*
|   C                     MOVELSC04      WF2201
|    C                     MOVELR181      WF2202
|    C                     MOVELR181      WF2203
|   C*TOTAL FOB,FHI,DUTY
     C*
|   C           KEYWF     CHAINWF220                40
     C                     EXSR RTN700
     C*
|   C                     READ RE18R                    46
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN700....WRITE OR UPDATE REWF22
      *==============================================================*
06===C           RTN700    BEGSR
|    C*
|    C                     Z-ADD0         WORK04
|    C                     Z-ADD0         WORK05
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C                     Z-ADD0         WORK08
|    C                     Z-ADD0         WORK09
|    C                     Z-ADD0         WORK
|    C                     Z-ADD0         WORK1
|    C*訂購＋搭贈WORK1
|    C           R182      ADD  R183      WORK   174
|    C*單位成本WORK1
|    C           R185      ADD  R186      WORK1
|    C                     ADD  R187      WORK1
|    C*                    ADD  R188      WORK1
|    C*                    ADD  R189      WORK1
|    C*                    ADD  R18A      WORK1
|    C*當月
B2000C           WSC39     IFEQ SC39YM
|   C*累計數量
|   C                     Z-ADDR182      WORK04
|   C*累計金額
|   C                     Z-ADDR183      WORK05
|   C           WORK      MULT WORK1     WORK06    H
| 02-C                     END
|    C*年累計
|    C*累計數量
|    C                     Z-ADDR182      WORK07
|    C*累計金額
|    C                     Z-ADDR184      WORK08
|    C           WORK      MULT WORK1     WORK09    H
|    C*
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  WORK04    WF2204
|   C                     ADD  WORK05    WF2205
|   C                     ADD  WORK06    WF2206
|   C                     ADD  WORK07    WF2207
|   C                     ADD  WORK08    WF2208
|   C                     ADD  WORK09    WF2209
|   C*
|   C                     UPDATWF220
| 03*C                     ELSE
|   C                     Z-ADDWORK04    WF2204
|   C                     Z-ADDWORK05    WF2205
|   C                     Z-ADDWORK06    WF2206
|   C                     Z-ADDWORK07    WF2207
|   C                     Z-ADDWORK08    WF2208
|   C                     Z-ADDWORK09    WF2209
|   C                     WRITEWF220
| 03-C                     END
|    C*
06===C                     ENDSR
