      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR058                                        *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :通路地區達成率分析表                         *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.12  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSAR058D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *MM/DD/YY
     I                                      605 6100DSC39
      *YY/MM/DD
     I*                                     611 6160WSC39
     I*                                     611 6120WSC39Y
     I*                                     613 6140WSC39M
M001MI                                      711 7180WSC39
M001MI                                      711 7140WSC39Y
M001MI                                      715 7160WSC39M
      *
     I                                      617 617 DSEL
      *螢幕本年月
     I*M001M                                618 6210SCRYM
M001MI                                      721 7260SCRYM
      *螢幕上年
     I*M001M                                622 6250SCRY1
M001MI                                      727 7320SCRY1
      *螢幕上月
     I*M001M                                626 6290SCRM1
     I*M001M                                626 6270SCRYY
     I*M001M                                628 6290SCRMM
M001MI                                      733 7380SCRM1
M001MI                                      733 7360SCRYY
M001MI                                      737 7380SCRMM
M001MI*                                     630 6350KEYDAT
M001MI                                      628 6350KEYDAT
     I                                      636 637 DSC34S
     I                                      638 639 DSC34E
     I                                      640 641 DSC31S
     I                                      642 643 DSC31E
     I                                      701 7060DSC08
     I                                      750 750 IN20
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     Z-ADD0         DSC08
|    C                     Z-ADD0         DSC39
|    C                     Z-ADD0         WSC39
M001AC                     Z-ADD0         W6      60
|    C                     MOVE 'A'       DSEL
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *
|    C*通路
| 01-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 01-C                     END
|    C*
| 02-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 02-C                     END
|    C*
| 03-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*型態
| 04-C           DSC34S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC34S
| 04-C                     END
|    C*
| 05-C           DSC34E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC34E
| 05-C                     END
|    C*
| 06-C           DSC34S    IFGT DSC34E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C*地區
| 07-C           DSC31S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC31S
| 07-C                     END
|    C*
| 08-C           DSC31E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC31E
| 08-C                     END
|    C*
| 09-C           DSC31S    IFGT DSC31E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 09-C                     END
|    C   99                GOTO END100
|    C*送貨日期或確認日期只輸入一項
| 10-C           DSC08     IFNE 0
|   C           DSC39     ANDNE0
|   C                     SETON                     668999
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 11-C           DSC39     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC39     P0901I  60
|   C                     PARM           P0911O  1
| 12-C           P0911O    IFEQ 'N'
|   C                     SETON                     669399
| 12-C                     END
|   C   99                GOTO END100
|   C*
|   C*(CHANGE TO CHINESE DATE)
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39     S001I2  60
|   C*M001M     WSC39     PARM           S001OI  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WSC39
|   C                     MOVEL'1'       IN20
| 11*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC08     P0901I  60
|   C                     PARM           P0911O  1
| 13-C           P0911O    IFEQ 'N'
|   C                     SETON                     689399
| 13-C                     END
|   C   99                GOTO END100
|   C*
|   C*(CHANGE TO CHINESE DATE)
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08     S001I2  60
|   C*M001M     WSC39     PARM           S001OI  60
M001MC           W6        PARM           S001OI  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WSC39
|   C                     MOVEL'0'       IN20
| 11-C                     END
|    C                     Z-ADDWSC39     KEYDAT
      *螢幕年月
|    C                     MOVELWSC39     SCRYM
      *螢幕去年同月
|    C                     MOVELWSC39     SCRY1
|    C                     SUB  100       SCRY1
      *螢幕上月
|    C                     MOVELWSC39     SCRM1
|    C                     SUB  1         SCRM1
| 14-C           SCRMM     IFEQ 0
|   C                     SUB  1         SCRYY
|   C                     Z-ADD12        SCRMM
| 14-C                     END
      *３月前資料為前一年度
| 15-C           WSC39M    IFLE 3
|   C                     SUB  1         WSC39Y
| 15-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 8
| 03-C           D#COL     IFGE 40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 45
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 6
| 06-C           D#COL     IFEQ 40
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFEQ 45
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
| 08-C           D#ROW     IFEQ 7
| 09-C           D#COL     IFGE 40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33S  1
|   C                     PARM           DSC34S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 45
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33E  1
|   C                     PARM           DSC34E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*
| 11-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 01-C                     END
|    C                     SETON                     99
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
