      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
      *                                                              *
      * PROGRAM NAME : SAR075                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 84/05/17                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :客戶產品銷售管理追蹤表　　　                 *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.12  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSAR075D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSAR075Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *辦事處
     I                                      600 600 COMP
     I                                      601 601 COMPS
     I                                      602 602 COMPE
      *通路
     I                                      603 603 DSC33S
     I                                      604 604 DSC33E
      *型態
     I                                      607 608 DSC34S
     I                                      609 610 DSC34E
      *客戶代號
     I                                      611 615 DSC04S
     I                                      616 620 DSC04E
      *產品組別
     I                                      621 621 DMA11
     I                                      622 622 DMA11S
     I                                      623 623 DMA11E
      *產品代號
     I                                      630 638 DSD03S
     I                                      640 648 DSD03E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      650 6550YMDS
M001AI                                      771 7780YMD8S
     I                                      650 6510YS
     I                                      650 6530YMS
     I                                      652 6530MS
     I                                      652 6550MDS
     I                                      656 6610YMDE
M001AI                                      781 7880YMD8E
     I                                      656 6570YE
     I                                      656 6590YME
     I                                      658 6610MDE
     I                                      662 6670DSC08S
     I                                      668 6730DSC08E
     I                                      674 6790DSC39S
     I                                      680 6850DSC39E
     I                                      686 689 DSC28S
     I                                      691 694 DSC28E
     I                                      700 700 DSEL
     I                                      701 701 IN20
     I*去年同期
M001MI*                                     711 7160LYMDS
M001MI*                                     711 7120LYS
M001MI*                                     713 7160LMDS
M001MI*                                     721 7260LYMDE
M001MI*                                     721 7220LYE
M001MI*                                     723 7260LMDE
M001MI                                      711 7180LYMDS
M001MI                                      711 7140LYS
M001MI                                      715 7180LMDS
M001MI                                      721 7280LYMDE
M001MI                                      721 7240LYE
M001MI                                      725 7280LMDE
     I*上月
M001MI*                                     731 7360AYMDS
M001MI*                                     731 7340AYMS
M001MI*                                     731 7320AYS
M001MI*                                     733 7340AMS
M001MI*                                     735 7360ADS
M001MI*                                     741 7460AYMDE
M001MI*                                     741 7440AYME
M001MI*                                     741 7420AYE
M001MI*                                     743 7440AME
M001MI*                                     745 7460ADE
M001MI                                      731 7380AYMDS
M001MI                                      731 7360AYMS
M001MI                                      731 7340AYS
M001MI                                      735 7360AMS
M001MI                                      737 7380ADS
M001MI                                      741 7480AYMDE
M001MI                                      741 7460AYME
M001MI                                      741 7440AYE
M001MI                                      745 7460AME
M001MI                                      747 7480ADE
     I*YTD
M001MI*                                     751 7560TYMDS
M001MI*                                     751 7520TYS
M001MI*                                     753 7540TMS
M001MI*                                     753 7560TMDS
M001MI*                                     761 7660TYMDE
M001MI                                      751 7580TYMDS
M001MI                                      751 7540TYS
M001MI                                      755 7560TMS
M001MI                                      755 7580TMDS
M001MI                                      761 7680TYMDE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*          KEY#A     KLIST
     C*                    KFLD           #A01
     C*                    KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C           *IN05     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  04-C           *IN99     IFEQ '0'
    C                     EXSR RTN200                                 ?
  04-C                     END
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
| 05-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C           AUT       ANDNE'DER'
|   C                     SETON                     31
| 05-C                     END
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DSC28S
|    C                     MOVE *BLANK    DSC28E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         LYMDS
|    C                     Z-ADD0         LYMDE
|    C                     Z-ADD0         AYMS
|    C                     Z-ADD0         AYME
|    C                     Z-ADD0         TYMDS
|    C                     Z-ADD0         TYMDE
|    C                     MOVE 'A'       DSEL
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C*通路
| 02-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 02-C                     END
      *
| 03-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 03-C                     END
      *
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     60
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*型態
| 05-C           DSC34S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC34S
| 05-C                     END
      *
| 06-C           DSC34E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC34E
| 06-C                     END
|    C*
| 07-C           DSC34S    IFGT DSC34E
|   C                     SETON                     61
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*客戶代號
| 08-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 08-C                     END
|    C*
| 09-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 09-C                     END
|    C*
| 10-C           DSC04S    IFGT DSC04E
|   C                     SETON                     62
|   C                     SETON                     9299
| 10-C                     END
|    C   99                GOTO END100
|    C* CHK部門組別
| 01-C           DSC28S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC28S
| 01-C                     END
|    C*
| 02-C           DSC28E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC28E
| 02-C                     END
|    C*
| 03-C           DSC28S    IFGT DSC28E
|   C                     SETON                     67
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C* CHK組別
| 11-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
| 11*C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 11-C                     END
|    C*產品
| 12-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 12-C                     END
|    C*
| 13-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 13-C                     END
|    C*
| 14-C           DSD03S    IFGT DSD03E
|   C                     SETON                     64
|   C                     SETON                     9299
| 14-C                     END
|    C   99                GOTO END100
|    C*送貨日期或確認日期只輸入一項
| 15-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 16-C           DSC39S    IFNE 0
|   C                     SETON                     668999
| 16-C                     END
| 17-C           DSC39E    IFNE 0
|   C                     SETON                     668999
| 17-C                     END
| 15-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 18-C           DSC08S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 19-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 19-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 20-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 20-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08S    S001I2  60
|   C           YMDS      PARM           S001O1  60
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08E    S001I2  60
|   C           YMDE      PARM           S001O1  60
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|   C**
| 21-C*M001M     YMDS      IFGT YMDE
M001MC           YMD8S     IFGT YMD8E
|   C                     SETON                     65
|   C                     SETON                     9299
| 21-C                     END
|   C   99                GOTO END100
|   C*本期不可跨月
| 22-C*          YMS       IFNE YME
|   C*                    SETON                     65
|   C*                    SETON                     8899
| 22-C*                    END
|   C*  99                GOTO END100
|   C                     MOVEL'0'       IN20
| 18*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 23-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 23-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 24-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 24-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           YMDS      PARM           S001O1  60
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           YMDE      PARM           S001O1  60
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|   C**
| 25-C*M001M     YMDS      IFGT YMDE
M001MC           YMD8S     IFGT YMD8E
|   C                     SETON                     66
|   C                     SETON                     9299
| 25-C                     END
|   C   99                GOTO END100
|   C*本期不可跨月
| 26-C*          YMS       IFNE YME
|   C*                    SETON                     66
|   C*                    SETON                     8899
| 26-C*                    END
|   C*  99                GOTO END100
|   C                     MOVEL'1'       IN20
| 18-C                     END
      *SCREEN LOG
|    C                     OPEN SAR075Z
|    C                     WRITEPH1
|    C                     CLOSESAR075Z
      *
02===C           END100    ENDSR
      *===============================================================*
      *          RTN200....GET DATE
      *===============================================================*
03===C           RTN200    BEGSR
|    C**
|    C** 去年同期
|    C**
|    C*M001M     YS        SUB  1         LYS
M001AC                     MOVE YS        HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4      40
M001AC           W4        SUB  1         LYS
|    C*M001M     YE        SUB  1         LYE
M001AC                     MOVE YE        HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4      40
M001AC           W4        SUB  1         LYE
|    C                     Z-ADDMDS       LMDS
|    C                     Z-ADDMDE       LMDE
|    C**
|    C** 上月
|    C**
|    C                     Z-ADDYMS       AYMS
| 01-C           MS        IFEQ 1
|   C*M001M     YS        SUB  1         AYS
M001AC                     MOVE YS        HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4      40
M001AC           W4        SUB  1         AYS
|   C                     Z-ADD12        AMS
| 01*C                     ELSE
|   C                     SUB  1         AYMS
| 01-C                     END
|    C                     Z-ADDAYMS      AYME
|    C                     Z-ADD01        ADS
|    C                     Z-ADD31        ADE
|    C*YTD
|    C                     Z-ADDYMDS      TYMDS
|    C                     Z-ADDYMDE      TYMDE
|    C                     Z-ADD401       TMDS
| 02-C           MS        IFLT 4
|   C*M001M     YS        SUB  1         TYS
M001AC                     MOVE YS        HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4      40
M001AC           W4        SUB  1         TYS
| 02-C                     END
|    C*
03===C           END200    ENDSR
     C*
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
04===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C*  GET ROW,COL
|    C*
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C*
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*通路
| 03-C           D#ROW     IFEQ 5
|   C           D#COL     ANDEQ38
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 5
|   C           D#COL     ANDEQ50
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*型態
| 05-C           D#ROW     IFEQ 6
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33   1
|   C           DSC34S    PARM DSC34S    PSC34   2
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 50
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33
|   C           DSC34E    PARM DSC34E    PSC34
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*客戶代號
| 08-C           D#ROW     IFEQ 7
| 09-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 50
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*組別
| 02-C           D#ROW     IFEQ 8
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*產品
| 11-C           D#ROW     IFEQ 10
| 12-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 12-C                     END
| 13-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 13-C                     END
| 11-C                     END
|   C*
| 14-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 14-C                     END
      *
|   C*
| 01-C                     END
|    C*
04===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
05===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
05===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
