      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SAR064                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/12/14                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :客戶往來產品表                               *
      ****************************************************************
     FSAR064D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*辦事處，通路，型態，業務員，客戶，產品
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      603 603 COMP
     I                                      611 611 DSC33S
     I                                      612 612 DSC33E
     I                                      613 614 DSC34S
     I                                      615 616 DSC34E
     I                                      621 629 DSC45S
     I                                      631 639 DSC45E
     I                                      641 649 DSD03S
     I                                      651 659 DSD03E
     I                                      700 705 DSC27S
     I                                      706 711 DSC27E
     I*(MM/DD/YY)
     I                                      661 6660DSC08S
     I                                      671 6760DSC08E
     I*(YY/MM/DD)
     I                                      681 6860YSC08S
     I                                      691 6960YSC08E
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE ' '       COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC27S
|    C                     MOVE *BLANK    DSC27E
|    C                     MOVE *BLANK    DSC45S
|    C                     MOVE *BLANK    DSC45E
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DSD03E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK通路
| 02-C           DSC33S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC33S
| 02-C                     END
|    C*
| 03-C           DSC33E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC33E
| 03-C                     END
|    C*
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C* CHK型態
| 05-C           DSC34S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC34S
| 05-C                     END
|    C*
| 06-C           DSC34E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC34E
| 06-C                     END
|    C*
| 07-C           DSC34S    IFGT DSC34E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK業務員
| 08-C           DSC27S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC27S
| 08-C                     END
|    C*
| 09-C           DSC27E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC27E
| 09-C                     END
|    C*
| 10-C           DSC27S    IFGT DSC27E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK客戶代號
| 11-C           DSC45S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC45S
| 11-C                     END
|    C*
| 12-C           DSC45E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC45E
| 12-C                     END
|    C*
| 13-C           DSC45S    IFGT DSC45E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK產品代號
| 14-C           DSD03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSD03S
| 14-C                     END
|    C*
| 15-C           DSD03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSD03E
| 15-C                     END
|    C*
| 16-C           DSD03S    IFGT DSD03E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 16-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK送貨日期
| 17-C           DSC08S    IFEQ 0
M001DC*                    Z-ADD010101    DSC08S
M001AC                     Z-ADD010192    DSC08S
| 17*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 18-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 18-C                     END
| 17-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC08S    S001I2  60
|    C           YSC08S    PARM           S001O1  60
|    C*
| 19-C           DSC08E    IFEQ 0
M001DC*                    Z-ADD123199    DSC08E
M001AC                     Z-ADD123129    DSC08E
| 19*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 20-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
| 20-C                     END
| 19-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC08E    S001I2  60
|    C           YSC08E    PARM           S001O1  60
|    C*
M001AC                     MOVE YSC08S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
M001AC                     MOVE YSC08E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YSC08S    IFGT YSC08E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     707192
|   C                     SETON                     99
|   C                     GOTO END100
| 21-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 43
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 8
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33S  1
|   C                     PARM           DSC34S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33E  1
|   C                     PARM           DSC34E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*業務員
| 08-C           D#ROW     IFEQ 10
| 09-C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS005'
|   C                     PARM           DSC27S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 47
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS005'
|   C                     PARM           DSC27E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*客戶代號
| 11-C           D#ROW     IFEQ 11
| 12-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45S
|   C                     GOTO ENDF4
| 12-C                     END
|   C*
| 13-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45E
|   C                     GOTO ENDF4
| 13-C                     END
|   C*
| 11-C                     END
|   C*產品代號
| 14-C           D#ROW     IFEQ 12
| 15-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 15-C                     END
|   C*
| 16-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 16-C                     END
|   C*
| 14-C                     END
|   C*
| 17-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 17-C                     END
|   C*
| 01-C                     END
|    C*
|    C           ENDF4     TAG
|    C*
03===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
