      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0611                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :產品標準箱數彙總表                           *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FSOSGPF  IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FSOSNPF  IF  E           K        DISK
     FSOSOPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FRES18WF IF  E           K        DISK                           UC
     FREWF45  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *產品
     I                                      601 609 DSD03S
     I                                      610 618 DSD03E
     I                                      648 648 DSEL
     I                                      720 720 DSEL2
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I            DS
     I                                        1   2 SC01
     I                                        1   1 SC01L
     I            DS
     I                                        1   2 SG01
     I                                        1   1 SG01L
     I            DS
     I                                        1   2 SO01
     I                                        1   1 SO01L
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11A
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF4502    WORK01
     C           *LIKE     DEFN WF4502    WORK02
     C           *LIKE     DEFN WF4502    WORK03
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF4504
     C                     KFLD           WF4505
     C                     KFLD           WF4501
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *銷售
     C                     READ SC0                      45
  01-C           *IN45     DOWEQ'0'
    C           SC02      SETLLSD0
    C           SC02      READESD0                      46
  02-C           *IN46     DOWEQ'0'
      *國別碼
    C                     SETOF                     40
  03-C           DSEL      IFEQ 'F'
    C           SD03      CHAINMA0                  40
  04-C           *IN40     IFEQ '0'
    C           SC01L     ANDEQ'C'
    C           SD16      ANDEQ'C'
    C                     SETON                     40
  04-C                     END
  03-C                     END
      *
  05-C           MA11A     IFGE DMA11S
    C           MA11A     ANDLEDMA11E
      *
  06-C           SD03      IFGE DSD03S
    C           SD03      ANDLEDSD03E
    C           *IN40     ANDLE'0'
    C*不拆
  07-C           DSEL2     IFEQ 'A'
    C                     MOVELSD03      WF4504
    C                     MOVELSD03      WF4505
    C                     MOVELSD03      WF4501
    C           KEYWF     CHAINWF450                40
    C                     EXSR RTN100
      *分析方式－單瓶(B)需拆解禮盒為單瓶
  07*C                     ELSE
    C                     EXSR RTN10X
  07-C                     END
  06-C                     END
  05-C                     END
      *
    C           SC02      READESD0                      46
  02-C                     END
      *
    C                     READ SC0                      45
  01-C                     END
     C*---------------------------------------------------------------
      *銷退
     C                     READ SG0                      45
  08-C           *IN45     DOWEQ'0'
    C           SG02      SETLLSH0
    C           SG02      READESH0                      46
  09-C           *IN46     DOWEQ'0'
      *
      *國別碼
    C                     SETOF                     40
  10-C           DSEL      IFEQ 'F'
    C           SH03      CHAINMA0                  40
  11-C           *IN40     IFEQ '0'
    C           SG01L     ANDEQ'C'
    C           SH11      ANDEQ'C'
    C                     SETON                     40
  11-C                     END
  10-C                     END
      *
  12-C           MA11A     IFGE DMA11S
    C           MA11A     ANDLEDMA11E
      *
  13-C           SH03      IFGE DSD03S
    C           SH03      ANDLEDSD03E
    C           *IN40     ANDLE'0'
    C*不拆
  14-C           DSEL2     IFEQ 'A'
    C                     MOVELSH03      WF4504
    C                     MOVELSH03      WF4505
    C                     MOVELSH03      WF4501
    C           KEYWF     CHAINWF450                40
    C                     EXSR RTN200
      *分析方式－單瓶(B)需拆解禮盒為單瓶
  14*C                     ELSE
    C                     EXSR RTN20X
  14-C                     END
  13-C                     END
  12-C                     END
      *
    C           SG02      READESH0                      46
  09-C                     END
      *
    C                     READ SG0                      45
  08-C                     END
     C*
     C*---------------------------------------------------------------
      *試飲退回
     C                     READ SN0                      45
  15-C           *IN45     DOWEQ'0'
    C           SN02      SETLLSO0
    C           SN02      READESO0                      46
  16-C           *IN46     DOWEQ'0'
      *
      *國別碼
    C                     SETOF                     40
  17-C           DSEL      IFEQ 'F'
    C           SO03      CHAINMA0                  40
  18-C           *IN40     IFEQ '0'
    C           SO01L     ANDEQ'C'
    C           SO11      ANDEQ'C'
    C                     SETON                     40
  18-C                     END
  17-C                     END
      *
  19-C           MA11A     IFGE DMA11S
    C           MA11A     ANDLEDMA11E
      *
  20-C           SO03      IFGE DSD03S
    C           SO03      ANDLEDSD03E
    C           *IN40     ANDLE'0'
    C*不拆
  21-C           DSEL2     IFEQ 'A'
    C                     MOVELSO03      WF4504
    C                     MOVELSO03      WF4505
    C                     MOVELSO03      WF4501
    C           KEYWF     CHAINWF450                40
    C                     EXSR RTN300
      *分析方式－單瓶(B)需拆解禮盒為單瓶
  21*C                     ELSE
    C                     EXSR RTN30X
  21-C                     END
  20-C                     END
  19-C                     END
      *
    C           SN02      READESO0                      46
  16-C                     END
      *
    C                     READ SN0                      45
  15-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN010....INITIAL
      *==============================================================*
01===C           RTN010    BEGSR
|    C                     Z-ADD0         WF4502
|    C                     Z-ADD0         W4502A
|    C                     Z-ADD0         W4502B
|    C                     Z-ADD0         WF4503
|    C                     Z-ADD0         W4503A
|    C                     Z-ADD0         W4503B
01===C                     ENDSR
      *==============================================================*
      *          RTN100....WRITE OR UPDATE REWF45
      *==============================================================*
02===C           RTN100    BEGSR
      *
|    C                     Z-ADD0         WORK01
|    C                     Z-ADD0         WORK02
|    C                     Z-ADD0         WORK03
      *
| 01-C           SC03      IFEQ 'S4'
|   C                     Z-ADDSD04      WORK03
| 01*C                     ELSE
|   C                     Z-ADDSD04      WORK01
| 01-C                     END
|    C                     Z-ADDSD05      WORK02
      *
| 02-C           *IN40     IFEQ '0'
|   C                     ADD  WORK01    WF4502
|   C                     ADD  WORK02    W4502A
|   C                     ADD  WORK03    W4502B
      *
|   C                     UPDATWF450
| 02*C                     ELSE
|   C                     EXSR RTN010
|   C                     Z-ADDWORK01    WF4502
|   C                     Z-ADDWORK02    W4502A
|   C                     Z-ADDWORK03    W4502B
| 03-C           WF4502    IFNE 0
|   C           W4502A    ORNE 0
|   C           W4502B    ORNE 0
|   C                     WRITEWF450
| 03-C                     END
|   C*
| 02-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN10X....禮盒單瓶售價計算數量及金額
      *==============================================================*
03===C           RTN10X    BEGSR
      *禮盒碼
|    C           SD03      CHAINMA0                  45
| 01-C           MA54      IFEQ 'Y'
|   C                     EXSR RTN10Y
|   C                     OPEN RES18WF
|   C                     EXSR RTN10Z
|   C                     CLOSERES18WF
      *ELSE非禮盒處理同禮盒處禮DSEL2='A'
| 01*C                     ELSE
|   C                     MOVELSD03      WF4504
|   C                     MOVELSD03      WF4505
|   C                     MOVELSD03      WF4501
|   C           KEYWF     CHAINWF450                40
|   C                     EXSR RTN100
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN10Y....禮盒單瓶成本
      *==============================================================*
04===C           RTN10Y    BEGSR
      *禮盒拆解為產品
M001AC                     Z-ADDSC07      XSC07   60       牌價判斷日
|    C                     CALL 'RES018'
|    C                     PARM SD03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM SD02      S08I2  12        訂單號碼
M001DC*                    PARM SC07      S08I3   80       牌價判斷日
M001AC                     PARM XSC07     S08I3   60       牌價判斷日
|    C                     PARM SD04      S08I4   60       禮盒訂購數量
|    C                     PARM SD05      S08I5   60       禮盒搭贈數量
|    C                     PARM SD06      S08I6   90       禮盒金額
      *部份－單位成本－中間
|    C                     PARM 0         S08I7   82       禮盒成本FOB
|    C                     PARM 0         S08I8   82       禮盒成本FHI
|    C                     PARM 0         S08I9   82       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM 0         S08IA   82       禮盒轉帳成本FOB
|    C                     PARM 0         S08IB   82       禮盒轉帳成本FHI
|    C                     PARM 0         S08IC   82       禮盒轉帳成本DUTY
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN10Z....WRITE OR UPDATE REWF45
      *==============================================================*
05===C           RTN10Z    BEGSR
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    47
| 01-C           *IN47     DOWEQ'0'
|   C                     MOVELR181      WF4504
|   C                     MOVELR181      WF4505
|   C                     MOVELR181      WF4501
|   C                     Z-ADDR182      SD04
|   C                     Z-ADDR183      SD05
|   C                     Z-ADDR184      SD07
|   C           KEYWF     CHAINWF450                40
|   C                     EXSR RTN100
|   C                     READ RE18R                    47
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE OR UPDATE REWF45
      *==============================================================*
06===C           RTN200    BEGSR
      *
|    C                     Z-ADD0         WORK01
|    C                     Z-ADD0         WORK02
      *
|    C                     Z-ADDSH12      WORK01
|    C                     Z-ADDSH13      WORK02
      *
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  WORK01    WF4503
|   C                     ADD  WORK02    W4503A
      *
|   C                     UPDATWF450
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     Z-ADDWORK01    WF4503
|   C                     Z-ADDWORK02    W4503A
| 02-C           WF4503    IFNE 0
|   C           W4503A    ORNE 0
|   C                     WRITEWF450
| 02-C                     END
|   C*
| 01-C                     END
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN20X....禮盒單瓶售價計算數量及金額
      *==============================================================*
07===C           RTN20X    BEGSR
      *禮盒碼
|    C           SH03      CHAINMA0                  45
| 01-C           MA54      IFEQ 'Y'
|   C                     EXSR RTN20Y
|   C                     OPEN RES18WF
|   C                     EXSR RTN20Z
|   C                     CLOSERES18WF
      *ELSE非禮盒處理同禮盒處禮DSEL2='A'
| 01*C                     ELSE
|   C                     MOVELSH03      WF4504
|   C                     MOVELSH03      WF4505
|   C                     MOVELSH03      WF4501
|   C           KEYWF     CHAINWF450                40
|   C                     EXSR RTN200
| 01-C                     END
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN20Y....禮盒單瓶成本
      *==============================================================*
08===C           RTN20Y    BEGSR
|    C*GET 單價
| 01-C           SH12      IFNE 0
|   C           SH07      DIV  SH12      FIELD   50
| 01-C                     END
      *禮盒拆解為產品
M001AC                     Z-ADDSG06      XSC06   60       牌價判斷日
|    C                     CALL 'RES018'
|    C                     PARM SH03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM *BLANKS   S08I2  12        訂單號碼
M001DC*                    PARM SG06      S08I3   80       牌價判斷日
M001AC                     PARM XSC06     S08I3   60       牌價判斷日
|    C                     PARM SH12      S08I4   60       禮盒訂購數量
|    C                     PARM SH13      S08I5   60       禮盒搭贈數量
|    C                     PARM FIELD     S08I6   90       禮盒金額
      *部份－單位成本－中間
|    C                     PARM 0         S08I7   82       禮盒成本FOB
|    C                     PARM 0         S08I8   82       禮盒成本FHI
|    C                     PARM 0         S08I9   82       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM 0         S08IA   82       禮盒轉帳成本FOB
|    C                     PARM 0         S08IB   82       禮盒轉帳成本FHI
|    C                     PARM 0         S08IC   82       禮盒轉帳成本DUTY
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN20Z....WRITE OR UPDATE REWF45
      *==============================================================*
09===C           RTN20Z    BEGSR
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    47
| 01-C           *IN47     DOWEQ'0'
|   C                     MOVELR181      WF4504
|   C                     MOVELR181      WF4505
|   C                     MOVELR181      WF4501
|   C                     Z-ADDR182      SH12
|   C                     Z-ADDR183      SH13
|   C                     Z-ADDR184      SH07
|   C           KEYWF     CHAINWF450                40
|   C                     EXSR RTN200
|   C                     READ RE18R                    47
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWF45
      *==============================================================*
10===C           RTN300    BEGSR
      *
|    C                     Z-ADD0         WORK01
|    C                     Z-ADDSO05      WORK01
      *
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  WORK01    W4503B
|   C                     UPDATWF450
| 01*C                     ELSE
|   C                     EXSR RTN010
|   C                     Z-ADDWORK01    W4503B
| 02-C           W4503B    IFNE 0
|   C                     WRITEWF450
| 02-C                     END
|   C*
| 01-C                     END
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN30X....禮盒單瓶售價計算數量及金額
      *==============================================================*
11===C           RTN30X    BEGSR
      *禮盒碼
|    C           SO03      CHAINMA0                  45
| 01-C           MA54      IFEQ 'Y'
|   C                     EXSR RTN30Y
|   C                     OPEN RES18WF
|   C                     EXSR RTN30Z
|   C                     CLOSERES18WF
      *ELSE非禮盒處理同禮盒處禮DSEL2='A'
| 01*C                     ELSE
|   C                     MOVELSO03      WF4504
|   C                     MOVELSO03      WF4505
|   C                     MOVELSO03      WF4501
|   C           KEYWF     CHAINWF450                40
|   C                     EXSR RTN300
| 01-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN30Y....禮盒單瓶成本
      *==============================================================*
12===C           RTN30Y    BEGSR
      *禮盒拆解為產品
|    C                     CALL 'RES018'
|    C                     PARM SO03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM *BLANKS   S08I2  12        訂單號碼
M001DC*                    PARM 0         S08I3   80       牌價判斷日
M001AC                     PARM 0         S08I3   60       牌價判斷日
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|    C                     PARM SO05      S08I4   60       禮盒訂購數量
|    C                     PARM 0         S08I5   60       禮盒搭贈數量
|    C                     PARM 0         S08I6   90       禮盒金額
      *部份－單位成本－中間
|    C                     PARM 0         S08I7   82       禮盒成本FOB
|    C                     PARM 0         S08I8   82       禮盒成本FHI
|    C                     PARM 0         S08I9   82       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM 0         S08IA   82       禮盒轉帳成本FOB
|    C                     PARM 0         S08IB   82       禮盒轉帳成本FHI
|    C                     PARM 0         S08IC   82       禮盒轉帳成本DUTY
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN30Z....WRITE OR UPDATE REWF45
      *==============================================================*
13===C           RTN30Z    BEGSR
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    47
| 01-C           *IN47     DOWEQ'0'
|   C                     MOVELR181      WF4504
|   C                     MOVELR181      WF4505
|   C                     MOVELR181      WF4501
|   C                     Z-ADDR182      SO05
|   C           KEYWF     CHAINWF450                40
|   C                     EXSR RTN300
|   C                     READ RE18R                    47
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
13===C                     ENDSR
