      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR082                                        *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 00/01/06                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :產品銷售分析週報－國外                       *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*           |          |
     A*---------------------------------------------------------------
      ****************************************************************
     FSAR082D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSAR082Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *公司
     I                                      601 601 DMA07
      *類別
     I*                                     602 602 DMA11S
      *試飲
     I                                      603 603 DSEL1
      *單瓶
     I                                      604 604 DSEL2
      *專櫃
     I                                      605 605 DSEL3
     I*結束類別
     I*                                     606 606 DMA11E
      *當期
      *MM/DD/YY
     I                                      611 6160DATES
     I                                      611 612 MMS
     I                                      613 614 DDS
     I                                      615 616 YYS
     I                                      621 6260DATEE
     I                                      621 622 MME
     I                                      623 624 DDE
     I                                      625 626 YYE
      *YY/MM/DD
     I                                      631 6360YMDS
     I                                      631 6340YM
     I                                      641 6460YMDE
     I                                      651 6560F01S
     I                                      651 6540F01YM
     I                                      661 6660F01E
     I                                      671 6760F02S
     I                                      681 6860F02E
     I                                      691 6960F03S
     I                                      701 7060F03E
     I*預算年度
     I                                      707 7100F04S
     I                                      711 7140F04E
     I*
     I*                                     721 729 DMA01S
     I*                                     731 739 DMA01E
     I                                      751 7560D01S
     I                                      751 752 D01SM
     I                                      753 754 D01SD
     I                                      755 756 D01SY
     I                                      761 7660D01E
     I                                      761 762 D01EM
     I                                      765 766 D01EY
     I                                      771 7760D02S
     I                                      771 7720D02SM
     I                                      771 774 D02SMD
     I                                      773 774 D02SD
     I                                      775 7760D02SY
     I                                      781 7860D02E
     I                                      781 7820D02EM
     I                                      781 7840D02EMD
     I                                      785 7860D02EY
     I                                      783 7840D02ED
     I                                      791 7960D03S
     I                                      791 7920D03SM
     I                                      793 7940D03SD
     I                                      791 7940D03SMD
     I                                      795 7960D03SY
     I                                      801 8060D03E
     I                                      801 8020D03EM
     I                                      803 8040D03ED
     I                                      801 8040D03EMD
     I                                      805 8060D03EY
     I                                      807 8100D04S
     I                                      807 8080D04SM
     I                                      809 8100D04SY
     I                                      811 8140D04E
     I                                      811 8120D04EM
     I                                      813 8140D04EY
     I*(YYYY/MM/DD)
     I                                      850 857 YMD8S
     I                                      858 865 YMD8E
     I                                      866 873 YF01S
     I                                      874 881 YF01E
     I                                      882 889 YF02S
     I                                      882 8870YF2SYM
     I                                      884 8850YF2SYY
     I                                      886 8870YF2SMM
     I                                      890 897 YF02E
     I                                      890 8930YF02EY
     I                                      894 8950YF02EM
     I                                      890 8950YF2EYM
     I                                      898 905 YF03S
     I                                      906 913 YF03E
     I                                      940 945 YF04S
     I                                      940 9430YF04SY
     I                                      944 9450YF04SM
     I                                      950 955 YF04E
     I                                      952 9530YF4EYY
     I                                      950 9530YF04EY
     I                                      954 9550YF04EM
     I                                      960 9650ENDYM
     I                                      960 9630ENDYY
     I                                      964 9650ENDMM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
|   C           *IN05     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
     C                     MOVEL$USER     AUT     3
     C           AUT       IFNE 'D91'
|    C                     SETON                     31
     C                     END
|    C                     MOVE *BLANK    DMA07
|    C*                    MOVE *BLANK    DMA11S
|    C*                    MOVE *BLANK    DMA11E
|    C*                    MOVE *BLANK    DMA01S
|    C*                    MOVE *BLANK    DMA01E
|    C                     MOVE 'N'       DSEL1
|    C                     MOVE 'B'       DSEL2
|    C                     MOVE 'A'       DSEL3
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         D01S
|    C                     Z-ADD0         D01E
|    C                     Z-ADD0         D02S
|    C                     Z-ADD0         D02E
|    C                     Z-ADD0         D03S
|    C                     Z-ADD0         D03E
|    C                     Z-ADD0         D04S
|    C                     Z-ADD0         D04E
|    C                     Z-ADD0         F01S
|    C                     Z-ADD0         F01E
|    C                     Z-ADD0         F02S
|    C                     Z-ADD0         F02E
|    C                     Z-ADD0         F03S
|    C                     Z-ADD0         F03E
|    C                     Z-ADD0         F04S
|    C                     Z-ADD0         F04E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           DMA07     IFEQ *BLANK
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C*
| 02-C*          DMA11S    IFEQ *BLANK
     C*                    MOVE ' '       DMA11S
     C*                    MOVE '9'       DMA11E
     C*                    ELSE
     C*                    MOVE DMA11S    DMA11E
| 02-C*                    END
|    C*
|    C*產品代號
| 03-C*          DMA01S    IFEQ *BLANK
|   C*                    MOVE *LOVAL    DMA01S
| 03-C*                    END
|    C*
| 04-C*          DMA01E    IFEQ *BLANK
|   C*                    MOVE *ALL'9'   DMA01E
| 04-C*                    END
|    C*
| 05-C*          DMA01S    IFGT DMA01E
|   C*                    SETON                     6667
|   C*                    SETON                     9299
| 05-C*                    END
|    C*  99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 06-C           DATES     IFEQ 0
|   C                     SETON                     629599
| 06-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           DATEE     IFEQ 0
|   C                     SETON                     639599
| 07-C                     END
|    C   99                GOTO END100
|    C*日期區間不可跨月
| 08-C           MMS       IFNE MME
|   C           YYS       ORNE YYE
|   C                     SETON                     6263
|   C                     SETON                     8699
| 08-C                     END
|    C* CHK
| 09-C           DATES     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DATES     P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 11-C           DATEE     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DATEE     P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATES     S001I2  60
|    C           YMDS      PARM           S001O1  60
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATEE     S001I2  60
|    C           YMDE      PARM           S001O1  60
|    C**
     C                     MOVE YMDS      HB2@F6  6
     C                     EXSR HB@68L
     C                     MOVE HB2@T8    YMD8S
     C                     MOVE YMDE      HB2@F6  6
     C                     EXSR HB@68L
     C                     MOVE HB2@T8    YMD8E
     C           YMD8S     IFGT YMD8E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
      *
|    C*當月起訖D01S,D01E
| 14-C           D01S      IFEQ 0
|   C                     MOVELMMS       D01SM
|   C                     MOVEL'01'      D01SD
|   C                     MOVELYYS       D01SY
| 14-C                     END
|    C*
| 15-C           D01E      IFEQ 0
|   C                     Z-ADDDATEE     D01E
| 15-C                     END
|    C*起始日須為每月之第一日
| 16-C           D01SD     IFNE '01'
|   C                     SETON                     688899
| 16-C                     END
|    C   99                GOTO END100
|    C*月份須相同
| 17-C           D01SY     IFNE D01EY
|   C           D01SM     ORNE D01EM
|   C                     SETON                     6869
|   C                     SETON                     8699
| 17-C                     END
|    C   99                GOTO END100
      *
|    C* CHK
| 09-C           D01S      IFNE 0
|   C                     CALL 'P09'
|   C                     PARM D01S      P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     689399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 11-C           D01E      IFNE 0
|   C                     CALL 'P09'
|   C                     PARM D01E      P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     699399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D01S      S001I2  60
|    C           F01S      PARM           S001O1  60
     C                     MOVE F01S      HB2@F6  6
     C                     EXSR HB@68L
     C                     MOVE HB2@T8    YF01S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D01E      S001I2  60
|    C           F01E      PARM           S001O1  60
     C                     MOVE F01E      HB2@F6  6
     C                     EXSR HB@68L
     C                     MOVE HB2@T8    YF01E
|    C*
     C           YF01S     IFGT YF01E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 18-C                     END
|    C   99                GOTO END100
     C*
     C           YM        IFNE F01YM
     C                     SETON                     626386
     C                     SETON                     686999
     C                     END
|    C   99                GOTO END100
     C*
      *
|    C*當年起訖D02S,D02E
| 19-C           D02S      IFEQ 0
|   C                     MOVEL'0701'    D02SMD           期間起始月
|   C                     MOVELYYS       D02SY
| 20-C           MMS       IFLT '07'
     C                     MOVE D02SY     HB2@YY  2
     C                     EXSR HB@24Y
     C                     MOVE HB2@Y4    W4      40
     C           W4        SUB  1         W2      20
     C                     MOVELW2        D02SY
| 20-C                     END
| 19-C                     END
| 21-C           D02E      IFEQ 0
|   C                     Z-ADDDATEE     D02E
| 21-C                     END
|    C*
|    C*起始日須為每月之第一日
| 22-C           D02SD     IFNE '01'
|   C                     SETON                     708899
| 22-C                     END
|    C   99                GOTO END100
|    C* CHK
| 09-C           D02S      IFNE 0
|   C                     CALL 'P09'
|   C                     PARM D02S      P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 11-C           D02E      IFNE 0
|   C                     CALL 'P09'
|   C                     PARM D02E      P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
      *
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D02S      S001I2  60
|    C           F02S      PARM           S001O1  60
     C                     MOVE F02S      HB2@F6  6
     C                     EXSR HB@68L
     C                     MOVE HB2@T8    YF02S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D02E      S001I2  60
|    C           F02E      PARM           S001O1  60
     C                     MOVE F02E      HB2@F6  6
     C                     EXSR HB@68L
     C                     MOVE HB2@T8    YF02E
     C*
     C           YF02EM    SUB  1         WMM     20
     C           WMM       IFLT 1
     C                     Z-ADD12        ENDMM
     C           YF02EY    SUB  1         ENDYY
     C                     ELSE
     C                     MOVELYF02EY    ENDYY
     C                     MOVELWMM       ENDMM
     C                     END
     C*
     C           YF02S     IFGT YF02E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 23-C                     END
|    C   99                GOTO END100
|    C*
|    C*去年起訖D03S,D03E
| 24-C           D03S      IFEQ 0
     C                     MOVE D02SY     HB2@YY  2
     C                     EXSR HB@24Y
     C                     MOVE HB2@Y4    D02SYX  40
|   C           D02SYX    SUB  1         D03SY
|   C                     MOVELD02SMD    D03SMD
| 24-C                     END
| 25-C           D03E      IFEQ 0
     C                     MOVE D02EY     HB2@YY  2
     C                     EXSR HB@24Y
     C                     MOVE HB2@Y4    D02EYX  40
|   C           D02EYX    SUB  1         D03EY
|   C                     Z-ADDD02EMD    D03EMD
| 25-C                     END
     C*
|    C                     MOVE D03SMD    F03S
|    C                     MOVELD03SY     F03S
|    C                     MOVE D03EMD    F03E
|    C                     MOVELD03EY     F03E
     C*
     C                     MOVE F03S      HB2@F6  6
     C                     EXSR HB@68L
     C                     MOVE HB2@T8    YF03S
     C                     MOVE F03E      HB2@F6  6
     C                     EXSR HB@68L
     C                     MOVE HB2@T8    YF03E
     C*
     C           YF03S     IFGT YF03E
|   C                     SETON                     7273
|   C                     SETON                     9299
| 23-C                     END
|    C   99                GOTO END100
|    C*
|    C*預算年月起訖D04S,D04E
| 24-C           D04S      IFEQ 0
     C                     MOVELYF2SYM    YF04S
     C                     MOVE YF2SYY    D04S
     C                     MOVELYF2SMM    D04S
     C                     ELSE
     C                     MOVE D04SY     HB2@YY  2
     C                     EXSR HB@24Y
     C                     MOVE HB2@Y4    D04SYX  40
     C                     MOVELD04SYX    YF04S
     C                     MOVE D04SM     YF04S
| 24-C                     END
| 25-C           D04E      IFEQ 0
     C*
     C* 預算迄止年月＝起始年月＋１２
     C*
     C           YF04SM    ADD  11        W04SM   30
     C           W04SM     SUB  12        W04SM
     C           YF04SY    ADD  1         YF04EY
     C                     Z-ADDW04SM     YF04EM
     C           W04SM     IFLT 1
     C                     Z-ADD12        YF04EM
     C           YF04SY    SUB  1         YF04EY
     C                     END
     C                     MOVELYF04EM    D04E
     C                     MOVE YF4EYY    D04E
     C                     ELSE
     C                     MOVE D04EY     HB2@YY  2
     C                     EXSR HB@24Y
     C                     MOVE HB2@Y4    D04EYX  40
     C                     MOVELD04EYX    YF04E
     C                     MOVE D04EM     YF04E
| 25-C                     END
|    C*
     C           YF04S     IFGT YF04E
|   C                     SETON                     7475
|   C                     SETON                     9299
| 23-C                     END
|    C   99                GOTO END100
|    C*
| 27-C           DSEL1     IFEQ *BLANK
|   C                     SETON                     799599
| 27-C                     END
|    C   99                GOTO END100
|    C*
| 28-C           DSEL2     IFEQ *BLANK
|   C                     SETON                     659599
| 28-C                     END
|    C   99                GOTO END100
      *SCREEN LOG
     C           *IN05     IFNE '1'
     C                     OPEN SAR082Z
     C                     WRITEPH1
     C                     CLOSESAR082Z
     C                     END
      *
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*產品代號
| 02-C*          D#ROW     IFEQ 6
| 03-C*          D#COL     IFGE 38
|   C*          D#COL     ANDLE46
|   C*                    CALL 'WDS001'
|   C*                    PARM           DMA01S
|   C*                    GOTO ENDF4
| 03-C*                    END
|   C*
| 04-C*          D#COL     IFGE 50
|   C*          D#COL     ANDLE58
|   C*                    CALL 'WDS001'
|   C*                    PARM           DMA01E
|   C*                    GOTO ENDF4
| 04-C*                    END
| 02-C*                    END
|   C*
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
