      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0821                                       *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 00/01/11                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :通路產品銷售週報－國外                       *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*           |          |
     A*---------------------------------------------------------------
      ****************************************************************
     FMTMALF1 IF  E           K        DISK
     FSOSCLF5 IF  E           K        DISK
     FSOSGLF3 IF  E           K        DISK
     FSOSNLF2 IF  E           K        DISK
     FSOSWPF  IF  E           K        DISK
     FREWFC6  UF  E           K        DISK                      A
     FRES18WF IF  E           K        DISK                           UC
     E*
     E*預算金額
     E                    WSW1       13 13 2
     E*---------------------------------------------------------------*
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *公司
     I                                      601 601 DMA07
      *類別
     I*                                     602 602 DMA11S
      *試飲
     I                                      603 603 DSEL1
      *單瓶
     I                                      604 604 DSEL2
      *專櫃
     I                                      605 605 DSEL3
     I*結束類別
     I*                                     606 606 DMA11E
      *當期
      *MM/DD/YY
     I                                      611 6160DATES
     I                                      611 612 MMS
     I                                      613 6140DDS
     I                                      615 616 YYS
     I                                      621 6260DATEE
     I                                      621 622 MME
     I                                      623 6240DDE
     I                                      625 626 YYE
      *YY/MM/DD
     I                                      631 6360YMDS
     I                                      631 6340YM
     I                                      641 6460YMDE
     I                                      651 6560F01S
     I                                      651 6540F01YM
     I                                      661 6660F01E
     I                                      671 6760F02S
     I                                      681 6860F02E
     I                                      691 6960F03S
     I                                      701 7060F03E
     I*預算年度
     I                                      707 7100F04S
     I                                      711 7140F04E
     I*
     I*                                     721 729 DMA01S
     I*                                     731 739 DMA01E
     I                                      751 7560D01S
     I                                      751 752 D01SM
     I                                      753 754 D01SD
     I                                      755 756 D01SY
     I                                      761 7660D01E
     I                                      761 762 D01EM
     I                                      765 766 D01EY
     I                                      771 7760D02S
     I                                      771 7720D02SM
     I                                      771 774 D02SMD
     I                                      773 774 D02SD
     I                                      775 7760D02SY
     I                                      781 7860D02E
     I                                      781 7820D02EM
     I                                      781 7840D02EMD
     I                                      785 7860D02EY
     I                                      783 7840D02ED
     I                                      791 7960D03S
     I                                      791 7920D03SM
     I                                      793 7940D03SD
     I                                      791 7940D03SMD
     I                                      795 7960D03SY
     I                                      801 8060D03E
     I                                      801 8020D03EM
     I                                      803 8040D03ED
     I                                      801 8040D03EMD
     I                                      805 8060D03EY
     I                                      807 8100D04S
     I                                      811 8140D04E
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I                                      850 8530BUDYY
     I                                      854 8550BUDMM
     I                                      858 8650YMD8E
     I                                      866 8730YF01S
     I                                      874 8810YF01E
     I                                      882 8890YF02S
     I                                      882 8850STRYY
     I                                      886 8870STRMM
     I                                      890 8970YF02E
     I                                      898 9050YF03S
     I                                      906 9130YF03E
     I                                      940 9450YF04S
     I                                      940 9430YF4SYY
     I                                      944 9450YF4SMM
     I                                      950 9550YF04E
     I                                      950 9530YF4EYY
     I                                      954 9550YF4EMM
     I                                      960 9650ENDYM
     I                                      960 9630ENDYY
     I                                      964 9650ENDMM
     I*           DS
     I*                                       1   2 MA11
     I*                                       1   1 MA11L
     I            DS
     I                                        1   9 SD03
     I                                        3   4 SD03A
     I            DS
     I                                        1   9 SH03
     I                                        3   4 SH03A
     I            DS
     I                                        1   9 SO03
     I                                        3   4 SO03A
     I            DS
     I                                        1   9 R181
     I                                        3   4 R181A
     I            DS
     I                                        1 169 WSW1
     I                                        1  132SW11
     I                                       14  262SW12
     I                                       27  392SW13
     I                                       40  522SW14
     I                                       53  652SW15
     I                                       66  782SW16
     I                                       79  912SW17
     I                                       92 1042SW18
     I                                      105 1172SW19
     I                                      118 1302SW20
     I                                      131 1432SW21
     I                                      144 1562SW22
     I                                      157 1692SW23
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WFC610    WORK01
     C           *LIKE     DEFN WFC610    WORK02
     C                     Z-ADD0         RATE    10
     C                     Z-ADD0         I       20
     C                     Z-ADD0         J       20
     C                     Z-ADD0         K       20
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WFC600
     C                     KFLD           WFC601
     C                     KFLD           WFC602
     C                     KFLD           WFC603
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN10A                     *SOSCPF
     C                     EXSR RTN20A                     *SOSGPF
  01-C           DSEL1     IFEQ 'Y'
    C                     EXSR RTN30A                     *SOSNPF
  01-C                     END
     C                     EXSR RTN40A                     *SOSWPF
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN10A    SOSCPF
      *==============================================================*
01===C           RTN10A    BEGSR
|    C*
|    C                     READ SC0                      46
| 02-C           *IN46     DOWEQ'0'
| 03-C           DSEL3     IFEQ 'A'
|   C           DSEL3     OREQ 'B'
|   C           SC04      ANDNE'B0000'
|   C*不拆
| 04-C           MA54      IFNE 'Y'
|   C           MA54      OREQ 'Y'
|   C           DSEL2     ANDEQ'A'
|   C                     MOVELMA08      WFC600
|   C                     MOVELMA08      WFC601
|   C                     MOVELMA10      WFC602
|   C                     MOVELMA09      WFC603
|   C                     MOVELSD03      WMA01   9
|   C                     EXSR RTN10B
      *分析方式－單瓶(B)需拆解禮盒為單瓶
| 04*C                     ELSE
|   C                     EXSR RTN10X
| 04-C                     END
| 03-C                     END
      *
|   C                     READ SC0                      46
| 02-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN10B    PEROID JUDGE
      *==============================================================*
02===C           RTN10B    BEGSR
|    C*
B2000C           SC39      IFGE YMD8S
|   C           SC39      ANDLEYMD8E
|   C                     EXSR RTN100
| 01-C                     END
|    C*當月內
B2000C           SC39      IFGE YF01S
|   C           SC39      ANDLEYF01E
|   C                     EXSR RTN110
| 02-C                     END
|    C*當年內
B2000C           SC39      IFGE YF02S
|   C           SC39      ANDLEYF02E
|   C                     EXSR RTN120
| 03-C                     END
|    C*
|    C*去年
B2000C           SC39      IFGE YF03S
|   C           SC39      ANDLEYF03E
|   C                     EXSR RTN130
| 03-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN10C....GET LITER
      *==============================================================*
03===C           RTN10C    BEGSR
|    C*GET單位容積
|    C           WMA01     CHAINMA0L                 49
|    C*容積數
|    C           SD04      MULT MA15L     WORK01
|    C           SD05      MULT MA15L     WORK02
     C           WORK01    ADD  WORK02    ACT    132
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN100....WRITE OR UPDATE REWFC6
      *==============================================================*
04===C           RTN100    BEGSR
|    C*
|    C                     EXSR RTN10C
|    C*
|    C           KEYWF     CHAINWFC60                40
|    C*當期
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  ACT       WFC612
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADDACT       WFC612
|   C                     Z-ADD0         WFC610
|   C                     Z-ADD0         WFC611
|   C                     Z-ADD0         WFC613
| 02-C           WFC612    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
|   C*
| 01-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN110....WRITE OR UPDATE REWFC6
      *==============================================================*
05===C           RTN110    BEGSR
|    C*當月
|    C                     EXSR RTN10C
|    C*
|    C           KEYWF     CHAINWFC60                40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  ACT       WFC613
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADD0         WFC610
|   C                     Z-ADD0         WFC611
|   C                     Z-ADD0         WFC612
|   C                     Z-ADDACT       WFC613
| 02-C           WFC613    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
| 01-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN120....WRITE OR UPDATE REWFC6
      *==============================================================*
06===C           RTN120    BEGSR
|    C*當年
|    C                     EXSR RTN10C
|    C*
|    C           KEYWF     CHAINWFC60                40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  ACT       WFC611
|   C*
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADD0         WFC610
|   C                     Z-ADD0         WFC612
|   C                     Z-ADD0         WFC613
|   C                     Z-ADDACT       WFC611
| 02-C           WFC611    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
|   C*
| 01-C                     END
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN130....WRITE OR UPDATE REWFC6
      *==============================================================*
06===C           RTN130    BEGSR
|    C*去年
|    C                     EXSR RTN10C
|    C*
|    C           KEYWF     CHAINWFC60                40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  ACT       WFC610
|   C*
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADD0         WFC611
|   C                     Z-ADD0         WFC612
|   C                     Z-ADD0         WFC613
|   C                     Z-ADDACT       WFC610
| 02-C           WFC610    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
|   C*
| 01-C                     END
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN10X....禮盒單瓶售價計算數量及金額
      *==============================================================*
07===C           RTN10X    BEGSR
      *禮盒碼
|    C                     EXSR RTN10Y
|    C                     OPEN RES18WF
|    C                     EXSR RTN10Z
|    C                     CLOSERES18WF
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN10Y....禮盒單瓶成本
      *==============================================================*
08===C           RTN10Y    BEGSR
      *禮盒拆解為產品
     C                     Z-ADDSD04      XSD04   60       禮盒訂購數量
     C                     Z-ADDSD05      XSD05   60       禮盒搭贈數量
|    C                     CALL 'RES018'
|    C                     PARM SD03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM SD02      S08I2  12        訂單號碼
|    C                     PARM 0         S08I3   60       牌價判斷日
|    C                     PARM XSD04     S08I4   60       禮盒訂購數量
|    C                     PARM XSD05     S08I5   60       禮盒搭贈數量
|    C                     PARM 0         S08I6   90       禮盒金額
      *部份－單位成本－中間
|    C                     PARM 0         S08I7   82       禮盒成本FOB
|    C                     PARM 0         S08I8   82       禮盒成本FHI
|    C                     PARM 0         S08I9   82       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM 0         S08IA   82       禮盒轉帳成本FOB
|    C                     PARM 0         S08IB   82       禮盒轉帳成本FHI
|    C                     PARM 0         S08IC   82       禮盒轉帳成本DUTY
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN10Z....WRITE OR UPDATE REWFC6
      *==============================================================*
09===C           RTN10Z    BEGSR
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    47
| 01-C           *IN47     DOWEQ'0'
     C           R181      CHAINMA0L                 40
     C           *IN40     IFEQ '0'
     C                     MOVELMA08      WFC600
     C                     MOVELMA08      WFC601
     C                     MOVELMA10      WFC602
     C                     MOVELMA09      WFC603
     C                     MOVELR181      WMA01
     C                     ELSE
     C                     MOVE *BLANKS   WFC600
     C                     MOVE *BLANKS   WFC601
     C                     MOVE *BLANKS   WFC602
     C                     MOVE *BLANKS   WFC603
     C                     MOVE *BLANKS   WMA01
     C                     END
|   C                     Z-ADDR182      SD04
|   C                     Z-ADDR183      SD05
|   C                     EXSR RTN10B
|   C                     READ RE18R                    47
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN20A    SOSGPF
      *==============================================================*
10===C           RTN20A    BEGSR
|    C*銷退
|    C                     READ SG0                      46
| 01-C           *IN46     DOWEQ'0'
| 03-C           DSEL3     IFEQ 'A'
|   C           DSEL3     OREQ 'B'
|   C           SG04      ANDNE'B0000'
|   C*不拆
| 02-C           MA54      IFNE 'Y'
|   C           MA54      OREQ 'Y'
|   C           DSEL2     ANDEQ'A'
|   C                     MOVELMA08      WFC600
|   C                     MOVELMA08      WFC601
|   C                     MOVELMA10      WFC602
|   C                     MOVELMA09      WFC603
|   C                     MOVELSH03      WMA01
|   C                     EXSR RTN20B
      *分析方式－單瓶(B)需拆解禮盒為單瓶
| 02*C                     ELSE
|   C                     EXSR RTN20X
| 02-C                     END
| 02-C                     END
|   C*
|   C                     READ SG0                      46
| 01-C                     END
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN20B    SOSNPF
      *==============================================================*
11===C           RTN20B    BEGSR
|    C*當期
B2000C           SG26      IFGE YMD8S
|   C           SG26      ANDLEYMD8E
|   C                     EXSR RTN200
| 01-C                     END
|    C*當月內
B2000C           SG26      IFGE YF01S
|   C           SG26      ANDLEYF01E
|   C                     EXSR RTN210
| 02-C                     END
|    C*當年內
     C           SG26      IFGE YF02S
     C           SG26      ANDLEYF02E
|   C                     EXSR RTN220
| 03-C                     END
|    C*去年
     C           SG26      IFGE YF03S
     C           SG26      ANDLEYF03E
|   C                     EXSR RTN230
| 03-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN20C....GET LITER
      *==============================================================*
12===C           RTN20C    BEGSR
|    C*容積
|    C           WMA01     CHAINMA0L                 49
|    C*
|    C           SH12      MULT MA15L     WORK01
|    C           SH13      MULT MA15L     WORK02
     C           WORK01    ADD  WORK02    ACT    132
12===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE OR UPDATE REWFC6
      *==============================================================*
13===C           RTN200    BEGSR
|    C*銷退
|    C                     EXSR RTN20C
|    C*
|    C           KEYWF     CHAINWFC60                40
|    C*當期
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  ACT       WFC612
|   C*
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-SUBACT       WFC612
|   C                     Z-ADD0         WFC610
|   C                     Z-ADD0         WFC611
|   C                     Z-ADD0         WFC613
| 02-C           WFC612    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
| 01-C                     END
|    C*
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN210....WRITE OR UPDATE REWFC6
      *==============================================================*
14===C           RTN210    BEGSR
|    C*
|    C                     EXSR RTN20C
|    C*
|    C           KEYWF     CHAINWFC60                40
|    C*當月
| 02-C           *IN40     IFEQ '0'
|   C                     SUB  ACT       WFC613
|   C                     UPDATWFC60
| 02*C                     ELSE
|   C                     Z-ADD0         WFC610
|   C                     Z-ADD0         WFC611
|   C                     Z-ADD0         WFC612
|   C                     Z-SUBACT       WFC613
| 03-C           WFC613    IFNE 0
|   C                     WRITEWFC60
| 03-C                     END
|   C*
| 02-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN220....WRITE OR UPDATE REWFC6
      *==============================================================*
15===C           RTN220    BEGSR
|    C*
|    C                     EXSR RTN20C
|    C*
|    C           KEYWF     CHAINWFC60                40
|    C*當年
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  ACT       WFC611
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADD0         WFC610
|   C                     Z-ADD0         WFC612
|   C                     Z-ADD0         WFC613
|   C                     Z-SUBACT       WFC611
| 02-C           WFC611    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN230....WRITE OR UPDATE REWFC6
      *==============================================================*
15===C           RTN230    BEGSR
|    C*
|    C                     EXSR RTN20C
|    C*
|    C           KEYWF     CHAINWFC60                40
|    C*去年
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  ACT       WFC610
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADD0         WFC611
|   C                     Z-ADD0         WFC612
|   C                     Z-ADD0         WFC613
|   C                     Z-SUBACT       WFC610
| 02-C           WFC610    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN20X....禮盒單瓶售價計算數量及金額
      *==============================================================*
16===C           RTN20X    BEGSR
      *禮盒碼
|    C                     EXSR RTN20Y
|    C                     OPEN RES18WF
|    C                     EXSR RTN20Z
|    C                     CLOSERES18WF
|    C*
16===C                     ENDSR
      *==============================================================*
      *          RTN20Y....禮盒單瓶成本
      *==============================================================*
17===C           RTN20Y    BEGSR
      *禮盒拆解為產品
     C                     Z-ADDSH12      XSH12   60       禮盒訂購數量
     C                     Z-ADDSH13      XSH13   60       禮盒搭贈數量
|    C                     CALL 'RES018'
|    C                     PARM SH03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM SG02      S08I2  12        訂單號碼
|    C                     PARM 0         S08I3   60       牌價判斷日
|    C                     PARM SH12      S08I4   60       禮盒訂購數量
|    C                     PARM SH13      S08I5   60       禮盒搭贈數量
|    C                     PARM 0         S08I6   90       禮盒金額
      *部份－單位成本－中間
|    C                     PARM 0         S08I7   82       禮盒成本FOB
|    C                     PARM 0         S08I8   82       禮盒成本FHI
|    C                     PARM 0         S08I9   82       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM 0         S08IA   82       禮盒轉帳成本FOB
|    C                     PARM 0         S08IB   82       禮盒轉帳成本FHI
|    C                     PARM 0         S08IC   82       禮盒轉帳成本DUTY
|    C*
17===C                     ENDSR
      *==============================================================*
      *          RTN20Z....WRITE OR UPDATE REWF69
      *==============================================================*
18===C           RTN20Z    BEGSR
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    47
| 01-C           *IN47     DOWEQ'0'
     C           R181      CHAINMA0L                 40
     C           *IN40     IFEQ '0'
     C                     MOVELMA08      WFC600
     C                     MOVELMA08      WFC601
     C                     MOVELMA10      WFC602
     C                     MOVELMA09      WFC603
     C                     MOVELR181      WMA01
     C                     ELSE
     C                     MOVE *BLANKS   WFC600
     C                     MOVE *BLANKS   WFC601
     C                     MOVE *BLANKS   WFC602
     C                     MOVE *BLANKS   WFC603
     C                     MOVE *BLANKS   WMA01
     C                     END
|   C                     Z-ADDR182      SH12
|   C                     Z-ADDR183      SH13
|   C                     EXSR RTN20B
|   C                     READ RE18R                    47
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
18===C                     ENDSR
      *==============================================================*
      *          RTN30A    SOSNPF
      *==============================================================*
19===C           RTN30A    BEGSR
|    C*試飲收回
|    C                     READ SN0                      46
| 01-C           *IN46     DOWEQ'0'
| 03-C           DSEL3     IFEQ 'A'
|   C           DSEL3     OREQ 'B'
|   C           SN03      ANDNE'B0000'
|   C*不拆
| 02-C           MA54      IFNE 'Y'
|   C           MA54      OREQ 'Y'
|   C           DSEL2     ANDEQ'A'
     C                     MOVELMA08      WFC600
|   C                     MOVELMA08      WFC601
|   C                     MOVELMA10      WFC602
|   C                     MOVELMA09      WFC603
|   C                     MOVELSO03      WMA01
|   C                     EXSR RTN30B
      *分析方式－單瓶(B)需拆解禮盒為單瓶
| 02*C                     ELSE
|   C                     EXSR RTN30X
| 02-C                     END
| 02-C                     END
|   C                     READ SN0                      46
| 01-C                     END
|    C*
19===C                     ENDSR
      *==============================================================*
      *          RTN30B    PERIOD JUDGE
      *==============================================================*
20===C           RTN30B    BEGSR
|    C*當期內
B2000C           SN06      IFGE YMD8S
|   C           SN06      ANDLEYMD8E
|   C                     EXSR RTN300
| 01-C                     END
|    C*當月內
B2000C           SN06      IFGE YF01S
|   C           SN06      ANDLEYF01E
|   C                     EXSR RTN310
| 02-C                     END
|    C*
|    C*當年內
     C           SN06      IFGE YF02S
     C           SN06      ANDLEYF02E
|   C                     EXSR RTN320
| 03-C                     END
|    C*去年內
     C           SN06      IFGE YF03S
     C           SN06      ANDLEYF03E
|   C                     EXSR RTN330
| 03-C                     END
|    C*
20===C                     ENDSR
      *==============================================================*
      *          RTN30C....GET LITER
      *==============================================================*
21===C           RTN30C    BEGSR
|    C*收回
|    C           WMA01     CHAINMA0L                 49
|    C*
|    C           SO05      MULT MA15L     WORK01
     C                     Z-ADDWORK01    ACT
|    C*
21===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWFC6
      *==============================================================*
22===C           RTN300    BEGSR
|    C*容積
|    C                     EXSR RTN30C
|    C           KEYWF     CHAINWFC60                40
|    C*
|    C*當期
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  ACT       WFC612
|   C*
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADD0         WFC610
|   C                     Z-ADD0         WFC611
|   C                     Z-ADD0         WFC613
|   C                     Z-SUBACT       WFC612
| 02-C           WFC612    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
| 01-C                     END
|    C*
22===C                     ENDSR
      *==============================================================*
      *          RTN310....WRITE OR UPDATE REWFC6
      *==============================================================*
23===C           RTN310    BEGSR
|    C*容積
|    C                     EXSR RTN30C
|    C*當月
|    C           KEYWF     CHAINWFC60                40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  ACT       WFC613
|   C*
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADD0         WFC610
|   C                     Z-ADD0         WFC611
|   C                     Z-ADD0         WFC612
|   C                     Z-SUBACT       WFC613
| 02-C           WFC613    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
|   C*
| 01-C                     END
|    C*
23===C                     ENDSR
      *==============================================================*
      *          RTN320....WRITE OR UPDATE REWFC6
      *==============================================================*
24===C           RTN320    BEGSR
|    C*容積
|    C                     EXSR RTN30C
|    C*當年
|    C           KEYWF     CHAINWFC60                40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  ACT       WFC611
|   C*
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADD0         WFC610
|   C                     Z-ADD0         WFC612
|   C                     Z-ADD0         WFC613
|   C                     Z-SUBACT       WFC611
| 02-C           WFC611    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
|   C*
| 01-C                     END
|    C*
24===C                     ENDSR
      *==============================================================*
      *          RTN330....WRITE OR UPDATE REWFC6
      *==============================================================*
24===C           RTN330    BEGSR
|    C*容積
|    C                     EXSR RTN30C
|    C*去年
|    C           KEYWF     CHAINWFC60                40
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     SUB  ACT       WFC610
|   C*
|   C                     UPDATWFC60
| 01*C                     ELSE
|   C                     Z-ADD0         WFC611
|   C                     Z-ADD0         WFC612
|   C                     Z-ADD0         WFC613
|   C                     Z-SUBACT       WFC610
| 02-C           WFC610    IFNE 0
|   C                     WRITEWFC60
| 02-C                     END
|   C*
| 01-C                     END
|    C*
24===C                     ENDSR
      *==============================================================*
      *          RTN30X....禮盒單瓶售價計算數量及金額
      *==============================================================*
25===C           RTN30X    BEGSR
      *禮盒碼
|    C                     EXSR RTN30Y
|    C                     OPEN RES18WF
|    C                     EXSR RTN30Z
|    C                     CLOSERES18WF
|    C*
25===C                     ENDSR
      *==============================================================*
      *          RTN30Y....禮盒單瓶成本
      *==============================================================*
26===C           RTN30Y    BEGSR
      *禮盒拆解為產品
|    C                     Z-ADDSO05      XSO05   60       禮盒訂購數量
|    C                     CALL 'RES018'
|    C                     PARM SO03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM SO02      S08I2  12        訂單號碼
|    C                     PARM 0         S08I3   60       牌價判斷日
|    C                     PARM XSO05     S08I4   60       禮盒訂購數量
|    C                     PARM 0         S08I5   60       禮盒搭贈數量
|    C                     PARM 0         S08I6   90       禮盒金額
      *部份－單位成本－中間
|    C                     PARM 0         S08I7   82       禮盒成本FOB
|    C                     PARM 0         S08I8   82       禮盒成本FHI
|    C                     PARM 0         S08I9   82       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM 0         S08IA   82       禮盒轉帳成本FOB
|    C                     PARM 0         S08IB   82       禮盒轉帳成本FHI
|    C                     PARM 0         S08IC   82       禮盒轉帳成本DUTY
|    C*
26===C                     ENDSR
      *==============================================================*
      *          RTN30Z....WRITE OR UPDATE REWF69
      *==============================================================*
27===C           RTN30Z    BEGSR
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    47
| 01-C           *IN47     DOWEQ'0'
     C           R181      CHAINMA0L                 40
     C           *IN40     IFEQ '0'
     C                     MOVELMA08      WFC600
     C                     MOVELMA08      WFC601
     C                     MOVELMA10      WFC602
     C                     MOVELMA09      WFC603
     C                     MOVELR181      WMA01
     C                     ELSE
     C                     MOVE *BLANKS   WFC600
     C                     MOVE *BLANKS   WFC601
     C                     MOVE *BLANKS   WFC602
     C                     MOVE *BLANKS   WFC603
     C                     MOVE *BLANKS   WMA01
     C                     END
|   C                     Z-ADDR182      SO05
|   C                     EXSR RTN30B
|   C                     READ RE18R                    47
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
27===C                     ENDSR
      *==============================================================*
      *          RTN40A    SOSWPF
      *==============================================================*
01===C           RTN40A    BEGSR
|    C*
     C           DDE       IFLT 10
     C                     Z-ADD1         RATE    10       第一個星期
     C                     ELSE
     C           DDE       IFLT 20
     C                     Z-ADD2         RATE             第二個星期
     C                     ELSE
     C           DDE       IFLT 28
     C                     Z-ADD3         RATE             第三個星期
     C                     ELSE
     C                     Z-ADD4         RATE             第四個星期
     C                     END
     C                     END
     C                     END
     C*
     C           DDE       SUB  DDS       WDDE    20
     C           WDDE      ADD  1         WDDE
     C           WDDE      IFLE 10
     C                     Z-ADD1         WRATE   10       第一個星期
     C                     ELSE
     C           WDDE      IFLT 20
     C                     Z-ADD2         WRATE            第二個星期
     C                     ELSE
     C           WDDE      IFLT 28
     C                     Z-ADD3         WRATE            第三個星期
     C                     ELSE
     C                     Z-ADD4         WRATE            第四個星期
     C                     END
     C                     END
     C                     END
     C*
|    C                     READ SW0                      50
| 02-C           *IN50     DOWEQ'0'
     C           SW04      IFEQ BUDYY
     C                     EXSR RTN400                     當期當月
     C                     END
     C           SW04      IFGE YF4SYY
     C           SW04      ANDLEYF4EYY
     C                     EXSR RTN410                     整年預算
     C                     END
     C           SW04      IFGE STRYY
     C           SW04      ANDLEENDYY
     C                     EXSR RTN420                     當年預算
     C                     END
|   C                     READ SW0                      50
| 02-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE OR UPDATE REWFC6
      *==============================================================*
24===C           RTN400    BEGSR
     C*
     C                     MOVELBUDMM     I       20
     C                     Z-ADDWSW1,I    WBUD   132
     C           WBUD      DIV  4         W01    132H
     C           W01       MULT WRATE     W02    132H
     C                     Z-ADDW02       BUD1   132H      當期預算
     C           W01       MULT RATE      BUD2   132H      當月預算
     C                     MOVELSW01      WFC600
     C                     MOVELSW01      WFC601
     C                     MOVELSW02      WFC602
     C                     MOVELSW03      WFC603
     C*
     C           KEYWF     CHAINWFC60                51
     C           *IN51     IFEQ '0'
     C                     ADD  BUD1      WFC621
     C                     ADD  BUD2      WFC622
     C*
     C*當年預算＝當月預算＋當年整月份預算
     C*例：8/1/99 - 11/21/99預算
     C*    ＝(11/1/99-11/21/99預算)+(8/99 - 10/99預算)
     C*
     C                     ADD  BUD2      WFC623           當年預算
     C                     UPDATWFC60
     C                     ELSE
     C                     Z-ADD0         WFC610
     C                     Z-ADD0         WFC611
     C                     Z-ADD0         WFC612
     C                     Z-ADD0         WFC613
     C                     Z-ADD0         WFC620
     C                     Z-ADDBUD1      WFC621
     C                     Z-ADDBUD2      WFC622
     C                     Z-ADDBUD2      WFC623
     C                     WRITEWFC60
     C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN410....WRITE OR UPDATE REWFC6
      *==============================================================*
24===C           RTN410    BEGSR
     C*年度預算
--1--C           YF4SYY    IFNE YF4EYY                     起迄年異
| -2-C           SW04      IFEQ YF4SYY
||   C                     Z-ADDYF4SMM    I
||   C                     Z-ADDYF4SMM    WMM     20
||   C                     Z-ADD0         BUD1
||   C           WMM       DO   12        I
||   C                     ADD  WSW1,I    BUD1   132H      年度預算
||   C                     ENDDO
||--*C                     ELSE
|| -3C           SW04      IFEQ YF4EYY
|| | C                     Z-ADD1         J
|| | C                     Z-ADDYF4EMM    WMM
||   C                     Z-ADD0         BUD1
|| | C           1         DO   WMM       J
|| | C                     ADD  WSW1,J    BUD1   132H      年度預算
|| | C                     ENDDO
|| |*C                     ELSE
|| | C                     Z-ADD1         K
|| | C                     Z-ADD0         BUD1
|| | C           1         DO   12        K
|| | C                     ADD  WSW1,K    BUD1   132H      年度預算
|| | C                     ENDDO
|| -3C                     END
||-2-C                     END
|---*C                     ELSE
|    C                     Z-ADDYF4SMM    I
|    C                     Z-ADDYF4SMM    J
|    C                     Z-ADDYF4EMM    WMM
|    C                     Z-ADD0         BUD1
|    C           I         DO   WMM       J
|    C                     ADD  WSW1,J    BUD1   132H      年度預算
|    C                     ENDDO
--1--C                     END
     C                     MOVELSW01      WFC600
     C                     MOVELSW01      WFC601
     C                     MOVELSW02      WFC602
     C                     MOVELSW03      WFC603
     C*
     C           KEYWF     CHAINWFC60                51
     C           *IN51     IFEQ '0'
     C                     ADD  BUD1      WFC620
     C                     UPDATWFC60
     C                     ELSE
     C                     Z-ADD0         WFC610
     C                     Z-ADD0         WFC611
     C                     Z-ADD0         WFC612
     C                     Z-ADD0         WFC613
     C                     Z-ADD0         WFC621
     C                     Z-ADD0         WFC622
     C                     Z-ADD0         WFC623
     C                     Z-ADDBUD1      WFC620
     C                     WRITEWFC60
     C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN420....WRITE OR UPDATE REWFC6
      *==============================================================*
24===C           RTN420    BEGSR
     C*當年預算
--1--C           STRYY     IFNE ENDYY                      起迄年異
| -2-C           SW04      IFEQ STRYY
||   C                     Z-ADDSTRMM     I
||   C                     Z-ADDSTRMM     WMM
||   C                     Z-ADD0         BUD1
||   C           WMM       DO   12        I
||   C                     ADD  WSW1,I    BUD1   132H      當年預算
||   C                     ENDDO
||--*C                     ELSE
|| -3C           SW04      IFEQ ENDYY
|| | C                     Z-ADD1         J
|| | C                     Z-ADDENDMM     WMM
|| | C                     Z-ADD0         BUD1
|| | C           1         DO   WMM       J
|| | C                     ADD  WSW1,J    BUD1   132H      當年預算
|| | C                     ENDDO
|| |*C                     ELSE
|| | C                     Z-ADD1         K
|| | C                     Z-ADD0         BUD1
|| | C           1         DO   12        K
|| | C                     ADD  WSW1,K    BUD1   132H      當年預算
|| | C                     ENDDO
|| -3C                     END
||-2-C                     END
|---*C                     ELSE
|    C                     Z-ADDSTRMM     I
|    C                     Z-ADDSTRMM     J
|    C                     Z-ADDENDMM     WMM
|    C                     Z-ADD0         BUD1
|    C           I         DO   WMM       J
|    C                     ADD  WSW1,J    BUD1   132H      當年預算
|    C                     ENDDO
--1--C                     END
     C                     MOVELSW01      WFC600
     C                     MOVELSW01      WFC601
     C                     MOVELSW02      WFC602
     C                     MOVELSW03      WFC603
     C*
     C           KEYWF     CHAINWFC60                51
     C           *IN51     IFEQ '0'
     C                     ADD  BUD1      WFC623
     C                     UPDATWFC60
     C                     ELSE
     C                     Z-ADD0         WFC610
     C                     Z-ADD0         WFC611
     C                     Z-ADD0         WFC612
     C                     Z-ADD0         WFC613
     C                     Z-ADD0         WFC620
     C                     Z-ADD0         WFC621
     C                     Z-ADD0         WFC622
     C                     Z-ADDBUD1      WFC623
     C                     WRITEWFC60
     C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
M001AC/COPY HBP2CVTR
