      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR0761                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單分析作業                                 *
      * REMARK       :客戶退貨明細表－銷退                         *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /*                                                          */
     /*=============================================================*/
      ****************************************************************
     FSOSGPF  IP  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FIMIAPF  IF  E           K        DISK
     FREWFC4  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      139 139 $RMK01
     I                                      598 5990$PRTID
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYIA     KLIST
     C                     KFLD           COMP    1
     C                     KFLD           WFC401
     C                     KFLD           WFC402
     C           KEYC4     KLIST
     C                     KFLD           WFC401
     C                     KFLD           WFC402
      *==============================================================*
      *                    DEFINE FIELD
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *INIT ENVIRM
     C*
     C                     EXSR RTN100                     *CHAIN MTME
     C*
     C*1 10                SETOF                     32
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE 'K'       COMP
|    C*                    Z-ADD0         WFC403
|    C                     Z-ADD0         WFC404
|   C                     SETON                     10
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....CHAIN MTMEPF
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     MOVELSG18      WFC401
|    C*
|    C           SG02      CHAINSH0                  51
| 01-C           *IN51     DOWEQ'0'
|   C                     MOVELSH03      WFC402
|   C           KEYC4     CHAINWFC40                40
| 02-C           *IN40     IFEQ '1'
|   C           SH04      ADD  SH05      WFC404
|   C*
|   C           KEYIA     CHAINIA0                  41
| 03-C           *IN41     IFEQ '0'
|   C                     Z-ADDIA10      WFC403
| 03*C                     ELSE
|   C                     Z-ADD0         WFC403
| 03-C                     END
|   C                     WRITEWFC40
| 02*C                     ELSE
|   C                     ADD  SH04      WFC404
|   C                     ADD  SH05      WFC404
|   C                     UPDATWFC40
| 02-C                     END
|   C           SG02      READESH0                      51
| 01-C                     END
|    C*
02===C                     ENDSR
