      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR081                                        *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 06/16/99                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :期間專櫃銷售分析表                           *
      ****************************************************************
     FSAR081D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      119 1200WMM
     I                                      123 1240WYY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 605 DSC04S
     I                                      606 610 DSC04E
      *MM/YY
     I                                      611 6140DSC39S
     I                                      611 6120D39SM
     I                                      613 6140D39SY
     I                                      617 6200DSC39E
     I                                      617 6180D39EM
     I                                      619 6200D39EY
      *YY/MM
     I                                      623 6280WSC39S
     I                                      629 6340WSC39E
      *SELECT
      *
     I                                      700 700 DSEL
     I                                      701 701 DSEL2
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I            DS
     I                                        1   60CHKMDY
     I                                        1   20CHKM
     I                                        3   40CHKD
     I                                        5   60CHKY
     I            DS
     I                                        1   40W39
     I                                        1   20W39Y
     I                                        3   40W39M
      *
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         WSC39S
|    C                     Z-ADD0         WSC39E
|    C                     Z-ADD0         CHKMDY
|    C                     Z-ADD0         W39
|    C                     MOVEL'B    '   DSC04S
|    C                     MOVEL'B9999'   DSC04E
|    C                     MOVELWMM       D39SM
|    C                     MOVELWMM       D39EM
|    C                     MOVELWYY       D39SY
|    C                     MOVELWYY       D39EY
|    C                     MOVE '1'       DSEL
|    C                     MOVE '1'       DSEL2
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *
|    C*客戶代號
| 01-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 01-C                     END
|    C*
| 02-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 02-C                     END
|    C*
| 03-C           DSC04S    IFGT DSC04E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-日期
| 04-C           DSC39S    IFEQ 0
|   C                     SETON                     629599
| 04-C                     END
|    C   99                GOTO END100
|    C*
     C                     MOVELD39SM     CHKM
     C                     MOVELD39SY     CHKY
     C                     MOVEL'01'      CHKD
|    C                     CALL 'P09'
|    C                     PARM CHKMDY    P0901I  60
|    C                     PARM           P0911O  1
| 09-C           P0911O    IFEQ 'N'
|   C                     SETON                     629399
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 04-C           DSC39E    IFEQ 0
|   C                     SETON                     639599
| 04-C                     END
|    C   99                GOTO END100
|    C*
     C                     MOVELD39EM     CHKM
     C                     MOVELD39EY     CHKY
     C                     MOVEL'01'      CHKD
|    C                     CALL 'P09'
|    C                     PARM CHKMDY    P0901I  60
|    C                     PARM           P0911O  1
| 09-C           P0911O    IFEQ 'N'
|   C                     SETON                     639399
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHANGE TO YYYYMM)
     C                     MOVELD39SM     W39M
     C                     MOVELD39SY     W39Y
     C                     MOVE '004N7'   HB2@FA
     C                     MOVE W39       HB2@F
     C                     MOVE '006N7'   HB2@TA
     C                     EXSR HB@ADD                     + CENTURY 2->4 YEAR
     C                     MOVE HB2@T     WSC39S
      *
     C                     MOVELD39EM     W39M
     C                     MOVELD39EY     W39Y
     C                     MOVE '004N7'   HB2@FA
     C                     MOVE W39       HB2@F
     C                     MOVE '006N7'   HB2@TA
     C                     EXSR HB@ADD                     + CENTURY 2->4 YEAR
     C                     MOVE HB2@T     WSC39E
      *
| 03-C           WSC39S    IFGT WSC39E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-日期
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
