      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR0421                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/05/09                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款作業                                 *
      * REMARK       :產品退貨彙總表                               *
      ****************************************************************
     FSOSNPF  IF  E           K        DISK
     FSOSOPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FREWF54  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DSG01S
     I                                      603 604 DSG01E
     I                                      605 613 DSH03S
     I                                      614 622 DSH03E
     I                                      647 6520DATES
     I                                      653 6580DATEE
     I                                      661 661 DATA
     I                                      663 663 DATA1
     I                                      662 662 IN20
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11A
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYSO     KLIST
     C                     KFLD           SO03
     C                     KFLD           SO01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100
     C                     SETON                     LR
      *==============================================================*
     C*          RTN010....INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C                     MOVEL*BLANKS   WF5401
|    C                     MOVEL*BLANKS   WF5402
|    C                     MOVEL*BLANKS   WF5406
|    C                     Z-ADD0         WF5403
|    C                     Z-ADD0         WF5404
|    C                     Z-ADD0         WF5405
|    C                     Z-ADD0         WF5407
|    C                     Z-ADD0         WF5408
|    C                     Z-ADD0         WF5409
|    C                     Z-ADD0         WF5410
01===C                     ENDSR
      *==============================================================*
     C*          RTN100....SN0
     C*==============================================================*
02===C           RTN100    BEGSR
|    C                     READ SN0                      45
| 01-C           *IN45     DOWEQ'0'
|   C                     EXSR RTN150
|   C                     READ SN0                      45
| 01-C                     END
|    C*
02===C                     ENDSR
     C*
      *==============================================================*
      *          RTN150....SO0
      *==============================================================*
03===C           RTN150    BEGSR
|    C*
|    C           SN02      SETLLSO0
|    C           SN02      READESO0                      46
| 01-C           *IN46     DOWEQ'0'
|   C*
|   C           SO03      CHAINMA0                  45
| 02-C           MA11A     IFGE DMA11S
|   C           MA11A     ANDLEDMA11E
|   C*
| 03-C           SO03      IFGE DSH03S
|   C           SO03      ANDLEDSH03E
|   C*
|   C           KEYSO     CHAINWF540                47
| 04-C           *IN47     IFEQ '0'
|   C                     ADD  SO05      WF5403
|   C                     ADD  SO13      WF5407
|   C                     ADD  SO14      WF5408
|   C                     ADD  SO15      WF5409
|   C*轉帳總成本
|   C                     ADD  SO13      WF5410
|   C                     ADD  SO14      WF5410
|   C                     ADD  SO15      WF5410
|   C*收回成本
|   C                     ADD  SO16      WF5405
|   C                     ADD  SO17      WF5405
|   C                     ADD  SO18      WF5405
|   C                     UPDATWF540
| 04*C                     ELSE
|   C                     MOVELSO01      WF5401
|   C                     MOVELSO03      WF5402
|   C                     Z-ADDSO05      WF5403
|   C*收回成本
|   C                     Z-ADDSO16      WF5405
|   C                     ADD  SO17      WF5405
|   C                     ADD  SO18      WF5405
|   C*轉帳總成本
|   C                     Z-ADDSO13      WF5407
|   C                     Z-ADDSO14      WF5408
|   C                     Z-ADDSO15      WF5409
|   C                     Z-ADDSO13      WF5410
|   C                     ADD  SO14      WF5410
|   C                     ADD  SO15      WF5410
|   C                     WRITEWF540
| 04-C                     END
| 03-C                     END
| 02-C                     END
|   C           SN02      READESO0                      46
| 01-C                     END
      *
|    C*
03===C                     ENDSR
