      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0481                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品成長率分析表                             *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.08  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FRES18WF IF  E           K        DISK                           UC
     FMTMAPF  IF  E           K        DISK
     FREWF28  UF  E           K        DISK                      A
B2MODE                    YM         13  6 0
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *型態
     I                                      603 604 DSC34S
     I                                      605 606 DSC34E
      *地區
     I                                      607 608 DSC31S
     I                                      609 610 DSC31E
      *YY/MM
     I                                      613 6160WSC391
     I                                      613 6140SC391Y
     I                                      615 6160SC391M
     I                                      617 6200WSC392
     I                                      617 6180SC392Y
     I                                      619 6200SC392M
M001AI                                      711 7160W6S
M001AI                                      721 7260W6E
      *SELECT起迄日期
      *YY/MM
     I                                      621 6240YMS1
     I                                      621 6220YYS1
     I                                      623 6240MMS1
     I                                      625 6280YME1
     I                                      625 6260YYE1
     I                                      627 6280MME1
      *減一年
     I                                      629 6320YMS2
     I                                      629 6300YYS2
     I                                      631 6320MMS2
     I                                      633 6360YME2
     I                                      633 6340YYE2
     I                                      635 6360MME2
      *
     I                                      637 637 DSEL
      *MM/YY
     I                                      638 6410DSC39S
     I                                      638 6390SC39SM
     I                                      640 6410SC39SY
     I                                      642 6450DSC39E
     I                                      642 6430SC39EM
     I                                      644 6450SC39EY
     I                                      701 7040DSC08S
     I                                      701 7020SC08SM
     I                                      703 7040SC08SY
     I                                      705 7080DSC08E
     I                                      705 7060SC08EM
     I                                      707 7080SC08EY
     I                                      750 750 IN20
     I            DS
B2MODI                                        1   80DATES
B2MODI                                        1   60SC39YM
B2MODI                                        1   40SC39YY
B2MODI                                        5   60SC39MM
     I            DS
B2MODI                                        1   60CHKYM
B2MODI                                        1   40CHKYY
B2MODI                                        5   60CHKMM
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF2806    WORK06
     C           *LIKE     DEFN WF2807    WORK07
     C           *LIKE     DEFN WF2808    WORK08
     C           *LIKE     DEFN WF2809    WORK09
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF2801
     C                     KFLD           WF2802
     C                     KFLD           WF2803
     C                     KFLD           WF2804
     C                     KFLD           WF2805
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100
      *分析方式－禮盒(A)
  01-C           DSEL      IFEQ 'A'
    C                     EXSR RTN200
  01-C                     END
      *
      *分析方式－單瓶(B)需拆解禮盒為單瓶
  02-C           DSEL      IFEQ 'B'
    C                     EXSR RTN400
  02-C                     END
      *
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....存放起迄年月
      *==============================================================*
01===C           RTN100    BEGSR
      *
B2MODC                     Z-ADD0         SYM1    60
M001MC*                    Z-ADD0         EYM1    40
M001MC*                    Z-ADD0         SYM2    40
M001MC*                    Z-ADD0         EYM2    40
M001MC                     Z-ADD0         EYM1    60
M001MC                     Z-ADD0         SYM2    60
M001MC                     Z-ADD0         EYM2    60
      *螢幕年月起迄YY/MM
B2000C*M001M               MOVELWSC391    SYM1
M001MC                     MOVELW6S       SYM1
      *減一年YY/MM
B2???C           SYM1      SUB  100       SYM2
B2INF *CVR0001 sev.00 Field SYM2 is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code SUB
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
      *CLEAR ARRAY
|    C                     Z-ADD0         YM
|    C                     Z-ADD1         X       20
B2000C*M001M               Z-ADDWSC391    CHKYM
M001MC                     Z-ADDW6S       CHKYM
B2000C                     Z-ADDCHKYM     YM,X
B2000C*M001M     CHKYM     DOWLTWSC392
M001MC           CHKYM     DOWLTW6E
      *
B2000C                     ADD  1         CHKYM
| 04-C           CHKMM     IFGE 12
B2000C                     ADD  1         CHKYY
|   C                     Z-ADD1         CHKMM
| 04-C                     END
      *
|   C                     ADD  1         X
B2000C                     Z-ADDCHKYM     YM,X
| 03-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....月銷售數量及金額
      *==============================================================*
02===C           RTN200    BEGSR
      *
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
|   C                     MOVELSC33      WF2801
|   C                     MOVELSC34      WF2802
|   C                     MOVELSC31      WF2803
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 02-C           *IN46     DOWEQ'0'
      *
|   C                     Z-ADD1         X
B2CHKC           YM,X      DOWNE0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     MOVELSD03      WF2804
B2000C                     Z-ADDYM,X      WF2805
B2MODC                     Z-ADD0         WS2805  60
B2CHKC           WF2805    SUB  100       WS2805
|   C           KEYWF     CHAINWF280                40
|   C                     EXSR RTN300
|   C                     ADD  1         X
| 03-C                     END
      *
|   C           SC02      READESD0                      46
| 02-C                     END
      *
|   C                     READ SC0                      45
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWF28
      *==============================================================*
03===C           RTN300    BEGSR
      *
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C                     Z-ADD0         WORK08
|    C                     Z-ADD0         WORK09
      *
     C           IN20      IFEQ '0'
B2000C                     Z-ADDSC08      DATES
     C                     ELSE
B2000C                     Z-ADDSC39      DATES
| 02-C                     END
      *
B2000C           SC39YM    IFGE SYM1
      *月累計銷售量
B2000C           SC39YM    IFEQ WF2805
|   C                     Z-ADDSD04      WORK06
| 02-C                     END
      *年累計銷售量
B2000C           SC39YM    IFLE WF2805
|   C                     Z-ADDSD04      WORK07
| 03-C                     END
      *
| 01*C                     ELSE
      *去年同月月累計銷售量
B2000C           SC39YM    IFEQ WS2805
|   C                     Z-ADDSD04      WORK08
| 04-C                     END
      *去年累計銷售量
B2000C           SC39YM    IFLE WS2805
|   C                     Z-ADDSD04      WORK09
| 05-C                     END
      *
| 01-C                     END
      *
| 06-C           *IN40     IFEQ '0'
|   C                     ADD  WORK06    WF2806
|   C                     ADD  WORK07    WF2807
|   C                     ADD  WORK08    WF2808
|   C                     ADD  WORK09    WF2809
      *
|   C                     UPDATWF280
| 06*C                     ELSE
|   C                     Z-ADDWORK06    WF2806
|   C                     Z-ADDWORK07    WF2807
|   C                     Z-ADDWORK08    WF2808
|   C                     Z-ADDWORK09    WF2809
|   C                     WRITEWF280
| 06-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN400....禮盒單瓶售價計算數量及金額
      *==============================================================*
04===C           RTN400    BEGSR
      *
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
|   C                     MOVELSC33      WF2801
|   C                     MOVELSC34      WF2802
|   C                     MOVELSC31      WF2803
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 02-C           *IN46     DOWEQ'0'
|   C           SD03      CHAINMA0                  40
      *禮盒碼
| 03-C           MA54      IFEQ 'Y'
      *禮盒單瓶售價
|   C                     EXSR RTN500
|   C                     OPEN RES18WF
|   C                     EXSR RTN600
|   C                     CLOSERES18WF
      *ELSE非禮盒處理同禮盒處禮DSEL='A'
| 03*C                     ELSE
|   C                     Z-ADD1         X
B2CHKC           YM,X      DOWNE0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     MOVELSD03      WF2804
B2000C                     Z-ADDYM,X      WF2805
B2MODC                     Z-ADD0         WS2805  60
B2CHKC           WF2805    SUB  100       WS2805
|   C           KEYWF     CHAINWF280                40
|   C                     EXSR RTN300
|   C                     ADD  1         X
| 04-C                     END
      *
| 03-C                     END
      *
|   C           SC02      READESD0                      46
| 02-C                     END
      *
|   C                     READ SC0                      45
| 01-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN500....禮盒單瓶售價
      *==============================================================*
05===C           RTN500    BEGSR
|    C*
      *禮盒拆解為產品
M001AC                     Z-ADDSC07      WSC07   60
|    C                     CALL 'RES018'
|    C                     PARM SD03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM SD02      S08I2  12        訂單號碼
B2MODC*M001M               PARM SC07      S08I3   80       牌價判斷日
M001MC                     PARM WSC07     S08I3   60       牌價判斷日
|    C                     PARM SD04      S08I4   60       禮盒訂購數量
|    C                     PARM SD05      S08I5   60       禮盒搭贈數量
|    C                     PARM SD06      S08I6   92       禮盒金額
      *部份－單位成本－中間
|    C                     PARM SD10      S08I7   92       禮盒成本FOB
|    C                     PARM SD11      S08I8   92       禮盒成本FHI
|    C                     PARM SD12      S08I9   92       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM SD22      S08IA   92       禮盒轉帳成本FOB
|    C                     PARM SD23      S08IB   92       禮盒轉帳成本FHI
|    C                     PARM SD24      S08IC   92       禮盒轉帳成本DUTY
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN600....WRITE OR UPDATE REWF93
      *==============================================================*
06===C           RTN600    BEGSR
|    C*
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    46
| 01-C           *IN46     DOWEQ'0'
|    C*
|   C*TOTAL FOB,FHI,DUTY
     C*
     C                     Z-ADDR182      SD04
|   C                     Z-ADD1         X
B2CHKC           YM,X      DOWNE0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     MOVELSD03      WF2804
B2000C                     Z-ADDYM,X      WF2805
B2MODC                     Z-ADD0         WS2805  60
B2CHKC           WF2805    SUB  100       WS2805
|   C           KEYWF     CHAINWF280                40
     C                     EXSR RTN300
|   C                     ADD  1         X
| 04-C                     END
     C*
|   C                     READ RE18R                    46
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
06===C                     ENDSR
