      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0582                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :通路地區達成率分析表                         *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.12  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREWF21  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSAR058P O   E             39     PRINTER
     E*
     IWF210
     I                                              WF2101L4
     I                                              WF2114L3
     I                                              WF2115L2
     I                                              WF2102L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *MM/DD/YY
     I                                      605 6100DSC39
      *YY/MM/DD
     I*                                     611 6160WSC39
     I*                                     611 6120WSC39Y
     I*                                     613 6140WSC39M
M001MI                                      711 7180WSC39
M001MI                                      711 7140WSC39Y
M001MI                                      715 7160WSC39M
      *
     I                                      617 617 DSEL
      *螢幕本年月
     I*M001M                                618 6210SCRYM
M001MI                                      721 7260SCRYM
      *螢幕上年
     I*M001M                                622 6250SCRY1
M001MI                                      727 7320SCRY1
      *螢幕上月
     I*M001M                                626 6290SCRM1
     I*M001M                                626 6270SCRYY
     I*M001M                                628 6290SCRMM
M001MI                                      733 7380SCRM1
M001MI                                      733 7360SCRYY
M001MI                                      737 7380SCRMM
      *
M001MI*                                     630 6350KEPDAT
M001MI                                      628 6350KEPDAT
     I                                      701 7060DSC08
     I                                      750 750 IN20
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#C     KLIST
     C                     KFLD           #C01
     C                     KFLD           #C02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL4     IFEQ '1'
    C                     EXSR RTN010                     *HEADING
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CL3                   SETOF                     20
     CL4 10                EXSR RTN400
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
     C           IN20      IFEQ '0'
     C                     SETOF                     20
     C                     ELSE
     C                     SETON                     20
     C                     END
|    C*禮盒
     C           DSEL      IFEQ 'B'
     C                     SETON                     22
     C                     END
|    C*通路
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVELWF2101    #A02
|    C           KEY#A     CHAIN#A0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   #A03
| 03-C                     END
|    C*
|    C                     WRITEPH1
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*產品名稱
|    C           WF2103    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 01-C                     END
|    C*型態說明
|    C                     MOVELWF2101    #C01
|    C                     MOVELWF2114    #C02
|    C           KEY#C     CHAIN#C0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #C03
| 02-C                     END
      *地區
|    C           WF2115    CHAIN#D0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   #D02
| 03-C                     END
|    C*
| 03-C           WF2104    IFNE 0
|   C           WF2108    MULT 100       WORK   174
|   C           WORK      DIV  WF2104    RATE1     H
| 03*C                     ELSE
|   C                     Z-ADD0         RATE1     H
| 03-C                     END
| 04-C           WF2105    IFNE 0
|   C           WF2109    MULT 100       WORK   174
|   C           WORK      DIV  WF2105    RATE2     H
| 04*C                     ELSE
|   C                     Z-ADD0         RATE2     H
| 04-C                     END
|    C   39                EXSR RTN900
|    C                     WRITEPD1
      *IN20 CONTROL型態是否顯示
|    C                     SETON                     2021
      *IN30 CONTROL SPACEA
|    C                     SETOF                     30
|    C                     ADD  WF2105    T12105
|    C                     ADD  WF2107    T12107
|    C                     ADD  WF2109    T12109
|    C                     ADD  RATE2     T1RATE
|    C                     ADD  WF2111    T12111
|    C                     ADD  WF2113    T12113
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
     C                     SETON                     30
|    C                     ADD  T12105    T22105
|    C                     ADD  T12107    T22107
|    C                     ADD  T12109    T22109
|    C                     ADD  T1RATE    T2RATE
|    C                     ADD  T12111    T22111
|    C                     ADD  T12113    T22113
|    C                     Z-ADD0         T12105
|    C                     Z-ADD0         T12107
|    C                     Z-ADD0         T12109
|    C                     Z-ADD0         T1RATE
|    C                     Z-ADD0         T12111
|    C                     Z-ADD0         T12113
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   TOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
     C                     SETOF                     21
|    C                     ADD  T22105    T32105
|    C                     ADD  T22107    T32107
|    C                     ADD  T22109    T32109
|    C                     ADD  T2RATE    T3RATE
|    C                     ADD  T22111    T32111
|    C                     ADD  T22113    T32113
|    C                     Z-ADD0         T22105
|    C                     Z-ADD0         T22107
|    C                     Z-ADD0         T22109
|    C                     Z-ADD0         T2RATE
|    C                     Z-ADD0         T22111
|    C                     Z-ADD0         T22113
      *
04===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT3   TOTAL
      *==============================================================*
04===C           RTN400    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
     C                     SETOF                     30
| 01-C           *INLR     IFEQ '0'
|   C                     WRITEPE1
| 01-C                     END
|    C                     Z-ADD0         T32105
|    C                     Z-ADD0         T32107
|    C                     Z-ADD0         T32109
|    C                     Z-ADD0         T3RATE
|    C                     Z-ADD0         T32111
|    C                     Z-ADD0         T32113
      *
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     3930
      *
05===C                     ENDSR
      *==============================================================*
      *          RTNLR
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
      *==============================================================*
