      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR078                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/09/21                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :產品銷售分析週報表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.14  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSAR078D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *公司
     I                                      600 600 DMD07S
     I                                      601 601 DMD07E
      *類別
     I                                      602 602 DMA11
      *單瓶
     I                                      604 604 DSEL2
      *MM/DD/YY
     I                                      611 6160DATES
     I                                      611 612 MMS
     I                                      613 614 DDS
     I                                      615 616 YYS
     I                                      621 6260DATEE
     I                                      621 622 MME
     I                                      623 624 DDE
     I                                      625 626 YYE
      *YY/MM/DD
     I                                      631 6360YMDS
     I                                      641 6460YMDE
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I*
     I                                      721 729 DMA01S
     I                                      731 739 DMA01E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
|   C           *IN05     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
     C                     MOVEL$USER     AUT     3
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA01S
|    C                     MOVE *BLANK    DMA01E
|    C                     MOVE *BLANK    DMD07S
|    C                     MOVE *BLANK    DMD07E
|    C                     MOVE 'A'       DSEL2
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
| 02-C           DMA11     IFEQ *BLANK
|   C                     SETON                     619599
| 02-C                     END
|    C   99                GOTO END100
|    C*
|    C*
|    C*產品代號
| 03-C           DMA01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DMA01S
| 03-C                     END
|    C*
| 04-C           DMA01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DMA01E
| 04-C                     END
|    C*
| 05-C           DMA01S    IFGT DMA01E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C*通路
| 03-C           DMD07S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DMD07S
| 03-C                     END
|    C*
| 04-C           DMD07E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DMD07E
| 04-C                     END
|    C*
| 05-C           DMD07S    IFGT DMD07E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 06-C           DATES     IFEQ 0
|   C                     SETON                     629599
| 06-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           DATEE     IFEQ 0
|   C                     SETON                     639599
| 07-C                     END
|    C   99                GOTO END100
|    C* CHK
| 09-C           DATES     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DATES     P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 11-C           DATEE     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DATEE     P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATES     S001I2  60
|    C           YMDS      PARM           S001O1  60
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATEE     S001I2  60
|    C           YMDE      PARM           S001O1  60
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C**
| 13-C*M001M     YMDS      IFGT YMDE
M001MC           YMD8S     IFGT YMD8E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
      *
|    C*
| 28-C           DSEL2     IFEQ *BLANK
|   C                     SETON                     659599
| 28-C                     END
|    C   99                GOTO END100
      *
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*產品代號
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
