      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR043                                        *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :應收帳款作業                                 *
     A* REMARK       :業務員業績報表                               *
      ****************************************************************
     FSAR043D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 604 DSC28S
     I                                      605 608 DSC28E
     I                                      611 616 DSC27S
     I                                      617 622 DSC27E
     I                                      631 6360DSC07
     I                                      641 641 DATA
B2MODI                                      642 6530DATES
B2MODI                                      707 7120DSC39
B2MODI                                      756 756 IN20
      *辦事處
B2MODI                                      676 676 COMP
B2MODI                                      677 677 COMPS
B2MODI                                      678 678 COMPE
     I*
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
     C                     Z-ADD0         D#ROW
     C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
     C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE '1'       COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC28S
|    C                     MOVE *BLANK    DSC28E
|    C                     MOVE *BLANK    DSC27S
|    C                     MOVE *BLANK    DSC27E
|    C                     MOVE *BLANK    DATA
|    C                     Z-ADD0         DSC07
|    C                     Z-ADD0         DSC39
|    C                     Z-ADD0         DATES
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK辦事處
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
     C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK組別
| 01-C           DSC28S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC28S
| 01-C                     END
|    C*
| 02-C           DSC28E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC28E
| 02-C                     END
|    C*
| 03-C           DSC28S    IFGT DSC28E
|   C                     SETON                     606193
|   C                     SETON                     99
|   C                     GOTO END100
| 03-C                     END
|    C*
|    C* CHK業務員
| 04-C           DSC27S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC27S
| 04-C                     END
|    C*
| 05-C           DSC27E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC27E
| 05-C                     END
|    C*
| 06-C           DSC27S    IFGT DSC27E
|   C                     SETON                     626393
|   C                     SETON                     99
|   C                     GOTO END100
| 06-C                     END
|    C*
|    C*送貨日期或確認日期只輸入一項
B2CHKC           DSC07     IFNE 0
B2INF *CVR3012 sev.30 Field DSC07 contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2INF *CVR3012 sev.30 Field DSC39 contains more than one year
| 05-C           DSC39     ANDNE0
|   C                     SETON                     668999
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK日期
B2CHKC           DSC39     IFEQ 0
B2INF *CVR3012 sev.30 Field DSC39 contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     CALL 'P09'
B2???C                     PARM DSC07     P0901I  80
B2INF *CVR3012 sev.30 Field DSC07 contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     649499
| 11-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSC07     S001I2  80
B2INF *CVR3012 sev.30 Field DSC07 contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           DATES     PARM           S001O1  80
     C                     MOVEL'0'       IN20
|    C*
     C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DSC39     P0901I  80
B2INF *CVR3012 sev.30 Field DSC39 contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     669499
| 11-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSC39     S001I2  80
B2INF *CVR3012 sev.30 Field DSC39 contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           DATES     PARM           S001O1  80
     C                     MOVEL'1'       IN20
|    C*
| 10-C                     END
|    C*
|    C**選擇單別
| 15-C           DATA      IFEQ *BLANKS
|   C                     SETON                     65
|   C                     SETON                     9699
| 15-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 4
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 47
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 47
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
