      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR042                                        *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/05/09                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :應收帳款作業                                 *
     A* REMARK       :產品退貨彙總表                               *
      ****************************************************************
     FSAR042D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 602 DSG01S
     I                                      603 604 DSG01E
     I                                      605 613 DSH03S
     I                                      614 622 DSH03E
     I                                      623 6280DSG06S
     I                                      629 6340DSG06E
     I                                      635 6400DSG26S
     I                                      641 6460DSG26E
     I                                      647 6520DATES
     I                                      653 6580DATEE
     I                                      661 661 DATA
     I                                      662 662 IN20
     I                                      663 663 DATA1
     I                                      664 665 DSG01
     I                                      671 675 DSG07S
     I                                      676 680 DSG07E
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
     C                     Z-ADD0         D#ROW
     C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSG01S
|    C                     MOVE *BLANK    DSG01E
|    C                     MOVE *BLANK    DSG01
|    C                     MOVE *BLANK    DSG07S
|    C                     MOVE *BLANK    DSG07E
|    C                     MOVE *BLANK    DSH03S
|    C                     MOVE *BLANK    DSH03E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     Z-ADD0         DSG06S
|    C                     Z-ADD0         DSG06E
|    C                     Z-ADD0         DSG26S
|    C                     Z-ADD0         DSG26E
|    C                     Z-ADD0         DATES   60
|    C                     Z-ADD0         DATEE   60
|    C                     MOVE *BLANK    DATA
|    C                     MOVE *BLANK    IN20
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK公司
| 01-C           DSG01     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG01S
|   C                     MOVE *HIVAL    DSG01E
     C                     ELSE
     C                     MOVELDSG01     DSG01S
     C                     MOVELDSG01     DSG01E
| 02-C                     END
|    C*
|    C* CHK種類
| 01-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
     C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 01-C                     END
|    C* CHK產品代號
| 01-C           DSH03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSH03S
| 01-C                     END
|    C*
| 02-C           DSH03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSH03E
| 02-C                     END
|    C*
| 03-C           DSH03S    IFGT DSH03E
|   C                     SETON                     6193
|   C                     SETON                     99
|   C                     GOTO END100
| 03-C                     END
|    C* CHK物流點
| 01-C           DSG07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG07S
| 01-C                     END
|    C*
| 02-C           DSG07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG07E
| 02-C                     END
|    C*
| 03-C           DSG07S    IFGT DSG07E
|   C                     SETON                     6869
|   C                     SETON                     9399
|   C                     GOTO END100
| 03-C                     END
|    C*
|    C* CHK日期
| 04-C           DSG06S    IFNE 0
|   C           DSG06E    ORNE 0
| 05-C           DSG26S    IFNE 0
|   C                     SETON                     648999
| 05-C                     END
| 06-C           DSG26E    IFNE 0
|   C                     SETON                     658999
| 06-C                     END
| 04-C                     END
|    C   99                GOTO END100
     C*
| 07-C           DSG06S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSG06S    P0901I  60
|   C                     PARM           P0901O  1
| 08-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 08-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSG06E    P0901I  60
|   C                     PARM           P0901O  1
| 09-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
     C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG06S    S001I2  60
|   C           DATES     PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG06E    S001I2  60
|   C           DATEE     PARM           S001O1  60
|   C**
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C**
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          DATES     IFGT DATEE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 10-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 09*C                     ELSE
     C           DSG26S    IFEQ 0
     C                     SETON                     649699
     C                     END
     C*
     C           DSG26E    IFEQ 0
     C                     SETON                     659699
     C                     END
     C*
|   C                     CALL 'P09'
|   C                     PARM DSG26S    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     649399
| 11-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSG26E    P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
     C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG26S    S001I2  60
|   C           DATES     PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSG26E    S001I2  60
|   C           DATEE     PARM           S001O1  60
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C**
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          DATES     IFGT DATEE
M001AC           YMD8S     IFGT YMD8E
|   C**
|   C                     SETON                     6465
|   C                     SETON                     9299
| 13-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 12-C                     END
|    C**
|    C**選擇單別
| 15-C           DATA      IFEQ *BLANKS
|   C                     SETON                     66
|   C                     SETON                     9699
| 15-C                     END
|    C   99                GOTO END100
     C**
     C           DATA      IFEQ 'A'
     C           DATA1     ANDNE*BLANKS
     C                     SETON                     67
     C                     SETON                     8999
| 15-C                     END
|    C   99                GOTO END100
     C**
|    C* 含試飲退回否
     C           DATA      IFEQ 'B'
     C           DATA1     ANDEQ*BLANKS
     C                     SETON                     67
     C                     SETON                     9699
| 15-C                     END
|    C   99                GOTO END100
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSH03S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 51
|   C           D#COL     ANDLE59
|   C                     CALL 'WDS001'
|   C                     PARM           DSH03E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
