      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR055                                        *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :客戶毛利金額排行榜                           *
      ****************************************************************
     FSAR055D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DSC01S
     I                                      603 604 DSC01E
     I                                      605 609 DSC04S
     I                                      610 614 DSC04E
      *MM/DD/YY
     I                                      615 6200DSC39S
     I                                      621 6260DSC39E
      *YY/MM/DD
     I                                      627 6320WSC39S
     I                                      633 6380WSC39E
      *
     I                                      641 641 DSC33S
     I                                      642 642 DSC33E
     I                                      643 644 DSC34S
     I                                      645 646 DSC34E
     I                                      647 648 DSC31S
     I                                      649 650 DSC31E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      750 750 IN20
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
      *
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSC01S
|    C                     MOVE *BLANK    DSC01E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         WSC39S
|    C                     Z-ADD0         WSC39E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *
|    C*公司　　
| 01-C           DSC01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC01S
| 01-C                     END
|    C*
| 02-C           DSC01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC01E
| 02-C                     END
|    C*
| 03-C           DSC01S    IFGT DSC01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*通路　　
| 01-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 01-C                     END
|    C*
| 02-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 02-C                     END
|    C*
| 03-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*型態　　
| 01-C           DSC34S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC34S
| 01-C                     END
|    C*
| 02-C           DSC34E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC34E
| 02-C                     END
|    C*
| 03-C           DSC34S    IFGT DSC34E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*地區　　
| 01-C           DSC31S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC31S
| 01-C                     END
|    C*
| 02-C           DSC31E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC31E
| 02-C                     END
|    C*
| 03-C           DSC31S    IFGT DSC31E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*客戶代號
| 01-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 01-C                     END
|    C*
| 02-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 02-C                     END
|    C*
| 03-C           DSC04S    IFGT DSC04E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*送貨日期或確認日期只輸入一項
| 04-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 05-C           DSC39S    IFNE 0
|   C                     SETON                     648999
| 05-C                     END
| 06-C           DSC39E    IFNE 0
|   C                     SETON                     658999
| 06-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 07-C           DSC39S    IFEQ 0
|   C           DSC39E    ANDEQ0
      *---
|   C* CHK送貨日期
| 10-C           DSC08S    IFEQ 0
M001DC*                    Z-ADD010101    DSC08S
M001AC                     Z-ADD010192    DSC08S
| 10*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     729499
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC08S    S001I2  60
|    C           WSC39S    PARM           S001O1  60
M001AC                     MOVE WSC39S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
| 10-C           DSC08E    IFEQ 0
M001DC*                    Z-ADD123199    DSC08E
M001AC                     Z-ADD123129    DSC08E
| 10*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     739499
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC08E    S001I2  60
|    C           WSC39E    PARM           S001O1  60
M001AC                     MOVE WSC39E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
M001DC*          WSC39S    IFGT WSC39E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     727393
|   C                     SETON                     99
|   C                     GOTO END100
| 03-C                     END
     C                     MOVEL'0'       IN20
      *---
| 07*C                     ELSE
|   C* CHK確認日期
| 13-C           DSC39S    IFEQ 0
M001DC*                    Z-ADD010101    DSC39S
M001AC                     Z-ADD010192    DSC39S
| 13*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 14-C           P0901O    IFEQ 'N'
|   C                     SETON                     649499
| 14-C                     END
| 13-C                     END
|   C   99                GOTO END100
|   C*
|   C**
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           WSC39S    PARM           S001O1  60
      *
| 15-C           DSC39E    IFEQ 0
M001DC*                    Z-ADD123199    DSC39E
M001AC                     Z-ADD123129    DSC39E
| 15*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 16-C           P0901O    IFEQ 'N'
|   C                     SETON                     659499
| 16-C                     END
| 15-C                     END
|   C   99                GOTO END100
|   C*
|   C**
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           WSC39E    PARM           S001O1  60
M001AC                     MOVE WSC39S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C*
M001AC                     MOVE WSC39E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          WSC39S    IFGT WSC39E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     646593
|   C                     SETON                     99
|   C                     GOTO END100
| 17-C                     END
     C                     MOVEL'1'       IN20
      *---
| 07-C                     END
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     IFEQ 40
|   C                     CALL 'WDS018'
|   C           DSC33S    PARM DSC33S    PSC33   1
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFEQ 45
|   C                     CALL 'WDS018'
|   C           DSC33E    PARM DSC33E    PSC33
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     IFGE 40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33
|   C           DSC34S    PARM DSC34S    PSC34   2
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 45
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33
|   C           DSC34E    PARM DSC34E    PSC34
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     IFGE 40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS007'
|   C           DSC31S    PARM DSC31S    PSC31   2
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 45
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS007'
|   C           DSC31E    PARM DSC31E    PSC31
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 10
|   C           D#COL     IFGE 40
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 48
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 03-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
     C*
     C           ENDF4     TAG
     C                     Z-ADD0         D#ROW
     C                     Z-ADD0         D#COL
03===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
