      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR0421                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/05/09                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款作業                                 *
      * REMARK       :產品退貨彙總表（銷貨退回）                   *
      ****************************************************************
     FREWF54  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FSAR042BPO   E             39     PRINTER
     IWF540
     I                                              WF5402L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      601 602 DSG01S
     I                                      603 604 DSG01E
     I                                      605 613 DSH03S
     I                                      614 622 DSH03E
     I                                      623 6280DSG06S
     I                                      629 6340DSG06E
     I                                      635 6400DSG26S
     I                                      641 6460DSG26E
     I                                      647 6520DATES
     I                                      653 6580DATEE
     I                                      661 661 DATA
     I                                      662 662 IN20
     I                                      663 663 DATA1
     I                                      664 665 DSG01
     I                                      671 675 DSG07S
     I                                      676 680 DSG07E
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C*  39                EXSR RTN900                     *OVRFLW-THE SAME SALE
     C                     EXSR RTN100                     *SALSE
     CL1 10                EXSR RTNL1
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*種類
     C                     MOVEL*BLANKS   GROUP
| 02-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'GROUP
| 02*C                     ELSE
| 03-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'GROUP
| 03*C                     ELSE
| 04-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'GROUP
| 04*C                     ELSE
|   C                     MOVEL'全部'  GROUP
| 04-C                     END
| 03-C                     END
| 02-C                     END
|    C*
     C                     SETOF                     20
     C           IN20      IFEQ '0'
     C                     SETON                     20
     C                     ELSE
     C                     SETOF                     20
     C                     END
     C*
     C                     SETON                     212223
     C           DATA1     IFEQ '1'
     C                     SETOF                     21
     C                     SETON                     2223
     C                     ELSE
     C           DATA1     IFEQ '2'
     C                     SETOF                     22
     C                     SETON                     2123
     C                     ELSE
     C           DATA1     IFEQ '3'
     C                     SETOF                     23
     C                     SETON                     2122
     C                     END
     C                     END
     C                     END
     C*                    WRITEPH1
     C*                    SETON                         10
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....CHAIN DATA
      *==============================================================*
02===C           RTN100    BEGSR
| 02*C*產品
|   C           WF5402    CHAINMA0                  40
     C           *IN40     IFEQ '1'
     C                     MOVEL*BLANKS   WF5402
     C                     MOVEL*BLANKS   MA03
     C                     END
     C*公司名稱
     C           WF5401    CHAIN#B0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #B03
| 01-C                     END
     C*
     C                     EXSR RTN900
     C                     WRITEPD1
     C*
     C                     ADD  WF5403    CT03
     C*                    ADD  WF5404    CT04
     C                     ADD  WF5405    CT05
     C                     ADD  WF5407    CT07
     C                     ADD  WF5408    CT08
     C                     ADD  WF5409    CT09
     C                     ADD  WF5410    CT10
     C*
     C                     ADD  WF5403    TT03
     C*                    ADD  WF5404    TT04
     C                     ADD  WF5405    TT05
     C                     ADD  WF5407    TT07
     C                     ADD  WF5408    TT08
     C                     ADD  WF5409    TT09
     C                     ADD  WF5410    TT10
     C                     SETON                     31
02===C                     ENDSR
      *==============================================================*
      *          RTNL1  ...NOT THE SANE COMPANY
      *==============================================================*
06===C           RTNL1     BEGSR
     C                     SETOF                     31
     C                     EXSR RTN900
     C                     WRITEPD2
     C                     Z-ADD0         CT03
     C*                    Z-ADD0         CT04
     C                     Z-ADD0         CT05
     C                     Z-ADD0         CT07
     C                     Z-ADD0         CT08
     C                     Z-ADD0         CT09
     C                     Z-ADD0         CT10
     C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW --
      *==============================================================*
06===C           RTN900    BEGSR
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     SETON                     10
     C                     SETOF                     39
     C                     END
     C           *IN39     IFEQ '1'
|    C                     WRITEPE1
|    C                     WRITEPH1
     C                     SETOF                     39
     C                     END
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTNLR ....END
      *==============================================================*
06===C*          RTNLR     BEGSR
|    C*
|    C*                    WRITEPD3
|    C*                    WRITEPE2
|    C*
06===C*                    ENDSR
08===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
     C                     EXSR RTN010
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01*C                     ELSE
|    C                     EXSR RTN900
|   C                     WRITEPD3
| 01-C                     END
|    C                     WRITEPE2
|    C*
08===C                     ENDSR
