      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0451                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :客戶銷售統計表                               *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FRES18WF IF  E           K        DISK                           UC
     FSOSDPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FREWF15  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
B2MODI                                      675 683 DSC04S
B2MODI                                      685 693 DSC04E
      *MM/YY
     I                                      611 6140DSC39
     I                                      611 6120DSC39M
     I                                      613 6140DSC39Y
      *YY/MM--------------------------------------------------------
      *本年月
B2MODI                                      615 6200SC39E
B2MODI                                      615 6180SC39EY
B2MODI                                      619 6200SC39EM
      *螢幕上年下月
B2MODI                                      621 6260SC39S
B2MODI                                      621 6240SC39SY
B2MODI                                      625 6260SC39SM
      *
B2MODI                                      627 627 DSEL
B2MODI                                      655 663 DSD03S
B2MODI                                      664 672 DSD03E
B2MODI                                      705 7080DSC08
B2MODI                                      705 7060DSC08M
B2MODI                                      707 7080DSC08Y
B2MODI                                      709 709 DSEL1
B2MODI                                      754 754 IN20
     I            DS
B2MODI                                        1   60YM01
B2MODI                                        1   40YY01
B2MODI                                        5   60MM01
     I            DS
B2MODI                                        1   60YM02
B2MODI                                        1   40YY02
B2MODI                                        5   60MM02
     I            DS
B2MODI                                        1   60YM03
B2MODI                                        1   40YY03
B2MODI                                        5   60MM03
     I            DS
B2MODI                                        1   60YM04
B2MODI                                        1   40YY04
B2MODI                                        5   60MM04
     I            DS
B2MODI                                        1   60YM05
B2MODI                                        1   40YY05
B2MODI                                        5   60MM05
     I            DS
B2MODI                                        1   60YM06
B2MODI                                        1   40YY06
B2MODI                                        5   60MM06
     I            DS
B2MODI                                        1   60YM07
B2MODI                                        1   40YY07
B2MODI                                        5   60MM07
     I            DS
B2MODI                                        1   60YM08
B2MODI                                        1   40YY08
B2MODI                                        5   60MM08
     I            DS
B2MODI                                        1   60YM09
B2MODI                                        1   40YY09
B2MODI                                        5   60MM09
     I            DS
B2MODI                                        1   60YM10
B2MODI                                        1   40YY10
B2MODI                                        5   60MM10
     I            DS
B2MODI                                        1   60YM11
B2MODI                                        1   40YY11
B2MODI                                        5   60MM11
     I            DS
B2MODI                                        1   60YM12
B2MODI                                        1   40YY12
B2MODI                                        5   60MM12
     I            DS
B2MODI                                        1   80DATES
B2MODI                                        1   60DATEYM
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF1505    WORK05
     C           *LIKE     DEFN WF1506    WORK06
     C           *LIKE     DEFN WF1507    WORK07
     C           *LIKE     DEFN WF1508    WORK08
     C           *LIKE     DEFN WF1509    WORK09
     C           *LIKE     DEFN WF1510    WORK10
     C           *LIKE     DEFN WF1511    WORK11
     C           *LIKE     DEFN WF1512    WORK12
     C           *LIKE     DEFN WF1513    WORK13
     C           *LIKE     DEFN WF1514    WORK14
     C           *LIKE     DEFN WF1515    WORK15
     C           *LIKE     DEFN WF1516    WORK16
     C           *LIKE     DEFN WF1517    WORK17
     C           *LIKE     DEFN WF1518    WORK18
     C           *LIKE     DEFN WF1519    WORK19
     C           *LIKE     DEFN WF1520    WORK20
     C           *LIKE     DEFN WF1521    WORK21
     C           *LIKE     DEFN WF1522    WORK22
     C           *LIKE     DEFN WF1523    WORK23
     C           *LIKE     DEFN WF1524    WORK24
     C           *LIKE     DEFN WF1525    WORK25
     C           *LIKE     DEFN WF1526    WORK26
     C           *LIKE     DEFN WF1527    WORK27
     C           *LIKE     DEFN WF1528    WORK28
     C           *LIKE     DEFN MA41      WAMT
B2000C           *LIKE     DEFN SC08      WSC08
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF1501
     C                     KFLD           WF1502
     C                     KFLD           WF1504
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100
     C*分析方式－禮盒(A)
  01-C           DSEL      IFEQ 'A'
    C                     EXSR RTN200
  01-C                     END
     C*
     C*分析方式－單瓶(B)需拆解禮盒為單瓶
  02-C           DSEL      IFEQ 'B'
    C                     EXSR RTN400
  02-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....INIT.
      *==============================================================*
01===C           RTN100    BEGSR
|    C*GET一年之區間月份
B2000C                     Z-ADDSC39SY    YY01
|    C                     Z-ADDSC39SM    MM01
B2000C                     Z-ADDSC39EY    YY12
|    C                     Z-ADDSC39EM    MM12
|    C                     Z-ADD0         YM02
|    C                     Z-ADD0         YM03
|    C                     Z-ADD0         YM04
|    C                     Z-ADD0         YM05
|    C                     Z-ADD0         YM06
|    C                     Z-ADD0         YM07
|    C                     Z-ADD0         YM08
|    C                     Z-ADD0         YM09
|    C                     Z-ADD0         YM10
|    C                     Z-ADD0         YM11
|    C*
|    C           MM01      ADD  1         MM02
| 03-C           MM02      IFGT 12
|   C                     SUB  12        MM02
B2CHKC           YY01      ADD  1         YY02
| 03*C                     ELSE
B2000C                     Z-ADDYY01      YY02
| 03-C                     END
|    C*
|    C           MM01      ADD  2         MM03
| 04-C           MM03      IFGT 12
|   C                     SUB  12        MM03
B2CHKC           YY01      ADD  1         YY03
| 04*C                     ELSE
B2000C                     Z-ADDYY01      YY03
| 04-C                     END
|    C*
|    C           MM01      ADD  3         MM04
| 05-C           MM04      IFGT 12
|   C                     SUB  12        MM04
B2CHKC           YY01      ADD  1         YY04
| 05*C                     ELSE
B2000C                     Z-ADDYY01      YY04
| 05-C                     END
|    C*
|    C           MM01      ADD  4         MM05
| 06-C           MM05      IFGT 12
|   C                     SUB  12        MM05
B2CHKC           YY01      ADD  1         YY05
| 06*C                     ELSE
B2000C                     Z-ADDYY01      YY05
| 06-C                     END
|    C*
|    C           MM01      ADD  5         MM06
| 07-C           MM06      IFGT 12
|   C                     SUB  12        MM06
B2CHKC           YY01      ADD  1         YY06
| 07*C                     ELSE
B2000C                     Z-ADDYY01      YY06
| 07-C                     END
|    C*
|    C           MM01      ADD  6         MM07
| 08-C           MM07      IFGT 12
|   C                     SUB  12        MM07
B2CHKC           YY01      ADD  1         YY07
| 08*C                     ELSE
B2000C                     Z-ADDYY01      YY07
| 08-C                     END
|    C*
|    C           MM01      ADD  7         MM08
| 09-C           MM08      IFGT 12
|   C                     SUB  12        MM08
B2CHKC           YY01      ADD  1         YY08
| 09*C                     ELSE
B2000C                     Z-ADDYY01      YY08
| 09-C                     END
|    C*
|    C           MM01      ADD  8         MM09
| 10-C           MM09      IFGT 12
|   C                     SUB  12        MM09
B2CHKC           YY01      ADD  1         YY09
| 10*C                     ELSE
B2000C                     Z-ADDYY01      YY09
| 10-C                     END
|    C*
|    C           MM01      ADD  9         MM10
| 11-C           MM10      IFGT 12
|   C                     SUB  12        MM10
B2CHKC           YY01      ADD  1         YY10
| 11*C                     ELSE
B2000C                     Z-ADDYY01      YY10
| 11-C                     END
|    C*
|    C           MM01      ADD  10        MM11
| 12-C           MM11      IFGT 12
|   C                     SUB  12        MM11
B2CHKC           YY01      ADD  1         YY11
| 12*C                     ELSE
B2000C                     Z-ADDYY01      YY11
| 12-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....月銷售數量及金額
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
|   C*
|   C                     MOVE 'Y'       MYN     1
| 02-C           DSEL1     IFEQ '1'
|   C           DSEL1     OREQ '2'
| 03-C           SC03      IFEQ 'S4'
|   C                     MOVE 'N'       MYN     1
| 03-C                     END
| 02-C                     END
| 04-C           MYN       IFEQ 'Y'
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 05-C           *IN46     DOWEQ'0'
| 06-C           SD03      IFGE DSD03S
|   C           SD03      ANDLEDSD03E
|   C                     MOVELSC04      WF1501
|   C                     MOVELSC05      WF1502
|   C                     MOVELSD03      WF1504
|   C           KEYWF     CHAINWF150                40
|   C                     MOVELSD03      WF1503
|   C                     EXSR RTN300
| 06-C                     END
|   C           SC02      READESD0                      46
| 05-C                     END
| 04-C                     END
|   C*
|   C                     READ SC0                      45
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWF15
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C                     Z-ADD0         WORK05
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C                     Z-ADD0         WORK08
|    C                     Z-ADD0         WORK09
|    C                     Z-ADD0         WORK10
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK12
|    C                     Z-ADD0         WORK13
|    C                     Z-ADD0         WORK14
|    C                     Z-ADD0         WORK15
|    C                     Z-ADD0         WORK16
|    C                     Z-ADD0         WORK17
|    C                     Z-ADD0         WORK18
|    C                     Z-ADD0         WORK19
|    C                     Z-ADD0         WORK20
|    C                     Z-ADD0         WORK21
|    C                     Z-ADD0         WORK22
|    C                     Z-ADD0         WORK23
|    C                     Z-ADD0         WORK24
|    C                     Z-ADD0         WORK25
|    C                     Z-ADD0         WORK26
|    C                     Z-ADD0         WORK27
|    C                     Z-ADD0         WORK28
|    C*
| 01-C           IN20      IFEQ '0'
B2000C                     Z-ADDSC08      DATES
| 01*C                     ELSE
B2000C                     Z-ADDSC39      DATES
| 01-C                     END
|    C*
B2000C           DATEYM    IFEQ YM01
|   C*累計數量
|   C                     Z-ADDSD04      WORK05
|   C*累計金額
|   C                     Z-ADDSD07      WORK06
|   C*累計搭贈數量
| 03-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK05
| 03-C                     END
| 02-C                     END
|    C*
B2000C           DATEYM    IFEQ YM02
|   C*累計數量
|   C                     Z-ADDSD04      WORK07
|   C*累計金額
|   C                     Z-ADDSD07      WORK08
| 05-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK07
| 05-C                     END
| 04-C                     END
|    C*
B2000C           DATEYM    IFEQ YM03
|   C*累計數量
|   C                     Z-ADDSD04      WORK09
|   C*累計金額
|   C                     Z-ADDSD07      WORK10
| 06-C                     END
| 07-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK09
| 07-C                     END
|    C*
B2000C           DATEYM    IFEQ YM04
|   C*累計數量
|   C                     Z-ADDSD04      WORK11
|   C*累計金額
|   C                     Z-ADDSD07      WORK12
| 09-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK11
| 09-C                     END
| 08-C                     END
|    C*
B2000C           DATEYM    IFEQ YM05
|   C*累計數量
|   C                     Z-ADDSD04      WORK13
|   C*累計金額
|   C                     Z-ADDSD07      WORK14
| 11-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK13
| 11-C                     END
| 10-C                     END
|    C*
B2000C           DATEYM    IFEQ YM06
|   C*累計數量
|   C                     Z-ADDSD04      WORK15
|   C*累計金額
|   C                     Z-ADDSD07      WORK16
| 13-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK15
| 13-C                     END
| 12-C                     END
|    C*
B2000C           DATEYM    IFEQ YM07
|   C*累計數量
|   C                     Z-ADDSD04      WORK17
|   C*累計金額
|   C                     Z-ADDSD07      WORK18
| 15-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK17
| 15-C                     END
| 14-C                     END
|    C*
B2000C           DATEYM    IFEQ YM08
|   C*累計數量
|   C                     Z-ADDSD04      WORK19
|   C*累計金額
|   C                     Z-ADDSD07      WORK20
| 17-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK19
| 17-C                     END
| 16-C                     END
|    C*
B2000C           DATEYM    IFEQ YM09
|   C*累計數量
|   C                     Z-ADDSD04      WORK21
|   C*累計金額
|   C                     Z-ADDSD07      WORK22
| 19-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK21
| 19-C                     END
| 18-C                     END
|    C*
B2000C           DATEYM    IFEQ YM10
|   C*累計數量
|   C                     Z-ADDSD04      WORK23
|   C*累計金額
|   C                     Z-ADDSD07      WORK24
| 21-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK23
| 21-C                     END
| 20-C                     END
|    C*
B2000C           DATEYM    IFEQ YM11
|   C*累計數量
|   C                     Z-ADDSD04      WORK25
|   C*累計金額
|   C                     Z-ADDSD07      WORK26
| 23-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK25
| 23-C                     END
| 22-C                     END
|    C*
B2000C           DATEYM    IFEQ YM12
|   C*累計數量
|   C                     Z-ADDSD04      WORK27
|   C*累計金額
|   C                     Z-ADDSD07      WORK28
| 25-C           DSEL1     IFEQ '2'
|   C           DSEL1     OREQ '4'
|   C                     ADD  SD05      WORK27
| 25-C                     END
| 24-C                     END
|    C*
| 26-C           *IN40     IFEQ '0'
|   C                     ADD  WORK05    WF1505
|   C                     ADD  WORK06    WF1506
|   C                     ADD  WORK07    WF1507
|   C                     ADD  WORK08    WF1508
|   C                     ADD  WORK09    WF1509
|   C                     ADD  WORK10    WF1510
|   C                     ADD  WORK11    WF1511
|   C                     ADD  WORK12    WF1512
|   C                     ADD  WORK13    WF1513
|   C                     ADD  WORK14    WF1514
|   C                     ADD  WORK15    WF1515
|   C                     ADD  WORK16    WF1516
|   C                     ADD  WORK17    WF1517
|   C                     ADD  WORK18    WF1518
|   C                     ADD  WORK19    WF1519
|   C                     ADD  WORK20    WF1520
|   C                     ADD  WORK21    WF1521
|   C                     ADD  WORK22    WF1522
|   C                     ADD  WORK23    WF1523
|   C                     ADD  WORK24    WF1524
|   C                     ADD  WORK25    WF1525
|   C                     ADD  WORK26    WF1526
|   C                     ADD  WORK27    WF1527
|   C                     ADD  WORK28    WF1528
|   C*
|   C                     UPDATWF150
| 26*C                     ELSE
|   C                     Z-ADDWORK05    WF1505
|   C                     Z-ADDWORK06    WF1506
|   C                     Z-ADDWORK07    WF1507
|   C                     Z-ADDWORK08    WF1508
|   C                     Z-ADDWORK09    WF1509
|   C                     Z-ADDWORK10    WF1510
|   C                     Z-ADDWORK11    WF1511
|   C                     Z-ADDWORK12    WF1512
|   C                     Z-ADDWORK13    WF1513
|   C                     Z-ADDWORK14    WF1514
|   C                     Z-ADDWORK15    WF1515
|   C                     Z-ADDWORK16    WF1516
|   C                     Z-ADDWORK17    WF1517
|   C                     Z-ADDWORK18    WF1518
|   C                     Z-ADDWORK19    WF1519
|   C                     Z-ADDWORK20    WF1520
|   C                     Z-ADDWORK21    WF1521
|   C                     Z-ADDWORK22    WF1522
|   C                     Z-ADDWORK23    WF1523
|   C                     Z-ADDWORK24    WF1524
|   C                     Z-ADDWORK25    WF1525
|   C                     Z-ADDWORK26    WF1526
|   C                     Z-ADDWORK27    WF1527
|   C                     Z-ADDWORK28    WF1528
|   C                     WRITEWF150
| 26-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN400....禮盒單瓶牌價計算數量及金額
      *==============================================================*
04===C           RTN400    BEGSR
|    C*
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
|   C*
|   C                     MOVE 'Y'       MYN     1
| 02-C           DSEL1     IFEQ '1'
|   C           DSEL1     OREQ '2'
| 03-C           SC03      IFEQ 'S4'
|   C                     MOVE 'N'       MYN     1
| 03-C                     END
| 02-C                     END
| 04-C           MYN       IFEQ 'Y'
B2CHKC           SC08      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2000C                     Z-ADDSC08      WSC08
| 05*C                     ELSE
B2000C                     Z-ADDSC07      WSC08
| 05-C                     END
|   C*
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 06-C           *IN46     DOWEQ'0'
| 07-C           SD03      IFGE DSD03S
|   C           SD03      ANDLEDSD03E
|   C           SD03      CHAINMA0                  40
|   C*禮盒碼
| 08-C           MA54      IFEQ 'Y'
|   C                     EXSR RTN500
|   C                     OPEN RES18WF
|   C                     EXSR RTN600
|   C                     CLOSERES18WF
|   C*ELSE非禮盒處理同禮盒處禮DSEL='A'
| 08*C                     ELSE
|   C                     MOVELSC04      WF1501
|   C                     MOVELSC05      WF1502
|   C                     MOVELSD03      WF1504
|   C           KEYWF     CHAINWF150                40
|   C                     MOVELSD03      WF1503
|   C                     EXSR RTN300
|   C*
| 08-C                     END
| 07-C                     END
|   C*
|   C           SC02      READESD0                      46
| 06-C                     END
| 04-C                     END
|   C*
|   C                     READ SC0                      45
| 01-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN500....禮盒單瓶牌價
      *==============================================================*
05===C           RTN500    BEGSR
      *禮盒拆解為產品
|    C                     CALL 'RES018'
|    C                     PARM SD03      S08I1   9        禮盒代號
      *若不為訂單則為空白
|    C                     PARM SD02      S08I2  12        訂單號碼
B2MODC                     PARM SC07      S08I3   80       牌價判斷日
|    C                     PARM SD04      S08I4   60       禮盒訂購數量
|    C                     PARM SD05      S08I5   60       禮盒搭贈數量
|    C                     PARM SD06      S08I6   92       禮盒金額
      *部份－單位成本
|    C                     PARM SD10      S08I7   92       禮盒成本FOB
|    C                     PARM SD11      S08I8   92       禮盒成本FHI
|    C                     PARM SD12      S08I9   92       禮盒成本DUTY
      *部份－單位成本－中間
|    C                     PARM SD22      S08IA   92       禮盒轉帳成本FOB
|    C                     PARM SD23      S08IB   92       禮盒轉帳成本FHI
|    C                     PARM SD24      S08IC   92       禮盒轉帳成本DUTY
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN600....WRITE OR UPDATE REWF69
      *==============================================================*
06===C           RTN600    BEGSR
|    C*
|    C                     MOVELSC04      WF1501
|    C                     MOVELSC05      WF1502
|    C           *LOVAL    SETLLRE18R
|    C                     READ RE18R                    46
| 01-C           *IN46     DOWEQ'0'
|   C                     MOVELR181      WF1503
|   C                     MOVELR181      WF1504
|   C                     Z-ADDR182      SD04
|   C                     Z-ADDR183      SD05
|   C                     Z-ADDR184      SD07
|   C           KEYWF     CHAINWF150                40
|   C                     EXSR RTN300
|   C                     READ RE18R                    46
| 01-C                     END
|    C           *LOVAL    SETLLRE18R
|    C*
06===C                     ENDSR
