      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR054                                        *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :專櫃產品銷售排行榜                           *
      ****************************************************************
     FSAR054D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 605 DSC04S
     I                                      606 610 DSC04E
      *MM/DD/YY
     I                                      611 6140DSC39S
     I                                      611 6120DS39MS
     I                                      613 6140DS39YS
     I                                      621 6240DSC39E
     I                                      621 6220DS39ME
     I                                      623 6240DS39YE
      *YY/MM/DD
     I                                      615 6180SC39S
     I                                      615 6160S39YS
     I                                      617 6180S39MS
     I                                      625 6280SC39E
     I                                      625 6260S39YE
     I                                      627 6280S39ME
      *
     I                                      619 619 DOPT
     I*專櫃品牌
     I                                      631 632 D#A02S
     I                                      641 642 D#A02E
M001AI*(YYYY/MM/DD)
M001AI                                      850 855 YMD8S
M001AI                                      858 863 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         SC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         SC39E
|    C                     MOVE *BLANK    D#A02S
|    C                     MOVE *BLANK    D#A02E
|    C                     MOVE *BLANK    DOPT
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *
|    C*客戶代號
| 01-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 01-C                     END
|    C*
| 02-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 02-C                     END
|    C*
| 03-C           DSC04S    IFGT DSC04E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-日期
| 04-C           DSC39S    IFEQ 0
|   C                     SETON                     629599
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C                     Z-ADDDS39YS    S39YS
|    C                     Z-ADDDS39MS    S39MS
| 05-C           S39MS     IFGT 12
|   C           S39MS     ORLT 1
|   C                     SETON                     629399
| 05-C                     END
|    C*****
| 06-C           DSC39E    IFEQ 0
|   C                     SETON                     639599
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C                     Z-ADDDS39YE    S39YE
|    C                     Z-ADDDS39ME    S39ME
| 07-C           S39ME     IFGT 12
|   C           S39ME     ORLT 1
|   C                     SETON                     639399
| 07-C                     END
|    C   99                GOTO END100
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE SC39S     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8S
|    C*
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE SC39E     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 19-C                     END
|    C   99                GOTO END100
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*區域查詢
| 02-C           D#ROW     IFEQ 10
| 03-C           D#COL     IFGE 40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS112'
|   C                     PARM           D#A02S
|   C                     GOTO ENDF4
| 03-C                     END
| 04-C           D#COL     IFGE 45
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS112'
|   C                     PARM           D#A02E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|   C*
|   C           *NAMVAR   DEFN *LDA      LDA
|   C                     OUT  *NAMVAR
|   C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
