      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR046                                        *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * UPDATE DATE  : 05/23/94  AN MING HSIA                        *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :客戶銷售統計表                               *
      ****************************************************************
     FSAR046D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I*MM//YY
     I                                      611 6140DSC39
     I                                      611 6120DSC39M
     I                                      613 6140DSC39Y
     I*YY/MM--------------------------------------------------------
     I*本年月
     I                                      615 6180SC39E
     I                                      615 6160SC39EY
     I                                      617 6180SC39EM
     I*螢幕上年下月
     I                                      619 6220SC39S
     I                                      619 6200SC39SY
     I                                      621 6220SC39SM
     I*
     I                                      623 623 DSEL
     I                                      624 624 COMP
     I                                      625 625 DSC33S
     I                                      626 626 DSC33E
     I                                      627 628 DSC34S
     I                                      629 630 DSC34E
     I                                      631 632 DSC31S
     I                                      633 634 DSC31E
     I                                      651 659 DSD03S
     I                                      660 668 DSD03E
     I                                      671 679 DSC04S
     I                                      681 689 DSC04E
     I                                      710 715 DSC27S
     I                                      716 721 DSC27E
     I                                      701 7040DSC08
     I                                      701 7020DSC08M
     I                                      703 7040DSC08Y
     I                                      705 705 DSEL1
     I                                      750 750 IN20
     I                                      751 751 COMPS
     I                                      752 752 COMPE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE ' '       COMP
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC31S
|    C                     MOVE *BLANK    DSC31E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DSC27S
|    C                     MOVE *BLANK    DSC27E
|    C                     Z-ADD0         DSC08
|    C                     Z-ADD0         DSC39
|    C                     Z-ADD0         SC39E
|    C                     Z-ADD0         SC39S
|    C                     MOVE 'A'       DSEL
|    C                     MOVE '1'       DSEL1
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
     C*
|    C*辦事處
| 01-C           COMP      IFEQ *BLANK
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
     C                     ELSE
     C                     MOVELCOMP      COMPS
     C                     MOVELCOMP      COMPE
| 01-C                     END
|    C*
|    C*通路
| 01-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 01-C                     END
|    C*
| 02-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 02-C                     END
|    C*
| 03-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*型態
| 01-C           DSC34S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC34S
| 01-C                     END
|    C*
| 02-C           DSC34E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC34E
| 02-C                     END
|    C*
| 03-C           DSC34S    IFGT DSC34E
|   C                     SETON                     6364
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*地區
| 01-C           DSC31S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC31S
| 01-C                     END
|    C*
| 02-C           DSC31E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC31E
| 02-C                     END
|    C*
| 03-C           DSC31S    IFGT DSC31E
|   C                     SETON                     6566
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*客戶
| 01-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 01-C                     END
|    C*
| 02-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 02-C                     END
|    C*
| 03-C           DSC04S    IFGT DSC04E
|   C                     SETON                     6768
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*產品
| 04-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 04-C                     END
|    C*
| 05-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 05-C                     END
|    C*
| 06-C           DSD03S    IFGT DSD03E
|   C                     SETON                     6970
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C*業務員代號
| 01-C           DSC27S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC27S
| 01-C                     END
|    C*
| 02-C           DSC27E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC27E
| 02-C                     END
|    C*
| 03-C           DSC27S    IFGT DSC27E
|   C                     SETON                     7475
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*送貨日期或確認日期只輸入一項
| 07-C           DSC08     IFNE 0
|   C           DSC39     ANDNE0
|   C                     SETON                     728999
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 08-C           DSC39     IFNE 0
     C*
| 09-C           DSC39M    IFGT 12
|   C           DSC39M    ORLT 1
|   C                     SETON                     719399
| 09-C                     END
|   C   99                GOTO END100
|   C                     MOVE '1'       IN20
|   C*
|   C*(CHANGE TO CHINESE DATE)
     C*本年月YY/MM
|   C                     Z-ADDDSC39Y    SC39EY
|   C                     Z-ADDDSC39M    SC39EM
| 08*C                     ELSE
     C*
| 10-C           DSC08M    IFGT 12
|   C           DSC08M    ORLT 1
|   C                     SETON                     729399
| 10-C                     END
|   C   99                GOTO END100
|   C                     MOVE '0'       IN20
|   C*
|   C*(CHANGE TO CHINESE DATE)
     C*本年月YY/MM
|   C                     Z-ADDDSC08Y    SC39EY
|   C                     Z-ADDDSC08M    SC39EM
| 08-C                     END
     C*去年下月OR本年一月
|    C           SC39EM    ADD  1         SC39SM
| 11-C           SC39SM    IFEQ 13
|   C                     Z-ADD1         SC39SM
|   C                     Z-ADDSC39EY    SC39SY
| 11*C                     ELSE
|   C           SC39EY    SUB  1         SC39SY
| 11-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|   C*通路
| 02-C           D#ROW     IFEQ 5
|   C           D#COL     ANDEQ30
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 5
|   C           D#COL     ANDEQ42
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*型態
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     IFGE 30
|   C           D#COL     ANDLE31
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33   1
|   C           DSC34S    PARM DSC34S    PSC34   2
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#COL     IFGE 42
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33
|   C           DSC34E    PARM DSC34E    PSC34
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*地區
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE30
|   C           D#COL     ANDLE31
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE42
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31E
|   C                     GOTO ENDF4
| 02-C                     END
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*客戶
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     IFGE 30
|   C           D#COL     ANDLE38
     C*                    MOVELDSC04S    P003O1
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04S
|   C*                    PARM           P003O1  9
     C*                    MOVELP003O1    DSC04S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 42
|   C           D#COL     ANDLE50
     C*                    MOVELDSC04E    P003O1
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04E
|   C*                    PARM           P003O1
     C*                    MOVELP003O1    DSC04E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 03-C                     END
|   C*產品
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE30
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE42
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE31
|   C           D#COL     ANDLE32
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 04-C                     END
|   C*業務員代號
| 02-C           D#ROW     IFEQ 10
|   C           D#COL     IFGE 30
|   C           D#COL     ANDLE35
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 42
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 03-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
