      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : MSOR0531                                      *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 03/03/95                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :專櫃產品毛利率表　　　                       *
      ****************************************************************
     FSOCDPF  IP  E           K        DISK
     F*TMAPF  IF  E           K        DISK
     FREWFB9  UF  E           K        DISK                      A
     ICD0
     I                                              CD04  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DPH06S
     I                                      601 601 DPH06A
     I                                      606 610 DPH06E
     I                                      606 606 DPH06B
     I                                      611 619 DPI04S
     I                                      611 611 DPI04A
     I                                      621 629 DPI04E
     I                                      621 621 DPI04B
     I                                      631 635 DPH05S
     I                                      631 631 DPH05A
     I                                      636 640 DPH05E
     I                                      636 636 DPH05B
     I*MM/YY
     I                                      641 6440DPH04S
     I                                      641 6420MMS
     I                                      643 644 YYS
     I                                      645 6480DPH04E
     I                                      645 6460MME
     I                                      643 644 YYE
     I*(YY/MM)
     I                                      651 6540YPH04S
     I                                      655 6580YPH04E
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WFB901
     C                     KFLD           WFB902
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *IN10     IFEQ '0'
     C                     EXSR RTN010
     C                     END
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CLR                   SETON                     LR
      *==============================================================*
      *          RTN010....INITIAL
      *==============================================================*
01===C           RTN010    BEGSR
|    C                     Z-ADD0         WORK01  90
|    C                     SETOF                     20
|    C                     SETON                     10
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     ADD  CD25      WORK01
|    C*
02===C                     ENDSR
     C*
      *==============================================================*
      *          RTN200....POPHPF
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
     C           *LOVAL    SETLLWFB90
|    C                     READ WFB90                    42
| 01-C           *IN42     DOWEQ'0'
| 02-C           CD04      IFEQ WFB902
| 03-C           *IN20     IFEQ '0'
|   C                     Z-ADDWORK01    WFB906
|   C                     UPDATWFB90
|   C                     SETON                     20    *UPDAT FLAG
| 03*C                     ELSE
|   C                     Z-ADD0         WFB906
|   C                     UPDATWFB90
| 03-C                     END
| 02-C                     END
|   C                     READ WFB90                    42
| 01-C                     END
|    C*同期無採購資料時
| 04-C           *IN20     IFEQ '0'
|   C                     MOVEL*BLANKS   WFB901
|   C                     MOVELCD04      WFB902
|   C                     Z-ADD0         WFB903
|   C                     Z-ADD0         WFB904
|   C                     Z-ADD0         WFB905
|   C                     Z-ADDWORK01    WFB906
|   C           KEYWF     CHAINWFB90                45
| 05-C           *IN45     IFEQ '1'
|   C                     WRITEWFB90
| 05-C                     END
| 04-C                     END
|    C*
|    C                     EXSR RTN010
|    C*
03===C                     ENDSR
