      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0541                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :專櫃產品銷售排行榜                           *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FMTMGLF1 IF  E           K        DISK
     FREWF24  UF  E           K        DISK                      A
     E*                    MA         10  9
     E*                    CNT        10  5 0
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DSC04S
     I                                      606 610 DSC04E
      *MM/DD/YY
     I                                      611 6140DSC39S
     I                                      611 6120DS39MS
     I                                      613 6140DS39YS
     I                                      621 6240DSC39E
     I                                      621 6220DS39ME
     I                                      623 6240DS39YE
      *YY/MM/DD
     I                                      615 6180WSC39S
     I                                      615 6160WS39YS
     I                                      617 6180WS39MS
     I                                      615 6180WSC39E
     I                                      615 6160WS39YE
     I                                      617 6180WS39ME
      *
     I                                      619 619 DOPT
     I*專櫃品牌
     I                                      631 632 D#A02S
     I                                      641 642 D#A02E
     I            DS
B2MODI                                        1   80SC39
B2MODI                                        1   60SC39YM
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF2404    WORK24
     C           *LIKE     DEFN WF2405    WORK04
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF2401
     C                     KFLD           WF2402
     C                     KFLD           WF2403
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *分析方式－禮盒(A)
     C                     EXSR RTN200
     C                     SETON                     LR
      *==============================================================*
      *          RTN200....月銷售數量及金額
      *==============================================================*
01===C           RTN200    BEGSR
|    C*
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 02-C           *IN46     DOWEQ'0'
|   C* SELECT部門別
|   C           SD03      CHAINMG0                  47
| 03-C           MG03      IFGE D#A02S
|   C           MG03      ANDLED#A02E
|   C                     MOVELSC04      WF2401
|   C                     MOVELSD03      WF2402
|   C                     MOVELSD03      WF2403
|   C           KEYWF     CHAINWF240                40
|   C                     EXSR RTN300
| 03-C                     END
|   C           SC02      READESD0                      46
| 02-C                     END
|   C*
|   C                     READ SC0                      45
| 01-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWF24
      *==============================================================*
02===C           RTN300    BEGSR
|    C*數量
|    C                     Z-ADD0         WORK24
|    C                     Z-ADDSD04      WORK24
|    C******
|    C                     Z-ADD0         WORK04
|    C                     Z-ADD0         WORK
|    C                     Z-ADD0         WORK1
|    C                     Z-ADD0         WORK2
|    C*訂購＋搭贈WORK1
|    C           SD04      ADD  SD05      WORK   172
|    C*單位成本WORK1
|    C           SD10      ADD  SD11      WORK1  172
|    C                     ADD  SD12      WORK1
|    C           WORK      MULT WORK1     WORK2  172
|    C*銷貨毛利
|    C           SD07      SUB  WORK2     WORK04
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  WORK24    WF2404
|   C                     ADD  WORK04    WF2405
|   C                     ADD  SD07      WF2407
|   C                     ADD  WORK2     WF2408
|   C                     UPDATWF240
| 01*C                     ELSE
|   C                     Z-ADDWORK24    WF2404
|   C                     Z-ADDWORK04    WF2405
|   C                     Z-ADDSD07      WF2407
|   C                     Z-ADDWORK2     WF2408
|   C                     WRITEWF240
| 01-C                     END
|    C*
02===C                     ENDSR
