     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.12  Y2K MODIFY                    */
     /*=============================================================*/
     FREW104  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSAR075P O   E             39     PRINTER
     E*
     IWF870
     I                                              WF870AL3
     I                                              WF8701L2
     I                                              WF870BL1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *辦事處
     I                                      600 600 COMP
     I                                      601 601 COMPS
     I                                      602 602 COMPE
      *通路
     I                                      603 603 DSC33S
     I                                      604 604 DSC33E
      *型態
     I                                      607 608 DSC34S
     I                                      609 610 DSC34E
      *客戶代號
     I                                      611 615 DSC04S
     I                                      616 620 DSC04E
      *產品組別
     I                                      621 621 DMA11
     I                                      622 622 DMA11S
     I                                      623 623 DMA11E
      *產品代號
     I                                      630 638 DSD03S
     I                                      640 648 DSD03E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      650 6550YMDS
M001AI                                      771 7780YMD8S
     I                                      650 6510YS
     I                                      650 6530YMS
     I                                      652 6530MS
     I                                      652 6550MDS
     I                                      656 6610YMDE
M001AI                                      781 7880YMD8E
     I                                      656 6570YE
     I                                      656 6590YME
     I                                      658 6610MDE
     I                                      662 6670DSC08S
     I                                      668 6730DSC08E
     I                                      674 6790DSC39S
     I                                      680 6850DSC39E
     I                                      686 689 DSC28S
     I                                      691 694 DSC28E
     I                                      700 700 DSEL
     I                                      701 701 IN20
     I*去年同期
M001MI*                                     711 7160LYMDS
M001MI*                                     711 7120LYS
M001MI*                                     713 7160LMDS
M001MI*                                     721 7260LYMDE
M001MI*                                     721 7220LYE
M001MI*                                     723 7260LMDE
M001MI                                      713 7180LYMDS
M001MI                                      711 7140LYS
M001MI                                      715 7180LMDS
M001MI                                      723 7280LYMDE
M001MI                                      721 7240LYE
M001MI                                      725 7280LMDE
     I*上月
M001MI*                                     731 7360AYMDS
M001MI*                                     731 7340AYMS
M001MI*                                     731 7320AYS
M001MI*                                     733 7340AMS
M001MI*                                     735 7360ADS
M001MI*                                     741 7460AYMDE
M001MI*                                     741 7440AYME
M001MI*                                     741 7420AYE
M001MI*                                     743 7440AME
M001MI*                                     745 7460ADE
M001MI                                      733 7380AYMDS
M001MI                                      731 7360AYMS
M001MI                                      731 7340AYS
M001MI                                      735 7360AMS
M001MI                                      737 7380ADS
M001MI                                      743 7480AYMDE
M001MI                                      741 7460AYME
M001MI                                      741 7440AYE
M001MI                                      745 7460AME
M001MI                                      747 7480ADE
     I*YTD
M001MI*                                     751 7560TYMDS
M001MI*                                     751 7520TYS
M001MI*                                     753 7540TMS
M001MI*                                     753 7560TMDS
M001MI*                                     761 7660TYMDE
M001MI                                      753 7580TYMDS
M001MI                                      751 7540TYS
M001MI                                      755 7560TMS
M001MI                                      755 7580TMDS
M001MI                                      763 7680TYMDE
     I            DS
     I                                        1   9 WF8701
     I                                        1   5 ME01K
     I                                        6   9 ME02K
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           ME01K
     C                     KFLD           ME02K
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL3     IFEQ '1'
    C                     WRITEPE1
  03-C           WF870A    IFEQ '1'
    C                     MOVEL'台北'  COMPC
  03*C                     ELSE
  04-C           WF870A    IFEQ '2'
    C                     MOVEL'台中'  COMPC
  04*C                     ELSE
    C                     MOVEL'高雄'  COMPC
  04-C                     END
    C                     WRITEPH1
  03-C                     END
    C*
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CL3 10                EXSR RTNL3
     CLR                   EXSR RTN500
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
| 05-C           IN20      IFEQ '0'
|   C                     SETOF                     20
| 05*C                     ELSE
|   C                     SETON                     20
| 05-C                     END
|    C*種類
|    C                     MOVEL*BLANKS   GROUP
| 06-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'GROUP
| 06*C                     ELSE
| 07-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'GROUP
| 07*C                     ELSE
| 08-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'GROUP
| 08*C                     ELSE
|   C                     MOVEL'全部'  GROUP
| 08-C                     END
| 07-C                     END
| 06-C                     END
|    C*辦事處
| 09-C           WF870A    IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 09*C                     ELSE
| 10-C           WF870A    IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 10*C                     ELSE
|   C                     MOVEL'高雄'  COMPC
| 10-C                     END
| 10-C                     END
|   C                     WRITEPH1
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|   C*
|   C*客戶
|   C           KEYME     CHAINME0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   ME04
| 01-C                     END
      *
|   C*產品
|   C           WF8702    CHAINMA0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 02-C                     END
|   C   39                EXSR RTN900
|   C                     WRITEPD1
|   C                     SETOF                     21
|   C                     SETON                     30
|   C                     ADD  WF8704    T1TOT4
|   C                     ADD  WF8705    T1TOT5
|   C                     ADD  WF8706    T1TOT6
|   C                     ADD  WF8707    T1TOT7
|   C                     ADD  WF8708    T1TOT8
|   C                     ADD  WF8709    T1TOT9
|   C                     ADD  WF8710    T1TO10
|   C                     ADD  WF8711    T1TO11
|   C                     ADD  WF8712    T1TO12
|   C                     ADD  WF8713    T1TO13
|   C                     ADD  WF8714    T1TO14
|   C                     ADD  WF8715    T1TO15
|   C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL1  ....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTNL1     BEGSR
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPT1
|   C                     SETON                     21
|   C                     ADD  T1TOT4    T2TOT4
|   C                     ADD  T1TOT5    T2TOT5
|   C                     ADD  T1TOT6    T2TOT6
|   C                     ADD  T1TOT7    T2TOT7
|   C                     ADD  T1TOT8    T2TOT8
|   C                     ADD  T1TOT9    T2TOT9
|   C                     ADD  T1TO10    T2TO10
|   C                     ADD  T1TO11    T2TO11
|   C                     ADD  T1TO12    T2TO12
|   C                     ADD  T1TO13    T2TO13
|   C                     ADD  T1TO14    T2TO14
|   C                     ADD  T1TO15    T2TO15
|   C                     Z-ADD0         T1TOT4
|   C                     Z-ADD0         T1TOT5
|   C                     Z-ADD0         T1TOT6
|   C                     Z-ADD0         T1TOT7
|   C                     Z-ADD0         T1TOT8
|   C                     Z-ADD0         T1TOT9
|   C                     Z-ADD0         T1TO10
|   C                     Z-ADD0         T1TO11
|   C                     Z-ADD0         T1TO12
|   C                     Z-ADD0         T1TO13
|   C                     Z-ADD0         T1TO14
|   C                     Z-ADD0         T1TO15
|   C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL2  ....WRITE PT2   SUBTOTAL
      *==============================================================*
04===C           RTNL2     BEGSR
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPT2
|   C                     SETOF                     30
|   C                     SETON                     21
|   C                     ADD  T2TOT4    T3TOT4
|   C                     ADD  T2TOT5    T3TOT5
|   C                     ADD  T2TOT6    T3TOT6
|   C                     ADD  T2TOT7    T3TOT7
|   C                     ADD  T2TOT8    T3TOT8
|   C                     ADD  T2TOT9    T3TOT9
|   C                     ADD  T2TO10    T3TO10
|   C                     ADD  T2TO11    T3TO11
|   C                     ADD  T2TO12    T3TO12
|   C                     ADD  T2TO13    T3TO13
|   C                     ADD  T2TO14    T3TO14
|   C                     ADD  T2TO15    T3TO15
|   C                     Z-ADD0         T2TOT4
|   C                     Z-ADD0         T2TOT5
|   C                     Z-ADD0         T2TOT6
|   C                     Z-ADD0         T2TOT7
|   C                     Z-ADD0         T2TOT8
|   C                     Z-ADD0         T2TOT9
|   C                     Z-ADD0         T2TO10
|   C                     Z-ADD0         T2TO11
|   C                     Z-ADD0         T2TO12
|   C                     Z-ADD0         T2TO13
|   C                     Z-ADD0         T2TO14
|   C                     Z-ADD0         T2TO15
|   C*
04===C                     ENDSR
      *==============================================================*
      *          RTNL3 ....WRITE PT3   SUBTOTAL
      *==============================================================*
05===C           RTNL3     BEGSR
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPT3
|   C                     SETOF                     30
|   C                     SETON                     21
|   C                     ADD  T3TOT4    T4TOT4
|   C                     ADD  T3TOT5    T4TOT5
|   C                     ADD  T3TOT6    T4TOT6
|   C                     ADD  T3TOT7    T4TOT7
|   C                     ADD  T3TOT8    T4TOT8
|   C                     ADD  T3TOT9    T4TOT9
|   C                     ADD  T3TO10    T4TO10
|   C                     ADD  T3TO11    T4TO11
|   C                     ADD  T3TO12    T4TO12
|   C                     ADD  T3TO13    T4TO13
|   C                     ADD  T3TO14    T4TO14
|   C                     ADD  T3TO15    T4TO15
|   C                     Z-ADD0         T3TOT4
|   C                     Z-ADD0         T3TOT5
|   C                     Z-ADD0         T3TOT6
|   C                     Z-ADD0         T3TOT7
|   C                     Z-ADD0         T3TOT8
|   C                     Z-ADD0         T3TOT9
|   C                     Z-ADD0         T3TO10
|   C                     Z-ADD0         T3TO11
|   C                     Z-ADD0         T3TO12
|   C                     Z-ADD0         T3TO13
|   C                     Z-ADD0         T3TO14
|   C                     Z-ADD0         T3TO15
|   C*
05===C                     ENDSR
      *==============================================================*
      *          RTN500....WRITE PT4   SUBTOTAL
      *==============================================================*
06===C           RTN500    BEGSR
|   C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01*C                     ELSE
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPT4
|   C                     SETOF                     31
| 01-C                     END
|   C                     WRITEPE2
|   C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
      *
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
|   C                     SETOF                     30
|   C                     SETOF                     21
      *
07===C                     ENDSR
