      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SAR067D                                       *
      * AUTHOR       : AN MING HSIA                                  *
      * CREATE DATE  : 09/01/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應收帳款作業                                 *
      * REMARK       :試飲分析彙總表                               *
      ****************************************************************
     FSAR067D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
 @   I                                      139 139 $RMK01
     I                                      598 5990$PRTID
     I*
     I                                      601 6060DSC07S
     I                                      607 6120DSC07E
     I                                      620 620 DSEL
     I                                      681 682 DSC01S
     I                                      683 684 DSC01E
     I                                      701 7060DSC39S
     I                                      707 7120DSC39E
     I                                      713 7180DATES
     I                                      719 7240DATEE
     I                                      731 739 DSD03S
     I                                      741 749 DSD03E
     I                                      750 750 IN20
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S1
M001AI                                      858 865 YMD8E1
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSC01S
|    C                     MOVE *BLANK    DSC01E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     Z-ADD0         DSC07S
|    C                     Z-ADD0         DSC07E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C*                    MOVE *BLANK    DSEL
|    C                     Z-ADD0         DATES   60
|    C                     Z-ADD0         DATEE   60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
     C*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           DSC01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC01S
| 01-C                     END
|    C*
| 02-C           DSC01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC01E
| 02-C                     END
|    C*
| 03-C           DSC01S    IFGT DSC01E
|   C                     SETON                     717299
|   C                     SETON                     93
| 03-C                     END
|    C*
|    C*送貨日期或確認日期只輸入一項
| 04-C           DSC07S    IFNE 0
|   C           DSC07E    ORNE 0
| 05-C           DSC39S    IFNE 0
|   C                     SETON                     738999
| 05-C                     END
| 06-C           DSC39E    IFNE 0
|   C                     SETON                     748999
| 06-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           DSC39S    IFEQ 0
|   C           DSC39E    ANDEQ0
      *---
|   C* CHK送貨日期
| 08-C           DSC07S    IFEQ 0
M001DC*                    Z-ADD010101    DSC07S
M001AC                     Z-ADD010192    DSC07S
| 08*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC07S    P0901I  60
|   C                     PARM           P0901O  1
| 09-C           P0901O    IFEQ 'N'
|   C                     SETON                     609499
| 09-C                     END
| 08-C                     END
|   C   99                GOTO END100
|   C*
|   C**
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC07S    S001I2  60
|   C           DATES     PARM           S001O1  60
|   C*
| 10-C           DSC07E    IFEQ 0
M001DC*                    Z-ADD123199    DSC07E
M001AC                     Z-ADD123129    DSC07E
| 10*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC07E    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     619499
| 11-C                     END
| 10-C                     END
|   C   99                GOTO END100
|   C*
|   C**
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC07E    S001I2  60
|   C           DATEE     PARM           S001O1  60
|   C*
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S1
|   C*
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E1
|   C*
M001DC*          DATES     IFGT DATEE
M001AC           YMD8S1    IFGT YMD8E1
|   C                     SETON                     606193
|   C                     SETON                     99
|   C                     GOTO END100
| 12-C                     END
|   C*---
| 07*C                     ELSE
|   C* CHK確認日期
| 13-C           DSC39S    IFEQ 0
M001DC*                    Z-ADD010101    DSC39S
M001AC                     Z-ADD010192    DSC39S
| 13*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 14-C           P0901O    IFEQ 'N'
|   C                     SETON                     739499
| 14-C                     END
| 13-C                     END
|   C   99                GOTO END100
|   C*
|   C**
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           DATES     PARM           S001O1  60
|   C*
| 15-C           DSC39E    IFEQ 0
M001DC*                    Z-ADD123199    DSC39E
M001AC                     Z-ADD123129    DSC39E
| 15*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 16-C           P0901O    IFEQ 'N'
|   C                     SETON                     749499
| 16-C                     END
| 15-C                     END
|   C   99                GOTO END100
|   C*
|   C**
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           DATEE     PARM           S001O1  60
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S1
|   C*
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E1
|   C*
M001DC*          DATES     IFGT DATEE
M001AC           YMD8S1    IFGT YMD8E1
|   C*
|   C                     SETON                     737493
|   C                     SETON                     99
|   C                     GOTO END100
| 17-C                     END
|   C*---
| 07-C                     END
|    C* CHK產品代號
| 31-C           DSD03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSD03S
| 31-C                     END
|    C*
| 32-C           DSD03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSD03E
| 32-C                     END
|    C*
| 33-C           DSD03S    IFGT DSD03E
|   C                     SETON                     626393
|   C                     SETON                     99
|   C                     GOTO END100
| 33-C                     END
|    C   99                GOTO END100
|    C*
|    C*
| 18-C           DSC07S    IFNE 0
|   C                     MOVEL'0'       IN20
| 18*C                     ELSE
|   C                     MOVEL'1'       IN20
| 18-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*產品代號
| 02-C           D#ROW     IFEQ 11
| 03-C           D#COL     IFGE 37
|   C           D#COL     ANDLE45
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 49
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE37
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
