      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0592                                       *
      * AUTHER       : 0070   JUDY                                   *
      * CREATE DATE  : 81/09/24                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品客戶銷售數量排行榜                       *
      ****************************************************************
     FREWF40L2IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSAR059BPO   E             39     PRINTER
     E*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*                                     601 602 DSC01S
     I*                                     603 604 DSC01E
     I                                      605 609 DSC04S
     I                                      610 614 DSC04E
      *MM/DD/YY
     I                                      615 6200DSC39S
     I                                      621 6260DSC39E
      *YY/MM/DD
     I                                      627 6320WSC39S
     I                                      633 6380WSC39E
     I                                      651 659 DSD03S
     I                                      660 668 DSD03E
     I                                      641 641 DSC33S
     I                                      642 642 DSC33E
     I                                      643 644 DSC34S
     I                                      645 646 DSC34E
     I                                      669 6720DSORT
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      750 750 IN20
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *HEADING
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
      *
     C           IN20      IFEQ '0'
     C                     SETOF                     20
     C                     ELSE
     C                     SETON                     20
     C                     END
      *
     C                     Z-ADD0         SORT
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*客戶
     C                     MOVELWF4001    ME01
     C                     MOVEL*BLANKS   ME02
|    C           KEYME     CHAINME0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   ME04
| 03-C                     END
|     *
| 04-C           SORT      IFLT DSORT
|   C                     ADD  1         SORT
|   C   39                EXSR RTN900
|   C                     WRITEPD1
|   C                     ELSE
|   C                     GOTO END100
| 04-C                     END
|    C*
02===C           END100    ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
      *
05===C                     ENDSR
      *==============================================================*
      *          RTNLR
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
