      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0622                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :通路產品銷售週報表                           *
      ****************************************************************
     FREWF47  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSAR062P O   E             39     PRINTER
     E*
     IWF470
     I                                              WF4701L2
     I                                              WF4702L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *產品
     I                                      601 609 DSD03S
     I                                      610 618 DSD03E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      619 6240YMDS
     I                                      625 6300YMDE
     I                                      631 6360DSC39S
     I                                      637 6420DSC39E
     I                                      643 643 COMPS
     I                                      644 644 COMPE
     I                                      647 647 COMP
      *通路
     I                                      645 645 DSC33S
     I                                      646 646 DSC33E
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF4706    T14706
     C           *LIKE     DEFN WF4707    T14707
     C           *LIKE     DEFN WF4706    T24706
     C           *LIKE     DEFN WF4707    T24707
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL2     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010
  02-C                     END
  01-C                     END
     C*
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200                                 L
     CL2 10                EXSR RTN300                                 L
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
      *
| 03-C           COMP      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 03*C                     ELSE
| 04-C           COMP      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 04*C                     ELSE
| 05-C           COMP      IFEQ '3'
|   C                     MOVEL'高雄'  COMPC
| 05*C                     ELSE
|   C                     MOVEL'全部'  COMPC
| 05-C                     END
| 04-C                     END
| 03-C                     END
      *
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVELWF4701    #A02
|    C           KEY#A     CHAIN#A0                  41
| 06-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    #A03
| 06-C                     END
|    C*
      *
|    C                     WRITEPH1
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           WF4703    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 01-C                     END
|    C*
|    C           WF4704    SUB  WF4705    WFTOT
|    C                     ADD  WF4704    T14704
|    C                     ADD  WF4705    T14705
|    C           WF4706    SUB  WF4707    WFTOT1
|    C                     ADD  WF4706    T14706
|    C                     ADD  WF4707    T14707
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     20
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....SUBTOT
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C           T14704    SUB  T14705    T1TOT
|    C                     ADD  T14704    T24704
|    C                     ADD  T14705    T24705
|    C           T14706    SUB  T14707    T1TOT1
|    C                     ADD  T14706    T24706
|    C                     ADD  T14707    T24707
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     Z-ADD0         T14704
|    C                     Z-ADD0         T14705
|    C                     Z-ADD0         T14706
|    C                     Z-ADD0         T14707
|    C                     SETON                     20
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....SUBTOT
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C           T24704    SUB  T24705    T2TOT
|    C           T24706    SUB  T24707    T2TOT1
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     Z-ADD0         T24704
|    C                     Z-ADD0         T24705
|    C                     Z-ADD0         T24706
|    C                     Z-ADD0         T24707
|    C                     SETON                     20
|    C*
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     3920
      *
05===C                     ENDSR
      *==============================================================*
      *          RTNLR.....ENDPGM
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
