      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR050                                        *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/05/19                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :應收帳款作業                                 *
     A* REMARK       :業務員業績日報表                             *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.11  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSAR050D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
 @   I                                      139 139 $RMK01
     I                                      598 5990$PRTID
     I                                      601 6060DSC07S
     I                                      607 6120DSC07E
     I                                      620 620 DSEL
     I                                      621 629 DCS01S
     I                                      631 639 DCS01E
     I                                      641 649 DSD03S
     I                                      651 659 DSD03E
     I                                      661 662 DSC01S
     I                                      663 664 DSC01E
     I                                      701 7060DSC39S
     I                                      707 7120DSC39E
M001MI*                                     713 7180DATES
M001MI*                                     719 7240DATEE
M001MI                                      713 7200DATES
M001MI                                      721 7280DATEE
     I                                      750 750 IN20
      *產品組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
     C                     Z-ADD0         D#ROW
     C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     Z-ADD0         DSC07S
|    C                     Z-ADD0         DSC07E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     MOVE *BLANK    DSEL
|    C                     MOVE *BLANK    DCS01S
|    C                     MOVE *BLANK    DCS01E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C*M001D               Z-ADD0         DATES   60
|    C*M001D               Z-ADD0         DATEE   60
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK公司
     C           DSC01S    IFEQ *BLANK
     C                     MOVE *LOVAL    DSC01S
     C                     END
|    C*
     C           DSC01E    IFEQ *BLANK
     C                     MOVE *HIVAL    DSC01E
     C                     END
     C*
     C           DSC01S    IFGT DSC01E
     C                     SETON                     676899
     C                     SETON                     93
     C                     END
|    C   99                GOTO END100
|    C*
|    C*送貨日期或確認日期只輸入一項
| 04-C           DSC07S    IFNE 0
|   C           DSC07E    ORNE 0
| 05-C           DSC39S    IFNE 0
|   C                     SETON                     698999
| 05-C                     END
| 06-C           DSC39E    IFNE 0
|   C                     SETON                     708999
| 06-C                     END
| 04-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           DSC39S    IFEQ 0
|   C           DSC39E    ANDEQ0
      *---
|   C* CHK送貨日期
| 10-C           DSC07S    IFEQ 0
|   C*M001M               Z-ADD010101    DSC07S
M001MC                     Z-ADD010192    DSC07S
| 10*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC07S    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     609499
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC07S    S001I2  60
|    C*M001M     DATES     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DATES
|    C*
| 10-C           DSC07E    IFEQ 0
|   C*M001M               Z-ADD123199    DSC07E
M001MC                     Z-ADD123129    DSC07E
| 10*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC07E    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     619499
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC07E    S001I2  60
|    C*M001M     DATEE     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DATEE
|    C*
| 03-C           DATES     IFGT DATEE
|   C                     SETON                     606193
|   C                     SETON                     99
|   C                     GOTO END100
| 03-C                     END
      *---
| 07*C                     ELSE
|   C* CHK確認日期
| 13-C           DSC39S    IFEQ 0
|   C*M001M               Z-ADD010101    DSC39S
M001MC                     Z-ADD010192    DSC39S
| 13*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 14-C           P0901O    IFEQ 'N'
|   C                     SETON                     699499
| 14-C                     END
| 13-C                     END
|   C   99                GOTO END100
|   C*
|   C**
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C*M001M     DATES     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DATES
      *
| 15-C           DSC39E    IFEQ 0
|   C*M001M               Z-ADD123199    DSC39E
M001MC                     Z-ADD123129    DSC39E
| 15*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 16-C           P0901O    IFEQ 'N'
|   C                     SETON                     709499
| 16-C                     END
| 15-C                     END
|   C   99                GOTO END100
|   C*
|   C**
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C*M001M     DATEE     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DATEE
|   C*
| 17-C           DATES     IFGT DATEE
|   C                     SETON                     697093
|   C                     SETON                     99
|   C                     GOTO END100
| 17-C                     END
      *---
| 07-C                     END
|    C*
|    C*
|    C* CHK選擇內容
| 15-C           DSEL      IFEQ *BLANKS
|   C                     SETON                     62
|   C                     SETON                     9699
| 15-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK客戶
| 05-C           DCS01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCS01S
| 05-C                     END
|    C*
| 05-C           DCS01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCS01E
| 05-C                     END
|    C*
| 06-C           DCS01S    IFGT DCS01E
|   C                     SETON                     636493
|   C                     SETON                     99
|   C                     GOTO END100
| 06-C                     END
|    C*
|    C   99                GOTO END100
|    C*
|    C* CHK產品組別
| 01-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
     C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 01-C                     END
|    C* CHK產品
| 05-C           DSD03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSD03S
| 05-C                     END
|    C*
| 05-C           DSD03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSD03E
| 05-C                     END
|    C*
| 06-C           DSD03S    IFGT DSD03E
|   C                     SETON                     656693
|   C                     SETON                     99
|   C                     GOTO END100
| 06-C                     END
|    C*
|    C   99                GOTO END100
|    C*
| 31-C           DSC07S    IFNE 0
|   C                     MOVEL'0'       IN20
| 31*C                     ELSE
|   C                     MOVEL'1'       IN20
| 31-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*客戶代號
| 02-C           D#ROW     IFEQ 12
|   C           D#COL     IFGE 52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS003'
|   C                     PARM           DCS01S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 64
|   C           D#COL     ANDLE72
|   C                     CALL 'WDS003'
|   C                     PARM           DCS01E
|   C                     GOTO ENDF4
| 02-C                     END
| 02-C                     END
|   C*
|   C*產品代號
| 02-C           D#ROW     IFEQ 10
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
