      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR0411                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單分析作業                                 *
      * REMARK       :客戶退貨明細表－銷退                         *
     F*================================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE FOR Y2K
     F*----------------------------------------------------------------
     F*  M002     | 99.11.11 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
      ****************************************************************
     FSOSGPF  IP  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
M002AFMTMDPF  IF  E           K        DISK
M002AFPA#APF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FSAR041APO   E             39     PRINTER
     ISG0
     I                                              SG11  L3
     I                                              SG04  L2
     I                                              SG05  L2
     I                                              SG02  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      139 139 $RMK01
     I                                      598 5990$PRTID
     I                                      601 604 DSG12S
     I                                      605 608 DSG12E
     I                                      611 616 DSG11S
     I                                      617 622 DSG11E
     I                                      631 635 DSG04S
     I                                      636 640 DSG04E
     I                                      641 6460DSG06S
     I                                      647 6520DSG06E
     I                                      673 6780DSG26S
     I                                      679 6840DSG26E
     I                                      685 6900DATES
     I                                      691 6960DATEE
     I                                      661 661 DSG03
     I                                      662 662 IN20
     I                                      663 663 DATA1
     I*增加辦事處的挑選
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I*增加產品挑選
     I                                      701 709 DSH03S
     I                                      711 719 DSH03E
M002A *集團代號
M002AI                                      800 801 DMD06S
M002AI                                      802 803 DMD06E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           MEKEY     KLIST
     C                     KFLD           SG04
     C                     KFLD           SG05
M002AC           KEY#A     KLIST
M002AC                     KFLD           #A01
M002AC                     KFLD           #A02
      *==============================================================*
      *                    DEFINE FIELD
      *==============================================================*
     C           *LIKE     DEFN SG11      PSG11            *BUF
     C           *LIKE     DEFN SG04      PSG04            *BUF
     C           *LIKE     DEFN SG02      PSG02            *BUF
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *INIT ENVIRM
     C*
     C* GET轉換日期
M001AC                     Z-ADDSG06      PSG06   60
     C                     CALL 'RES001'
     C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SG06      S001I2  80
M001AC                     PARM PSG06     S001I2  60
     C           PSG06     PARM           S001O1  60
     C*
     C                     EXSR RTN100                     *CHAIN MTME
     C                     EXSR RTN200                     *CHAIN MTMC
     C                     EXSR RTN300                     *READE SOSH
     C*
     CL1 10                SETOF                     32
     CL2 10                EXSR RTNL2                      *WRITE PD2
     CL3 10                EXSR RTNL3                      *WRITE PD3
     CLR                   EXSR RTNLR                      *END PGM
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
     C                     MOVE COMPS     COMP
|    C*                    Z-ADD0         ASH06
|    C                     Z-ADD0         PPRC
|    C                     Z-ADD0         CTSH06
|    C*                    Z-ADD0         CTPPRC
|    C                     Z-ADD0         CTSH07
|    C                     Z-ADD0         CTSH08
|    C                     Z-ADD0         CTSH17
|    C                     Z-ADD0         CTSH18
|    C                     Z-ADD0         CTSH19
|    C                     Z-ADD0         CTSH20
|    C                     Z-ADD0         STSH06
|    C*                    Z-ADD0         STPPRC
|    C                     Z-ADD0         STSH07
|    C                     Z-ADD0         STSH08
|    C                     Z-ADD0         STSH17
|    C                     Z-ADD0         STSH18
|    C                     Z-ADD0         STSH19
|    C                     Z-ADD0         STSH20
|    C                     Z-ADD0         RTSH06
|    C*                    Z-ADD0         RTPPRC
|    C                     Z-ADD0         RTSH07
|    C                     Z-ADD0         RTSH08
|    C                     Z-ADD0         RTSH17
|    C                     Z-ADD0         RTSH18
|    C                     Z-ADD0         RTSH19
|    C                     Z-ADD0         RTSH20
|    C*
| 01-C           $RMK01    IFEQ 'Y'
|   C                     SETON                     34
| 01*C                     ELSE
|   C                     SETOF                     34
| 01-C                     END
|    C*
M002AC                     MOVEL'CUSTGRP' #A01
M002AC                     MOVELDMD06S    #A02
M002AC           KEY#A     CHAIN#A0                  42
M002AC           *IN42     IFEQ '0'
M002AC                     MOVEL#A03      D#A03S
M002AC                     ELSE
M002AC                     MOVE *BLANKS   D#A03S
M002AC                     END
M002AC                     MOVEL'CUSTGRP' #A01
M002AC                     MOVELDMD06E    #A02
M002AC           KEY#A     CHAIN#A0                  42
M002AC           *IN42     IFEQ '0'
M002AC                     MOVEL#A03      D#A03E
M002AC                     ELSE
M002AC                     MOVE *BLANKS   D#A03E
M002AC                     END
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....CHAIN MTMEPF
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           MEKEY     CHAINME0                  51
|    C*
|    C   51                MOVE *BLANK    ME04
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....CHAIN MTMCPF
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C           SG11      CHAINMC0                  51
|    C*
|    C   51                MOVE *BLANK    MC02
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN300....READE SOSHPF
     C*==============================================================*
04===C           RTN300    BEGSR
|    C*
M002AC                     MOVELSG04      MD01
M002AC           MD01      CHAINMD0                  40
M002AC           *IN40     IFEQ '0'
M002AC           MD06      ANDGEDMD06S
M002AC           MD06      ANDLEDMD06E
|    C           SG02      CHAINSH0                  51
| 01-C           *IN51     DOWEQ'0'
|   C*
| 02-C           SH03      IFGE DSH03S
|   C           SH03      ANDLEDSH03E
      *打單日期未折完畢以打單數量計算且成本及金額為零
| 03-C           IN20      IFEQ '0'
| 04-C           SG14      IFEQ ' '
|   C           SG14      OREQ '*'
|   C           SH04      ADD  SH05      SH06
|   C                     Z-ADD0         PPRC
|   C                     Z-ADD0         SH07
|   C                     Z-ADD0         SH17
|   C                     Z-ADD0         SH18
|   C                     Z-ADD0         SH19
|   C                     Z-ADD0         SH20
| 04-C                     END
     C*加顯示單價：如果已分配訂購不為才有單價
     C                     ELSE
     C           SH12      IFNE 0
     C           SH07      DIV  SH12      PPRC
     C                     ELSE
     C                     Z-ADDSH07      PPRC
     C                     END
| 03-C                     END
      *
|   C                     EXSR RTN310                     *CHAIN MTMA
|   C                     ADD  SH06      CTSH06
|   C*                    ADD  PPRC      CTPPRC
|   C                     ADD  SH07      CTSH07
|   C                     ADD  SH08      CTSH08
|   C                     ADD  SH17      CTSH17
|   C                     ADD  SH18      CTSH18
|   C                     ADD  SH19      CTSH19
|   C                     ADD  SH20      CTSH20
|   C                     ADD  SH06      STSH06
|   C*                    ADD  PPRC      STPPRC
|   C                     ADD  SH07      STSH07
|   C                     ADD  SH08      STSH08
|   C                     ADD  SH17      STSH17
|   C                     ADD  SH18      STSH18
|   C                     ADD  SH19      STSH19
|   C                     ADD  SH20      STSH20
|   C                     ADD  SH06      RTSH06
|   C*                    ADD  PPRC      RTPPRC
|   C                     ADD  SH07      RTSH07
|   C                     ADD  SH08      RTSH08
|   C                     ADD  SH17      RTSH17
|   C                     ADD  SH18      RTSH18
|   C                     ADD  SH19      RTSH19
|   C                     ADD  SH20      RTSH20
|   C*
| 05-C           SG05      IFEQ *BLANK
|   C                     SETON                     33
| 05*C                     ELSE
|   C                     SETOF                     33
| 05-C                     END
|   C*
|   C                     EXSR RTN900                     *PROC SKIP
|   C                     WRITEPD1
|   C                     SETON                     303132
| 02-C                     END
|   C           SG02      READESH0                      51
| 01-C                     END
M002AC                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN310....CHAIN MTMAPF
     C*==============================================================*
05===C           RTN310    BEGSR
|    C*
|    C           SH03      CHAINMA0                  51
|    C*
|    C   51                MOVE *BLANK    MA03
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTNL2.....WRITE PD2
      *==============================================================*
06===C           RTNL2     BEGSR
|    C*
|    C                     SETOF                     31
|    C*
|    C                     EXSR RTN900
| 01-C           CTSH06    IFNE 0
|   C                     WRITEPD2
| 01-C                     END
|    C*
|    C                     Z-ADD0         CTSH06
|    C*                    Z-ADD0         CTPPRC
|    C                     Z-ADD0         CTSH07
|    C                     Z-ADD0         CTSH08
|    C                     Z-ADD0         CTSH17
|    C                     Z-ADD0         CTSH18
|    C                     Z-ADD0         CTSH19
|    C                     Z-ADD0         CTSH20
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTNL3.....WRITE PD3
      *==============================================================*
07===C           RTNL3     BEGSR
|    C*
|    C                     SETOF                     30
|    C*
|    C                     EXSR RTN900
| 01-C           STSH06    IFNE 0
|   C                     WRITEPD3
| 01-C                     END
|    C*
|    C                     Z-ADD0         CTSH06
|    C*                    Z-ADD0         CTPPRC
|    C                     Z-ADD0         CTSH07
|    C                     Z-ADD0         CTSH08
|    C                     Z-ADD0         CTSH17
|    C                     Z-ADD0         CTSH18
|    C                     Z-ADD0         CTSH19
|    C                     Z-ADD0         CTSH20
|    C                     Z-ADD0         STSH06
|    C*                    Z-ADD0         STPPRC
|    C                     Z-ADD0         STSH07
|    C                     Z-ADD0         STSH08
|    C                     Z-ADD0         STSH17
|    C                     Z-ADD0         STSH18
|    C                     Z-ADD0         STSH19
|    C                     Z-ADD0         STSH20
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTNLR.....ENDPGM
      *==============================================================*
08===C           RTNLR     BEGSR
|    C*
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     SETOF                     20
| 02-C           IN20      IFEQ '0'
|   C                     SETON                     20
| 02*C                     ELSE
|   C                     SETOF                     20
| 02-C                     END
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01*C                     ELSE
|   C   39                EXSR RTN900
| 03-C           RTSH06    IFNE 0
|   C                     WRITEPD4
| 03-C                     END
| 01-C                     END
|    C                     WRITEPE2
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN900....PROC SKIP
      *==============================================================*
09===C           RTN900    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     SETOF                     20
| 02-C           IN20      IFEQ '0'
|   C                     SETON                     20
| 02*C                     ELSE
|   C                     SETOF                     20
| 02-C                     END
|   C                     WRITEPH1
|   C                     SETON                     10
|   C                     SETOF                     39
| 01-C                     END
|    C*
| 03-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 03-C                     END
|    C*
09===C                     ENDSR
