      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0842                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :寰盛洋酒                                     *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品銷售毛利報表                             *
      ****************************************************************
     FREWF48  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSAR084APO   E             39     PRINTER
     E*
     IWF480
     I                                              WF481AL1
     I                                              WF4801L2
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *產品
     I                                      601 609 DSD03S
     I                                      610 618 DSD03E
      *辦事處
     I                                      650 650 DCOMP
      *專櫃
     I                                      651 651 DSEL1
      *SELECT起迄日期
      *YY/MM/DD
     I                                      619 6240YMDS
     I                                      625 6300YMDE
     I                                      631 6360DSC39S
     I                                      637 6420DSC39E
     I                                      648 648 DSEL
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN110                                 L
     CL2 10                EXSR RTN200                                 L
     CLR                   EXSR RTN300
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
      *
|    C                     EXSR RTN320                                 L
      *
|    C                     WRITEPH1
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           WF4802    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 01-C                     END
|    C*
|    C           WF4803    SUB  WF4804    WFTOT1
|    C                     SUB  WF4807    WFTOT1
M001DC*                    SUB  WF4810    WFTOT1
M001DC*          WF4805    ADD  WF4808    WFTOT2
M001DC*          WF4806    ADD  WF4809    WFTOT3
|    C           WFTOT1    SUB  WF4805    WFTOT4
|    C           WFTOT4    SUB  WF4806    WFTOT4
|    C*
|    C                     ADD  WF4803    T14803
|    C                     ADD  WF4804    T14804
|    C                     ADD  WF4807    T14807
|    C*                    ADD  WF4810    T14810
|    C                     ADD  WFTOT1    T1TOT1
|    C                     ADD  WF4805    T14805
|    C*                    ADD  WF4808    T14808
|    C*                    ADD  WFTOT2    T1TOT2
|    C                     ADD  WF4806    T14806
|    C*                    ADD  WF4809    T14809
|    C*                    ADD  WFTOT3    T1TOT3
|    C                     ADD  WFTOT4    T1TOT4
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     20
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN110....SUBTOT
      *==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C   39                EXSR RTN900
| 01-C           WF4801    IFEQ 'ESRM'
|   C                     WRITEPT1
| 01-C                     END
|    C                     ADD  T14803    T24803
|    C                     ADD  T14804    T24804
|    C                     ADD  T14805    T24805
|    C                     ADD  T14806    T24806
|    C                     ADD  T14807    T24807
|    C*                    ADD  T14808    T24808
|    C*                    ADD  T14809    T24809
|    C*                    ADD  T14810    T24810
|    C                     ADD  T1TOT1    T2TOT1
|    C*                    ADD  T1TOT2    T2TOT2
|    C*                    ADD  T1TOT3    T2TOT3
|    C                     ADD  T1TOT4    T2TOT4
|    C*
|    C                     Z-ADD0         T14803
|    C                     Z-ADD0         T14804
|    C                     Z-ADD0         T14805
|    C                     Z-ADD0         T14806
|    C                     Z-ADD0         T14807
|    C*                    Z-ADD0         T14808
|    C*                    Z-ADD0         T14809
|    C*                    Z-ADD0         T14810
|    C                     Z-ADD0         T1TOT1
|    C*                    Z-ADD0         T1TOT2
|    C*                    Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN200....SUBTOT
      *==============================================================*
04===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     ADD  T24803    T34803
|    C                     ADD  T24804    T34804
|    C                     ADD  T24805    T34805
|    C                     ADD  T24806    T34806
|    C                     ADD  T24807    T34807
|    C*                    ADD  T24808    T34808
|    C*                    ADD  T24809    T34809
|    C*                    ADD  T24810    T34810
|    C                     ADD  T2TOT1    T3TOT1
|    C*                    ADD  T2TOT2    T3TOT2
|    C*                    ADD  T2TOT3    T3TOT3
|    C                     ADD  T2TOT4    T3TOT4
|    C*
|    C                     Z-ADD0         T24803
|    C                     Z-ADD0         T24804
|    C                     Z-ADD0         T24805
|    C                     Z-ADD0         T24806
|    C                     Z-ADD0         T24807
|    C*                    Z-ADD0         T24808
|    C*                    Z-ADD0         T24809
|    C*                    Z-ADD0         T24810
|    C                     Z-ADD0         T2TOT1
|    C*                    Z-ADD0         T2TOT2
|    C*                    Z-ADD0         T2TOT3
|    C                     Z-ADD0         T2TOT4
|    C                     SETON                     20
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN300....TOTAL
      *==============================================================*
05===C           RTN300    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
      *
|   C                     EXSR RTN320                                 L
|   C                     WRITEPH1
|   C                     WRITEPE3
|   C                     WRITEPE2
| 01*C                     ELSE
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPT3
|   C                     Z-ADD0         T34803
|   C                     Z-ADD0         T34804
|   C                     Z-ADD0         T34805
|   C                     Z-ADD0         T34806
|   C                     Z-ADD0         T34807
|   C*                    Z-ADD0         T34808
|   C*                    Z-ADD0         T34809
|   C*                    Z-ADD0         T34810
|   C                     Z-ADD0         T3TOT1
|   C*                    Z-ADD0         T3TOT2
|   C*                    Z-ADD0         T3TOT3
|   C                     Z-ADD0         T3TOT4
|   C*
|   C                     WRITEPE2
| 01-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN320....OVERFLOW
      *==============================================================*
06===C           RTN320    BEGSR
| 01-C           DSEL1     IFEQ 'A'
|   C                     MOVEL'不　含'PSEL1   8
|   C                     MOVEL'專　櫃'PSEL2   8
| 01*C                     ELSE
| 01-C           DSEL1     IFEQ 'B'
|   C                     MOVEL'僅　含'PSEL1
|   C                     MOVEL'專　櫃'PSEL2
| 01*C                     ELSE
| 01-C           DSEL1     IFEQ 'C'
|   C                     MOVEL'全　部'PSEL1
|   C                     MOVEL'        'PSEL2
| 01-C                     END
| 01-C                     END
| 01-C                     END
      *
|    C                     SELEC
|    C           DCOMP     WHEQ '1'
|    C                     MOVEL'台　北'PCOMP   8
|    C           DCOMP     WHEQ '2'
|    C                     MOVEL'台　中'PCOMP
|    C           DCOMP     WHEQ '3'
|    C                     MOVEL'高　雄'PCOMP
|    C           DCOMP     WHEQ ' '
|    C                     MOVEL'全　部'PCOMP
|    C                     ENDSL
      *
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     3920
      *
07===C                     ENDSR
