      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SAR0652                                       *
      * AUTHER       : TINA WHANG                                    *
      * CREATE DATE  : 82/03/16                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :試飲原因統計表　　　　　　                   *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /*                                                          */
     /*=============================================================*/
      ****************************************************************
     FREWF64  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSAR065P O   E             39     PRINTER
     E*
     IWF640
     I                                              WF6401L3
     I                                              WF6402L2
     I                                              WF6403L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *辦事處
     I                                      601 601 COMPS
     I                                      602 602 COMPE
      *通路
     I                                      603 603 DSC33S
     I                                      604 604 DSC33E
      *原因
     I                                      605 606 DSC10S
     I                                      607 608 DSC10E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      610 6150YMDS
     I                                      616 6210YMDE
     I                                      622 6270DSC39S
     I                                      628 6330DSC39E
     I                                      640 648 DSD03S
     I                                      650 658 DSD03E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN210
     CL3 10                EXSR RTN220
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     Z-ADD0         TOT1
|    C                     Z-ADD0         TOT2
|    C                     Z-ADD0         TOT3
|    C                     Z-ADD0         TOT107
|    C                     Z-ADD0         TOT108
|    C                     Z-ADD0         TOT109
|    C                     Z-ADD0         TOT110
|    C                     Z-ADD0         TOT111
|    C                     Z-ADD0         TOT207
|    C                     Z-ADD0         TOT208
|    C                     Z-ADD0         TOT209
|    C                     Z-ADD0         TOT210
|    C                     Z-ADD0         TOT211
|    C                     Z-ADD0         TOT307
|    C                     Z-ADD0         TOT308
|    C                     Z-ADD0         TOT309
|    C                     Z-ADD0         TOT310
|    C                     Z-ADD0         TOT311
|    C                     Z-ADD0         TOT407
|    C                     Z-ADD0         TOT408
|    C                     Z-ADD0         TOT409
|    C                     Z-ADD0         TOT410
|    C                     Z-ADD0         TOT411
|    C*
| 01-C           $RMK01    IFEQ 'Y'
|   C                     SETOF                     34
     C                     ELSE
     C                     SETON                     34
| 01-C                     END
     C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*產品名稱
|    C           WF6401    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA03
| 01-C                     END
|    C*辦事處
| 02-C           WF6403    IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 02*C                     ELSE
| 03-C           WF6403    IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 03*C                     ELSE
|   C                     MOVEL'高雄'  COMPC
| 03-C                     END
| 02-C                     END
|    C*
|    C*試飲原因
|    C                     MOVEL*BLANKS   #A01
|    C                     MOVEL*BLANKS   #A02
|    C                     MOVEL'STOCK'   #A01
|    C                     MOVELWF6402    #A02
|    C           KEY#A     CHAIN#A0                  42
| 04-C           *IN42     IFEQ '1'
|   C                     MOVE *BLANK    D#A03A
| 04*C                     ELSE
|   C                     MOVEL*BLANKS   D#A03A
|   C                     MOVEL#A03      D#A03A
| 04-C                     END
|    C*通路
|    C                     MOVEL*BLANKS   #A01
|    C                     MOVEL*BLANKS   #A02
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVELWF6404    #A02
|    C           KEY#A     CHAIN#A0                  43
| 05-C           *IN43     IFEQ '1'
|   C                     MOVE *BLANK    D#A03B
| 05*C                     ELSE
|   C                     MOVEL*BLANKS   D#A03B
|   C                     MOVEL#A03      D#A03B
| 05-C                     END
|    C*
|    C                     ADD  WF6405    TOT1
|    C                     ADD  WF6407    TOT107
|    C                     ADD  WF6408    TOT108
|    C                     ADD  WF6409    TOT109
|    C                     ADD  WF6410    TOT110
|    C                     ADD  WF6411    TOT111
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     21
|    C                     SETON                     303132
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C*
|    C   39                EXSR RTN900
|    C                     SETOF                     32
|    C                     WRITEPT1
|    C                     SETON                     213031
|    C                     ADD  TOT1      TOT2
|    C                     ADD  TOT107    TOT207
|    C                     ADD  TOT108    TOT208
|    C                     ADD  TOT109    TOT209
|    C                     ADD  TOT110    TOT210
|    C                     ADD  TOT111    TOT211
|    C                     Z-ADD0         TOT1
|    C                     Z-ADD0         TOT107
|    C                     Z-ADD0         TOT108
|    C                     Z-ADD0         TOT109
|    C                     Z-ADD0         TOT110
|    C                     Z-ADD0         TOT111
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN210....WRITE PT2   SUBTOTAL
      *==============================================================*
04===C           RTN210    BEGSR
|    C*
|    C*
|    C   39                EXSR RTN900
|    C                     SETOF                     3132
|    C                     WRITEPT2
|    C                     SETON                     2130
|    C                     ADD  TOT2      TOT3
|    C                     ADD  TOT207    TOT307
|    C                     ADD  TOT208    TOT308
|    C                     ADD  TOT209    TOT309
|    C                     ADD  TOT210    TOT310
|    C                     ADD  TOT211    TOT311
|    C                     Z-ADD0         TOT2
|    C                     Z-ADD0         TOT207
|    C                     Z-ADD0         TOT208
|    C                     Z-ADD0         TOT209
|    C                     Z-ADD0         TOT210
|    C                     Z-ADD0         TOT211
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN220....WRITE PT3   SUBTOTAL
      *==============================================================*
05===C           RTN220    BEGSR
|    C*
|    C*
|    C   39                EXSR RTN900
|    C                     SETOF                     303132
|    C                     WRITEPT3
|    C                     SETON                     21
|    C                     ADD  TOT3      TOT4
|    C                     ADD  TOT307    TOT407
|    C                     ADD  TOT308    TOT408
|    C                     ADD  TOT309    TOT409
|    C                     ADD  TOT310    TOT410
|    C                     ADD  TOT311    TOT411
|    C                     Z-ADD0         TOT3
|    C                     Z-ADD0         TOT307
|    C                     Z-ADD0         TOT308
|    C                     Z-ADD0         TOT309
|    C                     Z-ADD0         TOT310
|    C                     Z-ADD0         TOT311
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTNLR.....ENDPGM
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|    C                     WRITEPT4
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     303132
|    C                     SETOF                     21
      *
07===C                     ENDSR
