      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR060                                        *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/10/24                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :                                               *
      * REMARK       :客戶最後成交一覽表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.12  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSAR060D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      611 611 DSC33S
     I                                      612 612 DSC33E
     I                                      613 614 DSC34S
     I                                      615 616 DSC34E
     I                                      617 618 DSC31S
     I                                      619 620 DSC31E
     I                                      621 629 DSC45S
     I                                      631 639 DSC45E
     I                                      641 649 DSD03S
     I                                      651 659 DSD03E
     I*(MM/DD/YY)
     I                                      661 6660DSC08S
     I                                      671 6760DSC08E
     I*(YY/MM/DD)
     I                                      681 6860YSC08S
     I                                      691 6960YSC08E
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE ' '       COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC31S
|    C                     MOVE *BLANK    DSC31E
|    C                     MOVE *BLANK    DSC45S
|    C                     MOVE *BLANK    DSC45E
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DSD03E
     C                     Z-ADD0         DSC08S
     C                     Z-ADD0         DSC08E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
     C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK通路
| 01-C           DSC33S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC33S
| 01-C                     END
|    C*
| 02-C           DSC33E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC33E
| 02-C                     END
|    C*
| 03-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C* CHK型態
| 01-C           DSC34S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC34S
| 01-C                     END
|    C*
| 02-C           DSC34E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC34E
| 02-C                     END
|    C*
| 03-C           DSC34S    IFGT DSC34E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK地區
| 01-C           DSC31S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC31S
| 01-C                     END
|    C*
| 02-C           DSC31E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC31E
| 02-C                     END
|    C*
| 03-C           DSC31S    IFGT DSC31E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK客戶代號
| 01-C           DSC45S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC45S
| 01-C                     END
|    C*
| 02-C           DSC45E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC45E
| 02-C                     END
|    C*
| 03-C           DSC45S    IFGT DSC45E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK產品代號
| 01-C           DSD03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSD03S
| 01-C                     END
|    C*
| 02-C           DSD03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSD03E
| 02-C                     END
|    C*
| 03-C           DSD03S    IFGT DSD03E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK交易期間
| 10-C           DSC08S    IFEQ 0
|   C*M001M               Z-ADD010101    DSC08S
M001MC                     Z-ADD010192    DSC08S
| 10*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC08S    S001I2  60
|    C           YSC08S    PARM           S001O1  60
M001AC                     MOVE YSC08S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
| 10-C           DSC08E    IFEQ 0
|   C*M001M               Z-ADD123199    DSC08E
M001MC                     Z-ADD123129    DSC08E
| 10*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC08E    S001I2  60
|    C           YSC08E    PARM           S001O1  60
M001AC                     MOVE YSC08E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
| 03-C*M001M     YSC08S    IFGT YSC08E
M001MC           YMD8S     IFGT YMD8E
|   C                     SETON                     707192
|   C                     SETON                     99
|   C                     GOTO END100
| 03-C                     END
|    C   99                GOTO END100
|   C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|   C*
|   C                     SETON                     99
|   C********************
|   C*  GET ROW,COL     *
|   C********************
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
|   C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFEQ 43
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33S  1
|   C                     PARM           DSC34S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33E  1
|   C                     PARM           DSC34E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
|   C*客戶代號
| 02-C           D#ROW     IFEQ 11
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45E
|   C                     GOTO ENDF4
| 02-C                     END
| 02-C                     END
|   C*
|   C*產品代號
| 02-C           D#ROW     IFEQ 12
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
|   C*客戶代號
| 02-C           D#ROW     IFEQ 11
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45E
|   C                     GOTO ENDF4
| 02-C                     END
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
     C*
     C           ENDF4     TAG
     C                     Z-ADD0         D#ROW
     C                     Z-ADD0         D#COL
     C*
03===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|   C*
|   C           *NAMVAR   DEFN *LDA      LDA
|   C                     OUT  *NAMVAR
|   C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
