      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0591                                       *
      * AUTHER       : 0070   JUDY                                   *
      * CREATE DATE  : 81/09/24                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品客戶銷售數量排行榜                       *
      *               改以公升數為排序值                           *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FSOSGPF  IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FREWF40  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      643 644 DSD34S
     I                                      645 647 DSD34E
     I                                      651 659 DSD03S
     I                                      660 668 DSD03E
     I                                      669 6720DSORT
     I                                      675 675 IN20
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C           *LIKE     DEFN WF4002    WORK2
     C           *LIKE     DEFN WF4003    WORK3
     C           *LIKE     DEFN WF4004    WORK4
     C           *LIKE     DEFN WF4005    WORK5
     C           *LIKE     DEFN WF4006    WORK6
     C           *LIKE     DEFN WF4007    WORK7
     C           *LIKE     DEFN WF4008    WORK8
     C           *LIKE     DEFN WF4009    WORK9
     C           *LIKE     DEFN WF4010    WORK10
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF4001
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN200
     C                     EXSR RTN300
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN200....累計銷售數量
     C*==============================================================*
01===C           RTN200    BEGSR
|    C*
|    C                     READ SC0                      45
| 01-C           *IN45     DOWEQ'0'
|   C                     Z-ADD0         WORK2
|   C                     Z-ADD0         WORK3
|   C                     Z-ADD0         WORK4
| 02-C           SC03      IFNE 'S4'                       *SKIP S4
|   C           SC02      SETLLSD0
|   C           SC02      READESD0                      46
| 03-C           *IN46     DOWEQ'0'
| 04-C           SD03      IFGE DSD03S
|   C           SD03      ANDLEDSD03E
|   C                     ADD  SD04      WORK2
|   C                     ADD  SD07      WORK3
|   C           SD03      CHAINMA0                  40
|   C  N40      SD04      MULT MA15      WORK    92
|   C   40                Z-ADD0         WORK    92
|   C                     ADD  WORK      WORK4
| 04-C                     END
|   C           SC02      READESD0                      46
| 03-C                     END
| 02-C                     END
|   C*
| 05-C           WORK2     IFGT 0
|   C                     MOVELSC04      WF4001
|   C           KEYWF     CHAINWF400                40
|   C                     EXSR RTN210
| 05-C                     END
|   C*
|   C                     READ SC0                      45
| 01-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN210....WRITE OR UPDATE REWF40
      *==============================================================*
02===C           RTN210    BEGSR
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  WORK2     WF4002
|   C                     ADD  WORK3     WF4003
|   C                     ADD  WORK4     WF4004
|   C           WF4002    SUB  WF4005    WF4008
|   C           WF4003    SUB  WF4006    WF4009
|   C           WF4004    SUB  WF4007    WF4010
|   C                     UPDATWF400
| 01*C                     ELSE
|   C                     Z-ADDWORK2     WF4002
|   C                     Z-ADDWORK3     WF4003
|   C                     Z-ADDWORK4     WF4004
|   C                     Z-ADD0         WF4005
|   C                     Z-ADD0         WF4006
|   C                     Z-ADD0         WF4007
|   C           WF4002    SUB  WF4005    WF4008
|   C           WF4003    SUB  WF4006    WF4009
|   C           WF4004    SUB  WF4007    WF4010
|   C                     WRITEWF400
| 01-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN300....累計銷退數量
     C*==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C                     READ SG0                      45
| 01-C           *IN45     DOWEQ'0'
|   C                     Z-ADD0         WORK5
|   C                     Z-ADD0         WORK6
|   C                     Z-ADD0         WORK7
|   C           SG04      CHAINMD0                  47
| 02-C           *IN47     IFEQ '0'
| 03-C           MD08      IFGE DSD34S                     *檢查型態
|   C           MD08      ANDLEDSD34E
|   C           SG02      SETLLSH0
|   C           SG02      READESH0                      46
| 04-C           *IN46     DOWEQ'0'
| 05-C           SH03      IFGE DSD03S                     *檢查產品
|   C           SH03      ANDLEDSD03E
|   C           SH03      CHAINMA0                  40
|   C  N40                Z-ADDMA15      WMA15   92
|   C   40                Z-ADD0         WMA15   92
|   C*
|   C*螢幕挑送貨日期且未確認或確認部份時，使用確認前數量，金額給零
| 06-C           IN20      IFEQ '0'
| 07-C           SG14      IFEQ ' '
|   C           SG14      ANDEQ'*'
|   C           SH04      SUB  SH05      WSH45   50       打單數量
|   C                     ADD  WSH45     WORK5
|   C                     ADD  0         WORK6            金額
     C           WSH45     MULT WMA15     WORK    92       公升數
| 07*C                     ELSE
|   C*螢幕挑送貨日期且已確認，使用確認數量，確認金額
|   C                     ADD  SH12      WORK5            折讓數量
|   C                     ADD  SH07      WORK6            金額
|   C           SH12      MULT WMA15     WORK    92       公升數
| 07-C                     END
| 06*C                     ELSE
|   C*螢幕挑確認日期，使用確認數量，確認金額
|   C                     ADD  SH12      WORK5            折讓數量
|   C                     ADD  SH07      WORK6            金額
|   C           SH12      MULT WMA15     WORK    92       公升數
| 06-C                     END
     C                     ADD  WORK      WORK7
| 05-C                     END
|   C           SG02      READESH0                      46
| 04-C                     END
|   C*
| 08-C           WORK5     IFGT 0
|   C                     MOVELSG04      WF4001
|   C           KEYWF     CHAINWF400                40
|   C                     EXSR RTN310
| 08-C                     END
|   C*
| 03-C                     END
| 02-C                     END
|   C                     READ SG0                      45
| 01-C                     END
|   C*
03===C                     ENDSR
      *==============================================================*
      *          RTN310....WRITE OR UPDATE REWF40
      *==============================================================*
04===C           RTN310    BEGSR
|   C*
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  WORK5     WF4005
|   C                     ADD  WORK6     WF4006
|   C                     ADD  WORK7     WF4007
|   C           WF4002    SUB  WF4005    WF4008
|   C           WF4003    SUB  WF4006    WF4009
|   C           WF4004    SUB  WF4007    WF4010
|   C                     UPDATWF400
| 01*C                     ELSE
|   C                     Z-ADD0         WF4002
|   C                     Z-ADD0         WF4003
|   C                     Z-ADD0         WF4004
|   C                     Z-ADDWORK5     WF4005
|   C                     Z-ADDWORK6     WF4006
|   C                     Z-ADDWORK7     WF4007
|   C           WF4002    SUB  WF4005    WF4008
|   C           WF4003    SUB  WF4006    WF4009
|   C           WF4004    SUB  WF4007    WF4010
|   C                     WRITEWF400
| 01-C                     END
|   C*
04===C                     ENDSR
