      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
      *                                                              *
      * PROGRAM NAME : SAR070                                        *
      * AUTHER       : MERCURY                                       *
      * CREATE DATE  : 83/05/13                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :產品銷售分析週報表－依辦事處                 *
      ****************************************************************
     FSAR070D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSAR070Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *公司
     I                                      601 601 DMA07
      *類別
     I                                      602 602 DMA11
      *試飲
     I                                      603 603 DSEL1
      *單瓶
     I                                      604 604 DSEL2
      *當期
      *MM/DD/YY
     I                                      611 6160DATES
     I                                      611 612 MMS
     I                                      613 614 DDS
     I                                      615 616 YYS
     I                                      621 6260DATEE
     I                                      621 622 MME
     I                                      623 624 DDE
     I                                      625 626 YYE
      *YY/MM/DD
B2MODI                                      631 6420YMDS
B2MODI                                      631 6380YM
B2MODI                                      647 6580YMDE
B2MODI                                      663 6740F01S
B2MODI                                      663 6700F01YM
B2MODI                                      679 6900F01E
B2MODI                                      695 7060F02S
B2MODI                                      695 7020F02SYM
B2MODI                                      711 7220F02E
B2MODI                                      711 7180F02EYM
B2MODI                                      723 7300F02EW
B2MODI                                      759 7700F0201
B2MODI                                      767 770 F0201D
B2MODI                                      731 7380F03S
B2MODI                                      745 7520F03E
     I*
B2MODI                                      775 783 DMA01S
B2MODI                                      785 793 DMA01E
B2MODI                                      805 8100D01S
B2MODI                                      805 806 D01SM
B2MODI                                      807 808 D01SD
B2MODI                                      809 810 D01SY
B2MODI                                      815 8200D01E
B2MODI                                      815 816 D01EM
B2MODI                                      819 820 D01EY
B2MODI                                      825 8300D02S
B2MODI                                      825 8260D02SM
B2MODI                                      825 828 D02SMD
B2MODI                                      827 828 D02SD
B2MODI                                      829 8300D02SY
B2MODI                                      827 8300D02SMY
B2MODI                                      835 8400D02E
B2MODI                                      835 8360D02EM
B2MODI                                      837 8400D02EMY
B2MODI                                      839 8400D02EY
B2MODI                                      845 8480D03S
B2MODI                                      845 8460D03SM
B2MODI                                      847 8480D03SY
B2MODI                                      855 8580D03E
B2MODI                                      855 8560D03EM
B2MODI                                      857 8580D03EY
     I*辦事處
B2MODI                                      864 864 COMP
     I                                      605 605 COMPS
     I                                      606 606 COMPE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
|   C           *IN05     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
     C                     MOVEL$USER     AUT     3
     C           AUT       IFNE 'D91'
|    C                     SETON                     31
     C                     END
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    DMA07
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA01S
|    C                     MOVE *BLANK    DMA01E
|    C                     MOVE *BLANK    DSEL1
|    C                     MOVE 'A'       DSEL2
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         D01S
|    C                     Z-ADD0         D01E
|    C                     Z-ADD0         D02S
|    C                     Z-ADD0         D02E
|    C                     Z-ADD0         D03S
|    C                     Z-ADD0         D03E
|    C                     Z-ADD0         F01S
|    C                     Z-ADD0         F01E
|    C                     Z-ADD0         F02S
|    C                     Z-ADD0         F02E
|    C                     Z-ADD0         F03S
|    C                     Z-ADD0         F03E
|    C                     Z-ADD0         F0201
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK辦事處
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
| 01-C           DMA07     IFEQ *BLANK
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C*
| 02-C           DMA11     IFEQ *BLANK
|   C                     SETON                     619599
| 02-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 03-C           DMA01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DMA01S
| 03-C                     END
|    C*
| 04-C           DMA01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DMA01E
| 04-C                     END
|    C*
| 05-C           DMA01S    IFGT DMA01E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
B2CHKC           DATES     IFEQ 0
B2INF *CVR3012 sev.30 Field DATES contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     629599
| 06-C                     END
|    C   99                GOTO END100
|    C*
B2CHKC           DATEE     IFEQ 0
B2INF *CVR3012 sev.30 Field DATEE contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     639599
| 07-C                     END
|    C   99                GOTO END100
|    C*日期區間不可跨月
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          MMS       IFNE MME
B2OLDC*          YYS       ORNE YYE
B2NEWC                     MOVE MMS       HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4X01  4
B2NEWC                     MOVE MME       HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4X02  4
B2NEWC                     MOVE YYS       HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4X03  4
B2NEWC                     MOVE YYE       HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4X04  4
B2NEWC           H@4X01    IFNE H@4X02
B2NEWC           H@4X03    ORNE H@4X04
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     SETON                     6263
|   C                     SETON                     8699
| 08-C                     END
|    C* CHK
B2CHKC           DATES     IFNE 0
B2INF *CVR3012 sev.30 Field DATES contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     CALL 'P09'
B2???C                     PARM DATES     P0901I  80
B2INF *CVR3012 sev.30 Field DATES contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
B2CHKC           DATEE     IFNE 0
B2INF *CVR3012 sev.30 Field DATEE contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     CALL 'P09'
B2???C                     PARM DATEE     P0901I  80
B2INF *CVR3012 sev.30 Field DATEE contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DATES     S001I2  80
B2INF *CVR3012 sev.30 Field DATES contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           YMDS      PARM           S001O1  80
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DATEE     S001I2  80
B2INF *CVR3012 sev.30 Field DATEE contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           YMDE      PARM           S001O1  80
|    C**
B2000C           YMDS      IFGT YMDE
|   C                     SETON                     6263
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
      *
|    C*當月起訖D01S,D01E
B2CHKC           D01S      IFEQ 0
B2INF *CVR3012 sev.30 Field D01S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2000C                     MOVELMMS       D01SM
B2CHKC                     MOVEL'01'      D01SD
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2000C                     MOVELYYS       D01SY
| 14-C                     END
|    C*
B2CHKC           D01E      IFEQ 0
B2INF *CVR3012 sev.30 Field D01E contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2000C                     Z-ADDDATEE     D01E
| 15-C                     END
|    C*起始日須為每月之第一日
B2CHKC           D01SD     IFNE '01'
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     688899
| 16-C                     END
|    C   99                GOTO END100
|    C*月份須相同
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          D01SY     IFNE D01EY
B2OLDC*          D01SM     ORNE D01EM
B2NEWC                     MOVE D01SY     HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4X01  4
B2NEWC                     MOVE D01EY     HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4X02  4
B2NEWC                     MOVE D01SM     HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4X03  4
B2NEWC                     MOVE D01EM     HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4X04  4
B2NEWC           H@4X01    IFNE H@4X02
B2NEWC           H@4X03    ORNE H@4X04
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     SETON                     6869
|   C                     SETON                     8699
| 17-C                     END
|    C   99                GOTO END100
      *
|    C* CHK
B2CHKC           D01S      IFNE 0
B2INF *CVR3012 sev.30 Field D01S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     CALL 'P09'
B2???C                     PARM D01S      P0901I  80
B2INF *CVR3012 sev.30 Field D01S contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     689399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
B2CHKC           D01E      IFNE 0
B2INF *CVR3012 sev.30 Field D01E contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     CALL 'P09'
B2???C                     PARM D01E      P0901I  80
B2INF *CVR3012 sev.30 Field D01E contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     699399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM D01S      S001I2  80
B2INF *CVR3012 sev.30 Field D01S contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           F01S      PARM           S001O1  80
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM D01E      S001I2  80
B2INF *CVR3012 sev.30 Field D01E contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           F01E      PARM           S001O1  80
|    C*
B2000C           F01S      IFGT F01E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 18-C                     END
|    C   99                GOTO END100
     C*
B2000C           YM        IFNE F01YM
     C                     SETON                     626386
     C                     SETON                     686999
     C                     END
|    C   99                GOTO END100
     C*
      *
|    C*當年起訖D02S,D02E
B2CHKC           D02S      IFEQ 0
B2INF *CVR3012 sev.30 Field D02S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     MOVEL'0401'    D02SMD
B2INF *CVR3012 sev.30 Field D02SMD contains more than one year
B2000C                     MOVELYYS       D02SY
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          MMS       IFLT '04'
B2NEWC                     MOVE MMS       HB2@YY  2
B2NEWC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2NEWC                     MOVE HB2@Y4    H@4X01  4
B2NEWC           H@4X01    IFLT '2004'
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2000C           D02S      SUB  1         D02S
B2INF *CVR3012 sev.30 Field D02S contains more than one year
| 20-C                     END
| 19-C                     END
B2CHKC           D02E      IFEQ 0
B2INF *CVR3012 sev.30 Field D02E contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2000C                     Z-ADDDATEE     D02E
| 21-C                     END
|    C*
|    C*起始日須為每月之第一日
B2CHKC           D02SD     IFNE '01'
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     708899
| 22-C                     END
|    C   99                GOTO END100
|    C* CHK
B2CHKC           D02S      IFNE 0
B2INF *CVR3012 sev.30 Field D02S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     CALL 'P09'
B2???C                     PARM D02S      P0901I  80
B2INF *CVR3012 sev.30 Field D02S contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
B2CHKC           D02E      IFNE 0
B2INF *CVR3012 sev.30 Field D02E contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     CALL 'P09'
B2???C                     PARM D02E      P0901I  80
B2INF *CVR3012 sev.30 Field D02E contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
      *
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM D02S      S001I2  80
B2INF *CVR3012 sev.30 Field D02S contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           F02S      PARM           S001O1  80
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM D02E      S001I2  80
B2INF *CVR3012 sev.30 Field D02E contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           F02E      PARM           S001O1  80
     C*
B2000C           F02S      IFGT F02E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 23-C                     END
|    C   99                GOTO END100
|    C*
B2000C           F02SYM    IFNE F02EYM
B2000C           F02EYM    SUB  1         F02EW
B2INF *CVR3012 sev.30 Field F02EYM contains more than one year
B2INF *CVR3012 sev.30 Field F02EW contains more than one year
| 26-C                     END
B2000C           F02SYM    IFNE F02EYM
B2000C                     Z-ADDF02E      F0201
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVEL'01'      F0201D
B2VFYC                     MOVEL'2001'    F0201D
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
| 26-C                     END
|    C*去年起訖D03S,D03E
B2CHKC           D03S      IFEQ 0
B2INF *CVR3012 sev.30 Field D03S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2000C           D02SY     SUB  1         D03SY
B2000C                     Z-ADDD02SM     D03SM
| 24-C                     END
B2CHKC           D03E      IFEQ 0
B2INF *CVR3012 sev.30 Field D03E contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2000C           D02EY     SUB  1         D03EY
B2000C                     Z-ADDD02EM     D03EM
| 25-C                     END
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE D03SM     F03S
B2CHKC                     MOVE D03SM     HB2@YY  2
B2CHKC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2CHKC                     MOVE HB2@Y4    F03S
B2INF *CVR3012 sev.30 Field F03S contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVELD03SY     F03S
B2CHKC                     MOVE D03SY     HB2@YY  2
B2CHKC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2CHKC                     MOVELHB2@Y4    F03S
B2INF *CVR3012 sev.30 Field F03S contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE D03EM     F03E
B2CHKC                     MOVE D03EM     HB2@YY  2
B2CHKC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2CHKC                     MOVE HB2@Y4    F03E
B2INF *CVR3012 sev.30 Field F03E contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVELD03EY     F03E
B2CHKC                     MOVE D03EY     HB2@YY  2
B2CHKC                     EXSR HB@24Y                     + CENTURY 2->4 YEAR
B2CHKC                     MOVELHB2@Y4    F03E
B2INF *CVR3012 sev.30 Field F03E contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C*
B2000C           F03S      IFGT F03E
|   C                     SETON                     7273
|   C                     SETON                     9299
| 23-C                     END
|    C   99                GOTO END100
|    C*
|    C*
| 27-C           DSEL1     IFEQ *BLANK
|   C                     SETON                     649599
| 27-C                     END
|    C   99                GOTO END100
|    C*
| 28-C           DSEL2     IFEQ *BLANK
|   C                     SETON                     659599
| 28-C                     END
|    C   99                GOTO END100
      *SCREEN LOG
     C                     OPEN SAR070Z
     C                     WRITEPH1
     C                     CLOSESAR070Z
      *
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*產品代號
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
|   C*
| 05-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
