      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0512                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :專櫃達成率分析表                             *
      ****************************************************************
     FREWF22  IP  E           K        DISK
     FSOSLPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSAR051P O   E             39     PRINTER
     E*
     E                    SL         12  9 0
     IWF220
     I                                              WF2201L2
     I                                              WF2202L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DSC04S
     I                                      606 610 DSC04E
B2MODI                                      632 640 DSD03S
B2MODI                                      642 650 DSD03E
      *MM/DD/YY
     I                                      611 6140DSC39
      *YY/MM/DD
     I                                      615 6180WSC39
     I                                      615 6160WSC39Y
     I                                      617 6180WSC39M
     I                                      617 6180M
      *SELECT
B2MODI                                      619 6240SSELYM
B2MODI                                      619 6220SSELYY
B2MODI                                      623 6240SSELMM
B2MODI                                      625 6280ESELYM
B2MODI                                      625 6260ESELYY
B2MODI                                      627 6280ESELMM
      *
B2MODI                                      629 629 DSEL
     I            DS
     I                                        1 1080SL
     I                                        1   90SL14
     I                                       10  180SL15
     I                                       19  270SL16
     I                                       28  360SL05
     I                                       37  450SL06
     I                                       46  540SL07
     I                                       55  630SL08
     I                                       64  720SL09
     I                                       73  810SL10
     I                                       82  900SL11
     I                                       91  990SL12
     I                                      100 1080SL13
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEYSL     KLIST
     C                     KFLD           SL01
     C                     KFLD           SL02
     C                     KFLD           SL03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL2     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010                     *HEADING
    C                     SETOF                     30
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*專櫃
|    C                     MOVELWF2201    ME01
|    C                     MOVEL*BLANKS   ME02
|    C           KEYME     CHAINME0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   ME04
| 03-C                     END
B2000C                     Z-ADDSSELYY    SL02
|    C*禮盒
|   C                     SETOF                     22
| 03-C           DSEL      IFEQ 'A'
|   C                     SETOF                     22
| 03*C                     ELSE
|   C                     SETON                     22
| 03-C                     END
|    C*
|    C                     WRITEPH1
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           WF2203    CHAINMA0                  40
     C           *IN40     IFEQ '0'
     C           MA07      ANDEQ'W'
     C           MA58      ANDEQ'I'
     C                     ELSE
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 01-C                     END
     C*
|    C           WF2205    SUB  WF2206    WF2256
|    C           WF2208    SUB  WF2209    WF2289
     C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     ADD  WF2204    T12204
|    C                     ADD  WF2205    T12205
|    C                     ADD  WF2206    T12206
|    C                     ADD  WF2207    T12207
|    C                     ADD  WF2208    T12208
|    C                     ADD  WF2209    T12209
|    C                     ADD  WF2256    T12256
|    C                     ADD  WF2289    T12289
|    C*
     C                     END
     C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     Z-ADD0         SL
|    C                     MOVELWF2201    SL01
|    C                     MOVELWF2202    SL03
|    C           KEYSL     CHAINSL0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     Z-ADDSL,M      T1SLMM
|   C                     Z-ADDSL04      T1SLYY
| 01*C                     ELSE
|   C                     Z-ADD0         T1SLMM
|   C                     Z-ADD0         T1SLYY
| 01-C                     END
| 02-C           T1SLMM    IFEQ 0
|   C                     Z-ADD0         RATEM
| 02*C                     ELSE
|   C           T12205    MULT 100       WORK   134
|   C           WORK      DIV  T1SLMM    RATEM     H
| 02-C                     END
| 03-C           T1SLYY    IFEQ 0
|   C                     Z-ADD0         RATEY
| 03*C                     ELSE
|   C           T12208    MULT 100       WORK
|   C           WORK      DIV  T1SLYY    RATEY     H
| 03-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETON                     30
|    C                     Z-ADD0         T12204
|    C                     Z-ADD0         T12205
|    C                     Z-ADD0         T12206
|    C                     Z-ADD0         T12207
|    C                     Z-ADD0         T12208
|    C                     Z-ADD0         T12209
|    C                     Z-ADD0         T12289
|    C                     Z-ADD0         T1SLMM
|    C                     Z-ADD0         T1SLYY
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
     C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
     C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
      *==============================================================*
