      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
      *                                                              *
      * PROGRAM NAME : SAR072                                        *
      * AUTHER       : MERCURY                                       *
      * CREATE DATE  : 83/05/13                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :產品銷售分析週報表－依辦事處                 *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 99.03.29 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 00.08.16 |起始年月改由七月起
     A*---------------------------------------------------------------
      ****************************************************************
     FSAR072D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSAR072Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *公司
     I                                      601 601 DMA07
      *類別
     I                                      602 602 DMA11
      *試飲
     I                                      603 603 DSEL1
      *單瓶
     I                                      604 604 DSEL2
      *專櫃
     I                                      610 610 DSEL3
      *當期
      *MM/DD/YY
     I                                      611 6160DATES
     I                                      611 612 MMS
     I                                      613 614 DDS
     I                                      615 616 YYS
     I                                      621 6260DATEE
     I                                      621 622 MME
     I                                      623 624 DDE
     I                                      625 626 YYE
      *YY/MM/DD
     I                                      631 6360YMDS
     I                                      631 6340YM
     I                                      641 6460YMDE
     I                                      651 6560F01S
     I                                      651 6540F01YM
     I                                      661 6660F01E
     I                                      671 6760F02S
     I                                      671 6740F02SYM
     I                                      681 6860F02E
     I                                      681 6840F02EYM
     I                                      687 6900F02EW
     I                                      711 7160F0201
     I                                      715 716 F0201D
     I                                      691 6940F03S
     I                                      701 7040F03E
     I*
     I                                      721 729 DMA01S
     I                                      731 739 DMA01E
     I                                      751 7560D01S
     I                                      751 752 D01SM
     I                                      753 754 D01SD
     I                                      755 756 D01SY
     I                                      761 7660D01E
     I                                      761 762 D01EM
     I                                      765 766 D01EY
     I                                      771 7760D02S
     I                                      771 7720D02SM
     I                                      771 774 D02SMD
     I                                      773 774 D02SD
     I                                      775 7760D02SY
     I                                      773 7760D02SMY
     I                                      781 7860D02E
     I                                      781 7820D02EM
     I                                      783 7860D02EMY
     I                                      785 7860D02EY
     I                                      791 7940D03S
     I                                      791 7920D03SM
     I                                      793 7940D03SY
     I                                      801 8040D03E
     I                                      801 8020D03EM
     I                                      803 8040D03EY
@@   I                                      805 805 DSEL4
     I*辦事處
     I                                      810 810 COMP
     I                                      605 605 COMPS
     I                                      606 606 COMPE
     I*(YYYY/MM/DD)
M001AI                                      850 8570YMDS8
M001AI                                      858 8650YMDE8
M001AI                                      866 8730YF01S
M001AI                                      874 8810YF01E
M001AI                                      882 8890YF02S
M001AI                                      882 8870YFSYM
M001AI                                      890 8970YF02E
M001AI                                      890 8950YFEYM
M001AI                                      898 9030YF03S
M001AI                                      904 9090YF03E
M001AI                                      911 9160YFEW
M001AI                                      921 9280YF0201
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
|   C           *IN05     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
     C                     MOVEL$USER     AUT     3
     C           AUT       IFNE 'D91'
|    C                     SETON                     31
     C                     END
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    DMA07
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA01S
|    C                     MOVE *BLANK    DMA01E
|    C                     MOVE *BLANK    DSEL1
|    C                     MOVE 'A'       DSEL2
|    C                     MOVE 'B'       DSEL3
| @@ C                     MOVE 'A'       DSEL4
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         D01S
|    C                     Z-ADD0         D01E
|    C                     Z-ADD0         D02S
|    C                     Z-ADD0         D02E
|    C                     Z-ADD0         D03S
|    C                     Z-ADD0         D03E
|    C                     Z-ADD0         F01S
|    C                     Z-ADD0         F01E
|    C                     Z-ADD0         F02S
|    C                     Z-ADD0         F02E
|    C                     Z-ADD0         F03S
|    C                     Z-ADD0         F03E
|    C                     Z-ADD0         F0201
M001AC                     Z-ADD0         YMDS8
M001AC                     Z-ADD0         YMDE8
M001AC                     Z-ADD0         YF01S
M001AC                     Z-ADD0         YF01E
M001AC                     Z-ADD0         YF02S
M001AC                     Z-ADD0         YF02E
M001AC                     Z-ADD0         YF03S
M001AC                     Z-ADD0         YF03E
M001AC                     Z-ADD0         YF0201
M001AC                     Z-ADD0         YFEW
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK辦事處
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
| 01-C           DMA07     IFEQ *BLANK
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C*
| 02-C           DMA11     IFEQ *BLANK
|   C                     SETON                     619599
| 02-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 03-C           DMA01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DMA01S
| 03-C                     END
|    C*
| 04-C           DMA01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DMA01E
| 04-C                     END
|    C*
| 05-C           DMA01S    IFGT DMA01E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 06-C           DATES     IFEQ 0
|   C                     SETON                     629599
| 06-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           DATEE     IFEQ 0
|   C                     SETON                     639599
| 07-C                     END
|    C   99                GOTO END100
|    C*日期區間不可跨月
| 08-C           MMS       IFNE MME
|   C           YYS       ORNE YYE
|   C                     SETON                     6263
|   C                     SETON                     8699
| 08-C                     END
|    C* CHK
| 09-C           DATES     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DATES     P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 11-C           DATEE     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DATEE     P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATES     S001I2  60
|    C           YMDS      PARM           S001O1  60
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDS8
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATEE     S001I2  60
|    C           YMDE      PARM           S001O1  60
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMDE8
|    C**
| 13-C*M001M     YMDS      IFGT YMDE
| 13-C           YMDS8     IFGT YMDE8
|   C                     SETON                     6263
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
      *
|    C*當月起訖D01S,D01E
| 14-C           D01S      IFEQ 0
|   C                     MOVELMMS       D01SM
|   C                     MOVEL'01'      D01SD
|   C                     MOVELYYS       D01SY
| 14-C                     END
|    C*
| 15-C           D01E      IFEQ 0
|   C                     Z-ADDDATEE     D01E
| 15-C                     END
|    C*起始日須為每月之第一日
| 16-C           D01SD     IFNE '01'
|   C                     SETON                     688899
| 16-C                     END
|    C   99                GOTO END100
|    C*月份須相同
| 17-C           D01SY     IFNE D01EY
|   C           D01SM     ORNE D01EM
|   C                     SETON                     6869
|   C                     SETON                     8699
| 17-C                     END
|    C   99                GOTO END100
      *
|    C* CHK
| 09-C           D01S      IFNE 0
|   C                     CALL 'P09'
|   C                     PARM D01S      P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     689399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 11-C           D01E      IFNE 0
|   C                     CALL 'P09'
|   C                     PARM D01E      P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     699399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D01S      S001I2  60
|    C           F01S      PARM           S001O1  60
M001AC                     MOVE F01S      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YF01S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D01E      S001I2  60
|    C           F01E      PARM           S001O1  60
M001AC                     MOVE F01E      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YF01E
|    C*
| 18-C*M001M     F01S      IFGT F01E
M001MC           YF01S     IFGT YF01E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 18-C                     END
|    C   99                GOTO END100
     C*
     C           YM        IFNE F01YM
     C                     SETON                     626386
     C                     SETON                     686999
     C                     END
|    C   99                GOTO END100
     C*
      *
|    C*當年起訖D02S,D02E
| 19-C           D02S      IFEQ 0
M004MC*                    MOVEL'0401'    D02SMD
M004MC                     MOVEL'0701'    D02SMD
|   C                     MOVELYYS       D02SY
| 20-C*M004M     MMS       IFLT '04'
M004MC           MMS       IFLT '07'
|   C*M001M     D02S      SUB  1         D02S
M001MC                     MOVE D02S      HB2@F6  6
M001MC                     EXSR HB@68R
M001MC                     MOVE HB2@T8    W8      80
M001MC           W8        SUB  1         W8
M001MC                     MOVE '008P3'   HB2@FA
M001MC                     MOVE W8        HB2@F
M001MC                     MOVE '006N3'   HB2@TA
M001MC                     EXSR HB@RMV                     ADD CENTURY
M001MC                     MOVE HB2@T     D02S
| 20-C                     END
| 19-C                     END
| 21-C           D02E      IFEQ 0
|   C                     Z-ADDDATEE     D02E
| 21-C                     END
|    C*
|    C*起始日須為每月之第一日
| 22-C           D02SD     IFNE '01'
|   C                     SETON                     708899
| 22-C                     END
|    C   99                GOTO END100
|    C* CHK
| 09-C           D02S      IFNE 0
|   C                     CALL 'P09'
|   C                     PARM D02S      P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 11-C           D02E      IFNE 0
|   C                     CALL 'P09'
|   C                     PARM D02E      P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
      *
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D02S      S001I2  60
|    C           F02S      PARM           S001O1  60
M001AC                     MOVE F02S      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YF02S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM D02E      S001I2  60
|    C           F02E      PARM           S001O1  60
M001AC                     MOVE F02E      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YF02E
     C*
| 23-C*M001M     F02S      IFGT F02E
M001MC           YF02S     IFGT YF02E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 23-C                     END
|    C   99                GOTO END100
|    C*
| 26-C           F02SYM    IFNE F02EYM
|   C           F02EYM    SUB  1         F02EW
M001AC           YFEYM     SUB  1         YFEW
| 26-C                     END
| 26-C           F02SYM    IFNE F02EYM
     C                     Z-ADDF02E      F0201
     C                     MOVEL'01'      F0201D
M001AC                     MOVE F0201     HB2@F6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YF0201
| 26-C                     END
|    C*去年起訖D03S,D03E
| 24-C           D03S      IFEQ 0
|   C*M001M     D02SY     SUB  1         D03SY
M001MC                     MOVE D02SY     HB2@YY  2
M001MC                     EXSR HB@24Y
M001MC                     MOVE HB2@Y4    W4      40
M001MC                     SUB  1         W4
M001MC                     Z-ADDW4        D03SY
|   C                     Z-ADDD02SM     D03SM
| 24-C                     END
| 25-C           D03E      IFEQ 0
|   C*M001M     D02EY     SUB  1         D03EY
M001MC                     MOVE D02EY     HB2@YY  2
M001MC                     EXSR HB@24Y
M001MC                     MOVE HB2@Y4    W4      40
M001MC                     SUB  1         W4
M001MC                     Z-ADDW4        D03EY
|   C                     Z-ADDD02EM     D03EM
| 25-C                     END
|    C*
|    C                     MOVE D03SM     F03S
|    C                     MOVELD03SY     F03S
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE F03S      HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YF03S
     C*
|    C                     MOVE D03EM     F03E
|    C                     MOVELD03EY     F03E
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE F03E      HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YF03E
     C*
| 23-C*M001M     F03S      IFGT F03E
M001MC           YF03S     IFGT YF03E
|   C                     SETON                     7273
|   C                     SETON                     9299
| 23-C                     END
|    C   99                GOTO END100
|    C*
|    C*
| 27-C           DSEL1     IFEQ *BLANK
|   C                     SETON                     649599
| 27-C                     END
|    C   99                GOTO END100
|    C*
| 28-C           DSEL2     IFEQ *BLANK
|   C                     SETON                     659599
| 28-C                     END
| @@ C           DSEL4     IFEQ *BLANK
| @@ C                     SETON                     669599
| @@ C                     END
|    C   99                GOTO END100
      *SCREEN LOG
     C           *IN05     IFNE '1'
     C                     OPEN SAR072Z
     C                     WRITEPH1
     C                     CLOSESAR072Z
     C                     END
      *
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*產品代號
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DMA01E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
|   C*
| 05-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
