      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SAR0651                                       *
      * AUTHER       : TINA WHANG                                    *
      * CREATE DATE  : 82/03/15                                      *
      * UPDATE DATE  : 82/07/13                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :試飲原因統計表　　　　　　                   *
      *              :報表增加成本的部份                           *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FREWF64  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *辦事處
     I                                      601 601 COMPS
     I                                      602 602 COMPE
      *通路
     I                                      603 603 DSC33S
     I                                      604 604 DSC33E
      *原因
     I                                      605 606 DSC10S
     I                                      607 608 DSC10E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      610 6150YMDS
     I                                      616 6210YMDE
     I                                      622 6270DSC39S
     I                                      628 6330DSC39E
     I                                      640 648 DSD03S
     I                                      650 658 DSD03E
     I*辦事處
     I            DS
     I                                        1   2 SC01
     I                                        2   2 SC01L
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           SD03
     C                     KFLD           SC10
     C                     KFLD           SC01L
     C                     KFLD           SC33
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     READ SC0                      45
  01-C           *IN45     DOWEQ'0'
    C           SC02      SETLLSD0
    C           SC02      READESD0                      46
  02-C           *IN46     DOWEQ'0'
    C*
  03-C           SD03      IFGE DSD03S
    C           SD03      ANDLEDSD03E
    C           KEYWF     CHAINWF640                40
    C                     EXSR RTN100
  03-C                     END
    C*
    C           SC02      READESD0                      46
  02-C                     END
    C*
    C                     READ SC0                      45
  01-C                     END
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....WRITE OR UPDATE REWF64
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
| 04-C           *IN40     IFEQ '0'
|   C                     ADD  SD04      WF6405
     C           SD10      ADD  SD11      AMT    112
     C                     ADD  SD12      AMT
     C           SD04      ADD  SD05      TOT     50
     C           TOT       MULT AMT       TOT07  112
     C                     ADD  TOT07     WF6407
     C           TOT       MULT SD22      TOT08  112
     C                     ADD  TOT08     WF6408
     C           TOT       MULT SD23      TOT09  112
     C                     ADD  TOT09     WF6409
     C           TOT       MULT SD24      TOT10  112
     C                     ADD  TOT10     WF6410
     C                     ADD  TOT08     WF6411
     C                     ADD  TOT09     WF6411
     C                     ADD  TOT10     WF6411
|   C                     UPDATWF640
| 04*C                     ELSE
|   C                     Z-ADDSD04      WF6405
|   C                     MOVELSD03      WF6401
|   C                     MOVELSC10      WF6402
|   C                     MOVELSC01L     WF6403
|   C                     MOVELSC33      WF6404
     C           SD10      ADD  SD11      AMT    112
     C                     ADD  SD12      AMT
     C           SD04      ADD  SD05      TOT     50
     C           TOT       MULT AMT       WF6407
     C           TOT       MULT SD22      WF6408
     C           TOT       MULT SD23      WF6409
     C           TOT       MULT SD24      WF6410
     C           WF6408    ADD  WF6409    WF6411
     C                     ADD  WF6410    WF6411
|   C                     WRITEWF640
| 04-C                     END
|    C*
01===C                     ENDSR
