      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
      *                                                              *
      * PROGRAM NAME : SAR074                                        *
      * AUTHER       : MERCURY                                       *
      * CREATE DATE  : 83/05/13                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :品牌／客戶達成率同期比較表　                 *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.12  Y2K MODIFY                    */
     /*-------------------------------------------------------------*/
     /* M002  MICHELLE   99.01.29  CALL P20之前先轉成中國年    */
     /*=============================================================*/
      ****************************************************************
     FPA#APF  IF  E           K        DISK
     FSAR074D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSAR074Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     **BRAND
     I                                      602 603 DMA10
      *單瓶
     I                                      604 604 DSEL2
     I                                      605 610 DMA01
      *MM/DD/YY FROM SCREEN
     I                                      611 6160DATES
     I                                      611 6120MMS
     I                                      613 6140DDS
     I                                      615 6160YYS
     I                                      621 6260DATEE
     I                                      621 6220MME
     I                                      623 6240DDE
     I                                      625 6260YYE
      *YY/MM/DD  本期
     I*                                     631 6360AYMDS
     I*                                     631 6320AYYS
     I*                                     633 6360AMDS
     I*                                     631 6340AYYMMS
     I*                                     641 6460AYMDE
     I*                                     641 6420AYYE
     I*                                     643 6460AMDE
     I*                                     641 6440AYYMME
M001MI                                      631 6380AYMDS
M001MI                                      631 6340AYYS
M001MI                                      635 6380AMDS
M001MI                                      631 6360AYYMMS
M001MI                                      641 6480AYMDE
M001MI                                      641 6440AYYE
M001MI                                      645 6480AMDE
M001MI                                      641 6460AYYMME
      *YY/MM/DD  本年
     I*                                     651 6560BYMDS
     I*                                     651 6520BYYS
     I*                                     653 6560BMDS
     I*                                     661 6660BYMDE
     I*                                     661 6620BYYE
     I*                                     643 6660BMDE
M001MI                                      651 6580BYMDS
M001MI                                      651 6540BYYS
M001MI                                      655 6580BMDS
M001MI                                      661 6680BYMDE
M001MI                                      661 6640BYYE
M001MI                                      665 6680BMDE
     I*
      *YY/MM/DD  去年同期
     I*                                     671 6760CYMDS
     I*                                     671 6720CYYS
     I*                                     673 6760CMDS
     I*                                     681 6860CYMDE
     I*                                     681 6820CYYE
     I*                                     683 6860CMDE
M001MI                                      671 6780CYMDS
M001MI                                      671 6740CYYS
M001MI                                      675 6780CMDS
M001MI                                      681 6880CYMDE
M001MI                                      681 6840CYYE
M001MI                                      685 6880CMDE
      *YY/MM/DD  去年
     I*                                     691 6960DYMDS
     I*                                     691 6920DYYS
     I*                                     693 6940DMMS
     I*                                     695 6960DDDS
     I*                                     701 7060DYMDE
     I*                                     701 7020DYYE
     I*                                     703 7060DMDE
M001MI                                      691 6980DYMDS
M001MI                                      691 6940DYYS
M001MI                                      695 6960DMMS
M001MI                                      697 6980DDDS
M001MI                                      701 7080DYMDE
M001MI                                      701 7040DYYE
M001MI                                      705 7080DMDE
     I*目標
     I                                      709 7100YEAR
     I                                      711 7120FDAY
     I                                      713 7140SDAY
     I                                      715 715 MON04
     I                                      716 716 MON05
     I                                      717 717 MON06
     I                                      718 718 MON07
     I                                      719 719 MON08
     I                                      720 720 MON09
     I                                      721 721 MON10
     I                                      722 722 MON11
     I                                      723 723 MON12
     I                                      724 724 MON01
     I                                      725 725 MON02
     I                                      726 726 MON03
     I                                      727 7280FDAYT
     I                                      729 7300SDAYT
     I*
     I*辦事處
     I                                      750 750 COMP
     I                                      751 751 COMPS
     I                                      752 752 COMPE
     I            DS
     I                                        1   60WRKDAT
     I                                        1   20WRKYY
     I                                        3   40WRKMM
     I                                        5   60WRKDD
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
|   C           *IN05     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
     C           *IN99     IFEQ '0'
    C                     EXSR RTN200                                 ?
    C                     EXSR RTN900                                 ?
  02-C                     END
  02-C                     END
  01-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
     C                     MOVEL$USER     AUT     3
     C           AUT       IFNE 'D91'
     C           AUT       ANDNE'REP'
     C           AUT       ANDNE'DER'
|    C                     SETON                     31
     C                     END
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE '*'       COMP
|    C                     MOVE *BLANK    DMA10
|    C                     MOVE 'A'       DSEL2
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     Z-ADD0         AYMDS
|    C                     Z-ADD0         AYMDE
M001AC                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* BRAND
|    C*
| 02-C           DMA10     IFEQ *BLANK
|   C                     SETON                     619599
| 02-C                     END
|    C   99                GOTO END100
|    C*
     C                     MOVEL'BRAND   '#A01
     C                     MOVELDMA10     #A02
|    C           KEY#A     CHAIN#A0                  40
     C           *IN40     IFEQ '1'
|   C                     SETON                     619599
     C                     END
|    C   99                GOTO END100
| 02-C           DMA10     IFEQ 'RM'
     C           DMA01     ANDEQ*BLANKS
|   C                     SETON                     619599
| 02-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-日期
| 06-C           DATES     IFEQ 0
|   C                     SETON                     629599
| 06-C                     END
|    C   99                GOTO END100
|    C*
| 07-C           DATEE     IFEQ 0
|   C                     SETON                     639599
| 07-C                     END
|    C   99                GOTO END100
|    C*日期區間不可跨年度
|   C*M001M     YYE       SUB  YYS       WRKYY
M001AC                     MOVE YYE       HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4E     40
M001AC                     MOVE YYS       HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4S     40
M001AC           W4E       SUB  W4S       WRKYY
| 08-C           WRKYY     IFGT 1
|   C                     SETON                     6263
|   C                     SETON                     8699
| 08-C                     ELSE
| 08-C           WRKYY     IFGT 0
| 08-C           MMS       IFLT 4
| 08-C           MME       ORGT 3
|   C                     SETON                     6263
|   C                     SETON                     8699
| 08-C                     END
     C                     ELSE
| 08-C           MMS       IFLT 4
| 08-C           MME       ANDGT3
|   C                     SETON                     6263
|   C                     SETON                     8699
| 08-C                     END
| 08-C                     END
| 08-C                     END
|    C   99                GOTO END100
|    C* CHK
| 09-C           DATES     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DATES     P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 10-C                     END
| 09-C                     END
|    C   99                GOTO END100
|    C*
| 11-C           DATEE     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DATEE     P0901I  60
|   C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATES     S001I2  60
|    C*M001M     AYMDS     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    AYMDS
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATEE     S001I2  60
|    C*M001M     AYMDE     PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    AYMDE
|    C*
|    C* RANGE CHECK
|    C*
| 11-C           AYMDS     IFGT AYMDE
|   C                     SETON                     6263
|   C                     SETON                     9199
| 11-C                     END
|    C   99                GOTO END100
|    C**
| 28-C           DSEL2     IFEQ *BLANK
|   C                     SETON                     659599
| 28-C                     END
|    C   99                GOTO END100
      *SCREEN LOG
     C                     OPEN SAR074Z
     C                     WRITEPH1
     C                     CLOSESAR074Z
      *
02===C           END100    ENDSR
      *===============================================================*
      *          RTN200....GET DATE
      *===============================================================*
02===C           RTN200    BEGSR
|    C**
|    C** GET TARGET YEAR
|    C**
|    C           MME       IFLT 4
|    C*M001M     YYE       SUB  1         YEAR
M001AC                     MOVE YYE       HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    W4E     40
M001AC           W4E       SUB  1         YEAR
| 28-C                     ELSE
|    C                     Z-ADDYYE       YEAR
| 28-C                     END
|    C**
|    C** 跨月非整起月
|    C**
|    C           DDS       IFNE 1
|    C           MMS       ANDNEMME
     C           AYYMMS    SUB  1100      CHNYY   40
     C                     CALL 'P22'
     C                     PARM CHNYY     PRM04   40
     C                     PARM 'Y'       PRM05   1
     C                     PARM 0         PRM06   20
|    C                     Z-ADDPRM06     WRKDD
|    C                     Z-ADDPRM06     FDAYT
|    C                     Z-ADDMMS       WRKMM
|    C                     Z-ADDYYS       WRKYY
M002AC           AYMDS     SUB  19110000  WAYMDS  60
M002AC                     MOVE WRKDAT    HB2@F6  6
M002AC                     EXSR HB@68L
M002AC                     MOVE HB2@T8    XRKDAT  80
M002AC           XRKDAT    SUB  19110000  XX      60
     C                     CALL 'P20'
M002MC*                    PARM AYMDS     PRM01   60
M002MC*                    PARM WRKDAT    PRM02   60
M002MC                     PARM WAYMDS    PRM01   60
M002MC                     PARM XX        PRM02   60
     C                     PARM 0         PRM03   90
    C                     EXSR RTN501                                 ?
| 28-C                     END
|    C**
|    C**
|    C** 跨月整起月
|    C**
|    C           DDS       IFEQ 1
|    C           MMS       ANDNEMME
    C                     EXSR RTN503                                 ?
| 28-C                     END
|    C**
|    C** 跨月非整迄月
|    C**
     C           AYYMME    SUB  1100      CHNYY
     C                     CALL 'P22'
     C                     PARM CHNYY     PRM04   40
     C                     PARM 'Y'       PRM05   1
     C                     PARM 0         PRM06   20
     C                     Z-ADDPRM06     SDAYT
|    C           MMS       IFNE MME
|    C           DDE       ANDNEPRM06
|    C                     Z-ADD01        WRKDD
|    C                     Z-ADDMME       WRKMM
|    C                     Z-ADDYYE       WRKYY
M002AC           AYMDE     SUB  19110000  WAYMDE  60
M002AC                     MOVE WRKDAT    HB2@F6  6
M002AC                     EXSR HB@68L
M002AC                     MOVE HB2@T8    XRKDAT  80
M002AC           XRKDAT    SUB  19110000  XX      60
     C                     CALL 'P20'
M002MC*                    PARM WRKDAT    PRM01   60
M002MC*                    PARM AYMDE     PRM02   60
M002MC                     PARM XX        PRM01   60
M002MC                     PARM WAYMDE    PRM02   60
     C                     PARM 0         PRM03   90
    C                     EXSR RTN502                                 ?
| 28-C                     END
|    C**
|    C** 跨月整迄月
|    C**
     C           AYYMME    SUB  1100      CHNYY
     C                     CALL 'P22'
     C                     PARM CHNYY     PRM04   40
     C                     PARM 'Y'       PRM05   1
     C                     PARM 0         PRM06   20
|    C           MMS       IFNE MME
|    C           DDE       ANDEQPRM06
    C                     EXSR RTN504                                 ?
| 28-C                     END
|    C**
|    C** 跨多月整月
|    C**
|    C           MMS       IFNE MME
    C                     EXSR RTN600                                 ?
| 28-C                     END
|    C**
|    C** 非跨月非整月
|    C**
|    C           MMS       IFEQ MME
|    C           DDS       IFNE 1
|    C           DDE       ORNE PRM06
M002AC           AYMDE     SUB  19110000  WAYMDE  60
M002AC           AYMDS     SUB  19110000  WAYMDS  60
     C                     CALL 'P20'
M002MC*                    PARM AYMDS     PRM01   60
M002MC*                    PARM AYMDE     PRM02   60
M002MC                     PARM WAYMDS    PRM01   60
M002MC                     PARM WAYMDE    PRM02   60
     C                     PARM 0         PRM03   90
    C                     EXSR RTN505                                 ?
| 28-C                     END
| 28-C                     END
|    C**
|    C** 非跨月整月
|    C**
|    C           MMS       IFEQ MME
|    C           DDS       ANDEQ1
|    C           DDE       ANDEQPRM06
    C                     EXSR RTN506                                 ?
| 28-C                     END
|    C**
02===C           END200    ENDSR
      *===============================================================*
|     *          RTN501....  跨月非整起月
      *===============================================================*
02===C           RTN501    BEGSR
     C*
     C           MMS       IFEQ 1
     C                     MOVE 'P'       MON01
     C                     END
     C*
     C           MMS       IFEQ 2
     C                     MOVE 'P'       MON02
     C                     END
     C*
     C           MMS       IFEQ 3
     C                     MOVE 'P'       MON03
     C                     END
     C*
     C           MMS       IFEQ 4
     C                     MOVE 'P'       MON04
     C                     END
     C*
     C           MMS       IFEQ 5
     C                     MOVE 'P'       MON05
     C                     END
     C*
     C           MMS       IFEQ 6
     C                     MOVE 'P'       MON06
     C                     END
     C*
     C           MMS       IFEQ 7
     C                     MOVE 'P'       MON07
     C                     END
     C*
     C           MMS       IFEQ 8
     C                     MOVE 'P'       MON08
     C                     END
     C*
     C           MMS       IFEQ 9
     C                     MOVE 'P'       MON09
     C                     END
     C*
     C           MMS       IFEQ 10
     C                     MOVE 'P'       MON10
     C                     END
     C*
     C           MMS       IFEQ 11
     C                     MOVE 'P'       MON11
     C                     END
     C*
     C           MMS       IFEQ 12
     C                     MOVE 'P'       MON12
     C                     END
     C*
     C           PRM03     ADD  1         FDAY
     C*
     C*
02===C           END501    ENDSR
      *===============================================================*
|     *          RTN502....  跨月非整迄月
      *===============================================================*
02===C           RTN502    BEGSR
     C*
     C           MME       IFEQ 1
     C                     MOVE 'P'       MON01
     C                     END
     C*
     C           MME       IFEQ 2
     C                     MOVE 'P'       MON02
     C                     END
     C*
     C           MME       IFEQ 3
     C                     MOVE 'P'       MON03
     C                     END
     C*
     C           MME       IFEQ 4
     C                     MOVE 'P'       MON04
     C                     END
     C*
     C           MME       IFEQ 5
     C                     MOVE 'P'       MON05
     C                     END
     C*
     C           MME       IFEQ 6
     C                     MOVE 'P'       MON06
     C                     END
     C*
     C           MME       IFEQ 7
     C                     MOVE 'P'       MON07
     C                     END
     C*
     C           MME       IFEQ 8
     C                     MOVE 'P'       MON08
     C                     END
     C*
     C           MME       IFEQ 9
     C                     MOVE 'P'       MON09
     C                     END
     C*
     C           MME       IFEQ 10
     C                     MOVE 'P'       MON10
     C                     END
     C*
     C           MME       IFEQ 11
     C                     MOVE 'P'       MON11
     C                     END
     C*
     C           MME       IFEQ 12
     C                     MOVE 'P'       MON12
     C                     END
     C*
     C           PRM03     ADD  1         SDAY
     C*
     C*
02===C           END502    ENDSR
      *===============================================================*
|     *          RTN503....  跨月整起月
      *===============================================================*
02===C           RTN503    BEGSR
     C*
     C           MMS       IFEQ 1
     C                     MOVE 'F'       MON01
     C                     END
     C*
     C           MMS       IFEQ 2
     C                     MOVE 'F'       MON02
     C                     END
     C*
     C           MMS       IFEQ 3
     C                     MOVE 'F'       MON03
     C                     END
     C*
     C           MMS       IFEQ 4
     C                     MOVE 'F'       MON04
     C                     END
     C*
     C           MMS       IFEQ 5
     C                     MOVE 'F'       MON05
     C                     END
     C*
     C           MMS       IFEQ 6
     C                     MOVE 'F'       MON06
     C                     END
     C*
     C           MMS       IFEQ 7
     C                     MOVE 'F'       MON07
     C                     END
     C*
     C           MMS       IFEQ 8
     C                     MOVE 'F'       MON08
     C                     END
     C*
     C           MMS       IFEQ 9
     C                     MOVE 'F'       MON09
     C                     END
     C*
     C           MMS       IFEQ 10
     C                     MOVE 'F'       MON10
     C                     END
     C*
     C           MMS       IFEQ 11
     C                     MOVE 'F'       MON11
     C                     END
     C*
     C           MMS       IFEQ 12
     C                     MOVE 'F'       MON12
     C                     END
     C*
     C                     Z-ADD0         FDAY
     C*
02===C           END503    ENDSR
      *===============================================================*
|     *          RTN504....  跨月整迄月
      *===============================================================*
02===C           RTN504    BEGSR
     C*
     C           MME       IFEQ 1
     C                     MOVE 'F'       MON01
     C                     END
     C*
     C           MME       IFEQ 2
     C                     MOVE 'F'       MON02
     C                     END
     C*
     C           MME       IFEQ 3
     C                     MOVE 'F'       MON03
     C                     END
     C*
     C           MME       IFEQ 4
     C                     MOVE 'F'       MON04
     C                     END
     C*
     C           MME       IFEQ 5
     C                     MOVE 'F'       MON05
     C                     END
     C*
     C           MME       IFEQ 6
     C                     MOVE 'F'       MON06
     C                     END
     C*
     C           MME       IFEQ 7
     C                     MOVE 'F'       MON07
     C                     END
     C*
     C           MME       IFEQ 8
     C                     MOVE 'F'       MON08
     C                     END
     C*
     C           MME       IFEQ 9
     C                     MOVE 'F'       MON09
     C                     END
     C*
     C           MME       IFEQ 10
     C                     MOVE 'F'       MON10
     C                     END
     C*
     C           MME       IFEQ 11
     C                     MOVE 'F'       MON11
     C                     END
     C*
     C           MME       IFEQ 12
     C                     MOVE 'F'       MON12
     C                     END
     C*
     C                     Z-ADD0         SDAY
     C*
02===C           END504    ENDSR
      *===============================================================*
|     *          RTN505....  非跨月非整月
      *===============================================================*
02===C           RTN505    BEGSR
     C*
     C           MME       IFEQ 1
     C                     MOVE 'P'       MON01
     C                     END
     C*
     C           MME       IFEQ 2
     C                     MOVE 'P'       MON02
     C                     END
     C*
     C           MME       IFEQ 3
     C                     MOVE 'P'       MON03
     C                     END
     C*
     C           MME       IFEQ 4
     C                     MOVE 'P'       MON04
     C                     END
     C*
     C           MME       IFEQ 5
     C                     MOVE 'P'       MON05
     C                     END
     C*
     C           MME       IFEQ 6
     C                     MOVE 'P'       MON06
     C                     END
     C*
     C           MME       IFEQ 7
     C                     MOVE 'P'       MON07
     C                     END
     C*
     C           MME       IFEQ 8
     C                     MOVE 'P'       MON08
     C                     END
     C*
     C           MME       IFEQ 9
     C                     MOVE 'P'       MON09
     C                     END
     C*
     C           MME       IFEQ 10
     C                     MOVE 'P'       MON10
     C                     END
     C*
     C           MME       IFEQ 11
     C                     MOVE 'P'       MON11
     C                     END
     C*
     C           MME       IFEQ 12
     C                     MOVE 'P'       MON12
     C                     END
     C*
     C                     Z-ADD0         FDAY
     C           PRM03     ADD  1         SDAY
     C*
02===C           END505    ENDSR
      *===============================================================*
|     *          RTN506....  非跨月整月
      *===============================================================*
02===C           RTN506    BEGSR
     C*
     C           MME       IFEQ 1
     C                     MOVE 'F'       MON01
     C                     END
     C*
     C           MME       IFEQ 2
     C                     MOVE 'F'       MON02
     C                     END
     C*
     C           MME       IFEQ 3
     C                     MOVE 'F'       MON03
     C                     END
     C*
     C           MME       IFEQ 4
     C                     MOVE 'F'       MON04
     C                     END
     C*
     C           MME       IFEQ 5
     C                     MOVE 'F'       MON05
     C                     END
     C*
     C           MME       IFEQ 6
     C                     MOVE 'F'       MON06
     C                     END
     C*
     C           MME       IFEQ 7
     C                     MOVE 'F'       MON07
     C                     END
     C*
     C           MME       IFEQ 8
     C                     MOVE 'F'       MON08
     C                     END
     C*
     C           MME       IFEQ 9
     C                     MOVE 'F'       MON09
     C                     END
     C*
     C           MME       IFEQ 10
     C                     MOVE 'F'       MON10
     C                     END
     C*
     C           MME       IFEQ 11
     C                     MOVE 'F'       MON11
     C                     END
     C*
     C           MME       IFEQ 12
     C                     MOVE 'F'       MON12
     C                     END
     C*
     C                     Z-ADD0         FDAY
     C                     Z-ADD0         SDAY
     C*
02===C           END506    ENDSR
      *===============================================================*
|     *          RTN600....  跨多月整月
      *===============================================================*
02===C           RTN600    BEGSR
     C*
     C           MMS       IFLT MME
     C           MMS       ADD  1         WRKMM   20
     C           WRKMM     DOWLTMME
     C                     EXSR RTN601
     C                     ADD  1         WRKMM
     C                     END
     C                     END
     C*
     C           MMS       IFGT MME
     C           MMS       ADD  1         WRKMM   20
     C           WRKMM     DOWNEMME
     C           WRKMM     IFEQ 13
     C                     Z-ADD1         WRKMM
     C                     END
     C           WRKMM     IFNE MME
     C                     EXSR RTN601
     C                     ADD  1         WRKMM
     C                     END
     C                     END
     C                     END
     C*
02===C           END600    ENDSR
      *===============================================================*
|     *          RTN601....  跨多月整月
      *===============================================================*
02===C           RTN601    BEGSR
     C*
     C           WRKMM     IFEQ 1
     C                     MOVE 'F'       MON01
     C                     END
     C*
     C           WRKMM     IFEQ 2
     C                     MOVE 'F'       MON02
     C                     END
     C*
     C           WRKMM     IFEQ 3
     C                     MOVE 'F'       MON03
     C                     END
     C*
     C           WRKMM     IFEQ 4
     C                     MOVE 'F'       MON04
     C                     END
     C*
     C           WRKMM     IFEQ 5
     C                     MOVE 'F'       MON05
     C                     END
     C*
     C           WRKMM     IFEQ 6
     C                     MOVE 'F'       MON06
     C                     END
     C*
     C           WRKMM     IFEQ 7
     C                     MOVE 'F'       MON07
     C                     END
     C*
     C           WRKMM     IFEQ 8
     C                     MOVE 'F'       MON08
     C                     END
     C*
     C           WRKMM     IFEQ 9
     C                     MOVE 'F'       MON09
     C                     END
     C*
     C           WRKMM     IFEQ 10
     C                     MOVE 'F'       MON10
     C                     END
     C*
     C           WRKMM     IFEQ 11
     C                     MOVE 'F'       MON11
     C                     END
     C*
     C           WRKMM     IFEQ 12
     C                     MOVE 'F'       MON12
     C                     END
     C*
02===C           END601    ENDSR
      *===============================================================*
|     *          RTN900....  各期年月起迄
      *===============================================================*
02===C           RTN900    BEGSR
     C*
     C*AYMD      本期
     C*BYMD      本年
     C                     Z-ADDAYMDE     BYMDE
     C                     Z-ADD401       BMDS
     C           MME       IFLT 4
     C           AYYE      SUB  1         BYYS
     C                     ELSE
     C                     Z-ADDAYYE      BYYS
     C                     END
     C*CYMD      去年同期
     C                     Z-ADDAYMDS     CYMDS
     C                     Z-ADDAYMDE     CYMDE
     C                     SUB  1         CYYS
     C                     SUB  1         CYYE
     C*DYMD      去年
     C                     Z-ADDBYMDS     DYMDS
     C                     Z-ADDBYMDE     DYMDE
     C                     SUB  1         DYYS
     C                     SUB  1         DYYE
     C*
     C                     EXSR RTN901
     C*
02===C           END900    ENDSR
      *===============================================================*
|     *          RTN901....  地區起迄
      *===============================================================*
02===C           RTN901    BEGSR
|    C* CHK辦事處
| 01-C           COMP      IFEQ '*'
|   C                     MOVE '1'       COMPS
|   C                     MOVE '3'       COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
     C*
02===C           END901    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C*  GET ROW,COL
|    C*
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C*
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 02-C           D#ROW     IFEQ 8
| 03-C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS026'
|   C                     PARM           DMA10
|   C                     GOTO ENDF4
| 03-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
