      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
      * PROGRAM NAME : SAR0721                                       *
      * AUTHER       : MERCURY                                       *
      * CREATE DATE  : 83/05/13                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :通路產品銷售週報表－依辦事處                 *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.12  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FMTMDLF01IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FSOSKLF02IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FREW103  UF  E           K        DISK                      A
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *BRAND
     I                                      602 603 DMA10
      *單瓶
     I                                      604 604 DSEL2
     I                                      605 610 DMA01
      *MM/DD/YY FROM SCREEN
     I                                      611 6160DATES
     I                                      611 6120MMS
     I                                      613 6140DDS
     I                                      615 6160YYS
     I                                      621 6260DATEE
     I                                      621 6220MME
     I                                      623 6240DDE
     I                                      625 6260YYE
      *YY/MM/DD  本期
     I*                                     631 6360AYMDS
     I*                                     631 6320AYYS
     I*                                     633 6360AMDS
     I*                                     631 6340AYYMMS
     I*                                     641 6460AYMDE
     I*                                     641 6420AYYE
     I*                                     643 6460AMDE
     I*                                     641 6440AYYMME
M001MI                                      631 6380AYMDS
M001MI                                      631 6340AYYS
M001MI                                      635 6380AMDS
M001MI                                      631 6360AYYMMS
M001MI                                      641 6480AYMDE
M001MI                                      641 6440AYYE
     I*                                     645 6480AMDE
     I*                                     641 6460AYYMME
      *YY/MM/DD  本年
     I*                                     651 6560BYMDS
     I*                                     651 6520BYYS
     I*                                     653 6560BMDS
     I*                                     661 6660BYMDE
     I*                                     661 6620BYYE
     I*                                     643 6660BMDE
M001MI                                      651 6580BYMDS
M001MI                                      651 6540BYYS
M001MI                                      655 6580BMDS
M001MI                                      661 6680BYMDE
M001MI                                      661 6640BYYE
M001MI                                      655 6680BMDE
     I*
      *YY/MM/DD  去年同期
     I*                                     671 6760CYMDS
     I*                                     671 6720CYYS
     I*                                     673 6760CMDS
     I*                                     681 6860CYMDE
     I*                                     681 6820CYYE
     I*                                     683 6860CMDE
M001MI                                      671 6780CYMDS
M001MI                                      671 6740CYYS
M001MI                                      675 6780CMDS
M001MI                                      681 6880CYMDE
M001MI                                      681 6840CYYE
M001MI                                      685 6880CMDE
      *YY/MM/DD  去年
     I*                                     691 6960DYMDS
     I*                                     691 6920DYYS
     I*                                     693 6940DMMS
     I*                                     695 6960DDDS
     I*                                     701 7060DYMDE
     I*                                     701 7020DYYE
     I*                                     703 7060DMDE
M001MI                                      691 6980DYMDS
M001MI                                      691 6940DYYS
M001MI                                      695 6960DMMS
M001MI                                      697 6980DDDS
M001MI                                      701 7080DYMDE
M001MI                                      701 7040DYYE
M001MI                                      705 7080DMDE
     I*目標
     I                                      709 7100YEAR
     I                                      711 7120FDAY
     I                                      713 7140SDAY
     I                                      715 715 MON04
     I                                      716 716 MON05
     I                                      717 717 MON06
     I                                      718 718 MON07
     I                                      719 719 MON08
     I                                      720 720 MON09
     I                                      721 721 MON10
     I                                      722 722 MON11
     I                                      723 723 MON12
     I                                      724 724 MON01
     I                                      725 725 MON02
     I                                      726 726 MON03
     I                                      727 7280FDAYT
     I                                      729 7300SDAYT
     I*
     I*辦事處
     I                                      750 750 COMP
     I                                      751 751 COMPS
     I                                      752 752 COMPE
     I            DS
     I                                        1   9 SK06
     I                                        1   6 SSK06
     I            DS
     I                                        1   4 MC03
     I                                        4   4 MC03A
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF8704    WORK01
     C           *LIKE     DEFN WF8704    WORK02
     C           *LIKE     DEFN WF8704    WORK03
     C           *LIKE     DEFN WF8704    WORK04
     C           *LIKE     DEFN WF8704    WORK05
     C           *LIKE     DEFN WF8704    WORK06
     C           *LIKE     DEFN WF8704    WORK07
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYSK1    KLIST
     C                     KFLD           SK02
     C                     KFLD           SK34
     C                     KFLD           SK06
     C*                    KFLD           SK07
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN010
     C                     EXSR RTN10A                     *PA#APF
     C                     EXSR RTN10B                     *SOSKLF02
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN010
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     OUT  *NAMVAR
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN10A    PA#APF
      *==============================================================*
02===C           RTN10A    BEGSR
|    C*
|    C                     MOVELDMA10     WF8701
|    C                     MOVEL'BRAND   '#A01
|    C                     MOVELDMA10     #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      WF870X
| 01-C                     END
|    C*
|    C                     MOVELDMA01     WF8712
|    C*
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVEL*BLANK    #A02
|    C           KEY#A     SETLL#A0
|    C           #A01      READE#A0                      46
| 02-C           *IN46     DOWEQ'0'
|   C                     MOVEL#A02      CHANEL  1
| 03-C           CHANEL    IFEQ 'A'
|   C                     EXSR RTN101
| 03*C                     ELSE
|   C                     EXSR RTN102
| 03-C                     END
|   C           #A01      READE#A0                      46
| 02-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN101    AGENT
      *==============================================================*
03===C           RTN101    BEGSR
|    C*
|    C           CHANEL    SETLLMTMDLF01
|    C           CHANEL    READEMTMDLF01                 42
| 01-C           *IN42     DOWEQ'0'
| 01-C           MD08      IFEQ '10'
| 01-C           MD08      OREQ '13'
|   C           MD01      CHAINMTMEPF               40
| 02-C           *IN40     IFEQ '0'
|   C           COMP      ANDEQ'*'
|   C                     MOVELME01      WF8702
|   C                     MOVELME04      WF8703
|   C                     WRITEWF870
| 02*C                     ELSE
|   C           ME15      CHAINMC0                  41
| 03-C           COMP      IFEQ MC03A
|   C                     MOVELME01      WF8702
|   C                     MOVELME04      WF8703
|   C                     WRITEWF870
| 03-C                     END
| 02-C                     END
| 02-C                     END
|   C           CHANEL    READEMTMDLF01                 42
| 01-C                     END
03===C                     ENDSR
      *==============================================================*
      *          RTN102    CHANNEL
      *==============================================================*
04===C           RTN102    BEGSR
|    C*
|    C                     MOVEL*BLANK    WF8702
|    C                     MOVELCHANEL    WF8702
|    C                     MOVEL#A03      WF8703
|    C                     WRITEWF870
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN10B    SOSKLF02
      *==============================================================*
05===C           RTN10B    BEGSR
|    C*
|    C                     MOVELDMA10     SK34
|    C                     MOVELDMA01     SK06
B2000C*M001M               Z-ADDYEAR      SK02
M001AC                     MOVE YEAR      HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    SK02
|    C                     MOVELCOMP      SK07
|    C           KEYSK1    SETLLSK0
|    C           KEYSK1    READESK0                      42
| 01-C           *IN42     DOWEQ'0'
|   C                     MOVEL*BLANK    KEYWF
| 02-C           SK03      IFNE 'A'
|   C                     MOVELSK03      KEYWF   5
| 02*C                     ELSE
|   C                     MOVELSK05      KEYWF
| 02-C                     END
|   C           KEYWF     CHAINWF870                40
| 03-C           *IN40     IFEQ '0'
|   C                     EXSR RTN250
|   C                     EXSR RTN350
|   C                     UPDATWF870
| 03-C                     END
|   C           KEYSK1    READESK0                      42
| 01-C                     END
05===C                     ENDSR
      *==============================================================*
      *          RTN250    QTY CONTROL  FULL MONTH
      *==============================================================*
06===C           RTN250    BEGSR
|    C*
|    C                     Z-ADD0         QTY1    90
|    C                     Z-ADD0         QTY2    90
|    C                     Z-ADD0         QTY3    90
|    C*
| 01-C           MON04     IFEQ 'F'
|   C                     ADD  SK10      QTY1
| 01-C                     END
|    C*
| 02-C           MON05     IFEQ 'F'
|   C                     ADD  SK11      QTY1
| 02-C                     END
|    C*
| 03-C           MON06     IFEQ 'F'
|   C                     ADD  SK12      QTY1
| 03-C                     END
|    C*
| 04-C           MON07     IFEQ 'F'
|   C                     ADD  SK13      QTY1
| 04-C                     END
|    C*
| 05-C           MON08     IFEQ 'F'
|   C                     ADD  SK14      QTY1
| 05-C                     END
|    C*
| 06-C           MON09     IFEQ 'F'
|   C                     ADD  SK15      QTY1
| 06-C                     END
|    C*
| 07-C           MON10     IFEQ 'F'
|   C                     ADD  SK16      QTY1
| 07-C                     END
|    C*
| 08-C           MON11     IFEQ 'F'
|   C                     ADD  SK17      QTY1
| 08-C                     END
|    C*
| 09-C           MON12     IFEQ 'F'
|   C                     ADD  SK18      QTY1
| 09-C                     END
|    C*
| 10-C           MON01     IFEQ 'F'
|   C                     ADD  SK19      QTY1
| 10-C                     END
|    C*
| 11-C           MON02     IFEQ 'F'
|   C                     ADD  SK20      QTY1
| 11-C                     END
|    C*
| 12-C           MON03     IFEQ 'F'
|   C                     ADD  SK21      QTY1
| 12-C                     END
|    C*
|    C                     EXSR RTN260
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN260    QTY CONTROL  PARTIAL MONTH
      *==============================================================*
07===C           RTN260    BEGSR
|    C*
| 01-C           FDAY      IFNE 0
|   C                     EXSR RTN270
| 01-C                     END
| 02-C           SDAY      IFNE 0
|   C                     EXSR RTN280
| 02-C                     END
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN270    QTY CONTROL  PARTIAL MONTH
      *==============================================================*
08===C           RTN270    BEGSR
|    C*
| 01-C           MON04     IFEQ 'P'
|   C                     ADD  SK10      QTY3
| 01*C                     ELSE
|   C*
| 02-C           MON05     IFEQ 'P'
|   C                     ADD  SK11      QTY3
| 02*C                     ELSE
|   C*
| 03-C           MON06     IFEQ 'P'
|   C                     ADD  SK12      QTY3
| 03*C                     ELSE
|   C*
| 04-C           MON07     IFEQ 'P'
|   C                     ADD  SK13      QTY3
| 04*C                     ELSE
|   C*
| 05-C           MON08     IFEQ 'P'
|   C                     ADD  SK14      QTY3
| 05*C                     ELSE
|   C*
| 06-C           MON09     IFEQ 'P'
|   C                     ADD  SK15      QTY3
| 06*C                     ELSE
|   C*
| 07-C           MON10     IFEQ 'P'
|   C                     ADD  SK16      QTY3
| 07*C                     ELSE
|   C*
| 08-C           MON11     IFEQ 'P'
|   C                     ADD  SK17      QTY3
| 08*C                     ELSE
|   C*
| 09-C           MON12     IFEQ 'P'
|   C                     ADD  SK18      QTY3
| 09*C                     ELSE
|   C*
| 10-C           MON01     IFEQ 'P'
|   C                     ADD  SK19      QTY3
| 10*C                     ELSE
|   C*
| 11-C           MON02     IFEQ 'P'
|   C                     ADD  SK20      QTY3
| 11*C                     ELSE
|   C*
| 12-C           MON03     IFEQ 'P'
|   C                     ADD  SK21      QTY3
| 12-C                     END
| 11-C                     END
| 10-C                     END
| 09-C                     END
| 08-C                     END
| 07-C                     END
| 06-C                     END
| 05-C                     END
| 04-C                     END
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
|    C           FDAY      DIV  FDAYT     WRKDAT  54
|    C           QTY3      MULT WRKDAT    QTY3      H
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN280    QTY CONTROL  PARTIAL MONTH
      *==============================================================*
09===C           RTN280    BEGSR
|    C*
| 01-C           MON03     IFEQ 'P'
|   C                     ADD  SK21      QTY2
| 01*C                     ELSE
|   C*
| 02-C           MON02     IFEQ 'P'
|   C                     ADD  SK20      QTY2
| 02*C                     ELSE
|   C*
| 03-C           MON01     IFEQ 'P'
|   C                     ADD  SK19      QTY2
| 03*C                     ELSE
|   C*
| 04-C           MON12     IFEQ 'P'
|   C                     ADD  SK18      QTY2
| 04*C                     ELSE
|   C*
| 05-C           MON11     IFEQ 'P'
|   C                     ADD  SK17      QTY2
| 05*C                     ELSE
|   C*
| 06-C           MON10     IFEQ 'P'
|   C                     ADD  SK16      QTY2
| 06*C                     ELSE
|   C*
| 07-C           MON09     IFEQ 'P'
|   C                     ADD  SK15      QTY2
| 07*C                     ELSE
|   C*
| 08-C           MON08     IFEQ 'P'
|   C                     ADD  SK14      QTY2
| 08*C                     ELSE
|   C*
| 09-C           MON07     IFEQ 'P'
|   C                     ADD  SK13      QTY2
| 09*C                     ELSE
|   C*
| 10-C           MON06     IFEQ 'P'
|   C                     ADD  SK12      QTY2
| 10*C                     ELSE
|   C*
| 11-C           MON05     IFEQ 'P'
|   C                     ADD  SK11      QTY2
| 11*C                     ELSE
|   C*
| 12-C           MON04     IFEQ 'P'
|   C                     ADD  SK10      QTY2
| 12-C                     END
| 11-C                     END
| 10-C                     END
| 09-C                     END
| 08-C                     END
| 07-C                     END
| 06-C                     END
| 05-C                     END
| 04-C                     END
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
|    C           SDAY      DIV  SDAYT     WRKDAT
|    C           QTY2      MULT WRKDAT    QTY2      H
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN350    QTY CONTROL  YEARLY  TARGET
      *==============================================================*
10===C           RTN350    BEGSR
|    C*
|    C                     Z-ADD0         QTY4    90
|    C                     MOVEL'N'       ENDFLG  1
|    C                     SETOF                     38
|    C*
| 01-C           MON03     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 02-C           MON03     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK21      MULT WRKDAT    QTY4      H
| 02*C                     ELSE
| 03-C           MON03     IFEQ 'F'
|   C                     ADD  SK21      QTY4
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
| 04-C           ENDFLG    IFEQ 'N'
| 05-C           MON02     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 06-C           MON02     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK20      MULT WRKDAT    QTY4      H
| 06*C                     ELSE
| 07-C           MON02     IFEQ 'F'
|   C                     ADD  SK20      QTY4
| 07-C                     END
| 06-C                     END
| 05-C                     END
| 04*C                     ELSE
|   C                     ADD  SK20      QTY4
| 04-C                     END
|    C*
| 08-C           ENDFLG    IFEQ 'N'
| 09-C           MON01     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 10-C           MON01     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK19      MULT WRKDAT    QTY4      H
| 10*C                     ELSE
| 11-C           MON01     IFEQ 'F'
|   C                     ADD  SK19      QTY4
| 11-C                     END
| 10-C                     END
| 09-C                     END
| 08*C                     ELSE
|   C                     ADD  SK19      QTY4
| 08-C                     END
|    C*
| 12-C           ENDFLG    IFEQ 'N'
| 13-C           MON12     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 14-C           MON12     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK18      MULT WRKDAT    QTY4      H
| 14*C                     ELSE
| 15-C           MON12     IFEQ 'F'
|   C                     ADD  SK18      QTY4
| 15-C                     END
| 14-C                     END
| 13-C                     END
| 12*C                     ELSE
|   C                     ADD  SK18      QTY4
| 12-C                     END
|    C*
| 16-C           ENDFLG    IFEQ 'N'
| 17-C           MON11     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 18-C           MON11     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK17      MULT WRKDAT    QTY4      H
| 18*C                     ELSE
| 19-C           MON11     IFEQ 'F'
|   C                     ADD  SK17      QTY4
| 19-C                     END
| 18-C                     END
| 17-C                     END
| 16*C                     ELSE
|   C                     ADD  SK17      QTY4
| 16-C                     END
|    C*
| 20-C           ENDFLG    IFEQ 'N'
| 21-C           MON10     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 22-C           MON10     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK16      MULT WRKDAT    QTY4      H
| 22*C                     ELSE
| 23-C           MON10     IFEQ 'F'
|   C                     ADD  SK16      QTY4
| 23-C                     END
| 22-C                     END
| 21-C                     END
| 20*C                     ELSE
|   C                     ADD  SK16      QTY4
| 20-C                     END
|    C*
| 24-C           ENDFLG    IFEQ 'N'
| 25-C           MON09     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 26-C           MON09     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK15      MULT WRKDAT    QTY4      H
| 26*C                     ELSE
| 27-C           MON09     IFEQ 'F'
|   C                     ADD  SK15      QTY4
| 27-C                     END
| 26-C                     END
| 25-C                     END
| 24*C                     ELSE
|   C                     ADD  SK15      QTY4
| 24-C                     END
|    C*
| 28-C           ENDFLG    IFEQ 'N'
| 29-C           MON08     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 30-C           MON08     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK14      MULT WRKDAT    QTY4      H
| 30*C                     ELSE
| 31-C           MON08     IFEQ 'F'
|   C                     ADD  SK14      QTY4
| 31-C                     END
| 30-C                     END
| 29-C                     END
| 28*C                     ELSE
|   C                     ADD  SK14      QTY4
| 28-C                     END
|    C*
| 32-C           ENDFLG    IFEQ 'N'
| 33-C           MON07     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 34-C           MON07     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK13      MULT WRKDAT    QTY4      H
| 34*C                     ELSE
| 35-C           MON07     IFEQ 'F'
|   C                     ADD  SK13      QTY4
| 35-C                     END
| 34-C                     END
| 33-C                     END
| 32*C                     ELSE
|   C                     ADD  SK13      QTY4
| 32-C                     END
|    C*
| 36-C           ENDFLG    IFEQ 'N'
| 37-C           MON06     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 38-C           MON06     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK12      MULT WRKDAT    QTY4      H
| 38*C                     ELSE
| 39-C           MON06     IFEQ 'F'
|   C                     ADD  SK12      QTY4
| 39-C                     END
| 38-C                     END
| 37-C                     END
| 36*C                     ELSE
|   C                     ADD  SK12      QTY4
| 36-C                     END
|    C*
| 40-C           ENDFLG    IFEQ 'N'
| 41-C           MON05     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 42-C           MON05     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK11      MULT WRKDAT    QTY4      H
| 42*C                     ELSE
| 43-C           MON05     IFEQ 'F'
|   C                     ADD  SK11      QTY4
| 43-C                     END
| 42-C                     END
| 41-C                     END
| 40*C                     ELSE
|   C                     ADD  SK11      QTY4
| 40-C                     END
|    C*
| 44-C           ENDFLG    IFEQ 'N'
| 45-C           MON04     IFNE *BLANK
|   C                     MOVEL'Y'       ENDFLG
| 46-C           MON04     IFEQ 'P'
|   C           SDAY      DIV  SDAYT     WRKDAT
|   C           SK10      MULT WRKDAT    QTY4      H
| 46*C                     ELSE
| 47-C           MON04     IFEQ 'F'
|   C                     ADD  SK10      QTY4
| 47-C                     END
| 46-C                     END
| 45-C                     END
| 44*C                     ELSE
|   C                     ADD  SK10      QTY4
| 44-C                     END
|    C*
|    C                     Z-ADDQTY1      WF8706
|    C                     ADD  QTY2      WF8706
|    C                     ADD  QTY3      WF8706
|    C*
|    C                     Z-ADDQTY4      WF8710
|    C*
10===C           END350    ENDSR
M001AC/COPY HBP2CVTR
