      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0522                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :期間專櫃銷售分析表                           *
      ****************************************************************
     FREWF23  IP  E           K        DISK
     FSOSLPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSAR052P O   E             39     PRINTER
     E*
     E                    SL         12  9 0
     IWF230
     I                                              WF2301L2
     I                                              WF2302L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DSC04S
     I                                      606 610 DSC04E
      *MM/DD/YY
     I                                      611 6160DSC39S
     I                                      617 6220DSC39E
      *YY/MM/DD
B2MODI                                      623 6280WSC39S
B2MODI                                      623 6260YMS
B2MODI                                      623 6240YYS
B2MODI                                      625 6260M
B2MODI                                      629 6340WSC39E
B2MODI                                      629 6320YME
      *
B2MODI*                                     637 637 DSEL
M001AI                                      635 635 DSEL
     I            DS
     I                                        1 1080SL
     I                                        1   90SL14
     I                                       10  180SL15
     I                                       19  270SL16
     I                                       28  360SL05
     I                                       37  450SL06
     I                                       46  540SL07
     I                                       55  630SL08
     I                                       64  720SL09
     I                                       73  810SL10
     I                                       82  900SL11
     I                                       91  990SL12
     I                                      100 1080SL13
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEYSL     KLIST
     C                     KFLD           SL01
     C                     KFLD           SL02
     C                     KFLD           SL03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL2     IFEQ '1'
     C                     WRITEPE1
    C                     EXSR RTN010                     *HEADING
     C                     SETOF                     30
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*專櫃
     C                     MOVELWF2301    ME01
     C                     MOVEL*BLANKS   ME02
|    C           KEYME     CHAINME0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   ME04
| 03-C                     END
B2000C                     Z-ADDYYS       SL02
|    C*禮盒
|   C                     SETOF                     22
| 03-C           DSEL      IFEQ 'A'
|   C                     SETOF                     22
| 03*C                     ELSE
|   C                     SETON                     22
| 03-C                     END
|    C*
|    C                     WRITEPH1
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           WF2303    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 01-C                     END
      *
     C           WF2305    SUB  WF2306    WF2356
     C           WF2308    SUB  WF2309    WF2389
      *
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     ADD  WF2304    T12304
|    C                     ADD  WF2305    T12305
|    C                     ADD  WF2306    T12306
|    C                     ADD  WF2307    T12307
|    C                     ADD  WF2308    T12308
|    C                     ADD  WF2309    T12309
|    C                     ADD  WF2356    T12356
|    C                     ADD  WF2389    T12389
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
     C                     Z-ADD0         SL
     C                     MOVELWF2301    SL01
     C                     MOVELWF2302    SL03
     C           KEYSL     CHAINSL0                  40
     C           *IN40     IFEQ '0'
     C                     Z-ADDSL,M      T1SLMM
     C                     ELSE
     C                     Z-ADD0         T1SLMM
     C                     END
     C           T1SLMM    IFEQ 0
     C                     Z-ADD0         RATER
     C                     Z-ADD0         RATEM
     C                     ELSE
     C           T12305    MULT 100       WORK   134
     C           WORK      DIV  T1SLMM    RATER     H
     C*
     C           T12308    MULT 100       WORK
     C           WORK      DIV  T1SLMM    RATEM     H
     C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
     C                     SETON                     30
|    C                     ADD  T12304    T22304
|    C                     ADD  T12305    T22305
|    C                     ADD  T12306    T22306
|    C                     ADD  T12307    T22307
|    C                     ADD  T12308    T22308
|    C                     ADD  T12309    T22309
|    C                     ADD  T12356    T22356
|    C                     ADD  T12389    T22389
|    C                     Z-ADD0         T12304
|    C                     Z-ADD0         T12305
|    C                     Z-ADD0         T12306
|    C                     Z-ADD0         T12307
|    C                     Z-ADD0         T12308
|    C                     Z-ADD0         T12309
|    C                     Z-ADD0         T12356
|    C                     Z-ADD0         T12389
|    C                     Z-ADD0         T1SLMM
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   SUBTOTAL
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     ADD  T22304    T32304
|    C                     ADD  T22305    T32305
|    C                     ADD  T22306    T32306
|    C                     ADD  T22307    T32307
|    C                     ADD  T22308    T32308
|    C                     ADD  T22309    T32309
|    C                     ADD  T22356    T32356
|    C                     ADD  T22389    T32389
|    C                     Z-ADD0         T22304
|    C                     Z-ADD0         T22305
|    C                     Z-ADD0         T22306
|    C                     Z-ADD0         T22307
|    C                     Z-ADD0         T22308
|    C                     Z-ADD0         T22309
|    C                     Z-ADD0         T22356
|    C                     Z-ADD0         T22389
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT3   SUBTOTAL
      *==============================================================*
03===C*          RTN400    BEGSR
|    C*
|    C*  39                EXSR RTN900
|    C*                    WRITEPT3
|    C*                    WRITEPE2
|    C*
03===C*                    ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
      *
05===C                     ENDSR
      *==============================================================*
      *          RTNLR
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE3
     C                     ELSE
|    C   39                EXSR RTN900
|    C                     WRITEPT3
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
      *==============================================================*
