      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SAR076                                        *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
     A* SUBSYSTEM    :應收帳款作業                                 *
     A* REMARK       :客戶退貨明細表                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.14  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSAR076D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 605 DSG18S
     I                                      606 610 DSG18E
     I                                      647 6520DSG06S
     I                                      653 6580DSG06E
     I                                      685 6900DATES
     I                                      691 6960DATEE
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
| 04-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 04-C                     END
|    C                     MOVE *BLANK    DSG18S
|    C                     MOVE *BLANK    DSG18E
|    C                     Z-ADD0         DSG06S
|    C                     Z-ADD0         DSG06E
|    C                     Z-ADD0         DATES   60
|    C                     Z-ADD0         DATEE   60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK專櫃
| 01-C           DSG18S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSG18S
| 01-C                     END
|    C*
| 02-C           DSG18E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSG18E
| 02-C                     END
|    C*
| 03-C           DSG18S    IFGT DSG18E
|   C                     SETON                     606193
|   C                     SETON                     99
|   C                     GOTO END100
| 03-C                     END
|    C*
|    C* CHK日期
| 04-C           DSG06S    IFEQ 0
|   C*M001M               Z-ADD010101    DSG06S
M001MC                     Z-ADD010192    DSG06S
| 04-C                     END
| 05-C           DSG06E    IFEQ 0
|   C*M001M               Z-ADD123199    DSG06E
M001MC                     Z-ADD123129    DSG06E
| 05-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSG06S    P0901I  60
|    C                     PARM           P0901O  1
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSG06E    P0901I  60
|    C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 07-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSG06S    S001I2  60
|    C           DATES     PARM           S001O1  60
M001AC                     MOVE DATES     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSG06E    S001I2  60
|    C           DATEE     PARM           S001O1  60
M001AC                     MOVE DATEE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C**
| 08-C*M001M     DATES     IFGT DATEE
M001MC           YMD8S     IFGT YMD8E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 08-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C*          D#ROW     IFEQ 6
| 03-C*          D#COL     IFGE 38
|   C*          D#COL     ANDLE41
|   C*                    CALL 'WDS016'
|   C*                    PARM           DSG18S
|   C*                    GOTO ENDF4
| 03-C*                    END
|   C*
| 04-C*          D#COL     IFGE 49
|   C*          D#COL     ANDLE52
|   C*                    CALL 'WDS016'
|   C*                    PARM           DSG18E
|   C*                    GOTO ENDF4
| 04-C*                    END
|   C*
| 02-C*                    END
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
