     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    PROGRAM ID   : SOA026                                     *
     A*    AUTHOR       : TINA                                       *
     A*    DATE WRITTEN : 12/30/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :專櫃銷售系統                              *
     A*    PROCEDURE    :專櫃部門抽成比率 (A/U/D/I)                *
     A****************************************************************
     FPA#JPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FPA#JLF  IF  E           K        DISK
     F            #J0                               KRENAME#J0L
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FSOA026D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     E                    WX01        6  1
     I*SDS        SDS
     I*                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
M001AI                                      201 2080DATE
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN1     DBGN1D           *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN1     OBGN1            *SUBFIL BUTTOM
     C*          *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BUTTOM
     C*          *LIKE     DEFN DBGN2     OBGN2            *SUBFIL BUTTOM
     C*          *LIKE     DEFN DBGN3     BBGN3            *SUBFIL BUTTOM
     C*          *LIKE     DEFN DBGN3     OBGN3            *SUBFIL BUTTOM
     C*
     C           *LIKE     DEFN #J01      W#J01                        OM
     C           *LIKE     DEFN #J02      W#J02                        OM
     C*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEY#J     KLIST
     C                     KFLD           D#J01
     C                     KFLD           D#J02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN110
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C                     MOVE $ADD      WX01,1
|    C                     MOVE $UPD      WX01,2
|    C                     MOVE $ADD      WX01,3
|    C                     MOVE $DLT      WX01,4
|    C                     MOVE $INQ      WX01,5
|    C*
|    C                     MOVE 'SCR001'  APPSCR
B2MODC*M001D               Z-ADD0         DATE    80
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
|    C*                    PARM $EGMDY    S001I2  60
B2MODC*M001D     DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C           RTN110    BEGSR
|    C*CHECK新增權利
|    C                     MOVE '1'       DOPT1
| 01-C           WX01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9699
| 01*C                     ELSE
|   C                     EXSR RTN200
| 02-C           DRRN1     IFGT 0
|   C           DRRN1     SUB  1         HRRN1
| 02-C                     END
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 01-C                     END
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*
      *
| 01-C           DBGN1     IFNE OBGN1
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *57 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN180....CHECK 'SC01' SCREEN
     C*==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WX01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
05===C                     ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     SETOF                     20
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD1         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD9999      WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
      *
|    C*
|    C           DBGN1     SETLL#J0L
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
|    C***
| 01-C           RRN1      DOWLTDSPRC1
|   C*
|   C                     READ #J0L                     46
      *
| 02-C           *IN46     IFEQ '0'
|   C           *IN20     ANDEQ'0'
|   C                     MOVEL#J01      W#J01
|   C                     EXSR RTN194
|   C                     SETON                     20
| 02-C                     END
|   C*
| 03-C           *IN46     IFEQ '0'
      *
| 04-C           W#J01     IFNE #J01
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
|   C                     EXSR RTN194
| 04-C                     END
|   C                     MOVEL#J01      W#J01
| 03*C                     ELSE
| 05-C           *IN20     IFEQ '1'
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 05-C                     END
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 03-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *=========================================================*
      *          RTN194 .. GET DATA FROM FILE
      *=========================================================*
09===C           RTN194    BEGSR
|    C*
|    C                     MOVEL#J01      #J01A
|    C                     MOVEL*BLANK    ME04
|    C           #J01A     CHAINME0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELME04      ME04A
| 01-C                     END
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
10===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     94    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
      *
10===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
11===C           RTN200    BEGSR
|    C*
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'3'       RTN230           *CPY
|   C           DOPT1     CASEQ'4'       RTN240           *DLT
|   C           DOPT1     CASEQ'5'       RTN250           *INQ
| 01-C                     END
|    C*
|    C           *LOVAL    SETLL#J0
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
12===C           RTN210    BEGSR
|    C*
|    C                     SETON                     32
|    C                     SETON                     303137
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C*
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN296                     *FILE->SFL
|    C                     EXSR RTN297                     *FILE->SFL
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXSR RTN295                     *EXFMT SFL2
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN25     IFEQ '1'
|   C                     ADD  WPRCD2    DSPRC2
|   C                     EXSR RTN297                     *FILE->SFL
| 04*C                     ELSE
| 05-C           *IN04     IFEQ '1'
|   C                     EXSR RTN281                     *HELP
| 05*C                     ELSE
|   C                     EXSR RTN279                     *HEADING
|   C  N99                EXSR RTN280                     *CHECK
| 05-C                     END
|   C*
| 06-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C                     EXSR RTN29S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
| 06-C                     END
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLL#J0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
13===C           RTN220    BEGSR
|    C*
|    C                     SETOF                     3032
|    C                     SETON                     313733
|    C*
|    C                     MOVE 'SCR002'  APPSCR
      *
|    C           #J01A     CHAIN#J0                  40
|    C*
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN298                     *READ DATA
|    C                     EXSR RTN297                     *FILE->SFL
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXSR RTN295                     *EXFMT SFL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN25     IFEQ '1'
|   C                     ADD  WPRCD2    DSPRC2
|   C                     EXSR RTN297                     *FILE->SFL
| 04*C                     ELSE
|   C*
| 05-C           *IN04     IFEQ '1'
|   C                     EXSR RTN281
| 05*C                     ELSE
|   C                     EXSR RTN279                      F5 OR ENTER
|   C  N99                EXSR RTN280
| 05-C                     END
|   C*
| 06-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C                     EXSR RTN29S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
| 06-C                     END
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLL#J0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN230....CPY DATA
      *==============================================================*
14===C           RTN230    BEGSR
|    C*
|    C                     SETON                     303137
|    C                     SETON                     33
|    C                     SETON                     32
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C*
|    C           #J01A     CHAIN#J0L                 40
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN296                     *READ DATA
|    C                     EXSR RTN297                     *FILE->SFL
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXSR RTN295
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN25     IFEQ '1'
|   C                     ADD  WPRCD2    DSPRC2
|   C                     EXSR RTN297                     *FILE->SFL
| 04*C                     ELSE
| 05-C           *IN04     IFEQ '1'
|   C                     EXSR RTN281
| 05*C                     ELSE
|   C                     EXSR RTN279                     F5 OR ETNER
|   C  N99                EXSR RTN280
| 05-C                     END
|   C*
| 06-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C                     EXSR RTN29S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
| 06-C                     END
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLL#J0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN240....DEL DATA
      *==============================================================*
15===C           RTN240    BEGSR
|    C*
|    C                     SETOF                     303132*NO INPUT
|    C                     SETOF                     33
|    C                     MOVE 'SCR002'  APPSCR
      *
|    C           #J01A     CHAIN#J0                  40
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN298                     *READ DATA TO SFLSR
      *
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXSR RTN295                     *EXFMT
|   C*
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     EXSR RTN24A
|   C                     MOVE 'SCR001'  APPSCR
| 03*C                     ELSE
|   C           *LOVAL    SETLL#J0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN24A....INQ DATA
      *==============================================================*
16===C           RTN24A    BEGSR
|    C*
|    C                     CALL 'WDS000'
|    C                     PARM 'N'       DLTFLG  1
| 01-C           DLTFLG    IFEQ 'Y'
|   C*
|   C           D#J01     SETLL#J0
|   C           D#J01     READE#J0                      40
| 02-C           *IN40     DOWEQ'0'
|   C                     DELET#J0
|   C           D#J01     READE#J0                      40
| 02-C                     END
| 01-C                     END
|    C*
16===C                     ENDSR
      *==============================================================*
      *          RTN250....INQ DATA
      *==============================================================*
17===C           RTN250    BEGSR
|    C*
|    C                     SETOF                     303137
|    C                     SETOF                     3332
|    C                     MOVE 'SCR002'  APPSCR
|    C           #J01A     CHAIN#J0L                 40
|    C*
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN298                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXSR RTN295                     *EXFMT
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
|   C*
| 04-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C           *IN25     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
17===C                     ENDSR
     C*==============================================================*
     C*          RTN291....INIT 'SC02' -- SFLSR2
     C*==============================================================*
18===C           RTN291    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '1'
|   C                     MOVEL*BLANKS   D#J01
|   C                     MOVE *BLANKS   ME04
| 01*C                     ELSE
|   C                     MOVEL#J01      D#J01
|   C           #J01      CHAINME0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    ME04
| 02-C                     END
| 01-C                     END
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD10        DSPRC2  40       *SFL SIZE
|    C                     Z-ADD10        WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*FOR RECORD
| 03-C           DOPT1     IFEQ '5'
|   C           #J01A     SETLL#J0L
| 03*C                     ELSE
|   C           #J01A     SETLL#J0
| 03-C                     END
|    C*
18===C                     ENDSR
      *==============================================================*
      *          RTN295... EXFMT SFL                                 *
      *==============================================================*
19===C           RTN295    BEGSR
|    C*
| 01-C           RRN2      IFLE *ZEROS
|   C                     SETON                     94    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC2
|    C                     EXFMTSFLCR2
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
      *
19===C                     ENDSR
     C*==============================================================*
     C*          RTN296....FILE TO SCREEN --- SFLSR(FOR ADD OR UPD)
     C*==============================================================*
20===C           RTN296    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '3'
|   C* GET 部門
|   C                     MOVEL'SHOPDEPT'#A01
|   C           #A01      SETLL#A0
|   C           #A01      READE#A0                      40
| 02-C           *IN40     DOWEQ'0'
|   C                     MOVEL'1'       DOPT2
|   C                     MOVEL#A02      D#J02
|   C*
| 03-C           DOPT1     IFEQ '1'
|   C                     Z-ADD0         D#J03
|   C                     Z-ADD0         D#J04
| 03-C                     END
|   C*
| 04-C           DOPT1     IFEQ '3'
|   C           KEY#J     CHAIN#J0L                 40
| 05-C           *IN40     IFEQ '0'
|   C           #J03      MULT 100       D#J03
|   C           #J04      MULT 100       D#J04
|   C                     MOVEL#J05      D#J05            *FOR ADD
| 05*C                     ELSE
|   C                     Z-ADD0         D#J03
|   C                     Z-ADD0         D#J04
|   C                     MOVEL*BLANKS   D#J05            *FOR ADD
| 05-C                     END
| 04-C                     END
|   C*DOPT1='1' OR '3' DCHK='N' FOR DOPT2 AND D#J02 UNDERLINE
|   C                     MOVEL'N'       DCHK             *FOR ADD
|   C                     SETOF                     3332
|   C                     SETON                     54
|   C*
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           #A01      READE#A0                      40
| 02-C                     END
| 01-C                     END
|    C*
|    C                     MOVEL*BLANKS   DCHK
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
| 06-C           DSPRC2    DOWLTRRN2
|   C                     ADD  WPRCD2    DSPRC2
| 06-C                     END
|    C*
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN297....FILE TO SCREEN --- SFLSR(FOR ADD OR UPD)
     C*==============================================================*
21===C           RTN297    BEGSR
|    C*
|    C                     Z-ADDWRRN2     RRN2
|    C                     EXSR RTN29A                     *INIT SFLDTA
|    C*
| 01-C           RRN2      DOWLTDSPRC2
      *WRITE *BLANKS TO SFL
|   C                     SETOF                     54    *45 FOR BLANK LOOP
|   C                     MOVEL*BLANKS   DOPT2
|   C                     ADD  1         RRN2
|   C                     SETON                     3233  *UL
|   C                     WRITESFLSR2
| 01-C                     END
|    C                     Z-ADDRRN2      WRRN2
|    C   25                Z-ADDRRN2      DRRN2
|    C*
|    C                     SETON                     5053
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          RTN298....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
22===C           RTN298    BEGSR
|    C*
|    C*FOR RECORD
| 01-C           DOPT1     IFEQ '5'
|   C           #J01A     READE#J0L                     44*NF/EOF
| 01*C                     ELSE
|   C           #J01A     READE#J0                      44*NF/EOF
| 01-C                     END
|    C*
| 02-C           *IN44     DOWEQ'0'
      *
| 03-C           DOPT1     IFNE '5'
| 03-C           DOPT1     ANDNE'4'
|   C                     SETON                     54    *45 FOR BLANK LOOP
| 03*C                     ELSE
|   C                     SETOF                     54
| 03-C                     END
      *
|   C                     EXSR RTN29B
|   C                     MOVEL*BLANKS   DOPT2
      *
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C*
| 04-C           DOPT1     IFEQ '5'
|   C           #J01A     READE#J0L                     44*NF/EOF
| 04*C                     ELSE
|   C           #J01A     READE#J0                      44*NF/EOF
| 04-C                     END
|   C*
| 02-C                     END
|    C*FOR RECORD LOCK
| 05-C           DOPT1     IFNE '5'
|   C           #J01A     CHAIN#J0                  40
| 05-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
| 06-C           DSPRC2    DOWLTRRN2
|   C                     ADD  WPRCD2    DSPRC2
| 06-C                     END
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          RTN29A....CLEAR SCREEN FIELDS
     C*==============================================================*
23===C           RTN29A    BEGSR
|    C*
|    C                     MOVEL*BLANK    D#J02
|    C                     MOVE *BLANKS   #A03
|    C                     Z-ADD0         D#J03
|    C                     Z-ADD0         D#J04
     C                     MOVEL*BLANK    D#J05
     C                     MOVEL*BLANK    DCHK
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*          RTN29B....FILE TO SCREEN --- MOVE
     C*==============================================================*
24===C           RTN29B    BEGSR
|    C*
|    C                     MOVEL#J02      D#J02
|    C                     MOVEL#J05      D#J05
|    C           #J03      MULT 100       D#J03
|    C           #J04      MULT 100       D#J04
|    C* GET 部門
|    C                     MOVEL'SHOPDEPT'#A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVEL#J02      #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #A03
| 01-C                     END
     C*DOPT1=2  DCHK='Y' FOR D#J02 UNDER LINE
     C           DOPT1     IFEQ '2'
     C                     MOVEL'Y'       DCHK
     C                     ELSE
     C                     MOVEL*BLANK    DCHK
     C                     END
|    C*
24===C                     ENDSR
     C*==============================================================*
     C*          RTN279....CHECK 'SC02' HEADING
     C*==============================================================*
25===C           RTN279    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '3'
| 02-C           D#J01     IFEQ *BLANKS
|   C                     SETON                     609399
| 02*C                     ELSE
|   C           D#J01     CHAINME0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #A03
|   C                     SETON                     608599
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END279
      *FOR DUPLICATE KEY
|    C           D#J01     SETLL#J0L                     40
| 04-C           *IN40     IFEQ '1'
| 05-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '3'
|   C                     SETON                     606162
|   C                     SETON                     9199
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END279
|    C*
      *
25===C           END279    ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' --- SFLSR
     C*==============================================================*
26===C           RTN280    BEGSR
|    C*
|    C*CHK SCREEN
|    C                     SETON                     54
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*部門代號
|   C                     SETOF                     707172
|   C                     SETOF                     73
| 02-C           *IN99     IFEQ '0'
| 03-C           DOPT2     IFNE *BLANKS
|   C* CHK 部門
|   C                     MOVEL*BLANK    #A03
| 04-C           D#J02     IFEQ *BLANKS
|   C                     SETON                     719399
| 04*C                     ELSE
|   C                     MOVEL*BLANK    #A02
|   C                     MOVEL'SHOPDEPT'#A01
|   C                     MOVELD#J02     #A02
|   C           KEY#A     CHAIN#A0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #A03
|   C                     SETON                     719299
| 05-C                     END
| 04-C                     END
|   C   99                GOTO DSP
|   C* CHK
      *
|   C           KEY#J     CHAIN#J0L                 40
| 06-C           DOPT2     IFEQ '1'
| 07-C           *IN40     IFEQ '0'
|   C                     SETON                     60
|   C                     SETON                     719199
| 07-C                     END
|   C   99                GOTO DSP
|   C*
| 06*C                     ELSE
|   C           KEY#J     CHAIN#J0L                 40
| 09-C           *IN40     IFEQ '1'
|   C                     SETON                     719299
| 09-C                     END
|   C   99                GOTO DSP
| 10-C           DCHK      IFEQ *BLANKS
|   C                     SETON                     718999
|   C   99                GOTO DSP
| 10-C                     END
| 06-C                     END
|   C   99                GOTO DSP
|   C*抽成比率不可為０，不可小於０
| 11-C           D#J03     IFEQ 0
|   C                     SETON                     729399
| 11-C                     END
|   C   99                GOTO DSP
|   C*
| 12-C           D#J03     IFGT 100
|   C                     SETON                     728699
| 12-C                     END
|   C   99                GOTO DSP
|   C*
|   C*應加稅率不可小於０
| 13-C           D#J04     IFGT 100
|   C                     SETON                     738699
| 13-C                     END
|   C   99                GOTO DSP
      *
| 03-C                     END
|   C           DSP       TAG
|   C                     Z-ADDRRN2      DRRN2
| 02-C                     END
|   C*
     C           DCHK      IFEQ 'Y'
|   C                     SETOF                     32
     C                     ELSE
     C           DCHK      IFEQ 'N'
|   C                     SETOF                     3233
     C                     ELSE
|   C                     SETON                     3233
| 14-C                     END
| 14-C                     END
|   C*
|   C*
|   C* DLETE : WINDOW CHK FOR SUMMARY
| 15-C           DOPT2     IFEQ '4'
|   C           *IN05     ANDEQ'0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 16-C           DLTFLG    IFNE 'Y'
|   C                     MOVE *BLANK    DOPT2
| 16-C                     END
| 15-C                     END
      *
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
      *
26===C           END280    ENDSR
     C*==============================================================*
     C*          RTN281....HELP  'SC02' --- SFLSR
     C*==============================================================*
27===C           RTN281    BEGSR
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C                     SETON                     99
|    C*專櫃代號
| 01-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '3'
| 02-C           D#ROW     IFEQ 5
| 03-C           D#COL     IFGE 15
|   C           D#COL     ANDLE19
|   C                     MOVEL'B       'S013I1  9
|   C                     CALL 'WDS013'
|   C                     PARM           S013I1
|   C                     PARM D#J01     S013O1  5
|   C                     MOVELS013O1    D#J01
|   C                     GOTO END281
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C*
27===C           END281    ENDSR
     C*==============================================================*
     C*          RTN29S....SFL TO FILE
     C*==============================================================*
28===C           RTN29S    BEGSR
|    C*
|    C*CHK SCREEN
|    C                     SETON                     54
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*
| 02-C           DOPT2     IFNE *BLANK
      *
| 03-C           DOPT2     IFEQ '2'
|   C           KEY#J     CHAIN#J0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVELD#J01     #J01
|   C                     MOVELD#J02     #J02
|   C                     MOVELD#J05     #J05
|   C           D#J03     DIV  100       #J03
|   C           D#J04     DIV  100       #J04
B2000C                     Z-ADDDATE      #JXX
B2000C                     TIME           #JYY
|   C                     MOVE $USER     #JZZ
|   C                     UPDAT#J0
| 04-C                     END
| 03-C                     END
| 05-C           DOPT2     IFEQ '1'
|   C           KEY#J     CHAIN#J0                  41
| 06-C           *IN41     IFEQ '1'
|   C                     MOVELD#J01     #J01
|   C                     MOVELD#J02     #J02
|   C                     MOVELD#J05     #J05
|   C           D#J03     DIV  100       #J03
|   C           D#J04     DIV  100       #J04
B2000C                     Z-ADDDATE      #JXX
B2000C                     TIME           #JYY
|   C                     MOVE $USER     #JZZ
|   C                     WRITE#J0
| 06-C                     END
| 05-C                     END
| 07-C           DOPT2     IFEQ '4'
|   C           KEY#J     CHAIN#J0                  41
| 08-C           *IN41     IFEQ '0'
|   C                     DELET#J0
| 08-C                     END
| 07-C                     END
| 02-C                     END
      *
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
      *
28===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
29===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
29===C                     ENDSR'*DETC'
**
新增修改拷貝刪除查詢
