     A*
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : SOA030                                     *
     A*    AUTHOR       : A1092  TAYLOR                              *
     A*    DATE WRITTEN : 81/01/21                                   *
     A*    UPDATE DATE  : 81/04/17 PHILIP DETAIL FILE ADD 物流點   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售資料建檔子系統                        *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :銷售訂單處理 (A/U/D/I)                    *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.18 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 123199 = 123129
     A*---------------------------------------------------------------
     A* M003      | 00.04.26 | FOR DUTY菸酒稅法實施
     A*---------------------------------------------------------------
     A* M004      | 00.05.02 |開放匯東可開立二聯式發票
     A*---------------------------------------------------------------
     A* M005      | 01.12.18 | CHANGE DUTY來源
     A*---------------------------------------------------------------
     A* M006      | 03.03.03 | B0000客戶改採報價方式計算進貨成本
     A*---------------------------------------------------------------
     A* M008      | 04/14/04 |開放訂單行數為8行
     A*---------------------------------------------------------------
     A****************************************************************
     FSOSCPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FSOSCLF3 IF  E           K        DISK
     F            SC0                               KRENAMESC0L
     FSOSDPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMDPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FIMIAPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMAPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSRPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FPOPBLF2 UF  E           K        DISK
     F                                              KINFSR ERRSR
     FPOPCPF  UF  E           K        DISK
M006AFSOSAPF  IF  E           K        DISK
M006AFSOSBPF  IF  E           K        DISK
     F*OSILF01IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#BLF01IF  E           K        DISK
     F            #B0                               KRENAME#B0L1
M006DF*POPELF02IF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FMTMFPF  IF  E           K        DISK
     FLGLDPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
B2CHKFSOA030D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E                    WFUN    7   7  6
     E*: A/U/D/I AUT
     E                    WA01        8  1
     E*: 訂單狀態
     E                    ARR1    4   4 10
     E*: 業務自送
     E                    ARR2    1   1 10
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I                                        1 256 STATUS
     I*                                     101 300 STATUS
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I*M001M                                119 120 $EGM
     I*M001M                                123 124 $EGY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
M001AI                                      201 2080DATE
M001AI                                      201 204 $EGY
M001AI                                      205 206 $EGM
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 512 $APAUT
     I                                      513 513 $WRHTY
     I*                                     514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I**   SCR002 CHANGE (Y/N)
     I            DS
     I                                        1  22 SCR2CN
     I                                        1   60DSC07
     I* FOR UPDATE 訂單日期年份不能修改
     I                                        5   60SC075N
     I* FOR UPDATE 訂單日期年月須＞結案年月
     I                                        1   20SC07M
     I* FOR UPDATE 交貨日期
     I                                        7  120DSC08
     I*出貨物流點
     I                                       13  17 DSC11
     I*進貨物流點
     I                                       18  22 DSC36
     I            DS
     I                                        1   2 DSC01
     I                                        1   1 DSC01L
     I            DS
     I                                        1   9 DSD03
     I                                        1   4 DSD03L
     I            DS
     I                                        1   9 MF02
     I                                        1   4 MF02L
      *FOR業務自送
     I            DS
     I                                        1  52 DSC18
     I                                        1   2 SC18L
     I                                        3  12 SC18L1
     I                                        3  52 SC18R
     I            DS
     I                                        1  52 DSC19
     I                                        1   2 SC19L
     I                                        3  12 SC19L1
     I                                        3  52 SC19R
     I            DS
     I                                        1  52 DSC20
     I                                        1   2 SC20L
     I                                        3  12 SC20L1
     I                                        3  52 SC20R
     I            DS
     I                                        1  52 WRKFLD
     I                                        1   2 WFLD1
     I                                        3  12 WFLD2
     I                                       13  52 WFLD3
     I            DS
     I                                        1   5 SC11
     I                                        1   1 SC11L
     I            DS
B2MODI*M001M                                  1   80SC08
B2MODI*M001M                                  1   4 SC08M
B2MODI*M001M                                  7   8 SC08Y
M001MI                                        1   60LSC08
M001MI                                        1   2 SC08M
M001MI                                        5   6 SC08Y
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11L
M003AIDA02        DS
M003AI                                        1   43DUTY1
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6        *CTL
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C                     MOVE *BLANK    WQUERY  1
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C*  FOR SUBFILE (SYS+PGM CONTROL)
B2MODC           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BUTTOM
      *MM/DD/YY--->YY/MM/DD
     C           *LIKE     DEFN DBGN1     DBGN1D+ 2        *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN1     BBGN1D+ 2        *SUBFIL BUTTOM
     C           *LIKE     DEFN SC03      HSC03                        OM
     C           *LIKE     DEFN SC12      TMON                         OM
     C           *LIKE     DEFN SC12      HSC12                        OM
B2MODC           *LIKE     DEFN SC08      WSC08                        OM
     C           *LIKE     DEFN DSD03     KSD03                        OM
     C           *LIKE     DEFN MA41      MA416                        OM
M003AC                     Z-ADD0         HTAX    70
M003AC                     Z-ADD0         HTOT   100
M003AC                     MOVEL$USER     AUT     3
     C*+EASON
     C                     Z-ADD0         LSC08
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSCL    KLIST
     C                     KFLD           HSC08
     C                     KFLD           SC02
     C           KEYSC1    KLIST
     C                     KFLD           DSC02
     C           KEYSC2    KLIST
     C                     KFLD           DBGN1D
     C                     KFLD           DBGN2
     C           KEYSC3    KLIST
     C                     KFLD           BBGN1D
     C                     KFLD           BBGN2
     C           KEYSC4    KLIST
     C                     KFLD           SC02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEYIA     KLIST
     C                     KFLD           IA01
     C                     KFLD           IA02
     C                     KFLD           DSD03
M006AC* BEGIN
M006A *KEY FOR 單位成本
     C           KEYSA3    KLIST
     C                     KFLD           DSD03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
     C                     KFLD           WSC07   80
     C           KEYSA4    KLIST
     C                     KFLD           DSD03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
      *KEY FOR 通路報價
     C           KEYSA1    KLIST
     C                     KFLD           DSD03
     C                     KFLD           HSC33
     C                     KFLD           HSC34
     C                     KFLD           SA04
     C                     KFLD           WSC07
     C           KEYSA2    KLIST
     C                     KFLD           DSD03
     C                     KFLD           HSC33
     C                     KFLD           HSC34
     C                     KFLD           SA04
     C           KEYSB1    KLIST
     C                     KFLD           SB01
     C                     KFLD           DSD03
     C                     KFLD           SB04
     C                     KFLD           WSC07
     C           KEYSB2    KLIST
     C                     KFLD           SB01
     C                     KFLD           DSD03
     C                     KFLD           SB04
      ********取產品代號前４碼獲得搭贈，普通折扣，正常折扣
      *KEY FOR 單位成本
     C           SA3KEY    KLIST
     C                     KFLD           KSD03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
     C                     KFLD           WSC07
     C           SA4KEY    KLIST
     C                     KFLD           KSD03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
      *KEY FOR 通路報價
     C           SA1KEY    KLIST
     C                     KFLD           KSD03
     C                     KFLD           HSC33
     C                     KFLD           HSC34
     C                     KFLD           SA04
     C                     KFLD           WSC07
     C           SA2KEY    KLIST
     C                     KFLD           KSD03
     C                     KFLD           HSC33
     C                     KFLD           HSC34
     C                     KFLD           SA04
     C           SB1KEY    KLIST
     C                     KFLD           SB01
     C                     KFLD           KSD03
     C                     KFLD           SB04
     C                     KFLD           WSC07
     C           SB2KEY    KLIST
     C                     KFLD           SB01
     C                     KFLD           KSD03
     C                     KFLD           SB04
M006AC* END
     C           KEY#B1    KLIST
     C                     KFLD           DSC04
     C                     KFLD           DSC05
     C           KEYSD1    KLIST
     C                     KFLD           DSC02
     C           KEYSD     KLIST
     C                     KFLD           DSC02
     C                     KFLD           DSD03
     C           KEYSR     KLIST
     C                     KFLD           SR02
     C                     KFLD           SR03
     C                     KFLD           SR04
     C           KEY#C     KLIST
     C                     KFLD           HSC33
     C                     KFLD           HSC34
      *DELETE LOG
     C           KEYLG     KLIST
     C                     KFLD           SDXX
     C                     KFLD           SDYY
     C*M006D     KEYPC     KLIST
     C*M006D               KFLD           PE03
     C*M006D               KFLD           PE04
M003AC           *NAMVAR   DEFN           DA02
M003AC                     IN   DA02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
M002MC                     Z-ADD123129    OBGN1                        ENT
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN110
    C           *IN09     CASEQ'1'       RTN120
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $INQ      WA01,6
|    C                     MOVE $UPD      WA01,7
|    C                     MOVE $RMK01    WA01,8
|    C                     MOVE 'SCR001'  APPSCR
|    C*CHANGE DATE MM/DD/YY
|    C*M001D               Z-ADD0         DATE    60
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
|    C*                    PARM $EGMDY    S001I2  60
|    C*M001D     DATE      PARM           S001O1  60
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C           RTN110    BEGSR
|    C*CHECK新增權利
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9099
| 01*C                     ELSE
|   C                     EXSR RTN200
| 02-C           DRRN1     IFGT 0
|   C           DRRN1     SUB  1         HRRN1
| 02-C                     END
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 01-C                     END
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN120....F9(PRINT)
      *==============================================================*
03===C           RTN120    BEGSR
|    C*CHECK新增權利
|    C                     MOVE '8'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9099
| 01*C                     ELSE
|   C                     CALL 'SOR058C'
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
04===C           RTN170    BEGSR
      *
| 01-C           DBGN1     IFEQ 0
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
| 01*C                     ELSE
|   C*START KEY
| 02-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
      *KEY START KEY TO OBGN1
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
| 02*C                     ELSE
| 03-C****       WRRN1     IFGT 0
|   C                     EXSR RTN171
| 04-C           *IN99     IFEQ '0'
|   C           *IN03     ANDEQ'0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 04-C                     END
| 03-C****                 END
| 02-C                     END
| 01-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
05===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C           *IN03     ANDEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
| 05-C           DOPT1     IFNE '7'
|   C                     EXSR RTN200
| 05*C                     ELSE
|   C                     EXSR RTN400
| 05-C                     END
      *
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   57*NF
|   C*
| 01-C                     END                             *40 END
| 06-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     96
| 06-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
06===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
| 01-C                     END
|    C   99                GOTO END180
|    C*單別'S7'=經銷商送貨定單請當地經銷商先行送貨後補定單還貨
| 02-C           SC03      IFEQ 'S7'                        WNUM = DOPT
      *物流點類別 A=經銷商W=完稅倉T=保稅倉B=專櫃C-F=寄賣／寄放
      *請特定專門人員代經銷商KEY IN  $WRHTY='A'<--*LDA才有權利修改刪除
|   C           $WRHTY    ANDNE'A'
| 03-C           DOPT1     IFEQ '1'
|   C           DOPT1     ANDEQ'2'
|   C           DOPT1     ANDEQ'4'
|   C           DOPT1     ANDEQ'7'
|   C                     SETON                     609099
| 03-C                     END
| 02-C                     END
|    C   99                GOTO END180
|    C*寄賣單跨月不可修改或刪除
| 04-C           SC03      IFEQ 'S3'
B2MODC*M001M               MOVELSC08Y     SC08YM  6
M001AC                     MOVE SC08Y     HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVELHB2@Y4    SC08YM  6
B2000C                     MOVE SC08M     SC08YM
|   C                     MOVEL$EGY      $EGYM   6
|   C                     MOVE $EGM      $EGYM
| 05-C           $EGYM     IFNE SC08YM
| 06-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
|   C                     SETON                     608399
| 06-C                     END
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END180
|    C*
| 07-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
|   C           DOPT1     OREQ '7'
|   C                     MOVE 'S'       #201
|   C                     MOVE SC03      #202
      *單別
|   C           KEY#2     CHAIN#20                  40
      *若為轉帳定單則無法修改#204='N'  定單代碼為SA,SB.....
| 08-C           #204      IFEQ 'N'
|   C           *IN40     OREQ '1'
|   C                     SETON                     608899
| 08*C                     ELSE
B2???C           KEYSCL    CHAINSC0L                 40
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields HSC08 and SC08 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
      *送貨單號<>*BLANKS表已有送貨單號
| 09-C           SC29      IFNE *BLANKS
|   C                     SETON                     608699
| 09*C                     ELSE
      *發票號碼<>*BLANKS表已有發票號碼
| 10-C           SC30      IFNE *BLANKS
|   C                     SETON                     608799
| 10*C                     ELSE
      *轉帳註記 'V'=已轉帳  ' '=未轉帳   '*'=公司間買賣－不轉帳
      *           'T'=轉帳定單'N'=無需轉帳           CL--->RE
      *SC35='V'表已轉帳不得修改刪除
| 11-C           SC35      IFEQ 'V'
|   C                     SETON                     608599
| 11*C                     ELSE
|   C*SC38='V'表已結帳，不得修改刪除
| 12-C           HSC38     IFEQ 'V'
|   C                     SETON                     608499
| 12-C                     END
| 11-C                     END
| 10-C                     END
| 09-C                     END
| 08-C                     END
| 07-C                     END
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
07===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
      *
| 01-C           DBGN1     IFEQ 0
M002MC                     Z-ADD123129    DBGN1
| 01-C                     END
      *
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DBGN1     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DBGN1D
|    C*
B2???C           KEYSC2    SETLLSC0L
B2INF *CVR5011 sev.50 Field DBGN1D is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR0001 sev.00 Field DBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field SC02 is not a date or year
|    C                     MOVE DBGN1     BBGN1
|    C                     MOVE DBGN2     BBGN2
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
08===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C*SCREEN1 START KEY
| 02-C           BBGN1     IFNE DBGN1
|   C           BBGN2     ORNE DBGN2
      *
B2000C           KEYSC3    SETGTSC0L
| 02-C                     END
|   C                     EXSR RTN193
|   C*KEEP SCREEN1 START KEY TO BBGN1
|   C                     Z-ADD0         WSC081  60
M001AC*M003D               MOVE SC08      LSC08
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM LSC08     S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C           WSC081    PARM           S001O1  60
      *
|   C*M001M               Z-ADDWSC081    BBGN1D
M001AC                     MOVE WSC081    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    BBGN1D
M001MC                     Z-ADDLSC08     BBGN1
|   C                     MOVE SC02      BBGN2
B2000C           *LOVAL    SETLLSC0L
| 01-C                     END
|    C*
08===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
09===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ SC0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*GET SFL DATA
|   C                     EXSR RTN194                     *GET DATA
|   C*MOVE 結案碼 HIDDEN FIELD
|   C                     MOVE SC38      HSC38
|   C                     ADD  1         RRN1
| 06-C*M006D     AUT       IFNE 'D91'
|   C* "        AUT       ANDNE'REP'
|   C* "                  SETON                     34
     C*M006D               ELSE
     C*M006D               SETOF                     34
| 06-C*M006D               END
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
09===C                     ENDSR
      *=========================================================*
      *          RTN194 .. GET DATA
      *=========================================================*
10===C           RTN194    BEGSR
|    C*
B2TRCC                     Z-ADDSC08      HSC08
|    C* 日期轉換
M001AC                     Z-ADDSC08      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2???C           LSC08     PARM           S001O1  60
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C* GET 單別說明
|    C                     MOVELSC03      #201
|    C                     MOVELSC03      #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#203      D#203
| 01*C                     ELSE
|   C                     MOVE *BLANK    D#203
| 01-C                     END
|    C* GET客戶分店簡稱 MTMEPF=客戶分店檔
|    C                     MOVELSC16      ME01
|    C                     MOVELSC17      ME02
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANK    ME04
|    C*
| 02-C           SC29      IFEQ *BLANK
|   C           SC30      ANDEQ*BLANK
|   C                     MOVE '*'       DSTA
| 02*C                     ELSE
|   C                     MOVE *BLANK    DSTA
| 02-C                     END
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
11===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     95    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
12===C           RTN200    BEGSR
|    C*
|    C                     SETOF                     81
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
|   C           DOPT1     CASEQ'6'       RTN250           *訂單明細
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLSC0
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
13===C           RTN210    BEGSR
|    C*
|    C                     SETON                     303132*ADD MSG
|    C                     EXSR RTN261                     *CLR FIELD
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C**IN04 = WINDOW TO HELP
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C*ENTER = PROCESS
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 04-C                     END
|   C*
| 02*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
14===C           RTN220    BEGSR
|    C*
| 01-C           SC03      IFEQ 'S2'
|   C           SC03      OREQ 'S3'
|   C                     SETOF                     32
| 01*C                     ELSE
|   C                     SETON                     32
| 01-C                     END
      *
|    C                     SETOF                     30
|    C                     SETON                     31    *CAN INPUT
      *
|    C                     SETOF                     20                ENT
| 02-C           *IN20     DOUEQ'0'
|   C           KEYSC4    CHAINSC0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 02-C                     END
      *
|    C                     EXSR RTN262                     *FILE->SCRN
| 03-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 04-C           *IN03     IFEQ '0'
| 05-C           *IN12     IFEQ '0'
|   C*
| 06-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 06-C                     END
|   C*
| 07-C           *IN99     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 07-C                     END
|   C*
| 05*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
| 04-C                     END
|   C*
| 03-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
15===C           RTN230    BEGSR
|    C*
|    C                     SETOF                     303132*NO INPUT
      *
|    C                     SETOF                     20                ENT
| 01-C           *IN20     DOUEQ'0'
|   C           KEYSC4    CHAINSC0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 01-C                     END
      *
|    C                     EXSR RTN262                     *FIEL->SCRN
| 02-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 03-C           *IN03     IFEQ '0'
| 04-C           *IN12     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 04*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03-C                     END
|   C*
| 02-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
16===C           RTN240    BEGSR
|    C*
|    C                     SETOF                     303132*NO INPUT
B2???C           KEYSCL    CHAINSC0L                 40
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields HSC08 and SC08 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
|    C                     EXSR RTN262                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
16===C                     ENDSR
      *==============================================================*
      *          RTN250....採購明細
      *==============================================================*
17===C           RTN250    BEGSR
|    C*
|    C                     SETOF                     303132*NO INPUT
B2???C           KEYSCL    CHAINSC0L                 40
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields HSC08 and SC08 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
|    C                     EXSR RTN262                     *FIEL->SCRN
|    C                     MOVE 'SCR003'  APPSCR
|    C                     EXSR RTN300
|    C                     MOVE 'SCR001'  APPSCR
|    C*
17===C                     ENDSR
      *==============================================================*
      *          RTN261....CLEAR SCREEN DATA
      *==============================================================*
18===CSR         RTN261    BEGSR
|    C*
|    C                     MOVE *BLANK    DSC01
|    C                     MOVE *BLANK    DSC02
|    C                     MOVE 'S1'      DSC03
|    C                     MOVE 'B0000'   DSC04
|    C                     MOVE *BLANK    DSC05
|    C                     MOVE *BLANK    DSC06
|    C                     Z-ADD$EGMDY    DSC07
|    C                     Z-ADD0         DSC08
|    C                     Z-ADD0         DSC09
|    C                     MOVE *BLANK    DSC10
|    C                     MOVE *BLANK    DSC11
|    C                     Z-ADD0         DSC12
|    C                     Z-ADD0         HSC12
M003AC                     Z-ADD0         HTAX
M003AC                     Z-ADD0         DTAX
M003AC                     Z-ADD0         DTOT
M003AC                     Z-ADD0         HTOT
|    C                     MOVE '*'       DSC13
|    C                     MOVE 'B0000'   DSC14
|    C                     MOVE *BLANK    DMD17
|    C                     MOVE *BLANK    DSC15
|    C                     MOVE *BLANK    DSC16
|    C                     MOVE *BLANK    DSC17
|    C                     MOVE *BLANK    DSC18
|    C                     MOVE *BLANK    DSC19
|    C                     MOVE *BLANK    DSC20
|    C                     MOVE *BLANK    DSC21
|    C                     MOVE *BLANK    DSC27
|    C                     MOVE *BLANK    SC29
|    C                     MOVE *BLANK    SC30
|    C                     MOVE *BLANK    DSC31
|    C                     MOVE *BLANK    SC37
|    C                     Z-ADD0         SC39
|    C                     Z-ADD0         DSC39
|    C*
|    C                     MOVE *BLANKS   D#B031
|    C                     MOVE *BLANKS   #D02
|    C                     MOVE *BLANKS   DME04
|    C                     MOVE *BLANKS   #203
|    C                     MOVE *BLANKS   D#A03
|    C                     MOVE *BLANKS   MC02
|    C                     MOVE *BLANKS   DSC11C
|    C                     MOVE *BLANKS   DSC13C
|    C                     MOVE *BLANKS   ME031
|    C                     MOVE *BLANKS   ME051
|    C                     MOVE *BLANKS   ME061
|    C                     MOVE *BLANKS   ME032
|    C                     MOVE *BLANKS   ME052
|    C                     MOVE *BLANKS   ME062
|    C*
18===CSR                   ENDSR
      *==============================================================*
      *          RTN262....MOVE DATA TO SCREEN
      *==============================================================*
19===CSR         RTN262    BEGSR
|    C*
|    C                     MOVE SC01      DSC01
|    C                     MOVE SC02      DSC02
|    C                     MOVE SC03      DSC03
|    C                     MOVE SC03      HSC03
|    C                     MOVE SC04      DSC04
|    C                     MOVE SC05      DSC05
|    C                     MOVE SC06      DSC06
|    C                     Z-ADDSC09      DSC09
|    C                     MOVE SC10      DSC10
|    C                     MOVE SC11      DSC11
|    C                     Z-ADDSC12      DSC12
|    C                     Z-ADDSC12      HSC12
M003AC           SC37      IFEQ 'D'
M003AC           SC12      MULT DUTY1     DTAX      H
M003AC                     Z-ADDDTAX      HTAX
M003AC           SC12      ADD  DTAX      DTOT
M003AC                     Z-ADDDTOT      HTOT
M003AC                     ELSE
M003AC                     Z-ADDSC12      DTOT
M003AC                     Z-ADDSC12      HTOT
M003AC                     Z-ADD0         DTAX
M003AC                     Z-ADD0         HTAX
M003AC                     END
|    C                     MOVE SC13      DSC13
|    C                     MOVE SC14      DSC14
|    C                     MOVEL*BLANKS   DMD17
      *
|    C                     SETOF                     20                ENT
| 01-C           *IN20     DOUEQ'0'
|   C           DSC14     CHAINMD0                  4220
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 01-C                     END
      *
|    C           *LOVAL    SETLLMD0
| 02-C           *IN42     IFEQ '0'
|   C                     MOVELMD17      DMD17
| 02-C                     END
|    C                     MOVE SC15      DSC15
|    C                     MOVE SC16      DSC16
|    C                     MOVE SC17      DSC17
|    C                     MOVE SC18      DSC18
|    C                     MOVE SC19      DSC19
|    C                     MOVE SC20      DSC20
|    C                     MOVE SC21      DSC21
|    C                     MOVE SC27      DSC27
|    C                     MOVE SC31      DSC31
|    C                     MOVE SC33      HSC33
|    C                     MOVE SC34      HSC34
|    C*
|    C* 日期轉換
M001AC                     Z-ADDSC07      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DSC07     PARM           S001O1  60
M001MC                     Z-ADDSC07      WSC07   80
B2INF *CVR5011 sev.50 Field WSC07 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C*
M001AC                     Z-ADDSC08      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DSC08     PARM           S001O1  60
|    C* GET 公司代號
|    C           DSC01     CHAIN#B0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVE #B03      D#B031
| 03*C                     ELSE
|   C                     MOVE *BLANK    D#B031
| 03-C                     END
|    C* GET 地區代號
|    C           DSC31     CHAIN#D0                  40
|    C   40                MOVE *BLANK    #D02
|    C* GET 客戶代號
|    C                     MOVELDSC04     ME01
|    C                     MOVELDSC05     ME02
|    C           KEYME     CHAINME0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVE ME04      DME04
| 04*C                     ELSE
|   C                     MOVE *BLANK    ME04
| 04-C                     END
|    C* GET 單別
|    C                     MOVELDSC03     #201
|    C                     MOVELDSC03     #202
|    C           KEY#2     CHAIN#20                  40
|    C   40                MOVE *BLANK    #203
|    C* GET 試飲原因
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'STOCK  ' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELDSC10     #A02
|    C           KEY#A     CHAIN#A0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 05*C                     ELSE
|   C                     MOVE *BLANK    D#A03
| 05-C                     END
|    C* GET 進貨物流點
| 06-C           SC03      IFEQ 'S7'
|   C                     MOVELDSC11     ME01
|   C                     MOVE *BLANKS   ME02
|   C           KEYME     CHAINME0                  40
|   C  N40                MOVELME04      DSC11C
|   C   40                MOVE *BLANK    DSC11C
| 06*C                     ELSE
|   C                     MOVE *BLANK    #A01
|   C                     MOVEL'STORAGE' #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVELDSC11     #A02
|   C           KEY#A     CHAIN#A0                  40
| 07-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DSC11C
| 07*C                     ELSE
|   C                     MOVE *BLANK    DSC11C
| 07-C                     END
| 06-C                     END
|    C* GET 業務員
|    C           SC27      CHAINMC0                  40
|    C   40                MOVE *BLANK    MC02
|    C* GET 訂單狀況
| 08-C           DSC13     IFEQ *BLANKS
|   C           DSC13     OREQ 'C'
|   C                     MOVE ARR1,1    DSC13C
| 08*C                     ELSE
| 09-C           DSC13     IFEQ 'V'
|   C                     MOVE ARR1,2    DSC13C
| 09*C                     ELSE
| 10-C           DSC13     IFEQ '*'
| 11-C           DSC03     IFEQ 'S3'
|   C                     MOVE ARR1,4    DSC13C
| 11*C                     ELSE
|   C                     MOVE ARR1,4    DSC13C
| 11-C                     END
| 10-C                     END
| 09-C                     END
| 08-C                     END
|    C* GET 發票地址
|    C                     MOVELDSC14     ME01
|    C                     MOVE *BLANKS   ME02
|    C           KEYME     CHAINME0                  40
| 12-C           *IN40     IFEQ '0'
|   C                     MOVE ME03      ME031
|   C                     MOVE ME05      ME051
|   C                     MOVE ME06      ME061
| 12*C                     ELSE
|   C                     MOVE *BLANK    ME031
|   C                     MOVE *BLANK    ME051
|   C                     MOVE *BLANK    ME061
| 12-C                     END
|    C* GET 送貨地址
|    C                     MOVELDSC16     ME01
|    C                     MOVELDSC17     ME02
|    C           KEYME     CHAINME0                  40
| 13-C           *IN40     IFEQ '0'
|   C                     MOVELME04      ME032
|   C                     MOVE ME05      ME052
|   C                     MOVE ME06      ME062
| 13*C                     ELSE
|   C                     MOVE *BLANK    ME032
|   C                     MOVE *BLANK    ME052
|   C                     MOVE *BLANK    ME062
| 13-C                     END
|    C* 日期轉換
M001AC                     Z-ADDSC39      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DSC39     PARM           S001O1  60
B2???C                     Z-ADDSC07      WSC07
B2INF *CVR5011 sev.50 Field WSC07 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C*
|    C* FOR UPDATE
| 14-C****       DOPT1     IFEQ '2'
|   C                     Z-ADDSC075N    SC075O  20       * FOR 年份
|   C* FOR UPDATE : CHECK SCREEN2 CHANGE 19920417 PHILIP CHANGE
|   C                     MOVE SCR2CN    SCR2CO 22        *FOR SCR2 CHANGE
|   C*    HSC11,HSC36 FOR 物流點改變CHK -- SCR003
|   C                     MOVE DSC11     HSC11
|   C                     MOVE SC36      DSC36
|   C                     MOVE SC36      HSC36
| 14-C****                 END
|    C*
19===CSR                   ENDSR
      *==============================================================*
      *          RTN270....F5 -- 參考資料
      *==============================================================*
20===CSR         RTN270    BEGSR
|    C*
|    C                     EXSR RTN280
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 01-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 01-C                     END
|    C                     SETON                     99
|    C*
20===C                     ENDSR
      *==============================================================*
      *          RTN280....CHECK 'SC02' SCREEN
      *==============================================================*
21===CSR         RTN280    BEGSR
|    C* CHK,GET公司
| 01-C           DSC01     IFEQ *BLANKS
|   C                     SETON                     609499
| 01*C                     ELSE
      *公司檔
|   C           DSC01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '0'
|   C           DSC01L    ANDNE'C'
      *公司說明
|   C                     MOVE #B03      D#B031
| 02*C                     ELSE
|   C                     MOVE *BLANK    D#B031
|   C                     SETON                     608999
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END280
|    C*
| 03-C           DSC01L    IFNE 'R'
|   C                     SETON                     608999
| 03-C                     END
|    C   99                GOTO END280
|    C                     MOVELDSC01     WCMP    1
      *
|    C                     SETOF                     20                ENT
| 04-C           *IN20     DOUEQ'0'
|   C           DSC04     CHAINMD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 04-C                     END
|    C           *LOVAL    SETLLMD0
      *
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME04
|   C                     SETON                     618999
| 05-C                     END
|    C   99                GOTO END280
|    C*
|    C*客戶代號＋分店代號
|    C                     MOVELDSC04     ME01
|    C                     MOVELDSC05     ME02
|    C* CHK,GET客戶代號
|    C           KEYME     CHAINME0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME04
|   C                     SETON                     618999
| 06*C                     ELSE
      *不往來客戶
| 07-C           ME20      IFEQ 'I'
|   C                     SETON                     617599
| 07*C                     ELSE
|   C                     MOVELDSC04     WQUERY
|   C                     MOVEL'S1'      DSC03
|   C                     MOVE ME04      DME04
      *地區
|   C                     MOVE ME07      DSC31
      *SC27=業務人員代碼 CHAIN 員工主檔
| 08-C*          DSC27     IFEQ *BLANKS
|   C                     MOVE ME15      DSC27
| 08-C*                    END
      *
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END280
      *
      *SC27=業務人員代碼 CHAIN 員工主檔
|    C           DSC27     CHAINMC0                  40
| 09-C           *IN40     IFEQ '1'
|   C                     SETON                     708999
|   C   40                MOVE *BLANK    MC02
| 09-C                     END
|    C   99                GOTO END280
|    C* CHK 訂單日期
| 10-C           DSC07     IFEQ 0
|   C                     SETON                     639499
| 10*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC07     P0901I  60
|   C                     PARM           P0901O  1
| 11-C           P0901O    IFEQ 'N'
|   C                     SETON                     639199
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END280
|    C* 日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC07     S001I2  60
     C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WSC07
|    C* UPDATE -- 年份不得變更定單日期必為同一年份
| 12-C           DOPT1     IFEQ '2'
|   C           SC075N    ANDNESC075O
|   C                     SETON                     638699
| 12-C                     END
|    C   99                GOTO END280
|    C* UPDATE -- 年月須＞結案日期
| 13-C           DOPT1     IFEQ '2'
|   C*M001M               MOVELSC075N    SC7YMO  40       * 結案年月
|   C*M001M               MOVE SC07M     SC7YMO  40       * 結案年月
M001AC                     MOVE SC075N    HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    FYY4    40
M001MC                     MOVELFYY4      SC7YMO  60       * 月結年月
M001MC                     MOVE SC07M     SC7YMO  60       * 月結年月
|   C           DSC01     CHAIN#B0                  40
B2???C           *IN40     IFEQ '0'
B2INF *CVR5011 sev.50 Field SC7YMO is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C           SC7YMO    ANDLE#B16
|   C                     SETON                     638099
| 14-C                     END
| 13-C                     END
|    C   99                GOTO END280
      *#212出貨倉是否有用亦即此定單是否必需出貨
      *    經銷商送貨訂單須輸入交貨日期
| 15-C           #212      IFEQ 'Y'
|   C* CHK 交貨日期
|   C           DSC08     ANDEQ0
|   C           DSC03     OREQ 'S7'
|   C           DSC08     ANDEQ0
|   C                     SETON                     649499
| 15-C                     END
| 16-C           DSC08     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08     P0901I  60
|   C                     PARM           P0901O  1
| 17-C           P0901O    IFEQ 'N'
|   C                     SETON                     649199
| 17-C                     END
| 16-C                     END
|    C   99                GOTO END280
|    C* 日期轉換
| 18-C           DSC08     IFNE 0
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08     S001I2  60
|   C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WSC08
| 18-C                     END
|    C* 交貨日期需大於訂單日期
| 19-C           DSC08     IFNE 0
| 20-C           WSC08     IFLT WSC07
|   C                     SETON                     6364
|   C                     SETON                     8399
| 20-C                     END
| 19-C                     END
|    C   99                GOTO END280
|    C* GET MD07通路 MD08型態FROM客戶主檔（ＭＤ）
      *
|    C                     SETOF                     20                ENT
| 21-C           *IN20     DOUEQ'0'
|   C           DSC04     CHAINMD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 21-C                     END
      *
|    C           *LOVAL    SETLLMD0
|    C                     MOVE MD07      HSC33
|    C                     MOVE MD08      HSC34
|    C* CHK 試飲原因代碼DSC10單別＝Ｓ４試飲定單
|    C                     MOVE *BLANK    D#A03
| 22-C           DSC03     IFEQ 'S4'
| 23-C           DSC10     IFEQ *BLANK
|   C                     SETON                     659499
| 23-C                     END
| 22*C                     ELSE
| 24-C           DSC10     IFNE *BLANK
|   C                     SETON                     657999
| 24-C                     END
| 22-C                     END
|    C   99                GOTO END280
      *
| 25-C           DSC10     IFEQ *BLANK
|   C                     MOVE *BLANK    D#A03
| 25*C                     ELSE
|   C                     MOVE *BLANK    #A01
      *代碼檔#A01='STOCK'表試飲原因
|   C                     MOVEL'STOCK  ' #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVELDSC10     #A02
|   C           KEY#A     CHAIN#A0                  40
| 26-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 26*C                     ELSE
|   C                     MOVE *BLANK    D#A03
|   C                     SETON                     658999
| 26-C                     END
| 25-C                     END
|    C   99                GOTO END280
|    C* CHK,GET 發票地址
|    C                     MOVEL'B0000'   DSC14
|    C*
|    C                     MOVELDSC14     ME01
|    C                     MOVEL*BLANKS   ME02
|    C           KEYME     CHAINME0                  40
| 27-C           *IN40     IFEQ '0'
|   C                     MOVE ME03      ME031
|   C                     MOVE ME05      ME051
|   C                     MOVE ME06      ME061
      *不往來客戶
| 28-C           ME20      IFEQ 'I'
|   C                     SETON                     687599
| 28-C                     END
| 27*C                     ELSE
|   C                     MOVE *BLANK    ME031
|   C                     MOVE *BLANK    ME051
|   C                     MOVE *BLANK    ME061
|   C                     SETON                     688999
| 27-C                     END
|    C   99                GOTO END280
      *
|    C                     MOVEL*BLANKS   DMD17
      *
|    C                     SETOF                     20                ENT
| 29-C           *IN20     DOUEQ'0'
|   C           DSC14     CHAINMD0                  4220
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 29-C                     END
      *
|    C           *LOVAL    SETLLMD0
| 30-C           *IN42     IFEQ '0'
|   C                     MOVELMD17      DMD17
|   C* GET 發票聯數FROM客戶主檔（ＭＤ）
| 31-C           DSC09     IFEQ 0
|   C                     Z-ADDMD18      DSC09
| 31-C                     END
| 30-C                     END
      *匯東僅非Ｓ３僅可出３聯發票
| 32-C*M004D     WCMP      IFNE 'W'
|   C*M004D     DSC03     ANDNE'S3'
|   C*M004D     DSC09     ANDNE3
|   C*M004D               SETON                     707499
| 32-C*M004D               END
|    C*M004D  99                GOTO END280
      *三聯式發票客戶統一發票不可空白
| 33-C           DSC09     IFEQ 3
|   C           DMD17     ANDEQ*BLANKS
|   C                     SETON                     689499
| 33-C                     END
|    C   99                GOTO END280
      *
|    C* CHK,GET 送貨地址
| 34-C           DSC16     IFEQ *BLANK
|   C           DSC16     ORLT 'B0001'
|   C           DSC16     ANDGT'B9999'
|   C                     SETON                     698994
| 34-C                     END
|    C   99                GOTO END280
|    C                     MOVELDSC16     ME01
|    C                     MOVELDSC17     ME02
|    C           KEYME     CHAINME0                  40
| 35-C           *IN40     IFEQ '0'
|   C                     MOVELME04      ME032
|   C                     MOVE ME05      ME052
|   C                     MOVE ME06      ME062
      *不往來客戶
| 36-C           ME20      IFEQ 'I'
|   C                     SETON                     697599
| 36-C                     END
| 35*C                     ELSE
|   C                     MOVE *BLANK    ME032
|   C                     MOVE *BLANK    ME052
|   C                     MOVE *BLANK    ME062
|   C                     SETON                     698999
| 35-C                     END
|    C   99                GOTO END280
|    C* CHK SC11出貨物流點     S7=經銷商送貨定單
| 37-C           DSC03     IFEQ 'S7'
      *出貨物流點不可空白
| 38-C           DSC11     IFEQ *BLANK
|   C                     SETON                     669499
| 38*C                     ELSE
|   C                     MOVELDSC11     WQUERY
      *物流點通路A=經銷商物流點
      *若不為經銷商送貨定單則物流點通路不可為Ａ
| 39-C           WQUERY    IFNE 'A'
|   C                     SETON                     668899
| 39*C                     ELSE
      *且此經銷商應為客戶
|   C           DSC11     SETLLMD0                      42
| 40-C           *IN42     IFEQ '0'
|   C                     SETON                     668999
| 40-C                     END
| 39-C                     END
| 38-C                     END
| 37*C                     ELSE                            <>'S7'
      *單別不為S7則區域碼應存在銷售地區代碼檔
|   C           ME07      CHAIN#D0                  40
| 41-C           *IN40     IFEQ '0'
|   C                     MOVEL#D03      FSC11   5
| 42-C           DSC11     IFEQ *BLANK
|   C                     MOVEL#D03      DSC11
| 42*C                     ELSE
      *輸入之出貨物流點應＝銷售地區代碼檔之出貨物流點
      *或第一碼＝Ｗ
|   C                     MOVELDSC11     WQUERY
| 43-C           DSC11     IFNE FSC11
|   C           WQUERY    ANDNE'W'
|   C                     SETON                     668299
| 43-C                     END
| 42-C                     END
| 41*C                     ELSE
|   C                     MOVE *BLANKS   FSC11
|   C                     SETON                     698999
| 41-C                     END
| 37-C                     END
|    C   99                GOTO END280
|    C* GET 出貨物流點
|    C*#211進貨倉庫存量
| 44-C           #211      IFEQ 'Y'
|   C*#211檢劾進貨倉庫存='Y'出貨物流點不輸入－專櫃，寄放
|   C                     MOVE *BLANKS   DSC11
|   C                     MOVE *BLANKS   DSC11C
| 44*C                     ELSE
      *
| 45-C           DSC03     IFEQ 'S7'
|   C                     MOVE DSC11     ME01
|   C                     MOVE *BLANKS   ME02
|   C           KEYME     CHAINME0                  40
| 46-C           *IN40     IFEQ '0'
      *物流點說明
|   C                     MOVELME04      DSC11C
| 46*C                     ELSE
|   C                     SETON                     668999
| 46-C                     END
| 45*C                     ELSE
|   C                     MOVE *BLANK    #A01
|   C                     MOVEL'STORAGE' #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVELDSC11     #A02
|   C           KEY#A     CHAIN#A0                  40
| 47-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DSC11C
| 47*C                     ELSE
|   C                     MOVE *BLANK    DSC11C
|   C                     SETON                     668999
| 47-C                     END
| 45-C                     END
| 44-C                     END
|    C   99                GOTO END280
|    C* GET 訂單狀況
| 48-C           DSC13     IFEQ *BLANKS
|   C           DSC13     OREQ 'C'
|   C                     MOVE ARR1,1    DSC13C
| 48*C                     ELSE
| 49-C           DSC13     IFEQ 'V'
|   C                     MOVE ARR1,2    DSC13C
| 49*C                     ELSE
| 50-C           DSC13     IFEQ '*'
| 51-C           DSC03     IFEQ 'S3'
|   C                     MOVE ARR1,3    DSC13C
| 51*C                     ELSE
|   C                     MOVE ARR1,4    DSC13C
| 51-C                     END
| 50-C                     END
| 49-C                     END
| 48-C                     END
|    C* GET 進貨物流點
|    C           KEY#B1    CHAIN#B0L1                40
| 52-C           *IN40     IFEQ '0'
|   C           #B06      ANDEQ'A'
|   C*                    MOVE DSC11     DSC36
|   C                     MOVEL*BLANKS   DSC36
| 52*C                     ELSE
| 53-C           #217      IFEQ 'Y'
      *
|   C                     SETOF                     20                ENT
| 54-C           *IN20     DOUEQ'0'
|   C           DSC14     CHAINMD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 54-C                     END
      *
| 55-C           *IN40     IFEQ '0'
|   C                     MOVE MD33      DSC36
| 55*C                     ELSE
|   C                     MOVE *BLANK    DSC36
| 55-C                     END
| 53*C                     ELSE
|   C                     MOVE *BLANK    DSC36
| 53-C                     END
| 52-C                     END
      *備註處理業務自送
|    C                     MOVEL*BLANKS   WRKFLD
      *前二碼為**
| 56-C           SC18L     IFEQ '**'
|   C           SC18L1    ANDNEARR2,1
|   C                     MOVELSC18L     WFLD1
|   C                     MOVELARR2,1    WFLD2
|   C                     MOVELSC18R     WFLD3
|   C                     MOVELWRKFLD    DSC18
| 56-C                     END
      *
|    C                     MOVEL*BLANKS   WRKFLD
| 57-C           SC19L     IFEQ '**'
|   C           SC19L1    ANDNEARR2,1
|   C                     MOVELSC19L     WFLD1
|   C                     MOVELARR2,1    WFLD2
|   C                     MOVELSC19R     WFLD3
|   C                     MOVELWRKFLD    DSC19
| 57-C                     END
      *
|    C                     MOVEL*BLANKS   WRKFLD
| 58-C           SC20L     IFEQ '**'
|   C           SC20L1    ANDNEARR2,1
|   C                     MOVELSC20L     WFLD1
|   C                     MOVELARR2,1    WFLD2
|   C                     MOVELSC20R     WFLD3
|   C                     MOVELWRKFLD    DSC20
| 58-C                     END
      *
|    C           END280    TAG
|    C           *LOVAL    SETLLMD0
|    C*
21===CSR                   ENDSR
     C*==============================================================*
     C*          RTN29S....SCREEN TO FILE --- H
     C*==============================================================*
22===C*          RTN29S    BEGSR
|    C*
|    C*
22===C*                    ENDSR
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
23===C           RTN300    BEGSR
|    C*
| 01-C           DOPT1     CASEQ'1'       RTN310           *ADD
|   C           DOPT1     CASEQ'2'       RTN320           *UPD
|   C           DOPT1     CASEQ'4'       RTN330           *DLT
|   C           DOPT1     CASEQ'5'       RTN340           *INQ
|   C           DOPT1     CASEQ'6'       RTN340           *採購明細
| 01-C                     END
|    C   12                SETOF                     12
|    C* FOR RECORD LOCK
|    C           *LOVAL    SETLLSD0
|    C           *LOVAL    SETLLIA0
|    C           *LOVAL    SETLLMD0
|    C           *LOVAL    SETLLMA0
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*          RTN310....ADD DATA --- SFLSR
     C*==============================================================*
24===C           RTN310    BEGSR
|    C*寄賣
| 01-C           DSC03     IFEQ 'S3'
|   C           DSC03     OREQ 'S4'
|   C                     SETOF                     34    *PR金額及搭贈數
| 01*C                     ELSE
|   C                     SETON                     34    *UL
| 01-C                     END
|    C                     SETON                     3233
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN397                     *READ BLANK
|    C*
| 02-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
| 04-C           *IN12     IFEQ '0'
|   C*
| 05-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 05-C                     END
|   C*
| 06-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C                     EXSR RTN39S                     *SAVE
|   C                     MOVE 'SCR001'  APPSCR
| 06-C                     END
|   C*
| 04*C                     ELSE
|   C           *LOVAL    SETLLSD0
|   C                     MOVE 'SCR002'  APPSCR
| 04-C                     END                             *IN03 ENDIF
| 03-C                     END                             *IN12 ENDIF
|   C*
| 02-C                     END                             *ENDDO
|    C*
24===C                     ENDSR
     C*==============================================================*
     C*          RTN320....UPD DATA --- SFLSR
     C*==============================================================*
25===C           RTN320    BEGSR
|    C*
| 01-C           DSC03     IFEQ 'S3'
|   C           DSC03     OREQ 'S4'
|   C                     SETOF                     34
| 01*C                     ELSE
|   C                     SETON                     34
| 01-C                     END
|    C                     SETON                     33
|    C                     SETOF                     32
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA
| 02-C           *IN99     IFEQ '0'
|   C                     EXSR RTN397                     *READ BLANK
| 02*C                     ELSE
|   C                     MOVE 'SCR002'  APPSCR
|   C           *LOVAL    SETLLSD0
| 02-C                     END
|    C*
| 03-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 04-C           *IN03     IFEQ '0'
| 05-C           *IN12     IFEQ '0'
|   C*
| 06-C           *IN05     IFEQ '1'
|   C                     MOVE 'N'       WINDLT  1
| 06*C                     ELSE
|   C                     MOVE 'Y'       WINDLT
| 06-C                     END
|   C*
| 07-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 07-C                     END
|   C*
| 08-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C                     EXSR RTN39S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
| 08-C                     END
|   C*
| 05*C                     ELSE
|   C           *LOVAL    SETLLSD0
|   C                     MOVE 'SCR002'  APPSCR
| 05-C                     END                             *IN03 ENDIF
| 04-C                     END                             *IN12 ENDIF
|   C*
| 03-C                     END                             *ENDDO
|    C*
25===C                     ENDSR
     C*==============================================================*
     C*          RTN330....DEL DATA --- SFLSR2
     C*==============================================================*
26===C           RTN330    BEGSR
|    C*
|    C                     SETOF                     323334*NO INPUT
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
|   C                     MOVE 'N'       WINDLT
|   C*
| 04-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 06-C           DLTFLG    IFEQ 'Y'
|   C                     EXSR RTN39T                      DLT D
| 06-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLSD0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
26===C                     ENDSR
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR2
     C*==============================================================*
27===C           RTN340    BEGSR
|    C*
|    C                     SETOF                     323334*NO INPUT
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTN381
|   C*                    CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLSD0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
27===C                     ENDSR
     C*==============================================================*
     C*          RTN380....CHECK 'SC03' --- SFLSR
     C*==============================================================*
28===C           RTN380    BEGSR
      *
|    C                     Z-ADDHSC12     DSC12
M003AC                     Z-ADDHTOT      DTOT
M003AC                     Z-ADDHTAX      DTAX
      *IN35 CONTROL DOPT1='2' FOR DELETE
|    C                     SETOF                     35
      *FOR課稅別
|    C                     Z-ADDCOUNT     COUNT1  10
|    C*CHK SCREEN
|    C                     SETON                     54
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*
| 02-C           DOPT1     IFEQ '4'
|   C                     MOVE '4'       DOPT2
| 02-C                     END
|   C*
| 03-C           DOPT1     IFEQ '2'
|   C           DOPT2     ANDNE'4'
|   C                     SETON                     35
| 03-C                     END
|   C*
|   C                     SETOF                     606162
|   C                     SETOF                     6364
|   C*                                  DATA ENTRY & *IN99 OFF ->CHECK
| 04-C           DCHK      IFEQ 'Y'
|   C                     SETOF                     32    *PROTECT FIELD
| 04*C                     ELSE
|   C                     SETON                     32
| 04-C                     END
|   C   99                GOTO UPD
|   C*
| 05-C           DOPT2     IFEQ *BLANK
|   C           DSD03     ANDEQ*BLANK
|   C                     EXSR RTN39A
|   C                     GOTO UPD
| 05-C                     END
|   C*
| 06-C           DCHK      IFEQ 'Y'
| 07-C           DOPT2     IFEQ '1'
|   C                     SETON                     609299
| 07-C                     END
| 06*C                     ELSE
| 08-C           DOPT2     IFEQ '2'
|   C           DOPT2     OREQ '4'
|   C           DOPT2     OREQ '0'
|   C           DOPT2     OREQ *BLANK                     JUDY
|   C***        DOPT2     OREQ '5'
|   C                     SETON                     609399
| 08-C                     END
| 06-C                     END
|   C   99                GOTO DSP
|   C* DLETE : WINDOW CHK FOR SUMMARY
| 09-C           DOPT2     IFEQ '4'
|   C           WINDLT    ANDEQ'Y'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 10-C           DLTFLG    IFNE 'Y'
|   C                     MOVE *BLANK    DOPT2
| 10-C                     END
| 09-C                     END
|   C* 5.庫存查詢
| 11-C           DOPT2     IFEQ '5'
|   C                     CALL 'IMI0211'
|   C                     PARM DSD03     I021I1  9
|   C                     PARM           I021O1  1
|   C                     SETON                     99
|   C                     MOVE *BLANKS   DOPT2
|   C                     GOTO UPD
| 11-C                     END
      *
| 12-C           DOPT2     IFEQ '6'
|   C                     CALL 'IMI028'
|   C                     PARM DSC11     I028I1  5
|   C                     PARM DSD03     I028I2  9
|   C                     PARM           I028O1  1
|   C                     SETON                     99
|   C                     MOVE *BLANKS   DOPT2
|   C                     GOTO UPD
| 12-C                     END
|   C* CHK 產品代號
| 13-C           DOPT2     IFNE *BLANK
| 14-C           DSD03     IFEQ *BLANK
|   C                     SETON                     619499
|   C                     MOVE *BLANK    MA03
|   C                     MOVE *BLANK    MA13
| 14*C                     ELSE
      *
|   C                     SETOF                     20                ENT
| 15-C           *IN20     DOUEQ'0'
|   C           DSD03     CHAINMA0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 15-C                     END
      *
|   C           *LOVAL    SETLLMA0
| 16-C           *IN40     IFEQ '1'
|   C                     SETON                     618999
|   C                     MOVE *BLANK    MA03
|   C                     MOVE *BLANK    MA13
| 16*C                     ELSE
|   C                     MOVE MA07      HSD16            *產品歸屬
| 17-C           MA58      IFNE 'A'
|   C                     SETON                     618999
| 17*C                     ELSE
| 18-C           DSC03     IFEQ 'S3'
|   C           MA55      ANDNE'Y'
|   C                     SETON                     618999
| 18-C                     END
| 17-C                     END
| 16-C                     END
| 14-C                     END
| 13-C                     END
|   C   99                GOTO DSP
|   C*
|   C                     MOVELDSC01     WQUERY
| 19-C           DSC03     IFEQ 'S9'
|   C           MA07      ANDNEWQUERY
|   C                     SETON                     618999
| 19-C                     END
|   C   99                GOTO DSP
|   C* CHK 課稅別
| 20-C           DOPT2     IFEQ '4'
|   C                     SUB  1         COUNT1
| 21-C           COUNT1    IFEQ 0
|   C                     MOVE *BLANKS   SC37
| 21-C                     END
| 20*C                     ELSE
| 22-C           DOPT2     IFEQ '1'
| 23-C           SC37      IFEQ *BLANKS
|   C                     MOVE MA59      SC37
| 23*C                     ELSE
| 24-C           MA59      IFNE SC37
|   C                     SETON                     618599
| 24-C                     END
| 23-C                     END
| 22-C                     END
| 20-C                     END
|   C   99                GOTO DSP
|   C* GET 零售價
B2???C           WSC07     IFLT MA39
M006AC                     Z-ADDMA41      HSD08
M006AC                     Z-ADDMA41      HSD10
|   C                     Z-ADDMA41      HSD15
| 25*C                     ELSE
|   C                     Z-ADDMA46      HSD15
M006AC                     Z-ADDMA46      HSD08
M006AC                     Z-ADDMA46      HSD10
| 25-C                     END
      *牌價
| 26-C           HSD15     IFEQ 0
|   C                     SETON                     618399
| 26-C                     END
|   C   99                GOTO DSP
|   C*
M006AC* BEGIN
M006AC* GET 正常單價，正常折扣，特別折扣
| 27-C           #214      IFEQ 'Y'
|   C                     SETOF                     81
|   C                     Z-ADD1         RATE    76
|   C                     MOVE DSC04     SB01
|   C                     MOVE 'N'       SA04
|   C                     MOVE 'N'       SB04
|   C                     EXSR RTN38B
|   C                     MOVE 'S'       SA04
|   C                     MOVE 'S'       SB04
|   C                     EXSR RTN38B
      *售價＝牌價も（１－（正折％＋特折％））
|   C           HSD15     MULT RATE      HSD08     H
      *折扣ＵＮＩＴ＝牌價－售價
|   C           HSD15     SUB  HSD08     WRK     90H
      *特折ＵＮＩＴ＝折扣ＵＮＩＴ－正折ＵＮＩＴ
|   C           WRK       SUB  HSD13     HSD14   50
| 28-C           HSD14     IFLT 0
|   C                     ADD  HSD14     HSD13
|   C                     Z-ADD0         HSD14
| 28-C                     END
| 27*C                     ELSE
|   C                     Z-ADD0         HSD08
|   C                     Z-ADD0         HSD13
|   C                     Z-ADD0         HSD14
| 27-C                     END
|   C   99                GOTO DSP
|   C* GET 正常搭贈
| 29-C           DOPT2     IFNE '0'
|   C                     EXSR RTN38A
| 29*C                     ELSE
|   C                     Z-ADD0         HSD09
| 29-C                     END
      *
| 30-C           DSD05     IFEQ 0
|   C           DSC03     OREQ 'S3'
|   C                     Z-ADDHSD09     DSD05
| 30-C                     END
M006AC* END
|   C* CHK 訂貨數量，搭贈數量
| 27-C           DOPT2     IFNE *BLANK
|   C           DSD03     ANDNE*BLANK
| 28-C           DSD04     IFEQ 0
|   C           DSD05     ANDEQ0
|   C                     SETON                     629499
| 28-C                     END
| 27-C                     END
|   C   99                GOTO DSP
|   C* CHK 可用量
|   C                     MOVELHSD16     IA01             *FOR KEY
| 29-C           #212      IFEQ 'Y'
|   C                     MOVE DSC11     IA02             *FOR KEY
|   C           KEYIA     CHAINIA0                  40
|   C           *LOVAL    SETLLIA0
|   C   40                Z-ADD0         IA10
| 30-C           DSC11     IFEQ HSC11                      *物流點未變
| 31-C           DOPT2     IFEQ '4'
|   C                     Z-ADDHSD04     STOR    60
|   C                     ADD  HSD05     STOR
| 31*C                     ELSE
|   C           HSD04     SUB  DSD04     STOR
|   C                     ADD  HSD05     STOR
|   C                     SUB  DSD05     STOR
| 31-C                     END
| 30*C                     ELSE                            *物流點改變
| 32-C           DOPT2     IFEQ '4'
|   C                     Z-ADDHSD04     STOR    60
|   C                     ADD  HSD05     STOR
| 32*C                     ELSE
|   C                     Z-SUBDSD04     STOR
|   C                     SUB  DSD05     STOR
| 32-C                     END
| 30-C                     END
|   C                     ADD  IA10      STOR
| 33-C           STOR      IFLT 0
|   C                     SETON                     6263
|   C                     SETON                     8899
| 33-C                     END
| 29-C                     END
|   C   99                GOTO DSP
|   C* CHK 庫存量
| 34-C           DSC03     IFNE 'S7'
|   C           #211      ANDEQ'Y'
|   C                     MOVE DSC36     IA02
|   C           KEYIA     CHAINIA0                  40
|   C           *LOVAL    SETLLIA0
|   C   40                Z-ADD0         IA10
| 35-C           DSC36     IFEQ HSC36                      *物流點未變
| 36-C           DOPT2     IFEQ '4'
|   C                     Z-ADDHSD04     STOR    60
|   C                     ADD  HSD05     STOR
| 36*C                     ELSE
|   C           HSD04     SUB  DSD04     STOR
|   C                     ADD  HSD05     STOR
|   C                     SUB  DSD05     STOR
| 36-C                     END
| 35*C                     ELSE                            *物流點改變
| 37-C           DOPT2     IFEQ '4'
|   C                     Z-ADDHSD04     STOR    60
|   C                     ADD  HSD05     STOR
| 37*C                     ELSE
|   C                     Z-SUBDSD04     STOR
|   C                     SUB  DSD05     STOR
| 37-C                     END
| 35-C                     END
|   C                     ADD  IA10      STOR
| 38-C           STOR      IFLT 0
|   C                     SETON                     6263
|   C                     SETON                     8799
| 38-C                     END
| 34-C                     END
|   C   99                GOTO DSP
      *售價＝成本　Ｘ　１１０％
| 38-C*M006D     MA11L     IFNE '3'
|   C* "        MA34      MULT 1.1       HSD08     H
|   C* "        MA34      MULT 1.1       DSD06     H
|   C* "        MA34      MULT 1.1       HSD10     H
| 38-C* "                  ELSE
      *售價＝最後成本　Ｘ　１１０％
|   C*M006D     MA01      SETGTPE0
|   C* "        MA01      REDPEPE0                      46
|    C* "        *IN46     IFEQ '0'
     C* "        KEYPC     CHAINPC0                  41
M001AC* "        *LOVAL    SETLLPC0
|   C*
|   C* "        PE07      ADD  PE08      AMT    130
|   C* "                  ADD  PE09      AMT    130
     C* "        *IN41     IFEQ '0'
     C* "        PE06      MULT PC10      QTY
     C* "                  ELSE
|   C* "        PE06      MULT MA16      QTY     90
     C* "                  END
|   C* "        AMT       DIV  QTY       COST    92
M005MC*                    ADD  MA25      COST    92
M005MC*M006D               ADD  MA33      COST    92
|   C*
|   C*M006D     COST      MULT 1.1       HSD08     H
|   C* "        COST      MULT 1.1       DSD06     H
|   C* "        COST      MULT 1.1       HSD10     H
|   C*
| 38-C*M006D               ELSE
      *售價＝成本　Ｘ　１１０％
|   C*M006D     MA34      MULT 1.1       HSD08     H
|   C* "        MA34      MULT 1.1       DSD06     H
|   C* "        MA34      MULT 1.1       HSD10     H
| 38-C* "                  END
| 38-C* "                  END
      *折扣ＵＮＩＴ＝牌價－售價
|   C*M006D     HSD15     SUB  HSD08     WRK     90H
      *
M006AC* BEGIN
|   C* GET 單價
| 43-C           DSD06     IFEQ 0
|   C           DSC03     OREQ 'S3'
|   C                     Z-ADDHSD08     DSD06
| 43-C                     END
M006AC* END
     C**********
|   C* GET 金額AND訂單總價
|   C********** DSD06     MULT DSD04     DSD07
|   C           DSD06     MULT DSD04     DSD07     H
M006AC           DSD06     MULT DSD04     DSD071    H
|   C                     SELEC
|   C           DOPT2     WHEQ '1'
|   C                     ADD  DSD07     DSC12
|   C           DOPT2     WHEQ '0'
|   C                     ADD  DSD07     DSC12
|   C                     SUB  HSD07     DSC12
|   C           DOPT2     WHEQ '2'
|   C                     ADD  DSD07     DSC12
|   C                     SUB  HSD07     DSC12
|   C           DOPT2     WHEQ '4'
|   C                     SUB  HSD07     DSC12
|   C                     ENDSL
M003AC           SC37      IFEQ 'D'
M003AC           DSC12     MULT DUTY1     DTAX      H
M003AC           DSC12     ADD  DTAX      DTOT
M003AC                     ELSE
M003AC                     Z-ADD0         DTAX
M003AC                     Z-ADDDSC12     DTOT
M003AC                     END
|   C* CHK,GET 單位成本
|   C                     MOVELDSC01     WQUERY
| 39-C           HSD16     IFEQ WQUERY
|   C                     Z-ADDMA31      HSD10
|   C                     Z-ADDMA32      HSD11
|   C                     Z-ADDMA33      HSD12
| 39*C                     ELSE
|   C                     SETOF                     81
      *產品歸屬＜＞公司第一碼
| 40-C           MA57      IFNE 'Y'
|   C           DOPT2     ANDNE*BLANKS
|   C                     SETON                     608499
| 40-C                     END
|   C   99                GOTO DSP
M006AC* BEGIN
M006A *
|   C           DSC01     CHAIN#B0                  40
|   C                     Z-ADD1         RATE
|   C                     MOVE #B14      SB01
|   C                     MOVE 'N'       SA04
|   C                     MOVE 'N'       SB04
|   C                     EXSR RTN38C
|   C                     MOVE 'S'       SA04
|   C                     MOVE 'S'       SB04
|   C                     EXSR RTN38C
|   C           HSD15     MULT RATE      HSD10     H
      *HSD10四捨五入－－＞元
|   C                     Z-ADDHSD10     WORK   100H
     C                     Z-ADDWORK      HSD10
M006AC* END
| 39-C                     END
|   C   99                GOTO DSP
|   C*
|   C           DSP       TAG
|   C   99                Z-ADDRRN2      DRRN2
|   C*
|   C           UPD       TAG
| 41-C           DOPT1     IFEQ '4'
|   C                     MOVE *BLANK    DOPT2
| 41-C                     END
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
|    C*
|    C   99                GOTO END380
|    C*新增訂單金額不可為０
| 42-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '2'
|   C           *IN35     ANDEQ'1'
| 43-C           DSC12     IFEQ 0
|   C                     SETON                     8299
| 43-C                     END
| 42-C                     END
|    C   99                GOTO END380
|    C* FOR RECORD LOCK
|    C           END380    TAG
|    C           *LOVAL    SETLLSD0
|    C           *LOVAL    SETLLIA0
|    C           *LOVAL    SETLLMD0
|    C           *LOVAL    SETLLMA0
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 44-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 44-C                     END
|    C*
28===C                     ENDSR
M006AC* RTN38A ~ RTN38C
     C*==============================================================*
M006AC*          RTN38A....GET 正常搭贈
     C*==============================================================*
29===C           RTN38A    BEGSR
|    C*
|    C                     Z-ADD0         HSD09
| 01-C           #213      IFNE 'N'
|   C                     MOVE DSC04     SB01
|   C                     MOVE 'A'       SA04
|   C                     MOVE 'A'       SB04
|   C                     SETOF                     59
      *----------------------------------------------------------------
      *客戶產品全稱
B2???C           KEYSB1    SETGTSB0
|   C           KEYSB2    REDPESB0                      48
| 02-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
      *訂單日期應在起迄日期內
B2???C           WSC07     IFGE SB05
|   C           WSC07     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
|   C*
| 04-C           DSD04     IFLT SB08
|   C           SB08      OREQ 0
|   C                     Z-ADD0         HSD09
| 04*C                     ELSE
| 05-C           DSD04     IFGE SB08
|   C           DSD04     ANDLTSB10
|   C           DSD04     ORGE SB08
|   C           SB10      ANDEQ0
|   C           DSD04     DIV  SB08      HSD09
|   C                     MULT SB07      HSD09
| 05*C                     ELSE
| 06-C           DSD04     IFGE SB10
|   C           DSD04     ANDLTSB12
|   C           DSD04     ORGE SB10
|   C           SB12      ANDEQ0
|   C           DSD04     DIV  SB10      HSD09
|   C                     MULT SB09      HSD09
| 06*C                     ELSE
| 07-C           DSD04     IFGE SB12
|   C           SB12      ANDNE0
|   C           DSD04     DIV  SB12      HSD09
|   C                     MULT SB11      HSD09
| 07-C                     END
| 06-C                     END
| 05-C                     END
| 04-C                     END
|   C                     SETON                     59
| 03*C                     ELSE
|   C           KEYSB2    REDPESB0                      48
| 03-C                     END
| 02-C                     END
      *----------------------------------------------------------------
| 08-C           *IN59     IFEQ '0'
|   C                     MOVELDSD03L    KSD03
      *客戶產品前四碼
B2???C           SB1KEY    SETGTSB0
|   C           SB2KEY    REDPESB0                      48
| 09-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
      *訂單日期應在起迄日期內
B2???C           WSC07     IFGE SB05
|   C           WSC07     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
|   C*
| 11-C           DSD04     IFLT SB08
|   C           SB08      OREQ 0
|   C                     Z-ADD0         HSD09
| 11*C                     ELSE
| 12-C           DSD04     IFGE SB08
|   C           DSD04     ANDLTSB10
|   C           DSD04     ORGE SB08
|   C           SB10      ANDEQ0
|   C           DSD04     DIV  SB08      HSD09
|   C                     MULT SB07      HSD09
| 12*C                     ELSE
| 13-C           DSD04     IFGE SB10
|   C           DSD04     ANDLTSB12
|   C           DSD04     ORGE SB10
|   C           SB12      ANDEQ0
|   C           DSD04     DIV  SB10      HSD09
|   C                     MULT SB09      HSD09
| 13*C                     ELSE
| 14-C           DSD04     IFGE SB12
|   C           SB12      ANDNE0
|   C           DSD04     DIV  SB12      HSD09
|   C                     MULT SB11      HSD09
| 14-C                     END
| 13-C                     END
| 12-C                     END
| 11-C                     END
|   C                     SETON                     59
| 10*C                     ELSE
|   C           SB2KEY    REDPESB0                      48
| 10-C                     END
| 09-C                     END
| 08-C                     END
      *----------------------------------------------------------------
      *產品全稱
|   C*
| 15-C           *IN59     IFEQ '0'
B2???C           KEYSA1    SETGTSA0
|   C           KEYSA2    REDPESA0                      48
| 16-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SA05
|   C           WSC07     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
|   C*搭贈----------------------------------------------------------
| 18-C           DSD04     IFLT SA08
|   C           SA08      OREQ 0
      *不足搭贈採購數或不搭贈
|   C                     Z-ADD0         HSD09
| 18*C                     ELSE
      *第一二組
| 19-C           DSD04     IFGE SA08
|   C           DSD04     ANDLTSA10
      *OR僅第一組
|   C           DSD04     ORGE SA08
|   C           SA10      ANDEQ0
|   C           DSD04     DIV  SA08      HSD09
|   C                     MULT SA07      HSD09
| 19*C                     ELSE
      *第二三組
| 20-C           DSD04     IFGE SA10
|   C           DSD04     ANDLTSA12
      *OR第二組
|   C           DSD04     ORGE SA10
|   C           SA12      ANDEQ0
|   C           DSD04     DIV  SA10      HSD09
|   C                     MULT SA09      HSD09
| 20*C                     ELSE
      *第三組以上
| 21-C           DSD04     IFGE SA12
|   C           SA12      ANDNE0
|   C           DSD04     DIV  SA12      HSD09
|   C                     MULT SA11      HSD09
| 21-C                     END
| 20-C                     END
| 19-C                     END
| 18-C                     END
|   C                     SETON                     59
| 17*C                     ELSE
|   C           KEYSA2    REDPESA0                      48
| 17-C                     END
| 16-C                     END
| 15-C                     END
      *----------------------------------------------------------------
      *產品前四碼
|   C*
| 22-C           *IN59     IFEQ '0'
B2???C           SA1KEY    SETGTSA0
|   C           SA2KEY    REDPESA0                      48
| 23-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SA05
|   C           WSC07     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
|   C*搭贈----------------------------------------------------------
| 25-C           DSD04     IFLT SA08
|   C           SA08      OREQ 0
      *不足搭贈採購數或不搭贈
|   C                     Z-ADD0         HSD09
| 25*C                     ELSE
      *第一二組
| 26-C           DSD04     IFGE SA08
|   C           DSD04     ANDLTSA10
      *OR僅第一組
|   C           DSD04     ORGE SA08
|   C           SA10      ANDEQ0
|   C           DSD04     DIV  SA08      HSD09
|   C                     MULT SA07      HSD09
| 26*C                     ELSE
      *第二三組
| 27-C           DSD04     IFGE SA10
|   C           DSD04     ANDLTSA12
      *OR第二組
|   C           DSD04     ORGE SA10
|   C           SA12      ANDEQ0
|   C           DSD04     DIV  SA10      HSD09
|   C                     MULT SA09      HSD09
| 27*C                     ELSE
      *第三組以上
| 28-C           DSD04     IFGE SA12
|   C           SA12      ANDNE0
|   C           DSD04     DIV  SA12      HSD09
|   C                     MULT SA11      HSD09
| 28-C                     END
| 27-C                     END
| 26-C                     END
| 25-C                     END
|   C                     SETON                     59
| 24*C                     ELSE
|   C           SA2KEY    REDPESA0                      48
| 24-C                     END
| 23-C                     END
| 22-C                     END
      *
| 01-C                     END
|    C*
29===C                     ENDSR
     C*==============================================================*
     C*          RTN38B....GET 正常單價，正常折扣，特別折扣
     C*==============================================================*
30===C           RTN38B    BEGSR
|    C*客戶產品全稱
|    C                     SETOF                     59
B2???C           KEYSB1    SETGTSB0
|    C           KEYSB2    REDPESB0                      48
| 01-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SB05
|   C           WSC07     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
| 03-C           SB04      IFEQ 'N'
      *正折ＵＮＩＴ＝牌價も正折％
|   C           HSD15     MULT SB06      HSD13     H      *正常折扣
|   C                     SUB  SB06      RATE             *正常單價
| 03*C                     ELSE
|   C                     SUB  SB06      RATE
| 03-C                     END
|   C                     SETON                     59
| 02*C                     ELSE
|   C           KEYSB2    REDPESB0                      48
| 02-C                     END
| 01-C                     END
|    C*----------------------------------------------------------------
| 04-C           *IN59     IFEQ '0'
|   C*客戶產品前四碼
|   C                     MOVELDSD03L    KSD03
B2???C           SB1KEY    SETGTSB0
|   C           SB2KEY    REDPESB0                      48
| 05-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SB05
|   C           WSC07     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
| 07-C           SB04      IFEQ 'N'
|   C           HSD15     MULT SB06      HSD13     H      *正常折扣
|   C                     SUB  SB06      RATE             *正常單價
| 07*C                     ELSE
|   C                     SUB  SB06      RATE
| 07-C                     END
|   C                     SETON                     59
| 06*C                     ELSE
|   C           SB2KEY    REDPESB0                      48
| 06-C                     END
| 05-C                     END
| 04-C                     END
|    C*----------------------------------------------------------------
|    C*客戶產品全稱
| 08-C           *IN59     IFEQ '0'
B2???C           KEYSA1    SETGTSA0
|   C           KEYSA2    REDPESA0                      48
| 09-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SA05
|   C           WSC07     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
| 11-C           SA04      IFEQ 'N'
|   C           HSD15     MULT SA06      HSD13     H      *正常折扣
|   C                     SUB  SA06      RATE
| 11*C                     ELSE
|   C                     SUB  SA06      RATE
| 11-C                     END
|   C                     SETON                     595959
| 10*C                     ELSE
|   C           KEYSA2    REDPESA0                      48
| 10-C                     END
| 09-C                     END
| 08-C                     END
|    C*----------------------------------------------------------------
|    C*客戶產品前四碼
| 12-C           *IN59     IFEQ '0'
B2???C           SA1KEY    SETGTSA0
|   C           SA2KEY    REDPESA0                      48
| 13-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SA05
|   C           WSC07     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
| 15-C           SA04      IFEQ 'N'
|   C           HSD15     MULT SA06      HSD13     H      *正常折扣
|   C                     SUB  SA06      RATE
| 15*C                     ELSE
|   C                     SUB  SA06      RATE
| 15-C                     END
|   C                     SETON                     59
| 14*C                     ELSE
|   C           SA2KEY    REDPESA0                      48
| 14-C                     END
| 13-C                     END
| 12-C                     END
|    C*
| 16-C           *IN59     IFEQ '0'
|   C   81                SETON                     618699
|   C                     SETON                     81
| 16-C                     END
|    C*
30===C                     ENDSR
     C*==============================================================*
     C*          RTN38C....GET 單位成本
     C*==============================================================*
31===C           RTN38C    BEGSR
|    C*客戶產品全稱
|    C                     SETOF                     59
B2???C           KEYSB1    SETGTSB0
|    C           KEYSB2    REDPESB0                      48
| 01-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SB05
|   C           WSC07     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
| 03-C           SB04      IFEQ 'N'
|   C                     SUB  SB06      RATE
| 03*C                     ELSE
|   C                     SUB  SB06      RATE      H
| 03-C                     END
|   C                     Z-ADD0         HSD11
|   C                     Z-ADD0         HSD12
|   C                     SETON                     59
| 02*C                     ELSE
|   C           KEYSB2    REDPESB0                      48
| 02-C                     END
| 01-C                     END
      *
|    C*產品歸屬不同公司第一碼GET公司檔客戶CHAIN客戶檔通路及型態
      *
|    C                     SETOF                     20                ENT
| 04-C           *IN20     DOUEQ'0'
|   C           #B14      CHAINMD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 04-C                     END
      *
|    C           *LOVAL    SETLLMD0
| 05-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MD07
|   C                     MOVEL*BLANKS   MD08
| 05-C                     END
      *----------------------------------------------------------------
| 06-C           *IN59     IFEQ '0'
|   C*客戶產品前四碼
|   C                     MOVELDSD03L    KSD03
B2???C           SB1KEY    SETGTSB0
|   C           SB2KEY    REDPESB0                      48
| 07-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SB05
|   C           WSC07     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
| 09-C           SB04      IFEQ 'N'
|   C                     SUB  SB06      RATE
| 09*C                     ELSE
|   C                     SUB  SB06      RATE      H
| 09-C                     END
|   C                     Z-ADD0         HSD11
|   C                     Z-ADD0         HSD12
|   C                     SETON                     59
| 08*C                     ELSE
|   C           SB2KEY    REDPESB0                      48
| 08-C                     END
| 07-C                     END
| 06-C                     END
      *----------------------------------------------------------------
      *產品全稱
| 10-C           *IN59     IFEQ '0'
B2???C           KEYSA3    SETGTSA0
|   C           KEYSA4    REDPESA0                      48
| 11-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SA05
|   C           WSC07     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
| 13-C           SA04      IFEQ 'N'
|   C                     SUB  SA06      RATE
| 13*C                     ELSE
|   C                     SUB  SA06      RATE
| 13-C                     END
|   C                     Z-ADD0         HSD11     H
|   C                     Z-ADD0         HSD12     H
|   C                     SETON                     59
| 12*C                     ELSE
|   C           KEYSA4    REDPESA0                      48
| 12-C                     END
| 11-C                     END
| 10-C                     END
|    C*
      *----------------------------------------------------------------
      *產品前四碼
| 14-C           *IN59     IFEQ '0'
B2???C           SA3KEY    SETGTSA0
|   C           SA4KEY    REDPESA0                      48
| 15-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2???C           WSC07     IFGE SA05
|   C           WSC07     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
| 17-C           SA04      IFEQ 'N'
|   C                     SUB  SA06      RATE
| 17*C                     ELSE
|   C                     SUB  SA06      RATE
| 17-C                     END
|   C                     Z-ADD0         HSD11     H
|   C                     Z-ADD0         HSD12     H
|   C                     SETON                     59
| 16*C                     ELSE
|   C           SA4KEY    REDPESA0                      48
| 16-C                     END
| 15-C                     END
| 14-C                     END
|    C*
| 18-C           *IN59     IFEQ '0'
|   C   81                SETON                     618699
|   C                     SETON                     81
| 18-C                     END
|    C*
31===C                     ENDSR
M006AC*
     C*==============================================================*
     C*          RTN381....HELP  'SC03' --- SFLSR
     C*==============================================================*
29===C           RTN381    BEGSR
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C*CHK SCREEN
|    C                     SETOF                     38
|    C                     SETON                     54
|    C                     SETOF                     606162
|    C                     SETOF                     6364
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
| 02-C           DCHK      IFEQ 'Y'
|   C                     SETOF                     32    *PROTECT FIELD
| 02*C                     ELSE
|   C                     SETON                     32
| 02-C                     END
|   C*挑選產品代號
|   C                     MOVELDSD03     WQUERY
| 03-C           WQUERY    IFEQ '?'
|   C                     CALL 'WDS001'
|   C           DSD03     PARM DSD03     DS01O1  9
|   C                     SETON                     38
|   C                     MOVELDSD03     WQUERY
| 04-C           WQUERY    IFEQ '?'
|   C                     MOVEL' '       DSD03
| 04-C                     END
| 03-C                     END
|   C   38                GOTO UPD1
|   C*
|   C           UPD1      TAG
|   C                     UPDATSFLSR2
| 05-C           *IN38     IFEQ '1'
|   C                     SETON                     37
|   C                     WRITEDSPC3
| 06-C*M006D     AUT       IFNE 'D91'
|   C* "        AUT       ANDNE'REP'
|   C* "                  SETON                     34
     C* "                  ELSE
     C* "                  SETOF                     34
| 06-C*M006D               END
|   C                     WRITESFLCR2
|   C                     SETOF                     3738
| 05-C                     END
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
|    C*
|    C                     SETON                     99
|    C*
29===C           END381    ENDSR
     C*==============================================================*
     C*          RTN391....INIT 'SC03' -- SFLSR2
     C*==============================================================*
30===C           RTN391    BEGSR
|    C*COUNT FOR課稅別
|    C                     Z-ADD0         COUNT
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
| 01-C*M008D     DOPT1     IFEQ '5'
|   C*M008D     DOPT1     OREQ '6'
|   C                     Z-ADD8         DSPRC2  40
|   C                     Z-ADD8         WPRCD2  40       *PAG RCD
| 01*C*M008D               ELSE
|   C*M008D               Z-ADD4         DSPRC2  40
|   C*M008D               Z-ADD4         WPRCD2  40       *PAG RCD
| 01-C*M008D               END
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
| 02-C*M006D     AUT       IFNE 'D91'
|   C* "        AUT       ANDNE'REP'
|   C* "                  SETON                     34
     C* "                  ELSE
     C* "                  SETOF                     34
| 02-C*M006D               END
|    C                     WRITESFLCR2
|    C                     SETOF                     5250
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYSD1    SETLLSD0
|    C* FOR HEADING
|    C                     MOVELD#B031    D#B03
|    C                     MOVEL#D02      D#D02
|    C*
|    C           KEY#C     CHAIN#C0                  43
|    C  N43                MOVEL#C03      #C031
|    C   43                MOVE *BLANK    #C031
|    C*
|    C                     MOVE HSC34     ASC34
|    C*
30===C                     ENDSR
     C*==============================================================*
     C*          RTN397....FILE TO SCREEN --- SFLSR(FOR ADD OR UPD)
     C*==============================================================*
31===C           RTN397    BEGSR
|    C*
|    C                     SETOF                     54    *45 FOR BLANK LOOP
|    C                     SETON                     32    *UL產品代號
|    C                     EXSR RTN39A                     *INIT SFLDTA
|    C*
| 01-C           RRN2      DOWLTDSPRC2
      *WRITE *BLANKS TO SFL
      *
| 02-C           RRN2      IFEQ 0
|   C                     MOVEL'1'       DOPT2
| 02*C                     ELSE
|   C                     MOVEL*BLANKS   DOPT2
| 02-C                     END
      *
|   C                     ADD  1         RRN2
| 03-C*M006D     AUT       IFNE 'D91'
|   C* "        AUT       ANDNE'REP'
|   C* "                  SETON                     34
     C* "                  ELSE
     C* "                  SETOF                     34
| 03-C*M006D               END
|   C                     WRITESFLSR2
| 01-C                     END
|    C*
|    C                     SETON                     50
|    C*
31===C                     ENDSR
     C*==============================================================*
     C*          RTN398....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
32===C           RTN398    BEGSR
|    C*
| 01-C           SCR2CN    IFNE SCR2CO
|   C           DSC11     ORNE HSC11
|   C           DOPT1     OREQ '4'
|   C                     SETON                     54
| 01*C                     ELSE
|   C                     SETOF                     54
| 01-C                     END
|    C*
|    C           KEYSD1    READESD0                      44*NF/EOF
|    C*
| 02-C           *IN44     DOWEQ'0'
|   C           *IN99     ANDEQ'0'
      *GET DATA TO SFL
|   C                     EXSR RTN39B
| 03-C           DOPT1     IFEQ '2'
|   C           DSD05     ANDEQ0
|   C                     MOVEL'0'       DOPT2
| 03*C                     ELSE
|   C                     MOVEL*BLANKS   DOPT2
| 03-C                     END
|   C                     ADD  1         RRN2
|   C                     ADD  1         COUNT   10
|   C                     MOVEL$USER     AUT     3
| 04-C*M006D     AUT       IFNE 'D91'
|   C* "        AUT       ANDNE'REP'
|   C* "                  SETON                     34
     C* "                  ELSE
     C* "                  SETOF                     34
| 04-C*M006D               END
|   C                     WRITESFLSR2
|   C           KEYSD1    READESD0                      44*NF/EOF
| 02-C                     END
|    C           *LOVAL    SETLLSD0
|    C*
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
| 05-C           DOPT1     IFEQ '5'
|   C           DOPT1     OREQ '6'
|   C           *LOVAL    SETLLSD0
| 05-C                     END
|    C* FOR DATA LOCK
|    C           *LOVAL    SETLLMD0
|    C           *LOVAL    SETLLIA0
|    C*
32===C                     ENDSR
     C*==============================================================*
     C*          RTN39A....INIT 'SC03' -- SFLSR(DTA)
     C*==============================================================*
33===C           RTN39A    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANK    DCHK
|    C                     MOVE *BLANKS   DOPT2
|    C                     MOVE *BLANKS   DSD03
|    C                     MOVE *BLANKS   MA03
|    C                     MOVE *BLANKS   MA13
|    C                     Z-ADD0         DSD04
|    C                     Z-ADD0         DSD05
|    C                     Z-ADD0         DSD06
|    C                     Z-ADD0         DSD07
|    C                     Z-ADD0         HSD04
|    C                     Z-ADD0         HSD05
|    C                     Z-ADD0         HSD07
|    C                     Z-ADD0         HSD08
|    C                     Z-ADD0         HSD09
|    C                     Z-ADD0         HSD10
|    C                     Z-ADD0         HSD11
|    C                     Z-ADD0         HSD12
|    C                     Z-ADD0         HSD13
|    C                     Z-ADD0         HSD15
|    C                     MOVE *BLANK    HSD16
|    C*
33===C                     ENDSR
     C*==============================================================*
     C*          RTN39B....FILE TO SCREEN --- MOVE
     C*==============================================================*
34===C           RTN39B    BEGSR
|    C*
|    C                     SETON                     54
|    C                     MOVE 'Y'       DCHK
|    C                     MOVE *BLANKS   DOPT2
|    C                     MOVE SD03      DSD03
      *KEEP課稅別
      *
|    C                     SETOF                     20                ENT
| 01-C           *IN20     DOUEQ'0'
|   C           DSD03     CHAINMA0                  4120
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 01-C                     END
      *
|    C           *LOVAL    SETLLMA0
| 02-C           *IN41     IFEQ '0'
|   C                     MOVELMA59      SC37
| 02-C                     END
      *
|    C                     Z-ADDSD04      DSD04
|    C                     Z-ADDSD05      DSD05
|    C                     Z-ADDSD06      DSD06
|    C                     Z-ADDSD07      DSD07
      *********
|    C                     Z-ADDSD04      HSD04
|    C                     Z-ADDSD05      HSD05
|    C                     Z-ADDSD07      HSD07
|    C                     Z-ADDSD08      HSD08
|    C                     Z-ADDSD09      HSD09
|    C                     Z-ADDSD10      HSD10
|    C                     Z-ADDSD11      HSD11
|    C                     Z-ADDSD12      HSD12
|    C                     Z-ADDSD13      HSD13
|    C                     Z-ADDSD15      HSD15
|    C                     MOVE SD16      HSD16
      ********
|    C* GET 產品名稱，單位
      *
|    C                     SETOF                     20                ENT
| 03-C           *IN20     DOUEQ'0'
|   C           DSD03     CHAINMA0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 03-C                     END
      *
|    C           *LOVAL    SETLLMA0
      *
34===C           END39B    ENDSR
     C*==============================================================*
     C*          RTN39C....SCREEN TO FILE --- HEADER
     C*==============================================================*
35===C           RTN39C    BEGSR
|    C*
|    C                     MOVE DSC01     SC01
|    C                     MOVE DSC02     SC02
|    C                     MOVE DSC03     SC03
|    C                     MOVE DSC04     SC04
|    C                     MOVE DSC05     SC05
|    C                     MOVE DSC06     SC06
B2???C                     Z-ADDWSC07     SC07             *DATE
B2INF *CVR5011 sev.50 Field WSC07 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C* DATE               Z-ADDDSC08     SC08
|    C                     Z-ADDDSC09     SC09
|    C                     MOVE DSC10     SC10
|    C                     MOVE DSC11     SC11
|    C                     Z-ADDDSC12     SC12
|    C                     MOVE DSC14     SC14
|    C                     MOVE DSC15     SC15
|    C                     MOVE DSC16     SC16
|    C                     MOVE DSC17     SC17
|    C                     MOVE DSC18     SC18
|    C                     MOVE DSC19     SC19
|    C                     MOVE DSC20     SC20
|    C                     MOVE DSC21     SC21
|    C                     MOVE DSC27     SC27
|    C                     MOVE DSC31     SC31
|    C                     MOVE HSC33     SC33
|    C                     MOVE HSC34     SC34
|    C                     MOVELDSC36     SC36
|    C                     MOVE *BLANKS   SC38
|    C* 日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC08     S001I2  60
B2???C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SC08
"    C* SC22單價待核準註記
"    C* SC25搭贈待核準註記
      *課稅別
|    C                     Z-ADD0         SC22NO  10
|    C                     Z-ADD0         SC25NO  10
|    C                     Z-ADD0         SC37NO  10
      *ITEM CONTROL DOPT1='2' DELETE SOSCPF
|    C                     Z-ADD0         ITEM    10
|    C           SC02      SETLLSD0
|    C           SC02      READESD0                      45
| 01-C           *IN45     DOWEQ'0'
|   C                     ADD  1         ITEM
      *
| 02-C           SC37NO    IFEQ 0
      *
|   C                     SETOF                     20                ENT
| 03-C           *IN20     DOUEQ'0'
|   C           SD03      CHAINMA0                  4220
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 03-C                     END
      *
|   C           *LOVAL    SETLLMA0
| 04-C           *IN42     IFEQ '0'
|   C                     MOVE MA59      SC37
| 04-C                     END
|   C                     ADD  1         SC37NO
| 02-C                     END
      *
|   C*M001D               MOVEL'C'       SD17
|   C* "                  MOVEL'C'       SC22
      *
|   C*M001D               MOVEL'C'       SD18
|   C* "                  MOVEL'C'       SC25
M001A * BEGIN
| 05-C           #214      IFEQ 'Y'
| 06-C           SD17      IFEQ '*'
|   C           SD17      OREQ ' '
|   C                     MOVEL'*'       SD17
|   C                     MOVEL'*'       SC22
|   C                     Z-ADD1         SC22NO
| 06-C                     END
| 05-C                     END
      *
| 07-C           #213      IFEQ 'Y'
| 08-C           SD18      IFEQ '*'
|   C           SD18      OREQ ' '
|   C                     MOVEL'*'       SD18
|   C                     MOVEL'*'       SC25
|   C                     Z-ADD1         SC25NO
| 08-C                     END
| 07-C                     END
M001A * END
|   C                     UPDATSD0
|   C           SC02      READESD0                      45
| 01-C                     END
|    C           *LOVAL    SETLLSD0
      *
M001A * BEGIN
| 09-C           SC22NO    IFEQ 0
|   C                     MOVEL'C'       SC22
| 09-C                     END
| 10-C           SC25NO    IFEQ 0
|   C                     MOVEL'C'       SC25
| 10-C                     END
M001AC* END
|    C                     MOVE 'C'       SC23
|    C                     MOVE 'C'       SC24
|    C                     MOVE 'C'       SC26
|    C* SC13訂單狀態
| 05-C           SC22      IFEQ '*'
|   C           SC23      OREQ '*'
|   C           SC24      OREQ '*'
|   C           SC25      OREQ '*'
|   C           SC26      OREQ '*'
      *待核準
|   C                     MOVE '*'       SC13
| 05*C                     ELSE
      *電腦核準
|   C                     MOVE 'C'       SC13
| 05-C                     END
|    C* SC32客戶區域
|    C                     MOVE DSC01     ME01
|    C                     MOVE DSC02     ME02
|    C           KEYME     CHAINME0                  40
|    C                     MOVE ME08      SC32
|    C* SC28,SC29,SC30
| 06-C           DOPT1     IFEQ '1'
|   C                     MOVE *BLANK    SC29
|   C                     MOVE *BLANK    SC30
| 06-C                     END
|    C                     MOVE *BLANK    SC35
| ERRC*                    END
|    C                     Z-ADD0         SC39
      *
|    C           SC27      CHAINMC0                  40
| 07-C           *IN40     IFEQ '0'
|   C                     MOVELMC03      SC28
| 07*C                     ELSE
|   C                     MOVEL*BLANKS   SC28
| 07-C                     END
|    C*
B2???C                     Z-ADDDATE      SCXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           SCYY
|    C                     MOVE $USER     SCZZ
|    C*
35===C                     ENDSR
     C*==============================================================*
     C*          RTN39D....SCREEN TO FILE --- DETAIL
     C*==============================================================*
36===C           RTN39D    BEGSR
|    C*
| 01-C           DOPT2     IFNE *BLANK
|   C                     Z-ADDDSD04     SD04
|   C                     Z-ADDDSD05     SD05
|   C                     Z-ADDDSD06     SD06
|   C                     Z-ADDDSD07     SD07
M999AC*M006D               Z-ADDSD07      SD131
M006AC                     Z-ADDDSD071    SD131
|   C                     Z-ADDHSD08     SD08
|   C                     Z-ADDHSD09     SD09
|   C                     Z-ADDHSD10     SD10
|   C                     Z-ADDHSD11     SD11
|   C                     Z-ADDHSD12     SD12
|   C* SD13=單位正常折扣も購買數量
|   C                     Z-ADDHSD15     SD15
|   C********** SD15      SUB  SD06      SD13
|   C*M006D     SD15      SUB  SD06      SD13      H
|   C* "                  MULT SD04      SD13
|   C* "                  Z-ADD0         SD14
M006AC* BEGIN
|   C* SD13=單位正常折扣も購買數量
|   C                     Z-ADDHSD13     SD13
|   C                     MULT SD04      SD13
|   C* SD14特別折扣=數量も牌價－正常折扣－金額
|   C           SD04      MULT SD15      WORK1  134
|   C                     SUB  SD13      WORK1
|   C           WORK1     SUB  SD07      SD14      H
| 02-C           SD14      IFLT 0
|   C                     ADD  SD14      SD13
|   C                     Z-ADD0         SD14
| 02-C                     END
M006AC* END
|   C* SD17
| 02-C           #214      IFEQ 'Y'
|   C           SD06      ANDNESD08
|   C                     MOVE '*'       SD17
| 02*C                     ELSE
|   C                     MOVE 'C'       SD17
| 02-C                     END
|   C* SD18
| 03-C           #213      IFEQ 'Y'
| 04-C           SD05      IFNE SD09
|   C           SD05      ANDNE0
|   C                     MOVE '*'       SD18
| 04*C                     ELSE
|   C                     MOVE 'C'       SD18
| 04-C                     END
| 03-C                     END
|   C* FOR ADD
| 05-C           DOPT2     IFEQ '1'
|   C                     MOVE DSC01     SD01
|   C                     MOVE DSC02     SD02
|   C                     MOVE DSD03     SD03
|   C                     MOVE HSD16     SD16
| 05-C                     END
| 01-C                     END
|    C* 交貨日期，進出貨物流點修改時，明細檔每筆需更新
|    C* 日期轉換
| 06-C           DSC08     IFNE 0
|   C                     Z-ADDDSC08     S001I2
| 06*C                     ELSE
|   C                     Z-ADDDSC07     S001I2
| 06-C                     END
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM           S001I2  60
B2???C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SD19
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C                     MOVE DSC11     SD20             出貨物流點
|    C                     MOVELDSC36     SD21             進貨物流點
|    C*
      *
|    C                     SETOF                     20                ENT
| 07-C           *IN20     DOUEQ'0'
|   C           DSD03     CHAINMA0                  4120
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 07-C                     END
      *
|    C           *LOVAL    SETLLMA0
|    C                     Z-ADDMA31      SD22
|    C                     Z-ADDMA32      SD23
|    C                     Z-ADDMA33      SD24
|    C*
B2???C                     Z-ADDDATE      SDXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           SDYY
|    C                     MOVE $USER     SDZZ
36===C                     ENDSR
     C*==============================================================*
     C*          RTN39E....禮盒銷售分析成本
     C*==============================================================*
37===C           RTN39E    BEGSR
|    C*
      *****SOSRPF
      *
|    C                     SETOF                     20                ENT
| 01-C           *IN20     DOUEQ'0'
|   C           DSD03     CHAINMA0                  4220
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 01-C                     END
      *
|    C           *LOVAL    SETLLMA0
| 02-C           *IN42     IFEQ '0'
      *禮盒碼
| 03-C           MA54      IFEQ 'Y'
      *
|   C           DSD03     SETLLMF0
|   C           DSD03     READEMF0                      44
| 04-C           *IN44     DOWEQ'0'
| 05-C           MF07      IFNE 'Y'
| 06-C           DOPT2     IFEQ '1'
|   C           DOPT2     OREQ '0'
|   C           DOPT2     OREQ '2'
      *
|   C                     SETOF                     20                ENT
| 07-C           *IN20     DOUEQ'0'
|   C           MF02      CHAINMA0                  4220
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 07-C                     END
      *
      *
|   C                     MOVELSD02      SR02
|   C                     MOVELMF01      SR03
|   C                     MOVELMF02      SR04
      *
|   C                     SETOF                     20                ENT
| 08-C           *IN20     DOUEQ'0'
|   C           KEYSR     CHAINSR0                  4220
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 08-C                     END
      *
|   C                     MOVELDSC01     SR01
|   C                     MOVELMF03      SR05
|   C                     Z-ADDMF04      SR06
|   C                     Z-ADDMF06      SR07
|   C                     Z-ADDMF08      SR08
|   C                     Z-ADDMF09      SR09
|   C*
B2???C                     Z-ADDDATE      SRXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           SRYY
|   C                     MOVE $USER     SRZZ
      *
| 09-C           *IN42     IFEQ '0'
|   C                     UPDATSR0
| 09*C                     ELSE
|   C                     WRITESR0
| 09-C                     END
| 06*C                     ELSE
      *DOPT2 ='4'
|   C                     MOVELSD02      SR02
|   C                     MOVELMF01      SR03
|   C                     MOVELMF02      SR04
      *
|   C                     SETOF                     20                ENT
| 10-C           *IN20     DOUEQ'0'
|   C           KEYSR     CHAINSR0                  4220
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 10-C                     END
      *
| 11-C           *IN42     IFEQ '0'
|   C                     DELETSR0
| 11-C                     END
      *
| 06-C                     END                             DOPT2
| 05-C                     END                             DOPT2
|   C           DSD03     READEMF0                      44
| 04-C                     END
      *
| 03-C                     END                             MA54
| 02-C                     END
|    C*****
37===C                     ENDSR
     C*==============================================================*
     C*          RTN39F....UPDATE POPCPF , IMIAPF , MTMAPF
     C*==============================================================*
38===C           RTN39F    BEGSR
|    C*****************
|    C* UPDATE IMIAPF *
|    C*****************
|    C*
|    C* FOR KEYIA
|    C                     MOVELHSD16     IA01
|    C***
|    C* FOR 出貨物流點
|    C***
| 01-C           #212      IFEQ 'Y'
|   C*
| 02-C           DOPT2     IFEQ '4'
|   C           HSC11     ORNE DSC11
|   C           DOPT2     ANDNE'1'
|   C                     MOVE HSC11     IA02             *原物流點
|   C           KEYIA     CHAINIA0                  40
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 03-C           *IN40     IFEQ '0'                        *新增時不做
|   C                     SUB  SD04      IA09
|   C                     SUB  SD05      IA09
|   C                     ADD  SD04      IA10
|   C                     ADD  SD05      IA10
|   C                     UPDATIA0
| 03-C                     END
| 02-C                     END
|   C* 出貨物流點改變
| 04-C           HSC11     IFNE DSC11
|   C*
| 05-C           DOPT2     IFNE '4'
|   C                     MOVE DSC11     IA02
|   C           KEYIA     CHAINIA0                  40
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 06-C           *IN40     IFEQ '0'
      *
| 07-C           DOPT2     IFNE *BLANKS
|   C                     ADD  DSD04     IA09
|   C                     ADD  DSD05     IA09
|   C                     SUB  DSD04     IA10
|   C                     SUB  DSD05     IA10
| 07*C                     ELSE
|   C                     ADD  SD04      IA09
|   C                     ADD  SD05      IA09
|   C                     SUB  SD04      IA10
|   C                     SUB  SD05      IA10
| 07-C                     END
      *
| 08-C           DOPT2     IFNE *BLANKS
|   C           DOPT2     ANDNE'2'
|   C           DOPT2     ANDNE'0'
|   C                     SUB  SD04      IA09
|   C                     SUB  SD05      IA09
|   C                     ADD  SD04      IA10
|   C                     ADD  SD05      IA10
| 08-C                     END
|   C                     UPDATIA0
| 06-C                     END
| 05-C                     END
|   C* 出貨物流點未變
| 04*C                     ELSE
|   C* CHECK DOPT2 ---> FROM POA003
| 09-C           DOPT2     IFEQ '1'
|   C           DOPT2     OREQ '0'
|   C           DOPT2     OREQ '2'
|   C                     MOVE DSC11     IA02
|   C           KEYIA     CHAINIA0                  40
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 10-C           *IN40     IFEQ '0'
|   C                     ADD  DSD04     IA09
|   C                     ADD  DSD05     IA09
|   C                     SUB  SD04      IA09
|   C                     SUB  SD05      IA09
|   C                     SUB  DSD04     IA10
|   C                     SUB  DSD05     IA10
|   C                     ADD  SD04      IA10
|   C                     ADD  SD05      IA10
|   C                     UPDATIA0
| 10-C                     END
| 09-C                     END
| 04-C                     END
|   C*
| 01-C                     END
|    C***
|    C* FOR 進貨物流點
|    C***
| 11-C           #211      IFEQ 'Y'
|   C*
| 12-C           DOPT2     IFEQ '4'
|   C           HSC36     ORNE DSC36
|   C           DOPT2     ANDNE'1'
|   C                     MOVE HSC36     IA02             *原物流點
|   C           KEYIA     CHAINIA0                  40
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 13-C           *IN40     IFEQ '0'
|   C                     ADD  SD04      IA06
|   C                     ADD  SD05      IA06
|   C                     ADD  SD04      IA07
|   C                     ADD  SD05      IA07
|   C                     ADD  SD04      IA10
|   C                     ADD  SD05      IA10
|   C                     UPDATIA0
| 13-C                     END
| 12-C                     END
|   C* 進貨物流點改變
| 14-C           HSC36     IFNE DSC36
|   C*
| 15-C           DOPT2     IFNE '4'
|   C                     MOVE DSC36     IA02
|   C           KEYIA     CHAINIA0                  40
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 16-C           *IN40     IFEQ '0'
|   C                     SUB  DSD04     IA06
|   C                     SUB  DSD05     IA06
|   C                     SUB  DSD04     IA07
|   C                     SUB  DSD05     IA07
|   C                     SUB  DSD04     IA10
|   C                     SUB  DSD05     IA10
| 17-C           DOPT2     IFNE *BLANKS
|   C           DOPT2     ANDNE'2'
|   C           DOPT2     ANDNE'0'
|   C                     ADD  SD04      IA06
|   C                     ADD  SD05      IA06
|   C                     ADD  SD04      IA07
|   C                     ADD  SD05      IA07
|   C                     ADD  SD04      IA10
|   C                     ADD  SD05      IA10
| 17-C                     END
|   C                     UPDATIA0
| 16-C                     END
| 15-C                     END
|   C* 進貨物流點未變
| 14*C                     ELSE
|   C* CHECK DOPT2 ---> FROM POA003
| 18-C           DOPT2     IFEQ '1'
|   C           DOPT2     OREQ '0'
|   C           DOPT2     OREQ '2'
|   C                     MOVE DSC36     IA02
|   C           KEYIA     CHAINIA0                  40
B2???C                     Z-ADDDATE      IAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 19-C           *IN40     IFEQ '0'
|   C                     SUB  DSD04     IA06
|   C                     SUB  DSD05     IA06
|   C                     ADD  SD04      IA06
|   C                     ADD  SD05      IA06
|   C                     SUB  DSD04     IA07
|   C                     SUB  DSD05     IA07
|   C                     ADD  SD04      IA07
|   C                     ADD  SD05      IA07
|   C                     SUB  DSD04     IA10
|   C                     SUB  DSD05     IA10
|   C                     ADD  SD04      IA10
|   C                     ADD  SD05      IA10
|   C                     UPDATIA0
| 19-C                     END
| 18-C                     END
| 14-C                     END
|   C*
| 11-C                     END
|    C*****************
|    C* UPDATE MTMAPF *
|    C*****************
      *#211檢核進貨倉庫存
| 20-C           #211      IFEQ 'Y'
      *
|   C                     SETOF                     20                ENT
| 21-C           *IN20     DOUEQ'0'
|   C           DSD03     CHAINMA0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 21-C                     END
      *
|   C                     Z-ADD0         WQTY    70
B2???C                     Z-ADDDATE      MAXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           MAYY
|   C                     MOVE $USER     MAZZ
| 22-C           DOPT2     IFNE *BLANK
| 23-C           DOPT2     IFEQ '1'
|   C           DOPT2     OREQ '0'
|   C           DOPT2     OREQ '2'
|   C                     SUB  DSD04     MA30
|   C                     SUB  DSD05     MA30
|   C                     ADD  SD04      MA30
|   C                     ADD  SD05      MA30
|   C                     SUB  DSD04     WQTY
|   C                     SUB  DSD05     WQTY
|   C                     ADD  SD04      WQTY
|   C                     ADD  SD05      WQTY
| 23*C                     ELSE
| 24-C           DOPT2     IFEQ '4'
|   C                     ADD  SD04      MA30
|   C                     ADD  SD05      MA30
|   C                     ADD  SD04      WQTY
|   C                     ADD  SD05      WQTY
| 24-C                     END
| 23-C                     END
      *TOTAL異動金額
|   C           WQTY      MULT MA31      FOB    174
|   C                     ADD  FOB       MA26      H
|   C           WQTY      MULT MA32      FHI    174
|   C                     ADD  FHI       MA27      H
|   C           WQTY      MULT MA33      DUTY   174
|   C                     ADD  DUTY      MA28      H
|   C                     UPDATMA0
| 22-C                     END
| 20-C                     END
|    C*
38===C                     ENDSR
     C*==============================================================*
     C*          RTN39S....SAVE
     C*==============================================================*
39===C           RTN39S    BEGSR
|    C*
|    C* GET 訂單號碼
| 01-C           DOPT1     IFEQ '1'
|   C                     CALL 'RES004'
|   C                     PARM DSC01     S004I1  2
|   C                     PARM DSC03     S004I2  2
|   C                     PARM SC075N    S004I3  20
|   C           DSC02     PARM           S004O1 12
| 01-C                     END
|    C*
|    C*****************
|    C* UPDATE SOSDPF *
|    C*****************
|    C                     Z-ADDHSC12     DSC12
M003AC                     Z-ADDHTAX      DTAX
M003AC                     Z-ADDHTOT      DTOT
|    C                     READCSFLSR2                 5757
| 02-C           *IN57     DOWEQ'0'
|   C*
| 03-C           DOPT2     IFEQ '1'
      *
|   C                     SETOF                     20                ENT
| 04-C           *IN20     DOUEQ'0'
|   C           KEYSD     CHAINSD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 04-C                     END
      *
| 05-C           *IN40     IFEQ '0'
|   C                     SUB  SD07      DSC12
|   C                     ADD  DSD07     DSC12
M003AC           SC37      IFEQ 'D'
M003AC           DSC12     MULT DUTY1     DTAX      H
M003AC           DSC12     ADD  DTAX      DTOT
M003AC                     ELSE
M003AC                     Z-ADD0         DTAX
M003AC                     Z-ADDDSC12     DTOT
M003AC                     END
|   C                     EXSR RTN39F                     *SAV OTHER FILE
|   C                     EXSR RTN39D
|   C                     EXSR RTN39E                     *SAV OTHER FILE
|   C                     UPDATSD0
| 05*C                     ELSE
|   C                     ADD  DSD07     DSC12
M003AC           SC37      IFEQ 'D'
M003AC           DSC12     MULT DUTY1     DTAX      H
M003AC           DSC12     ADD  DTAX      DTOT
M003AC                     ELSE
M003AC                     Z-ADD0         DTAX
M003AC                     Z-ADDDSC12     DTOT
M003AC                     END
|   C                     Z-ADD0         SD04
|   C                     Z-ADD0         SD05
|   C                     EXSR RTN39F                     *SAV OTHER FILE
|   C                     EXSR RTN39D
|   C                     EXSR RTN39E                     *SAV OTHER FILE
|   C                     WRITESD0
| 05-C                     END
| 03-C                     END
|   C*
| 06-C           DOPT2     IFEQ '2'
|   C           DOPT2     OREQ '0'
      *
|   C                     SETOF                     20                ENT
| 07-C           *IN20     DOUEQ'0'
|   C           KEYSD     CHAINSD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 07-C                     END
      *
|   C                     SUB  SD07      DSC12
|   C                     ADD  DSD07     DSC12
M003AC           SC37      IFEQ 'D'
M003AC           DSC12     MULT DUTY1     DTAX      H
M003AC           DSC12     ADD  DTAX      DTOT
M003AC                     ELSE
M003AC                     Z-ADD0         DTAX
M003AC                     Z-ADDDSC12     DTOT
M003AC                     END
|   C                     EXSR RTN39F                     *SAV OTHER FILE
|   C                     EXSR RTN39D
|   C                     EXSR RTN39E                     *SAV OTHER FILE
|   C                     UPDATSD0
| 06-C                     END
|   C*
| 08-C           DOPT2     IFEQ '4'
      *
|   C                     SETOF                     20                ENT
| 09-C           *IN20     DOUEQ'0'
|   C           KEYSD     CHAINSD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 09-C                     END
      *
|   C                     SUB  SD07      DSC12
M003AC           SC37      IFEQ 'D'
M003AC           DSC12     MULT DUTY1     DTAX      H
M003AC           DSC12     ADD  DTAX      DTOT
M003AC                     ELSE
M003AC                     Z-ADD0         DTAX
M003AC                     Z-ADDDSC12     DTOT
M003AC                     END
|   C                     EXSR RTN39F                     *SAV OTHER FILE
|   C                     EXSR RTN39E                     *SAV OTHER FILE
|   C                     DELETSD0
      *
B2???C                     Z-ADDDATE      LDXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           LDYY
B2000C           KEYLG     CHAINLD0                  40
|   C                     MOVELSD02      LD01
|   C                     MOVELSD03      LD02
|   C                     MOVE $USER     LDZZ
| 10-C           *IN40     IFEQ '1'
|   C                     WRITELD0
| 10*C                     ELSE
|   C                     UPDATLD0
| 10-C                     END
      *
| 08-C                     END
|   C*
| 11-C           DOPT2     IFEQ *BLANK
|   C*
| 12-C           SCR2CN    IFNE SCR2CO
      *
|   C                     SETOF                     20                ENT
| 13-C           *IN20     DOUEQ'0'
|   C           KEYSD     CHAINSD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 13-C                     END
      *
| 14-C           *IN40     IFEQ '0'
|   C                     EXSR RTN39D
|   C                     UPDATSD0
| 14-C                     END
| 12-C                     END
|   C*
| 15-C           DSC11     IFNE HSC11
|   C           DSC36     ORNE HSC36
      *
|   C                     SETOF                     20                ENT
| 16-C           *IN20     DOUEQ'0'
|   C           KEYSD     CHAINSD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 16-C                     END
      *
|   C  N40                EXSR RTN39F                     *SAV OTHER FILE
| 15-C                     END
| 11-C                     END
|   C*
|   C                     READCSFLSR2                   57
| 02-C                     END
|    C           *LOVAL    SETLLSD0
|    C*****************
|    C* UPDATE SOSCPF *
|    C*****************
| 17-C           DOPT1     IFEQ '1'
|   C                     EXSR RTN39C
|   C                     WRITESC0
|   C*UPDATE POPBPF
|   C                     CALL 'SOA027'
|   C                     PARM           SC02
|   C*
|   C                     SETON                     80
| 17-C                     END
|    C*
| 18-C           DOPT1     IFEQ '2'
      *
|   C                     SETOF                     20                ENT
| 19-C           *IN20     DOUEQ'0'
|   C           KEYSC1    CHAINSC0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 19-C                     END
      *
|   C                     EXSR RTN39C
      *
| 20-C           ITEM      IFEQ 0
|   C                     DELETSC0
|   C*DELETE POPBPF POPCPF
|   C           SC02      CHAINPB0                  41
|   C                     DELETPB0
|   C           PB02      SETLLPC0
|   C           PB02      READEPC0                      42
| 21-C           *IN42     DOWEQ'0'
|   C                     DELETPC0
|   C           PB02      READEPC0                      42
| 21-C                     END
| 20*C                     ELSE
|   C                     UPDATSC0
|   C*
|   C*UPDATE POPBPF  AFTER DELETE
|   C           SC02      CHAINPB0                  41
|   C                     DELETPB0
|   C           PB02      SETLLPC0
|   C           PB02      READEPC0                      42
| 22-C           *IN42     DOWEQ'0'
|   C                     DELETPC0
|   C           PB02      READEPC0                      42
| 22-C                     END
|   C*
|   C                     CALL 'SOA027'
|   C                     PARM           SC02
| 20-C                     END
      *
| 18-C                     END
|    C*****************
|    C* UPDATE MTMDPF *
|    C*****************
| 23-C           #216      IFEQ 'Y'
      *
|   C                     SETOF                     20                ENT
| 24-C           *IN20     DOUEQ'0'
|   C           DSC14     CHAINMD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 24-C                     END
      *
|   C                     ADD  DSC12     MD30
|   C                     SUB  HSC12     MD30
M003AC                     ADD  DTAX      MD30
M003AC                     SUB  HTAX      MD30
|   C                     UPDATMD0
| 23-C                     END
|    C*
|    C*
39===C                     ENDSR
     C*==============================================================*
     C*          RTN39T....DLT D
     C*==============================================================*
40===C           RTN39T    BEGSR
|    C* DLT DETAIL
|    C           KEYSD1    SETLLSD0
|    C           KEYSD1    READESD0                      44
| 01-C           *IN44     DOWEQ'0'
|   C* FOR OTHER FILE AND KEY
|   C                     MOVE '4'       DOPT2
|   C                     MOVE SD03      DSD03
|   C                     MOVE SD04      DSD04
|   C*
|   C                     MOVELSD16      HSD16
|   C                     EXSR RTN39F
|   C                     EXSR RTN39E
      *
|   C                     DELETSD0
      *
B2???C                     Z-ADDDATE      LDXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           LDYY
B2000C           KEYLG     CHAINLD0                  40
|   C                     MOVELSD02      LD01
|   C                     MOVELSD03      LD02
|   C                     MOVE $USER     LDZZ
| 02-C           *IN40     IFEQ '1'
|   C                     WRITELD0
| 02*C                     ELSE
|   C                     UPDATLD0
| 02-C                     END
      *
|   C           KEYSD1    READESD0                      44
| 01-C                     END
|    C* DLT HEADER
      *
|    C                     SETOF                     20                ENT
| 03-C           *IN20     DOUEQ'0'
|   C           KEYSC1    CHAINSC0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 03-C                     END
      *
|    C                     DELETSC0
|    C*DELETE POPBPF POPCPF
|    C           SC02      CHAINPB0                  41
|    C                     DELETPB0
|    C           PB02      SETLLPC0
|    C           PB02      READEPC0                      42
| 04-C           *IN42     DOWEQ'0'
|   C                     DELETPC0
|   C           PB02      READEPC0                      42
| 04-C                     END
      *
| 05-C           #216      IFEQ 'Y'
      *
|   C                     SETOF                     20                ENT
| 06-C           *IN20     DOUEQ'0'
|   C           DSC14     CHAINMD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 06-C                     END
      *
|   C                     SUB  HSC12     MD30
M003AC                     SUB  HTAX      MD30
|   C                     UPDATMD0
| 05-C                     END
|    C*
|    C*
40===C                     ENDSR
      *==============================================================*
      *          RTN400....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
41===C           RTN400    BEGSR
|    C*
|    C                     MOVE 'SCR004'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
|    C*
|    C                     SETOF                     30
|    C                     SETON                     31    *CAN INPUT
      *
|    C                     SETOF                     20                ENT
| 01-C           *IN20     DOUEQ'0'
|   C           KEYSC4    CHAINSC0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 01-C                     END
      *
|    C                     EXSR RTN410                     *FILE->SCRN
| 02-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR004'
|   C*
|   C                     EXFMTDSPD4
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
| 04-C           *IN12     IFEQ '0'
|   C*
| 05-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN470
|   C                     CAS            RTN480
| 05-C                     END
|   C*
| 06-C           *IN99     IFEQ '0'
|   C           *IN04     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
      *
|   C                     SETOF                     20                ENT
| 07-C           *IN20     DOUEQ'0'
|   C           KEYSC1    CHAINSC0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 07-C                     END
      *
|   C                     EXSR RTN49C
|   C                     EXSR RTN49D
|   C  N40                UPDATSC0
|   C*UPDATE POPBPF  AFTER DELETE
|   C           SC02      CHAINPB0                  41
|   C                     DELETPB0
|   C           PB02      SETLLPC0
|   C           PB02      READEPC0                      42
| 08-C           *IN42     DOWEQ'0'
|   C                     DELETPC0
|   C           PB02      READEPC0                      42
| 08-C                     END
|   C*
|   C                     CALL 'SOA027'
|   C                     PARM           SC02
| 06-C                     END
      *
|   C                     SETON                     12
|   C                     MOVE 'SCR001'  APPSCR
|   C*
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|    C*
| ERRC*                    END
|    C           *LOVAL    SETLLSC0
|    C           *LOVAL    SETLLSD0
|    C   12                SETOF                     12
|    C*
41===C                     ENDSR
      *==============================================================*
      *          RTN410....MOVE DATA TO SCREEN
      *==============================================================*
42===CSR         RTN410    BEGSR
|    C*
|    C                     MOVE SC01      DSC01
|    C                     MOVE SC02      DSC02
|    C                     MOVE SC03      DSC03
|    C                     MOVE SC03      HSC03
|    C                     MOVE SC04      DSC04
|    C                     MOVE SC05      DSC05
|    C                     MOVE SC06      DSC06
|    C* DATE               Z-ADDSC07      DSC07
|    C* DATE               Z-ADDSC08      DSC08
|    C                     Z-ADDSC09      DSC09
|    C                     MOVE SC10      DSC10
|    C                     MOVE SC11      DSC11
|    C                     Z-ADDSC12      DSC12
|    C                     Z-ADDSC12      HSC12
M003AC           SC37      IFEQ 'D'
M003AC           DSC12     MULT DUTY1     DTAX      H
M003AC           DSC12     ADD  DTAX      DTOT
M003AC                     Z-ADDDTAX      HTAX
M003AC                     Z-ADDDTOT      HTOT
M003AC                     ELSE
M003AC                     Z-ADD0         DTAX
M003AC                     Z-ADDDSC12     DTOT
M003AC                     Z-ADDDTAX      HTAX
M003AC                     Z-ADDDTOT      HTOT
M003AC                     END
|    C                     MOVE SC13      DSC13
|    C                     MOVE SC14      DSC14
|    C                     MOVEL*BLANKS   DMD17
      *
|    C                     SETOF                     20                ENT
| 01-C           *IN20     DOUEQ'0'
|   C           DSC14     CHAINMD0                  4220
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 01-C                     END
      *
|    C           *LOVAL    SETLLMD0
| 02-C           *IN42     IFEQ '0'
|   C                     MOVELMD17      DMD17
| 02-C                     END
|    C                     MOVE SC15      DSC15
|    C                     MOVE SC16      DSC16
|    C                     MOVE SC17      DSC17
|    C                     MOVE SC18      DSC18
|    C                     MOVE SC19      DSC19
|    C                     MOVE SC20      DSC20
|    C                     MOVE SC21      DSC21
|    C                     MOVE SC27      DSC27
|    C                     MOVE SC31      DSC31
|    C                     MOVE SC33      HSC33
|    C                     MOVE SC34      HSC34
|    C*
|    C* 日期轉換
M001AC                     Z-ADDSC07      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DSC07     PARM           S001O1  60
B2???C                     Z-ADDSC07      WSC07
B2INF *CVR5011 sev.50 Field WSC07 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C*
M001AC                     Z-ADDSC08      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM W6        S001I2  60
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C           DSC08     PARM           S001O1  60
|    C* GET 公司代號
|    C           DSC01     CHAIN#B0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVE #B03      D#B031
| 03*C                     ELSE
|   C                     MOVE *BLANK    D#B031
| 03-C                     END
|    C* GET 地區代號
|    C           DSC31     CHAIN#D0                  40
|    C   40                MOVE *BLANK    #D02
|    C* GET 客戶代號
|    C                     MOVELDSC04     ME01
|    C                     MOVELDSC05     ME02
|    C           KEYME     CHAINME0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVE ME04      DME04
| 04*C                     ELSE
|   C                     MOVE *BLANK    ME04
| 04-C                     END
|    C* GET 單別
|    C                     MOVELDSC03     #201
|    C                     MOVELDSC03     #202
|    C           KEY#2     CHAIN#20                  40
|    C   40                MOVE *BLANK    #203
|    C* GET 試飲原因
|    C                     MOVE *BLANK    #A01
|    C                     MOVEL'STOCK  ' #A01
|    C                     MOVE *BLANK    #A02
|    C                     MOVELDSC10     #A02
|    C           KEY#A     CHAIN#A0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 05*C                     ELSE
|   C                     MOVE *BLANK    D#A03
| 05-C                     END
|    C* GET 業務員
|    C           SC27      CHAINMC0                  40
|    C   40                MOVE *BLANK    MC02
|    C* GET 訂單狀況
| 06-C           DSC13     IFEQ *BLANKS
|   C           DSC13     OREQ 'C'
|   C                     MOVE ARR1,1    DSC13C
| 06*C                     ELSE
| 07-C           DSC13     IFEQ 'V'
|   C                     MOVE ARR1,2    DSC13C
| 07*C                     ELSE
| 08-C           DSC13     IFEQ '*'
| 09-C           DSC03     IFEQ 'S3'
|   C                     MOVE ARR1,4    DSC13C
|   C****                 MOVE ARR1,3    DSC13C
| 09*C                     ELSE
|   C                     MOVE ARR1,4    DSC13C
| 09-C                     END
| 08-C                     END
| 07-C                     END
| 06-C                     END
|    C* GET 發票地址
|    C                     MOVELDSC14     ME01
|    C                     MOVE *BLANKS   ME02
|    C           KEYME     CHAINME0                  40
| 10-C           *IN40     IFEQ '0'
|   C                     MOVE ME03      ME031
|   C                     MOVE ME05      ME051
|   C                     MOVE ME06      ME061
| 10*C                     ELSE
|   C                     MOVE *BLANK    ME031
|   C                     MOVE *BLANK    ME051
|   C                     MOVE *BLANK    ME061
| 10-C                     END
|    C* GET 送貨地址
|    C                     MOVELDSC16     ME01
|    C                     MOVELDSC17     ME02
|    C           KEYME     CHAINME0                  40
| 11-C           *IN40     IFEQ '0'
|   C                     MOVELME04      ME032
|   C                     MOVE ME05      ME052
|   C                     MOVE ME06      ME062
| 11*C                     ELSE
|   C                     MOVE *BLANK    ME032
|   C                     MOVE *BLANK    ME052
|   C                     MOVE *BLANK    ME062
| 11-C                     END
|    C* FOR UPDATE
| 12-C****       DOPT1     IFEQ '2'
|   C                     Z-ADDSC075N    SC075O  20       * FOR 年份
|   C* FOR UPDATE : CHECK SCREEN2 CHANGE 19920417 PHILIP CHANGE
|   C                     MOVE SCR2CN    SCR2CO 22        *FOR SCR2 CHANGE
|   C*    HSC11,HSC36 FOR 物流點改變CHK -- SCR003
|   C                     MOVE DSC11     HSC11
|   C                     MOVE SC36      DSC36
|   C                     MOVE SC36      HSC36
| 12-C****                 END
|    C*
42===CSR                   ENDSR
      *==============================================================*
      *          RTN470....F5 -- 參考資料
      *==============================================================*
43===CSR         RTN470    BEGSR
|    C*
|    C                     EXSR RTN480
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 01-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 01-C                     END
|    C                     SETON                     99
|    C*
43===C                     ENDSR
      *==============================================================*
      *          RTN480....CHECK 'SC02' SCREEN
      *==============================================================*
44===CSR         RTN480    BEGSR
|    C*
|    C* CHK,GET公司
| 01-C           DSC01     IFEQ *BLANK
|   C                     SETON                     609499
| 01*C                     ELSE
      *公司檔
|   C           DSC01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '0'
|   C           DSC01L    ANDNE'C'
      *公司說明
|   C                     MOVE #B03      D#B031
| 02*C                     ELSE
|   C                     MOVE *BLANK    D#B031
|   C                     SETON                     608999
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END480
|    C                     MOVELDSC01     WCMP    1
      *不為試飲或公賣局訂單
| 03-C           DSC03     IFEQ 'S4'
|   C           DSC03     OREQ 'S9'
|   C                     SETON                     628999
| 03-C                     END
|    C   99                GOTO END480
      *專櫃送貨定單
      *公司第一碼Ｗ＝匯齡
      *專櫃定單一定需為匯齡之定單
| 04-C           DSC03     IFEQ 'S2'
|   C           WCMP      ANDNE'W'
|   C                     SETON                     608999
| 04-C                     END
|    C   99                GOTO END480
      *公賣局酒定單
      *公司第一碼Ｒ＝匯東
| 05-C           DSC03     IFEQ 'S9'
|   C           WCMP      ANDNE'R'
|   C                     SETON                     608999
| 05-C                     END
|    C   99                GOTO END480
|    C*客戶代號＋分店代號
|    C                     MOVELDSC04     ME01
|    C                     MOVELDSC05     ME02
|    C* CHK,GET客戶代號
|    C           KEYME     CHAINME0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME04
|   C                     SETON                     618999
| 06*C                     ELSE
      *不往來客戶
| 07-C           ME20      IFEQ 'I'
|   C                     SETON                     617599
| 07*C                     ELSE
|   C                     MOVELDSC04     WQUERY
| 08-C           DSC03     IFEQ 'S2'
|   C           WQUERY    ANDNE'B'
|   C                     SETON                     617899
| 08*C                     ELSE
|   C                     MOVE ME04      DME04
      *地區
|   C                     MOVE ME07      DSC31
| 09-C*          DOPT1     IFEQ '1'
|   C                     MOVE ME15      DSC27
      *SC27=業務人員代碼 CHAIN 員工主檔
|   C           DSC27     CHAINMC0                  40
|   C   40                MOVE *BLANK    MC02
| 09-C*                    END
| 08-C                     END
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END480
|    C* CHK,GET 單別
      *公司主檔KEY=客戶＋分店
|    C           KEY#B1    CHAIN#B0L1                40
| 10-C           *IN40     IFEQ '0'
      *#B06公司型態='A'代理商  則為一般定單S1
      *=客戶若為代理商則必為一班定單
|   C           #B06      ANDEQ'A'
|   C                     MOVEL'S1'      DSC03
| 10-C                     END
|    C                     MOVELDSC04     WQUERY
      *客戶代碼Ｂ開頭表通路專櫃
| 11-C           WQUERY    IFEQ 'B'
|   C                     MOVE 'S2'      DSC03
| 11-C                     END
|    C                     MOVE 'S'       #201
|    C                     MOVELDSC03     #202
      *單別
|    C           KEY#2     CHAIN#20                  40
| 12-C           *IN40     IFEQ '1'
      *若為轉帳定單則無法新增#204='N'不可為轉帳定單
|   C           #204      OREQ 'N'
|   C   40                MOVE *BLANK    #203
|   C                     SETON                     628799
| 12-C                     END
|    C   99                GOTO END480
|    C* CHK 寄賣
|    C** UPDATE BY STEPHANIE   D5->S3
      *寄賣定單客戶必為寄賣客戶
| 13-C           DSC03     IFEQ 'S3'
      *
|   C                     SETOF                     20                ENT
| 14-C           *IN20     DOUEQ'0'
|   C           DSC04     CHAINMD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 14-C                     END
      *
|   C           *LOVAL    SETLLMD0
      *MD20='Y'表寄賣客戶
| 15-C           MD20      IFNE 'Y'
|   C                     SETON                     628999
| 15-C                     END
| 13-C                     END
|    C   99                GOTO END480
|    C* 修改時　單別不可改變
| 16-C           DOPT1     IFEQ '2'
|   C           DSC03     ANDNEHSC03
|   C                     SETON                     618199
| 16-C                     END
|    C   99                GOTO END480
|    C* CHK 訂單日期
| 17-C           DSC07     IFEQ 0
|   C                     SETON                     639499
| 17*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC07     P0901I  60
|   C                     PARM           P0901O  1
| 18-C           P0901O    IFEQ 'N'
|   C                     SETON                     639199
| 18-C                     END
| 17-C                     END
|    C   99                GOTO END480
|    C* 日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC07     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WSC07
|    C* UPDATE -- 年份不得變更定單日期必為同一年份
| 19-C           DOPT1     IFEQ '2'
|   C           SC075N    ANDNESC075O
|   C                     SETON                     638699
| 19-C                     END
|    C   99                GOTO END480
|    C* UPDATE -- 年月須＞結案日期
| 20-C           DOPT1     IFEQ '2'
|   C*M001M               MOVELSC075N    SC7YMO  40       * 結案年月
|   C*M001M               MOVE SC07M     SC7YMO  40       * 結案年月
M001AC                     MOVE SC075N    HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    FYY4    40
M001MC                     MOVELFYY4      SC7YMO  60       * 月結年月
M001MC                     MOVE SC07M     SC7YMO  60       * 月結年月
|   C           DSC01     CHAIN#B0                  40
B2???C           *IN40     IFEQ '0'
B2INF *CVR5011 sev.50 Field SC7YMO is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C           SC7YMO    ANDLE#B16
|   C                     SETON                     638099
| 21-C                     END
| 20-C                     END
|    C   99                GOTO END480
      *專櫃或寄賣送貨定單送貨日不可輸入
| 22-C           DSC03     IFEQ 'S2'
|   C           DSC03     OREQ 'S3'
|   C                     Z-ADDDSC07     DSC08
|   C*                    SETON                     647999
| 22-C                     END
|    C   99                GOTO END480
      *#212出貨倉是否有用亦即此定單是否必需出貨
      *    經銷商送貨訂單須輸入交貨日期
| 23-C           #212      IFEQ 'Y'
|   C* CHK 交貨日期
|   C           DSC08     ANDEQ0
|   C           DSC03     OREQ 'S7'
|   C           DSC08     ANDEQ0
|   C                     SETON                     649499
| 23-C                     END
| 24-C           DSC08     IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08     P0901I  60
|   C                     PARM           P0901O  1
| 25-C           P0901O    IFEQ 'N'
|   C                     SETON                     649199
| 25-C                     END
| 24-C                     END
|    C   99                GOTO END480
|    C* 日期轉換
| 26-C           DSC08     IFNE 0
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08     S001I2  60
|   C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WSC08
| 26-C                     END
|    C* 交貨日期需大於訂單日期
| 27-C           DSC08     IFNE 0
| 28-C           WSC08     IFLT WSC07
|   C                     SETON                     6364
|   C                     SETON                     8399
| 28-C                     END
| 27-C                     END
|    C   99                GOTO END480
|    C* GET 發票聯數FROM客戶主檔（ＭＤ）
      *
|    C                     SETOF                     20                ENT
| 29-C           *IN20     DOUEQ'0'
|   C           DSC14     CHAINMD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 29-C                     END
      *
|    C           *LOVAL    SETLLMD0
| 30-C           DSC09     IFEQ 0
|   C                     Z-ADDMD18      DSC09
| 30-C                     END
      *匯東非Ｓ３僅可出３聯發票
| 31-C*M004D     WCMP      IFNE 'W'
|   C*M004D     DSC03     ANDNE'S3'
|   C*M004D     DSC09     ANDNE3
|   C*M004D               SETON                     707499
| 31-C*M004D               END
|    C*M004D   99                GOTO END480
|    C* GET MD07通路 MD08型態FROM客戶主檔（ＭＤ）
|    C                     MOVE MD07      HSC33
|    C                     MOVE MD08      HSC34
|    C* CHK 試飲原因代碼DSC10單別＝Ｓ４試飲定單
|    C                     MOVE *BLANK    D#A03
| 32-C           DSC03     IFEQ 'S4'
| 33-C           DSC10     IFEQ *BLANK
|   C                     SETON                     659499
| 33-C                     END
| 32*C                     ELSE
| 34-C           DSC10     IFNE *BLANK
|   C                     SETON                     657999
| 34-C                     END
| 32-C                     END
|    C   99                GOTO END480
      *
| 35-C           DSC10     IFEQ *BLANK
|   C                     MOVE *BLANK    D#A03
| 35*C                     ELSE
|   C                     MOVE *BLANK    #A01
      *代碼檔#A01='STOCK'表試飲原因
|   C                     MOVEL'STOCK  ' #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVELDSC10     #A02
|   C           KEY#A     CHAIN#A0                  40
| 36-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 36*C                     ELSE
|   C                     MOVE *BLANK    D#A03
|   C                     SETON                     658999
| 36-C                     END
| 35-C                     END
|    C   99                GOTO END480
|    C* CHK,GET 發票地址
| 37-C           DSC14     IFEQ *BLANK
|   C           DSC15     ANDEQ*BLANK
|   C                     MOVE DSC04     DSC14
|   C****                 MOVE DSC05     DSC15
| 37-C                     END
|    C                     MOVELDSC14     ME01
|    C                     MOVEL*BLANKS   ME02
|    C           KEYME     CHAINME0                  40
| 38-C           *IN40     IFEQ '0'
|   C                     MOVE ME03      ME031
|   C                     MOVE ME05      ME051
|   C                     MOVE ME06      ME061
      *不往來客戶
| 39-C           ME20      IFEQ 'I'
|   C                     SETON                     687599
| 39-C                     END
| 38*C                     ELSE
|   C                     MOVE *BLANK    ME031
|   C                     MOVE *BLANK    ME051
|   C                     MOVE *BLANK    ME061
|   C                     SETON                     688999
| 38-C                     END
|    C   99                GOTO END480
|    C* CHK,GET 送貨地址
| 40-C           DSC16     IFEQ *BLANK
|   C           DSC17     ANDEQ*BLANK
|   C                     MOVE DSC04     DSC16
|   C                     MOVE DSC05     DSC17
| 40-C                     END
|    C                     MOVELDSC16     ME01
|    C                     MOVELDSC17     ME02
|    C           KEYME     CHAINME0                  40
| 41-C           *IN40     IFEQ '0'
|   C                     MOVELME04      ME032
|   C                     MOVE ME05      ME052
|   C                     MOVE ME06      ME062
      *不往來客戶
| 42-C           ME20      IFEQ 'I'
|   C                     SETON                     697599
| 42-C                     END
| 41*C                     ELSE
|   C                     MOVE *BLANK    ME032
|   C                     MOVE *BLANK    ME052
|   C                     MOVE *BLANK    ME062
|   C                     SETON                     698999
| 41-C                     END
|    C   99                GOTO END480
|    C* CHK SC11出貨物流點     S7=經銷商送貨定單
| 43-C           DSC03     IFEQ 'S7'
      *出貨物流點不可空白
| 44-C           DSC11     IFEQ *BLANK
|   C                     SETON                     669499
| 44*C                     ELSE
|   C                     MOVELDSC11     WQUERY
      *物流點通路A=經銷商物流點
      *若不為經銷商送貨定單則物流點通路不可為Ａ
| 45-C           WQUERY    IFNE 'A'
|   C                     SETON                     668899
| 45*C                     ELSE
      *且此經銷商應為客戶
|   C           DSC11     SETLLMD0                      42
| 46-C           *IN42     IFEQ '0'
|   C                     SETON                     668999
| 46-C                     END
| 45-C                     END
| 44-C                     END
| 43*C                     ELSE                            <>'S7'
      *單別不為S7則區域碼應存在銷售地區代碼檔
|   C           ME07      CHAIN#D0                  40
| 47-C           *IN40     IFEQ '0'
|   C                     MOVEL#D03      FSC11   5
| 48-C           DSC11     IFEQ *BLANK
|   C                     MOVEL#D03      DSC11
| 48*C                     ELSE
      *輸入之出貨物流點應＝銷售地區代碼檔之出貨物流點
      *或第一碼＝Ｗ
|   C                     MOVELDSC11     WQUERY
| 49-C           DSC11     IFNE FSC11
|   C           WQUERY    ANDNE'W'
|   C                     SETON                     668299
| 49-C                     END
| 48-C                     END
| 47*C                     ELSE
|   C                     MOVE *BLANKS   FSC11
|   C                     SETON                     698999
| 47-C                     END
| 43-C                     END
|    C   99                GOTO END480
|    C* ??? -----------------------------------------------------------
|    C* GET 出貨物流點
|    C*#211進貨倉庫存量
| 50-C           #211      IFEQ 'Y'
|   C*#211檢劾進貨倉庫存='Y'出貨物流點不輸入－專櫃，寄放
|   C                     MOVE *BLANKS   DSC11
|   C                     MOVE *BLANKS   DSC11C
| 50*C                     ELSE
      *
| 51-C           DSC03     IFEQ 'S7'
|   C                     MOVE DSC11     ME01
|   C                     MOVE *BLANKS   ME02
|   C           KEYME     CHAINME0                  40
| 52-C           *IN40     IFEQ '0'
      *物流點說明
|   C                     MOVELME04      DSC11C
| 52*C                     ELSE
|   C                     SETON                     668999
| 52-C                     END
| 51*C                     ELSE
|   C                     MOVE *BLANK    #A01
|   C                     MOVEL'STORAGE' #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVELDSC11     #A02
|   C           KEY#A     CHAIN#A0                  40
| 53-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DSC11C
| 53*C                     ELSE
|   C                     MOVE *BLANK    DSC11C
|   C                     SETON                     668999
| 53-C                     END
| 51-C                     END
| 50-C                     END
|    C   99                GOTO END480
|    C* GET 訂單狀況
| 54-C           DSC13     IFEQ *BLANKS
|   C           DSC13     OREQ 'C'
|   C                     MOVE ARR1,1    DSC13C
| 54*C                     ELSE
| 55-C           DSC13     IFEQ 'V'
|   C                     MOVE ARR1,2    DSC13C
| 55*C                     ELSE
| 56-C           DSC13     IFEQ '*'
| 57-C           DSC03     IFEQ 'S3'
|   C                     MOVE ARR1,3    DSC13C
| 57*C                     ELSE
|   C                     MOVE ARR1,4    DSC13C
| 57-C                     END
| 56-C                     END
| 55-C                     END
| 54-C                     END
|    C* GET 進貨物流點
|    C           KEY#B1    CHAIN#B0L1                40
| 58-C           *IN40     IFEQ '0'
|   C           #B06      ANDEQ'A'
|   C*                    MOVE DSC11     DSC36
|   C                     MOVE *BLANKS   DSC36
| 58*C                     ELSE
| 59-C           #217      IFEQ 'Y'
      *
|   C                     SETOF                     20                ENT
| 60-C           *IN20     DOUEQ'0'
|   C           DSC14     CHAINMD0                  4020
|   C   20                CALL 'LOCKCL'
|   C                     PARM           STATUS
| 60-C                     END
      *
| 61-C           *IN40     IFEQ '0'
|   C                     MOVE MD33      DSC36
| 61*C                     ELSE
|   C                     MOVE *BLANK    DSC36
| 61-C                     END
| 59*C                     ELSE
|   C                     MOVE *BLANK    DSC36
| 59-C                     END
| 58-C                     END
|    C* FOR RECORD LOCK ---> SETLL
|    C           END480    TAG
|    C           *LOVAL    SETLLMD0
|    C*
|    C*
44===CSR                   ENDSR
     C*==============================================================*
     C*          RTN49C....SCREEN TO FILE --- HEADER
     C*==============================================================*
45===C           RTN49C    BEGSR
|    C*
|    C                     MOVE DSC05     SC05
|    C                     MOVE DSC06     SC06
B2???C                     Z-ADDWSC08     SC08
B2INF *CVR5011 sev.50 Field WSC08 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|    C                     Z-ADDDSC09     SC09
|    C                     MOVE DSC17     SC17
|    C                     MOVE DSC18     SC18
|    C                     MOVE DSC19     SC19
|    C                     MOVE DSC20     SC20
|    C                     MOVE DSC21     SC21
      *
|    C                     MOVELDSC04     ME01
|    C                     MOVELDSC05     ME02
|    C           KEYME     CHAINME0                  42
| 01-C           *IN42     IFEQ '0'
|   C                     MOVELME15      SC27
|   C                     MOVELME07      SC31
|   C                     MOVELME08      SC32
| 01*C                     ELSE
|   C                     MOVEL*BLANKS   SC27
|   C                     MOVEL*BLANKS   SC31
|   C                     MOVEL*BLANKS   SC32
| 01-C                     END
|    C           SC27      CHAINMC0                  42
| 02-C           *IN42     IFEQ '0'
|   C                     MOVELMC03      SC28
| 02*C                     ELSE
|   C                     MOVEL*BLANKS   SC28
| 02-C                     END
|    C*
B2???C                     Z-ADDDATE      SCXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           SCYY
|    C                     MOVE $USER     SCZZ
|    C*
45===C                     ENDSR
     C*==============================================================*
     C*          RTN49D....SCREEN TO FILE --- DETAIL
     C*==============================================================*
46===C           RTN49D    BEGSR
|    C*
|    C           DSC02     SETLLSD0
|    C           DSC02     READESD0                      46
| 01-C           *IN46     DOWEQ'0'
B2???C                     Z-ADDWSC08     SD19
B2INF *CVR5011 sev.50 Field WSC08 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C*
B2???C                     Z-ADDDATE      SDXX
B2INF *CVR5011 sev.50 Field DATE is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2000C                     TIME           SDYY
|   C                     MOVE $USER     SDZZ
|   C                     UPDATSD0
|   C           DSC02     READESD0                      46
| 01-C                     END
|    C*
46===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
47===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
47===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
48===C           RTNF4     BEGSR
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C********************
|    C*  FOR  SCR002     *
|    C********************
| 01-C           APPSCR    IFEQ 'SCR002'
|   C** 客戶代號
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE16
|   C           D#COL     ANDLE25
|   C                     MOVE DSC05     S003O1
|   C                     MOVELDSC04     S003O1
|   C                     CALL 'WDS003'
|   C                     PARM           S003O1  9
|   C                     MOVE S003O1    DSC05
|   C                     MOVELS003O1    DSC04
| 02-C                     END
|   C** 客戶代號
| 03-C*M003M     D#ROW     IFEQ 13
M003MC           D#ROW     IFEQ 14
|   C           D#COL     ANDGE16
|   C           D#COL     ANDLE25
|   C                     MOVE DSC15     S003O1
|   C                     MOVELDSC14     S003O1
|   C                     CALL 'WDS003'
|   C                     PARM           S003O1  9
|   C                     MOVE S003O1    DSC15
|   C                     MOVELS003O1    DSC14
| 03-C                     END
|   C** 客戶代號
| 04-C*M003M     D#ROW     IFEQ 15
M003MC           D#ROW     IFEQ 16
|   C           D#COL     ANDGE16
|   C           D#COL     ANDLE25
|   C                     MOVE DSC17     S003O1
|   C                     MOVELDSC16     S003O1
|   C                     CALL 'WDS003'
|   C                     PARM           S003O1  9
|   C                     MOVE S003O1    DSC17
|   C                     MOVELS003O1    DSC16
| 04-C                     END
|   C* 單別
| 05-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE55
|   C           D#COL     ANDLE56
|   C                     CALL 'WDS008'
|   C                     PARM 'S'       S008I1  1
|   C                     PARM 'Y '      S008I2  2
|   C           DSC03     PARM DSC03     S008O1  2
| 05-C                     END
|   C* 試飲原因
| 06-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE55
|   C           D#COL     ANDLE56
|   C                     CALL 'WDS012'
|   C                     PARM 'STOCK   'PARMI1
|   C           DSC10     PARM DSC10     PARMO1
| 06-C                     END
|   C* 出貨物流點
| 07-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE16
|   C           D#COL     ANDLE20
|   C                     CALL 'WDS013'
|   C                     PARM 'ABW     'S013I1  8
|   C           DSC11     PARM DSC11     S013O1  5
| 07-C                     END
|   C* 業務員
| 08-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE55
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27
| 08-C                     END
|   C** SCR002
| 01-C                     END
|    C*
|    C                     SETON                     99
|    C*
48===C           ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
49===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
49===C                     ENDSR'*DETC'
M001AC/COPY HBP2CVTR
**
新增修改      刪除查詢明細核修
**
已核準  已送貨  待開發票待核準
**
業務自送
