     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.16 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     FSOSCJF01IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FSOSGJF01IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FSOSNJF01IF  E           K        DISK
     FSOSOPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMFPF  IF  E           K        DISK
     FSOCDPF  UF  E           K        DISK                      A
     FPA#IPF  O   E           K        DISK
     FSOA014P O   E             39     PRINTER
     I**********
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
M001AI                                      201 2080DATE
     I            DS
     I                                        1   2 MA09
     I                                        1   1 MA091
     I                                        2   2 MA092
     I            DS
     I                                        1  12 SO02
     I                                        3   4 SO02L
     I            DS
     I                                        1   9 PRDUT
     I                                        2   2 PRDUT1
     I                                        3   4 PRDUT2
     I            DS
B2MODI                                        1   60#I02
B2MODI                                        1   40#I02Y
B2MODI                                        5   60#I02M
     I            DS
     I                                        1   40D#I02
     I                                        1   20D#I02M
     I                                        3   40D#I02Y
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C*          *ENTRY    PLIST
     C*          *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                   *LIKE DEFN
      *==============================================================*
     C           *LIKE     DEFN CD16      WORK16
     C           *LIKE     DEFN CD17      WORK17
     C           *LIKE     DEFN CD18      WORK18
     C           *LIKE     DEFN CD19      WORK19
     C           *LIKE     DEFN CD20      WORK20
     C           *LIKE     DEFN CD21      WORK21
     C           *LIKE     DEFN CD22      WORK22
     C           *LIKE     DEFN CD23      WORK23
     C           *LIKE     DEFN CD24      WORK24
     C           *LIKE     DEFN CD25      WORK25
     C           *LIKE     DEFN CD26      WORK26
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           CD06
     C                     KFLD           CD07
     C           KEYMD     KLIST
     C                     KFLD           CD06
     C           KEYCD     KLIST
     C                     KFLD           CD01
     C                     KFLD           CD02
     C                     KFLD           CD03
     C                     KFLD           CD04
     C                     KFLD           CD05
     C                     KFLD           CD06
     C                     KFLD           CD07
     C                     KFLD           CD09
     C                     KFLD           CD10
     C                     KFLD           CD11
     C                     KFLD           CD12
     C                     KFLD           CD13
     C                     KFLD           CD14
     C                     KFLD           CD15
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     WRITEPH1
|    C*CHANGE DATE MM/DD/YY
B2MODC* M001D              Z-ADD0         DATE    80
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
B2???C*                    PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC* M001D    DATE      PARM           S001O1  80
      *
     C                     SETOF                     96
     C*
     C                     READ SC0                      45
  02-C           *IN45     DOWEQ'0'
    C                     EXSR RTN100
      *WRITE TO月結控制檔
    C                     MOVELSC02      #I01
B2000C                     MOVELSC39      #I02
B2000C                     MOVELSC39      #I03
B2000C                     Z-ADDDATE      #IXX
B2000C                     TIME           #IYY
    C                     MOVE $USER     #IZZ
    C                     WRITE#I0
    C*PRINTER
    C                     EXSR RTN900
      *
    C                     READ SC0                      45
  02-C                     END
     C*
     C                     READ SG0                      45
  04-C           *IN45     DOWEQ'0'
      *
    C                     EXSR RTN200
      *WRITE TO月結控制檔
    C                     MOVELSG02      #I01
B2000C                     MOVELSG26      #I02
B2000C                     MOVELSG26      #I03
B2000C                     Z-ADDDATE      #IXX
B2000C                     TIME           #IYY
    C                     MOVE $USER     #IZZ
    C                     WRITE#I0
    C*PRINTER
    C                     EXSR RTN900
      *
    C                     READ SG0                      45
  04-C                     END
     C*
     C                     READ SN0                      45
  06-C           *IN45     DOWEQ'0'
    C                     EXSR RTN300
      *WRITE TO月結控制檔
    C                     MOVELSN02      #I01
B2000C                     MOVELSN06      #I02
B2000C                     MOVELSN06      #I03
B2000C                     Z-ADDDATE      #IXX
B2000C                     TIME           #IYY
    C                     MOVE $USER     #IZZ
    C                     WRITE#I0
    C*PRINTER
    C                     EXSR RTN900
      *
      *
    C                     READ SN0                      45
  06-C                     END
     C*
     C                     WRITEPE2
      *
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN100....SC AND SD TO CD
     C*==============================================================*
01===C           RTN100    BEGSR
|    C*
B2000C                     MOVELSC39      CD01
|    C                     MOVE SC01      CD02
|    C                     MOVELSC01      CD03
|    C                     MOVELSC04      CD06
|    C                     MOVELSC05      CD07
|    C                     MOVELSC27      CD09
      *
|    C                     MOVELSC28      CD10
      *
|    C                     MOVELSC31      CD11
|    C                     MOVELSC32      CD12
|    C                     MOVELSC33      CD13
|    C                     MOVELSC34      CD14
      *
| 08-C           SC35      IFEQ 'T'
|   C                     MOVELSC35      CD15
| 08*C                     ELSE
|   C                     MOVEL*BLANKS   CD15
| 08-C                     END
      *
|    C           SC02      SETLLSD0
|    C           SC02      READESD0                      46
| 09-C           *IN46     DOWEQ'0'
|   C                     MOVELSD03      CD04
|   C                     MOVEL*BLANKS   CD05
|   C           KEYCD     CHAINCD0                  43
|   C                     MOVELCD04      CD31
      *WRITE TO FILE
|   C           CD04      CHAINMA0                  40
|   C                     MOVELMA07      CD29
|   C                     MOVELMA10      CD30
| 10-C           MA54      IFEQ 'Y'
      *禮盒碼
|   C                     MOVEL'Y'       CD27
| 10*C                     ELSE
|   C                     MOVEL*BLANKS   CD27
| 10-C                     END
      *產品分類碼----------------------------------------------------
|   C                     MOVELCD04      PRDUT
| 11-C           PRDUT2    IFEQ 'RM'
|   C                     MOVEL'R'       CD28
| 11*C                     ELSE
| 12-C           MA54      IFNE 'Y'
| 13-C           PRDUT1    IFEQ 'W'
|   C                     MOVEL'W'       CD28
| 13*C                     ELSE
| 14-C           MA091     IFEQ 'W'
|   C           MA092     OREQ 'W'
|   C                     MOVEL'W'       CD28
| 14*C                     ELSE
|   C                     MOVEL'S'       CD28
| 14-C                     END
      *
| 13-C                     END
| 12*C                     ELSE
|   C           CD04      SETLLMF0
|   C           CD04      READEMF0                      47
| 15-C           *IN47     DOWEQ'0'
      *非副屬品
| 16-C           MF07      IFNE 'Y'
|   C                     MOVELMF02      PRDUT
| 17-C           PRDUT1    IFEQ 'W'
|   C                     MOVEL'W'       CD28
| 17*C                     ELSE
|   C                     MOVEL'S'       CD28
| 17-C                     END
      *
|   C                     SETON                     47
| 16-C                     END
      *
|   C  N47      CD04      READEMF0                      47
| 15-C                     END
      *
| 12-C                     END
| 11-C                     END
      *----------------------------------------------------------------
|   C                     EXSR RTN110
| 18-C           *IN40     IFEQ '0'
|   C           MA54      ANDEQ'Y'
|   C*禮盒
|   C                     EXSR RTN120
| 18-C                     END
|   C*單瓶
|   C           SC02      READESD0                      46
| 09-C                     END
      *
01===C                     ENDSR
     C*==============================================================*
     C*          RTN110....單瓶
     C*==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     Z-ADD0         WORK16
|    C                     Z-ADD0         WORK17
|    C                     Z-ADD0         WORK18
|    C                     Z-ADD0         WORK19
|    C                     Z-ADD0         WORK20
|    C                     Z-ADD0         WORK21
|    C                     Z-ADD0         WORK22
|    C                     Z-ADD0         WORK23
|    C                     Z-ADD0         WORK24
|    C                     Z-ADD0         WORK25
|    C                     Z-ADD0         WORK26
| 01-C           SC03      IFEQ 'S4'
      *試飲
|   C                     Z-ADDSD04      WORK18
| 01*C                     ELSE
| 02-C           SC03      IFEQ 'S2'
|   C           SC03      OREQ 'S3'
      *寄賣
|   C                     Z-ADDSD04      WORK19
|   C                     Z-ADDSD07      WORK25
| 02*C                     ELSE
|   C                     Z-ADDSD04      WORK16
|   C                     Z-ADDSD07      WORK24
| 02-C                     END
| 01-C                     END
      *搭贈
|    C                     Z-ADDSD05      WORK17
      *WRITE TO FILE
B2000C                     Z-ADDDATE      CDXX
B2000C                     TIME           CDYY
|    C                     MOVE $USER     CDZZ
| 03-C           *IN43     IFEQ '0'
|   C                     ADD  WORK16    CD16
|   C                     ADD  WORK17    CD17
|   C                     ADD  WORK18    CD18
|   C                     ADD  WORK19    CD19
|   C                     ADD  WORK20    CD20
|   C                     ADD  WORK21    CD21
|   C                     ADD  WORK22    CD22
|   C                     ADD  WORK23    CD23
|   C                     ADD  WORK24    CD24
|   C                     ADD  WORK25    CD25
|   C                     ADD  WORK26    CD26
|   C                     UPDATCD0
| 03*C                     ELSE
|   C                     Z-ADDWORK16    CD16
|   C                     Z-ADDWORK17    CD17
|   C                     Z-ADDWORK18    CD18
|   C                     Z-ADDWORK19    CD19
|   C                     Z-ADDWORK20    CD20
|   C                     Z-ADDWORK21    CD21
|   C                     Z-ADDWORK22    CD22
|   C                     Z-ADDWORK23    CD23
|   C                     Z-ADDWORK24    CD24
|   C                     Z-ADDWORK25    CD25
|   C                     Z-ADDWORK26    CD26
|   C                     WRITECD0
| 03-C                     END
      *
02===C                     ENDSR
     C*==============================================================*
     C*          RTN120....禮盒
     C*==============================================================*
03===C           RTN120    BEGSR
|    C*計算分母
|    C                     Z-ADD0         MOTHER  90
|    C           SD03      SETLLMF0
|    C           SD03      READEMF0                      47
| 01-C           *IN47     DOWEQ'0'
      *非副屬品
| 02-C           MF07      IFNE 'Y'
      *
|   C           MF04      MULT MF05      SUN     90
|   C                     ADD  SUN       MOTHER
| 02-C                     END
      *
|   C           SD03      READEMF0                      47
| 01-C                     END
      *
|    C*計算單瓶比率
|    C           SD03      SETLLMF0
|    C           SD03      READEMF0                      47
| 03-C           *IN47     DOWEQ'0'
      *副屬品
| 04-C           MF07      IFNE 'Y'
|   C                     MOVELMF02      CD04
|   C                     MOVELCD04      CD31
|   C           CD04      CHAINMA0                  40
|   C                     MOVELMA07      CD29
|   C                     MOVELMA10      CD30
      *從禮盒拆出之單瓶
|   C                     MOVEL'Y'       CD05
|   C           KEYCD     CHAINCD0                  43
|   C                     MOVEL*BLANKS   CD27
      *產品分類碼----------------------------------------------------
|   C                     MOVELCD04      PRDUT
| 05-C           PRDUT2    IFEQ 'RM'
|   C                     MOVEL'R'       CD28
| 05*C                     ELSE
| 06-C           PRDUT1    IFEQ 'W'
|   C                     MOVEL'W'       CD28
| 06*C                     ELSE
|   C                     MOVEL'S'       CD28
| 06-C                     END
| 05-C                     END
      *----------------------------------------------------------------
|   C                     EXSR RTN130
| 04-C                     END
      *
|   C           SD03      READEMF0                      47
| 03-C                     END
      *
03===C                     ENDSR
     C*==============================================================*
     C*          RTN130....禮盒WRITE TO FILE
     C*==============================================================*
04===C           RTN130    BEGSR
|    C*
|    C                     Z-ADD0         WORK16
|    C                     Z-ADD0         WORK17
|    C                     Z-ADD0         WORK18
|    C                     Z-ADD0         WORK19
|    C                     Z-ADD0         WORK20
|    C                     Z-ADD0         WORK21
|    C                     Z-ADD0         WORK22
|    C                     Z-ADD0         WORK23
|    C                     Z-ADD0         WORK24
|    C                     Z-ADD0         WORK25
|    C                     Z-ADD0         WORK26
      *單瓶所佔比率
|    C           MF04      MULT MF05      SUN     90
|    C           SUN       DIV  MOTHER    RATE    94H
|    C           SD07      MULT RATE      WSD07   90H
|    C           SD04      MULT MF04      WSD04   50
|    C           SD05      MULT MF04      WSD05   50
| 01-C           SC03      IFEQ 'S4'
      *試飲
|   C                     Z-ADDWSD04     WORK18
| 01*C                     ELSE
| 02-C           SC03      IFEQ 'S2'
|   C           SC03      OREQ 'S3'
      *寄賣
|   C                     Z-ADDWSD04     WORK19
|   C                     Z-ADDWSD07     WORK25
| 02*C                     ELSE
|   C                     Z-ADDWSD04     WORK16
|   C                     Z-ADDWSD07     WORK24
| 02-C                     END
| 01-C                     END
      *搭贈
|    C                     Z-ADDWSD05     WORK17
      *WRITE TO FILE
B2000C                     Z-ADDDATE      CDXX
B2000C                     TIME           CDYY
|    C                     MOVE $USER     CDZZ
| 03-C           *IN43     IFEQ '0'
|   C                     ADD  WORK16    CD16
|   C                     ADD  WORK17    CD17
|   C                     ADD  WORK18    CD18
|   C                     ADD  WORK19    CD19
|   C                     ADD  WORK20    CD20
|   C                     ADD  WORK21    CD21
|   C                     ADD  WORK22    CD22
|   C                     ADD  WORK23    CD23
|   C                     ADD  WORK24    CD24
|   C                     ADD  WORK25    CD25
|   C                     ADD  WORK26    CD26
|   C                     UPDATCD0
| 03*C                     ELSE
|   C                     Z-ADDWORK16    CD16
|   C                     Z-ADDWORK17    CD17
|   C                     Z-ADDWORK18    CD18
|   C                     Z-ADDWORK19    CD19
|   C                     Z-ADDWORK20    CD20
|   C                     Z-ADDWORK21    CD21
|   C                     Z-ADDWORK22    CD22
|   C                     Z-ADDWORK23    CD23
|   C                     Z-ADDWORK24    CD24
|   C                     Z-ADDWORK25    CD25
|   C                     Z-ADDWORK26    CD26
|   C                     WRITECD0
| 03-C                     END
      *
04===C                     ENDSR
     C*==============================================================*
     C*          RTN200....SG AND SH TO CD
     C*==============================================================*
05===C           RTN200    BEGSR
|    C*
B2000C                     MOVELSG26      CD01
|    C                     MOVE SG01      CD02
|    C                     MOVELSG01      CD03
|    C                     MOVELSG04      CD06
|    C                     MOVELSG05      CD07
|    C                     MOVELSG11      CD09
      *
|    C                     MOVELSG12      CD10
      *
      *地區區域
|    C                     MOVEL*BLANKS   CD11
|    C                     MOVEL*BLANKS   CD12
|    C           KEYME     CHAINME0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELME07      CD11
|   C                     MOVELME08      CD12
| 01-C                     END
      *通路型態
|    C                     MOVEL*BLANKS   CD13
|    C                     MOVEL*BLANKS   CD14
|    C           KEYMD     CHAINMD0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELMD07      CD13
|   C                     MOVELMD08      CD14
| 02-C                     END
      *
| 03-C           SG17      IFEQ SG18
|   C                     MOVEL*BLANKS   CD15
| 03*C                     ELSE
| 04-C           SG17      IFNE *BLANKS
|   C           SG18      ANDNE*BLANKS
|   C                     MOVEL'T'       CD15
| 04*C                     ELSE
|   C                     MOVEL*BLANKS   CD15
| 04-C                     END
| 03-C                     END
      *
|    C           SG02      SETLLSH0
|    C           SG02      READESH0                      46
| 04-C           *IN46     DOWEQ'0'
|   C                     MOVELSH03      CD04
|   C                     MOVEL*BLANKS   CD05
|   C           KEYCD     CHAINCD0                  43
|   C                     MOVELCD04      CD31
      *WRITE TO FILE
|   C           CD04      CHAINMA0                  40
|   C                     MOVELMA07      CD29
|   C                     MOVELMA10      CD30
| 05-C           MA54      IFEQ 'Y'
|   C                     MOVEL'Y'       CD27
| 05*C                     ELSE
|   C                     MOVEL*BLANKS   CD27
| 05-C                     END
      *
      *產品分類碼----------------------------------------------------
|   C                     MOVELCD04      PRDUT
| 06-C           PRDUT2    IFEQ 'RM'
|   C                     MOVEL'R'       CD28
| 06*C                     ELSE
| 07-C           MA54      IFNE 'Y'
| 08-C           PRDUT1    IFEQ 'W'
|   C                     MOVEL'W'       CD28
| 08*C                     ELSE
| 09-C           MA091     IFEQ 'W'
|   C           MA092     OREQ 'W'
|   C                     MOVEL'W'       CD28
| 09*C                     ELSE
|   C                     MOVEL'S'       CD28
| 09-C                     END
| 08-C                     END
| 07*C                     ELSE
|   C           CD04      SETLLMF0
|   C           CD04      READEMF0                      47
| 10-C           *IN47     DOWEQ'0'
      *非副屬品
| 11-C           MF07      IFNE 'Y'
|   C                     MOVELMF02      PRDUT
| 12-C           PRDUT1    IFEQ 'W'
|   C                     MOVEL'W'       CD28
| 12*C                     ELSE
|   C                     MOVEL'S'       CD28
| 12-C                     END
      *
|   C                     SETON                     47
| 11-C                     END
      *
|   C  N47      CD04      READEMF0                      47
| 10-C                     END
      *
| 07-C                     END
| 06-C                     END
      *----------------------------------------------------------------
|   C                     EXSR RTN210
| 13-C           *IN40     IFEQ '0'
|   C           MA54      ANDEQ'Y'
|   C*禮盒
|   C                     EXSR RTN220
| 13-C                     END
|   C*單瓶
|   C           SG02      READESH0                      46
| 04-C                     END
      *
05===C                     ENDSR
     C*==============================================================*
     C*          RTN210....單瓶
     C*==============================================================*
06===C           RTN210    BEGSR
|    C*
|    C                     Z-ADD0         WORK16
|    C                     Z-ADD0         WORK17
|    C                     Z-ADD0         WORK18
|    C                     Z-ADD0         WORK19
|    C                     Z-ADD0         WORK20
|    C                     Z-ADD0         WORK21
|    C                     Z-ADD0         WORK22
|    C                     Z-ADD0         WORK23
|    C                     Z-ADD0         WORK24
|    C                     Z-ADD0         WORK25
|    C                     Z-ADD0         WORK26
      *銷退數
|    C                     Z-ADDSH12      WORK20
      *銷退搭贈數
|    C                     Z-ADDSH13      WORK21
      *銷退金額
|    C                     Z-ADDSH07      WORK26
      *WRITE TO FILE
B2000C                     Z-ADDDATE      CDXX
B2000C                     TIME           CDYY
|    C                     MOVE $USER     CDZZ
| 01-C           *IN43     IFEQ '0'
|   C                     ADD  WORK16    CD16
|   C                     ADD  WORK17    CD17
|   C                     ADD  WORK18    CD18
|   C                     ADD  WORK19    CD19
|   C                     ADD  WORK20    CD20
|   C                     ADD  WORK21    CD21
|   C                     ADD  WORK22    CD22
|   C                     ADD  WORK23    CD23
|   C                     ADD  WORK24    CD24
|   C                     ADD  WORK25    CD25
|   C                     ADD  WORK26    CD26
|   C                     UPDATCD0
| 01*C                     ELSE
|   C                     Z-ADDWORK16    CD16
|   C                     Z-ADDWORK17    CD17
|   C                     Z-ADDWORK18    CD18
|   C                     Z-ADDWORK19    CD19
|   C                     Z-ADDWORK20    CD20
|   C                     Z-ADDWORK21    CD21
|   C                     Z-ADDWORK22    CD22
|   C                     Z-ADDWORK23    CD23
|   C                     Z-ADDWORK24    CD24
|   C                     Z-ADDWORK25    CD25
|   C                     Z-ADDWORK26    CD26
|   C                     WRITECD0
| 01-C                     END
      *
06===C                     ENDSR
     C*==============================================================*
     C*          RTN220....禮盒
     C*==============================================================*
07===C           RTN220    BEGSR
|    C*計算分母
|    C                     Z-ADD0         MOTHER  90
|    C           SH03      SETLLMF0
|    C           SH03      READEMF0                      47
| 01-C           *IN47     DOWEQ'0'
      *非副屬品
| 02-C           MF07      IFNE 'Y'
      *
|   C           MF04      MULT MF05      SUN     90
|   C                     ADD  SUN       MOTHER
| 02-C                     END
      *
|   C           SH03      READEMF0                      47
| 01-C                     END
      *
|    C*計算單瓶比率
|    C           SH03      SETLLMF0
|    C           SH03      READEMF0                      47
| 03-C           *IN47     DOWEQ'0'
      *副屬品
| 04-C           MF07      IFNE 'Y'
|   C                     MOVELMF02      CD04
      *從禮盒拆出之單瓶
|   C                     MOVEL'Y'       CD05
|   C           KEYCD     CHAINCD0                  43
|   C                     MOVELCD04      CD31
|   C           CD04      CHAINMA0                  40
|   C                     MOVELMA07      CD29
|   C                     MOVELMA10      CD30
|   C                     MOVEL*BLANKS   CD27
      *產品分類碼----------------------------------------------------
|   C                     MOVELCD04      PRDUT
| 05-C           PRDUT2    IFEQ 'RM'
|   C                     MOVEL'R'       CD28
| 05*C                     ELSE
| 06-C           PRDUT1    IFEQ 'W'
|   C                     MOVEL'W'       CD28
| 06*C                     ELSE
|   C                     MOVEL'S'       CD28
| 06-C                     END
| 05-C                     END
      *----------------------------------------------------------------
|   C                     EXSR RTN230
| 04-C                     END
      *
|   C           SH03      READEMF0                      47
| 03-C                     END
      *
07===C                     ENDSR
     C*==============================================================*
     C*          RTN230....禮盒WRITE TO FILE
     C*==============================================================*
08===C           RTN230    BEGSR
|    C*
|    C                     Z-ADD0         WORK16
|    C                     Z-ADD0         WORK17
|    C                     Z-ADD0         WORK18
|    C                     Z-ADD0         WORK19
|    C                     Z-ADD0         WORK20
|    C                     Z-ADD0         WORK21
|    C                     Z-ADD0         WORK22
|    C                     Z-ADD0         WORK23
|    C                     Z-ADD0         WORK24
|    C                     Z-ADD0         WORK25
|    C                     Z-ADD0         WORK26
      *單瓶所佔比率
|    C           MF04      MULT MF05      SUN     90
|    C           SUN       DIV  MOTHER    RATE    94H
|    C           SH07      MULT RATE      WSD07   90H
|    C           SH12      MULT MF04      WSD04   50
|    C           SH13      MULT MF04      WSD05   50
      *銷退數
|    C                     Z-ADDWSD04     WORK20
      *銷退搭贈數
|    C                     Z-ADDWSD05     WORK21
      *銷退金額
|    C                     Z-ADDWSD07     WORK26
      *WRITE TO FILE
B2000C                     Z-ADDDATE      CDXX
B2000C                     TIME           CDYY
|    C                     MOVE $USER     CDZZ
| 01-C           *IN43     IFEQ '0'
|   C                     ADD  WORK16    CD16
|   C                     ADD  WORK17    CD17
|   C                     ADD  WORK18    CD18
|   C                     ADD  WORK19    CD19
|   C                     ADD  WORK20    CD20
|   C                     ADD  WORK21    CD21
|   C                     ADD  WORK22    CD22
|   C                     ADD  WORK23    CD23
|   C                     ADD  WORK24    CD24
|   C                     ADD  WORK25    CD25
|   C                     ADD  WORK26    CD26
|   C                     UPDATCD0
| 01*C                     ELSE
|   C                     Z-ADDWORK16    CD16
|   C                     Z-ADDWORK17    CD17
|   C                     Z-ADDWORK18    CD18
|   C                     Z-ADDWORK19    CD19
|   C                     Z-ADDWORK20    CD20
|   C                     Z-ADDWORK21    CD21
|   C                     Z-ADDWORK22    CD22
|   C                     Z-ADDWORK23    CD23
|   C                     Z-ADDWORK24    CD24
|   C                     Z-ADDWORK25    CD25
|   C                     Z-ADDWORK26    CD26
|   C                     WRITECD0
| 01-C                     END
      *
08===C                     ENDSR
     C*==============================================================*
     C*          RTN300....SN AND SO TO CD
     C*==============================================================*
09===C           RTN300    BEGSR
|    C*
B2000C                     MOVELSN06      CD01
|    C                     MOVE SN01      CD02
|    C                     MOVELSN01      CD03
|    C                     MOVELSN03      CD06
|    C                     MOVEL*BLANKS   CD07
|    C                     MOVELSN07      CD09
      *
|    C                     MOVELSN08      CD10
      *
      *地區區域
|    C                     MOVEL*BLANKS   CD11
|    C                     MOVEL*BLANKS   CD12
|    C           KEYME     CHAINME0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELME07      CD11
|   C                     MOVELME08      CD12
| 01-C                     END
      *通路型態
|    C                     MOVEL*BLANKS   CD13
|    C                     MOVEL*BLANKS   CD14
|    C           KEYMD     CHAINMD0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELMD07      CD13
|   C                     MOVELMD08      CD14
| 02-C                     END
      *
| 03-C           SN10      IFEQ 'T'
|   C                     MOVEL'T'       CD15
| 03*C                     ELSE
|   C                     MOVEL*BLANKS   CD15
| 03-C                     END
      *
|    C           SN02      SETLLSO0
|    C           SN02      READESO0                      46
| 04-C           *IN46     DOWEQ'0'
|   C                     MOVELSO03      CD04
|   C                     MOVEL*BLANKS   CD05
|   C           KEYCD     CHAINCD0                  43
|   C                     MOVELCD04      CD31
      *WRITE TO FILE
|   C           CD04      CHAINMA0                  40
|   C                     MOVELMA07      CD29
|   C                     MOVELMA10      CD30
| 05-C           MA54      IFEQ 'Y'
|   C                     MOVEL'Y'       CD27
| 05*C                     ELSE
|   C                     MOVEL*BLANKS   CD27
| 05-C                     END
      *
      *產品分類碼----------------------------------------------------
|   C                     MOVELCD04      PRDUT
| 06-C           PRDUT2    IFEQ 'RM'
|   C                     MOVEL'R'       CD28
| 06*C                     ELSE
| 07-C           MA54      IFNE 'Y'
| 08-C           PRDUT1    IFEQ 'W'
|   C                     MOVEL'W'       CD28
| 08*C                     ELSE
| 09-C           MA091     IFEQ 'W'
|   C           MA092     OREQ 'W'
|   C                     MOVEL'W'       CD28
| 09*C                     ELSE
|   C                     MOVEL'S'       CD28
| 09-C                     END
| 08-C                     END
| 07*C                     ELSE
|   C           CD04      SETLLMF0
|   C           CD04      READEMF0                      47
| 10-C           *IN47     DOWEQ'0'
      *非副屬品
| 11-C           MF07      IFNE 'Y'
|   C                     MOVELMF02      PRDUT
| 12-C           PRDUT1    IFEQ 'W'
|   C                     MOVEL'W'       CD28
| 12*C                     ELSE
|   C                     MOVEL'S'       CD28
| 12-C                     END
      *
|   C                     SETON                     47
| 11-C                     END
      *
|   C  N47      CD04      READEMF0                      47
| 10-C                     END
      *
| 07-C                     END
| 06-C                     END
      *----------------------------------------------------------------
|   C                     EXSR RTN310
| 13-C           *IN40     IFEQ '0'
|   C           MA54      ANDEQ'Y'
|   C*禮盒
|   C                     EXSR RTN320
| 13-C                     END
|   C*單瓶
|   C           SN02      READESO0                      46
| 04-C                     END
      *
09===C                     ENDSR
     C*==============================================================*
     C*          RTN310....單瓶
     C*==============================================================*
10===C           RTN310    BEGSR
|    C*
|    C                     Z-ADD0         WORK16
|    C                     Z-ADD0         WORK17
|    C                     Z-ADD0         WORK18
|    C                     Z-ADD0         WORK19
|    C                     Z-ADD0         WORK20
|    C                     Z-ADD0         WORK21
|    C                     Z-ADD0         WORK22
|    C                     Z-ADD0         WORK23
|    C                     Z-ADD0         WORK24
|    C                     Z-ADD0         WORK25
|    C                     Z-ADD0         WORK26
| 01-C           SO02L     IFEQ 'R2'
      *收回數
|   C                     Z-ADDSO06      WORK22
      *收回搭贈數
|   C                     ADD  SO07      WORK22
| 01*C                     ELSE
      *試飲收回數
|   C                     Z-ADDSO06      WORK23
|   C                     ADD  SO07      WORK23
| 01-C                     END
      *WRITE TO FILE
B2000C                     Z-ADDDATE      CDXX
B2000C                     TIME           CDYY
|    C                     MOVE $USER     CDZZ
| 02-C           *IN43     IFEQ '0'
|   C                     ADD  WORK16    CD16
|   C                     ADD  WORK17    CD17
|   C                     ADD  WORK18    CD18
|   C                     ADD  WORK19    CD19
|   C                     ADD  WORK20    CD20
|   C                     ADD  WORK21    CD21
|   C                     ADD  WORK22    CD22
|   C                     ADD  WORK23    CD23
|   C                     ADD  WORK24    CD24
|   C                     ADD  WORK25    CD25
|   C                     ADD  WORK26    CD26
|   C                     UPDATCD0
| 02*C                     ELSE
|   C                     Z-ADDWORK16    CD16
|   C                     Z-ADDWORK17    CD17
|   C                     Z-ADDWORK18    CD18
|   C                     Z-ADDWORK19    CD19
|   C                     Z-ADDWORK20    CD20
|   C                     Z-ADDWORK21    CD21
|   C                     Z-ADDWORK22    CD22
|   C                     Z-ADDWORK23    CD23
|   C                     Z-ADDWORK24    CD24
|   C                     Z-ADDWORK25    CD25
|   C                     Z-ADDWORK26    CD26
|   C                     WRITECD0
| 02-C                     END
      *
10===C                     ENDSR
     C*==============================================================*
     C*          RTN320....禮盒
     C*==============================================================*
11===C           RTN320    BEGSR
|    C*計算分母
|    C                     Z-ADD0         MOTHER  90
|    C           SO03      SETLLMF0
|    C           SO03      READEMF0                      47
| 01-C           *IN47     DOWEQ'0'
      *非副屬品
| 02-C           MF07      IFNE 'Y'
      *
|   C           MF04      MULT MF05      SUN     90
|   C                     ADD  SUN       MOTHER
| 02-C                     END
      *
|   C           SH03      READEMF0                      47
| 01-C                     END
      *
|    C*計算單瓶比率
|    C           SO03      SETLLMF0
|    C           SO03      READEMF0                      47
| 03-C           *IN47     DOWEQ'0'
      *副屬品
| 04-C           MF07      IFNE 'Y'
|   C                     MOVELMF02      CD04
      *從禮盒拆出之單瓶
|   C                     MOVEL'Y'       CD05
|   C           KEYCD     CHAINCD0                  43
|   C                     MOVELCD04      CD31
|   C           CD04      CHAINMA0                  40
|   C                     MOVELMA07      CD29
|   C                     MOVELMA10      CD30
|   C                     MOVEL*BLANKS   CD27
      *產品分類碼----------------------------------------------------
|   C                     MOVELCD04      PRDUT
| 05-C           PRDUT2    IFEQ 'RM'
|   C                     MOVEL'R'       CD28
| 05*C                     ELSE
| 06-C           PRDUT1    IFEQ 'W'
|   C                     MOVEL'W'       CD28
| 06*C                     ELSE
|   C                     MOVEL'S'       CD28
| 06-C                     END
| 05-C                     END
      *----------------------------------------------------------------
|   C                     EXSR RTN330
| 04-C                     END
      *
|   C           SH03      READEMF0                      47
| 03-C                     END
      *
11===C                     ENDSR
     C*==============================================================*
     C*          RTN330....禮盒WRITE TO FILE
     C*==============================================================*
12===C           RTN330    BEGSR
|    C*
|    C                     Z-ADD0         WORK16
|    C                     Z-ADD0         WORK17
|    C                     Z-ADD0         WORK18
|    C                     Z-ADD0         WORK19
|    C                     Z-ADD0         WORK20
|    C                     Z-ADD0         WORK21
|    C                     Z-ADD0         WORK22
|    C                     Z-ADD0         WORK23
|    C                     Z-ADD0         WORK24
|    C                     Z-ADD0         WORK25
|    C                     Z-ADD0         WORK26
      *單瓶所佔比率
|    C           MF04      MULT MF05      SUN     90
|    C           SUN       DIV  MOTHER    RATE    94H
|    C           SO06      MULT MF04      WSD04   50
|    C           SO07      MULT MF04      WSD05   50
| 01-C           SO02L     IFEQ 'R2'
      *收回數
|   C                     Z-ADDWSD04     WORK22
      *收回搭贈數
|   C                     ADD  WSD05     WORK22
| 01*C                     ELSE
      *試飲收回數
|   C                     Z-ADDWSD04     WORK22
      *試飲搭贈數
|   C                     ADD  WSD05     WORK22
| 01-C                     END
      *WRITE TO FILE
B2000C                     Z-ADDDATE      CDXX
B2000C                     TIME           CDYY
|    C                     MOVE $USER     CDZZ
| 02-C           *IN43     IFEQ '0'
|   C                     ADD  WORK16    CD16
|   C                     ADD  WORK17    CD17
|   C                     ADD  WORK18    CD18
|   C                     ADD  WORK19    CD19
|   C                     ADD  WORK20    CD20
|   C                     ADD  WORK21    CD21
|   C                     ADD  WORK22    CD22
|   C                     ADD  WORK23    CD23
|   C                     ADD  WORK24    CD24
|   C                     ADD  WORK25    CD25
|   C                     ADD  WORK26    CD26
|   C                     UPDATCD0
| 02*C                     ELSE
|   C                     Z-ADDWORK16    CD16
|   C                     Z-ADDWORK17    CD17
|   C                     Z-ADDWORK18    CD18
|   C                     Z-ADDWORK19    CD19
|   C                     Z-ADDWORK20    CD20
|   C                     Z-ADDWORK21    CD21
|   C                     Z-ADDWORK22    CD22
|   C                     Z-ADDWORK23    CD23
|   C                     Z-ADDWORK24    CD24
|   C                     Z-ADDWORK25    CD25
|   C                     Z-ADDWORK26    CD26
|   C                     WRITECD0
| 02-C                     END
      *
12===C                     ENDSR
     C*==============================================================*
     C*          RTN900....PRINTER LOG
     C*==============================================================*
13===C           RTN900    BEGSR
      *
B2TRCC                     Z-ADD#I02Y     D#I02Y
|    C                     Z-ADD#I02M     D#I02M
M001AC                     Z-ADD#I03      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           D#I03     PARM           S001O1  60
|    C*
|    C                     WRITEPD1
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     END
|    C*
13===C                     ENDSR
