      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOA0241                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 1993.10.12                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :客戶新增報價拷貝作業                         *
      ****************************************************************
     FSOSBLF  IP  E           K        DISK
     F            SB0                               KRENAMESB0CP
     FSOSBPF  IF  E           K        DISK                      A
     FMTMDPF  IF  E           K        DISK
     E*新增客戶之ＡＲＲＡＹ
     E                    W01        20  5
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
M001AI                                      201 2080$EG8
     I                                      601 605 DSB01
     I                                      606 606 DSB04
M001AI                                      607 6140YSB05
M001AI                                      615 6220YSB13
     I                                      701 800 W01
     I                                      701 705 D1011
     I                                      706 710 D1012
     I                                      711 715 D1013
     I                                      716 720 D1014
     I                                      721 725 D1015
     I                                      726 730 D1021
     I                                      731 735 D1022
     I                                      736 740 D1023
     I                                      741 745 D1024
     I                                      746 750 D1025
     I                                      751 755 D1031
     I                                      756 760 D1032
     I                                      761 765 D1033
     I                                      766 770 D1034
     I                                      771 775 D1035
     I                                      776 780 D1041
     I                                      781 785 D1042
     I                                      786 790 D1043
     I                                      791 795 D1044
     I                                      796 800 D1045
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWSB    KLIST
     C                     KFLD           WSB01
     C                     KFLD           WSB02
     C                     KFLD           WSB04
     C                     KFLD           WSB05
     C           KEYWMD    KLIST
     C                     KFLD           WMD01
      *==============================================================*
      *                   *LIKE DEFN
      *==============================================================*
     C           *LIKE     DEFN SB01      WSB01
     C           *LIKE     DEFN SB02      WSB02
     C           *LIKE     DEFN SB04      WSB04
B2000C           *LIKE     DEFN SB05      WSB05
     C           *LIKE     DEFN SB01      WMD01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN000                     *SET INIT
     C*
     C*
     CLR                   RETRN
     C*==============================================================*
     C*          RTN000....
     C*==============================================================*
01===C           RTN000    BEGSR
|    C*
|    C                     MOVELSB02      WSB02
|    C                     MOVELSB04      WSB04
B2000C                     Z-ADDSB05      WSB05
| 01-C           1         DO   20        I       20
| 02-C           W01,I     IFNE *BLANK
|   C                     MOVELW01,I     WMD01
|   C*CHECK MD0中是否存在此客戶代號
|   C           KEYWMD    CHAINMD0                  41
| 03-C           *IN41     IFEQ '0'
|   C                     MOVELW01,I     WSB01
|   C*CHECK SB0中是否有相同之報價
B2000C           KEYWSB    CHAINSB0                  40
|   C*無相同報價時即可WRITE SB0
| 04-C           *IN40     IFEQ '1'
|   C                     MOVELW01,I     SB01
|   C                     MOVE '*'       SB14
B2000C*M001M               Z-ADD$EGYMD    SBXX
M001MC                     Z-ADD$EG8      SBXX
B2000C                     TIME           SBYY
|    C                     MOVE $USER     SBZZ
|   C                     WRITESB0
| 04-C                     END                             'ENDIF 40
| 03-C                     END                             'ENDIF 41
| 02-C                     END                             'ENDIF W01
| 01-C                     END                             'ENDDO
|   C*
01===C           MAINED    ENDSR
      *===============================================================*
02===C           OUTLDA    BEGSR
|   C*
|   C           *NAMVAR   DEFN *LDA      LDA
|   C                     OUT  LDA
|   C*
02===C           ENDLDA    ENDSR
