      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOA017X                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 82/01/07                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :通路產品報價還原作業                         *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.13 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
      ****************************************************************
     FSOA017XDCF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*產品，通路，型態，折扣別，生效日期，截止日期
     I                                      601 609 DSA01S
     I                                      611 619 DSA01E
     I                                      620 620 DSA02S
     I                                      621 621 DSA02E
     I                                      622 623 DSA03S
     I                                      624 625 DSA03E
     I                                      626 626 DSA04
     I                                      630 6350DSA05
     I                                      636 6410DSA13
M001MI                                      642 6490YSA05
M001MI                                      650 6570YSA13
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN04     PARM *IN04     IN04    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N10N96          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  02-C           *IN03     OREQ '0'
    C           *IN14     ANDEQ'1'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSA01E
|    C                     MOVE *BLANK    DSA01S
|    C                     MOVE *BLANK    DSA02E
|    C                     MOVE *BLANK    DSA02S
|    C                     MOVE *BLANK    DSA03E
|    C                     MOVE *BLANK    DSA03S
|    C                     MOVE *BLANK    DSA04
|    C                     Z-ADD0         DSA05
|    C                     Z-ADD0         DSA13
M001AC                     Z-ADD0         W6      60
|    C                     SETON                     10
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*通路
| 01-C           DSA02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSA02S
| 01-C                     END
| 02-C           DSA02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSA02E
| 02-C                     END
| 03-C           DSA02S    IFGT DSA02E
|   C                     SETON                     619099
| 03-C                     END
|    C   99                GOTO END100
|    C*型態
| 04-C           DSA03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSA03S
| 04-C                     END
| 05-C           DSA03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSA03E
| 05-C                     END
| 06-C           DSA03S    IFGT DSA03E
|   C                     SETON                     709099
| 06-C                     END
|    C   99                GOTO END100
|    C*產品
| 07-C           DSA01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSA01S
| 07-C                     END
| 08-C           DSA01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSA01E
| 08-C                     END
| 09-C           DSA01S    IFGT DSA01E
|   C                     SETON                     639099
| 09-C                     END
|    C   99                GOTO END100
|    C*折扣
| 10-C           DSA04     IFEQ *BLANK
|   C                     SETON                     649599
| 10-C                     END
|    C   99                GOTO END100
|    C*日期
| 11-C           DSA05     IFEQ 0
|   C                     SETON                     659599
| 11-C                     END
| 12-C           DSA13     IFEQ 0
|   C                     SETON                     669599
| 12-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'P09'
|    C                     PARM DSA05     P0901I  60
|    C                     PARM           P0911O  1
| 13-C           P0911O    IFEQ 'N'
|   C                     SETON                     659899
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSA13     P0901I  60
|    C                     PARM           P0911O  1
| 14-C           P0911O    IFEQ 'N'
|   C                     SETON                     669899
| 14-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSA05     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSA05
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSA13     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSA13
|    C*日期區間檢查
| 15-C           YSA05     IFGT YSA13
|   C                     SETON                     656692
|   C                     SETON                     99
| 15-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*
| 02-C           D#ROW     IFEQ 4
|   C           D#COL     ANDEQ38
|   C                     CALL 'WDS018'
|   C                     PARM           DSA02S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 4
|   C           D#COL     ANDEQ42
|   C                     CALL 'WDS018'
|   C                     PARM           DSA02E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 6
| 05-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSA02S    PSA02   1
|   C           DSA03S    PARM DSA03S    PSA03   2
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 06-C           D#COL     IFGE 43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS009'
|   C                     PARM DSA02E    PSA02
|   C           DSA03E    PARM DSA03E    PSA03
|   C                     GOTO ENDF4
| 06-C                     END
| 04-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
