     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.18 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     FSOA023D CF  E                    WORKSTN
     FS#SUPF  IF  E           K        DISK
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      601 605 DST01S
     I                                      606 610 DST01E
M001MI                                      611 6180YST02S
M001MI                                      619 6260YST02E
M001MI                                      627 6300DST02
M001MI                                      627 6280DST02M
M001MI                                      629 6300DST02Y
     I            DS
     I                                        1   60CHKMDY
     I                                        1   20CHKM
     I                                        3   40CHKD
     I                                        5   60CHKY
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N10N96          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'B0001'   DST01S
|    C                     MOVEL'B9999'   DST01E
|    C                     Z-ADD0         DST02
|    C                     Z-ADD0         YST02S
|    C                     Z-ADD0         YST02E
M001AC                     Z-ADD0         W6      60
|    C                     Z-ADD0         CHKMDY
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
     C                     MOVEL*BLANKS   PUSER
     C                     CALL 'SOA023C1'
     C                     PARM           PUSER
     C           PUSER     IFNE *BLANKS
     C           PUSER     CHAINSU0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELSU02      PUSER
     C                     END
     C                     SETON                     8699
     C                     END
|    C   99                GOTO END100
|    C****
      *
| 11-C           DST01S    IFGT DST01E
|   C                     SETON                     6162
|   C                     SETON                     9499
| 11-C                     END
|    C   99                GOTO END100
     C*
|    C*(CHECK DATE)-¾P°â¦~¤ë
| 07-C           DST02     IFEQ 0
     C                     SETON                     639599
| 07-C                     END
|    C   99                GOTO END100
|    C*
     C                     MOVELDST02M    CHKM
     C                     MOVELDST02Y    CHKY
     C                     MOVEL'01'      CHKD
|    C*
|    C                     CALL 'P09'
|    C                     PARM CHKMDY    P0901I  60
|    C                     PARM           P0911O  1
| 09-C           P0911O    IFEQ 'N'
|   C                     SETON                     639599
| 09-C                     END
|    C   99                GOTO END100
|    C****
|    C*(CHANGE END-DATE TO CHINESE DATE)
|    C****
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM CHKMDY    S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YST02S  80
|    C*
|    C                     MOVELYST02S    YST02E
|    C                     MOVE '31'      YST02E
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
