     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : SOA016                                     *
     A*    AUTHOR       :
     A*    DATE WRITTEN : 81/12/28                                   *
     A*    UPDATE DATE  : 81/12/28
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    REMARK       :客戶產品報價批次作業                      *
     A*    PROCEDURE    :                                            *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.13 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A*                                                              *
     A****************************************************************
     FSOA016D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      601 605 DSB01S
     I                                      606 610 DSB01E
     I                                      611 619 DSB02S
     I                                      620 628 DSB02E
     I                                      629 6340DSB05
     I                                      635 6400DSB13
     I                                      641 6460DDATES
     I                                      647 6520DDATEE
     I                                      653 653 DSB04
     I                                      654 6610YSB05
     I                                      662 6690YSB13
     I                                      670 6770YDATES
     I                                      678 6850YDATEE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN04     PARM *IN04     IN04    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N10N96          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C           *IN03     OREQ '0'
    C           *IN14     ANDEQ'1'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSB01E
|    C                     MOVE *BLANK    DSB01S
|    C                     MOVE *BLANK    DSB02E
|    C                     MOVE *BLANK    DSB02S
|    C                     MOVE *BLANK    DSB04
|    C                     Z-ADD0         DSB05
|    C                     Z-ADD0         DSB13
|    C                     Z-ADD0         DDATES
|    C                     Z-ADD0         DDATEE
M001MC                     Z-ADD0         W6      60
|    C                     SETON                     10
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *USE TIME
|    C*客戶區間檢查
| 01-C           DSB01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSB01S
| 01-C                     END
| 02-C           DSB01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSB01E
| 02-C                     END
| 03-C           DSB01S    IFGT DSB01E
|   C                     SETON                     619099
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品區間檢查
| 04-C           DSB02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSB02S
| 04-C                     END
| 05-C           DSB02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSB02E
| 05-C                     END
| 06-C           DSB02S    IFGT DSB02E
|   C                     SETON                     639099
| 06-C                     END
|    C   99                GOTO END100
|    C*折扣別
| 07-C           DSB04     IFEQ *BLANK
|   C                     SETON                     649599
| 07-C                     END
|    C   99                GOTO END100
|    C*日期檢查
|    C** DEFAULT VALUE
| 08-C           DSB05     IFEQ 0
|   C                     SETON                     659599
| 08-C                     END
| 09-C           DSB13     IFEQ 0
|   C                     SETON                     669599
| 09-C                     END
|    C**
|    C                     CALL 'P09'
|    C                     PARM DSB05     P0901I  60
|    C                     PARM           P0911O  1
| 10-C           P0911O    IFEQ 'N'
|   C                     SETON                     659899
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSB13     P0901I  60
|    C                     PARM           P0911O  1
| 11-C           P0911O    IFEQ 'N'
|   C                     SETON                     669899
| 11-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSB05     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSB05
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSB13     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSB13
|    C*日期區間檢查
| 12-C           YSB05     IFGT YSB13
|   C                     SETON                     656692
|   C                     SETON                     99
| 12-C                     END
|    C   99                GOTO END100
|    C*
|    C*日期檢查
|    C** DEFAULT VALUE
| 13-C           DDATES    IFEQ 0
|   C                     SETON                     679599
| 13-C                     END
| 14-C           DDATEE    IFEQ 0
|   C                     SETON                     689599
| 14-C                     END
|    C**
|    C                     CALL 'P09'
|    C                     PARM DDATES    P0901I  60
|    C                     PARM           P0911O  1
| 15-C           P0911O    IFEQ 'N'
|   C                     SETON                     679899
| 15-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DDATEE    P0901I  60
|    C                     PARM           P0911O  1
| 16-C           P0911O    IFEQ 'N'
|   C                     SETON                     689899
| 16-C                     END
|    C*
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DDATES    S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YDATES
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DDATEE    S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YDATEE
|    C*日期區間檢查
| 18-C           YDATES    IFGT YDATEE
|   C                     SETON                     676892
|   C                     SETON                     99
| 18-C                     END
|    C   99                GOTO END100
|    C*
|    C*修正報價日期必須大於原報價日期
| 17-C           YDATES    IFLT YSB05
|   C                     SETON                     679899
| 17-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*
| 02-C           D#ROW     IFEQ 5
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DSB01S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 5
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS003'
|   C                     PARM           DSB01E
|   C                     GOTO ENDF4
| 03-C                     END
| 04-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSB02S
|   C                     GOTO ENDF4
| 04-C                     END
| 05-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSB02E
|   C                     GOTO ENDF4
| 05-C                     END
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
