     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : SOA016                                     *
     A*    AUTHOR       :
     A*    DATE WRITTEN : 81/12/28                                   *
     A*    UPDATE DATE  : 81/12/28
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    REMARK       :客戶產品報價批次作業                      *
     A*    PROCEDURE    :                                            *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.11 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A*                                                              *
     A****************************************************************
     FSOA024D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     E*新增客戶之ＡＲＲＡＹ
     E                    W01        20  5
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      601 605 DSB01
     I                                      606 606 DSB04
M001MI                                      607 6140YSB05
M001MI                                      615 6220YSB13
     I                                      701 800 W01
     I                                      701 705 D1011
     I                                      706 710 D1012
     I                                      711 715 D1013
     I                                      716 720 D1014
     I                                      721 725 D1015
     I                                      726 730 D1021
     I                                      731 735 D1022
     I                                      736 740 D1023
     I                                      741 745 D1024
     I                                      746 750 D1025
     I                                      751 755 D1031
     I                                      756 760 D1032
     I                                      761 765 D1033
     I                                      766 770 D1034
     I                                      771 775 D1035
     I                                      776 780 D1041
     I                                      781 785 D1042
     I                                      786 790 D1043
     I                                      791 795 D1044
     I                                      796 800 D1045
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN04     PARM *IN04     IN04    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N10N96          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
    C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  03-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSB01
|    C                     MOVE 'A'       DSB04
|    C                     Z-ADD0         DSB05
|    C                     Z-ADD0         DSB13
|    C                     MOVEA*BLANK    W01
M001AC                     Z-ADD0         W6      60
|    C                     SETON                     10
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *USE TIME
|    C*客戶代號檢查
| 01-C           DSB01     IFEQ *BLANKS
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C*折扣別
| 02-C           DSB04     IFEQ *BLANK
|   C                     SETON                     649599
| 02-C                     END
|    C   99                GOTO END100
|    C*日期檢查
|    C** DEFAULT VALUE
| 03-C           DSB05     IFEQ 0
|   C                     SETON                     659599
| 03-C                     END
|    C   99                GOTO END100
| 04-C           DSB13     IFEQ 0
|   C                     SETON                     669599
| 04-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'P09'
|    C                     PARM DSB05     P0901I  60
|    C                     PARM           P0911O  1
| 05-C           P0911O    IFEQ 'N'
|   C                     SETON                     659899
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSB13     P0901I  60
|    C                     PARM           P0911O  1
| 06-C           P0911O    IFEQ 'N'
|   C                     SETON                     669899
| 06-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSB05     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSB05
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSB13     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSB13
|    C*日期區間檢查
| 07-C           YSB05     IFGT YSB13
|   C                     SETON                     656692
|   C                     SETON                     99
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶代號ＡＲＲＡＹ檢查
|    C                     Z-ADD0         WI      20
| 08-C           1         DO   20        I       20
| 09-C           W01,I     IFNE *BLANKS
|   C                     ADD  1         WI
| 09-C                     END
| 08-C                     END
| 10-C           WI        IFEQ 0
|   C                     SETON                     619599
| 10-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*
| 02-C           D#ROW     IFEQ 5
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DSB01
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
