     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : SOA001                                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/02/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單作業                              *
     A*    REMARK       :通路型態產品報價設定 (A/U/D/I)            *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.11 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 01.12.28 |零售價以生效日為判斷基礎，過往報價以系
     A*           |          |統日判斷
     A*---------------------------------------------------------------
     A****************************************************************
     FSOSAPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FSOSALF  IF  E           K        DISK
     F            SA0                               KRENAMESA0L
     FMTMAPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FSOA001ADCF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN   KSFILE SFLSR
     E*: FUNCTION DATA :
     E                    WFUN    6   6  6
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
M001AI                                      201 2080DATE
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I*                                     514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I            DS
     I                                        1   9 DSA01
     I                                        3   4 DSA011
     I                                        1   4 DSA012
     I                                        5   9 DSA013
     I            DS
     I                                        1   9 MA01
     I                                        1   4 MA01L
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN    40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
      *  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY1
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY2
     C           *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN3     OBGN3            *START KEY3
     C           *LIKE     DEFN DBGN3     BBGN3            *SUBFIL BUTTOM
     C           *LIKE     DEFN SA04      DBGN4            *START KEY3
     C           *LIKE     DEFN SA04      OBGN4            *START KEY3
     C           *LIKE     DEFN SA04      BBGN4            *SUBFIL BUTTOM
B2000C           *LIKE     DEFN SA05      DBGN5            *START KEY3
B2000C           *LIKE     DEFN SA05      OBGN5            *START KEY3
B2000C           *LIKE     DEFN SA05      BBGN5            *SUBFIL BUTTOM
B2000C           *LIKE     DEFN SA05      DKSA5                        OM
     C           *LIKE     DEFN SA01      HSA01                        OM
     C           *LIKE     DEFN SA02      HSA02                        OM
     C           *LIKE     DEFN SA03      HSA03                        OM
     C           *LIKE     DEFN SA04      HSA04                        OM
B2000C           *LIKE     DEFN SA05      HSA05                        OM
B2000C           *LIKE     DEFN SA05      WSA05                        OM
     C*
     C                     MOVE *BLANK    WBOTOM  1
     C           *LIKE     DEFN RRN       WRRN
     C           *LIKE     DEFN RRN       WPRCD
     C           *LIKE     DEFN RRN       DSPRCD
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSA1    KLIST
     C                     KFLD           DSA01
     C                     KFLD           DSA02
     C                     KFLD           DSA03
     C                     KFLD           DSA04
     C                     KFLD           DKSA5
     C           KEYSA2    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C                     KFLD           DBGN3
     C                     KFLD           DBGN4
     C                     KFLD           DBGN5
     C           KEYSA3    KLIST
     C                     KFLD           BBGN1
     C                     KFLD           BBGN2
     C                     KFLD           BBGN3
     C                     KFLD           BBGN4
     C                     KFLD           BBGN5
     C           KEYSA4    KLIST
     C                     KFLD           SA01
     C                     KFLD           SA02
     C                     KFLD           SA03
     C                     KFLD           SA04
     C                     KFLD           SA05
     C           KEYSA5    KLIST
     C                     KFLD           DSA01
     C                     KFLD           HSA02
     C                     KFLD           HSA03
     C                     KFLD           HSA04
     C                     KFLD           WSA05
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#C     KLIST
     C                     KFLD           DSA02
     C                     KFLD           DSA03
     C           KEYMA     KLIST
     C                     KFLD           SA01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     MOVE *ALL'0'   *IN,60
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN110
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $ADD      WA01,3
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $RMK01    WA01,6
|    C                     MOVE 'SCR001'  APPSCR
|    C*
B2MODC* M001D              Z-ADD0         DATE    80
|    C*                    CALL 'RES001'
|    C*                    PARM 'MDY'     S001I1  3
B2???C*                    PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC*          DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9199
| 01-C                     END
|    C  N99                EXSR RTN200
| 02-C           DRRN      IFGT 0
|   C           DRRN      SUB  1         HRRN
| 02-C                     END
|    C                     EXSR RTN191
|    C                     EXSR RTN192
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C           DBGN3     ORNE OBGN3
|   C                     Z-ADD0         HRRN
|   C                     MOVE *BLANK    DBGN4
B2000C                     MOVE *BLANK    DBGN5
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
|   C                     MOVE DBGN3     OBGN3
|   C                     MOVELDBGN4     OBGN4
B2000C                     MOVELDBGN5     OBGN5
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN       HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR                  5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANKS
|   C                     EXSR RTN180                     *CHK
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN       DRRN
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C                     UPDATSFLSR
|   C                     READCSFLSR                    57*NF
|   C*
| 01-C                     END                             *57 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     97
| 05-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609199
|   C                     Z-ADDRRN       DRRN
| 01-C                     END
|    C   99                GOTO END180
|    C*
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN       DRRN
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         WRRN
|    C                     Z-ADD12        WPRCD
|    C*                    Z-ADD0         DSPRCD
|    C           HRRN      DIV  WPRCD     DSPRCD
|    C                     MULT WPRCD     DSPRCD
|    C                     MOVE 'N'       WBOTOM
|    C*                    SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR
|    C                     SETOF                     52
B2000C           KEYSA2    SETLLSA0L
|    C                     MOVE DBGN1     BBGN1
|    C                     MOVE DBGN2     BBGN2
|    C                     MOVE DBGN3     BBGN3
|    C                     MOVE DBGN4     BBGN4
B2000C                     MOVE DBGN5     BBGN5
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
| 02-C           BBGN1     IFNE DBGN1
|   C           BBGN2     ORNE DBGN2
|   C           BBGN3     ORNE DBGN3
B2000C           KEYSA3    SETGTSA0L
| 02-C                     END
|   C                     EXSR RTN193
|   C                     MOVE SA01      BBGN1
|   C                     MOVE SA02      BBGN2
|   C                     MOVE SA03      BBGN3
|   C                     MOVE SA04      BBGN4
B2000C                     MOVE SA05      BBGN5
|   C                     MOVE SA04      DBGN4
B2000C                     MOVE SA05      DBGN5
|   C           *LOVAL    SETLLSA0L
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANK    DOPT1
|    C                     Z-ADDWRRN      RRN
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN       DOWLTDSPRCD
|   C                     READ SA0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     ADD  1         RRN
|   C* GET通路說明
|   C*                    MOVE *BLANKS   #A01
|   C*                    MOVEL'DISTRUBT'#A01
|   C*                    MOVE *BLANKS   #A02
|   C*                    MOVELSA02      #A02
|   C*          KEY#A     CHAIN#A0                  40
|   C*  40                MOVE *BLANKS   D#A03
|   C* N40                MOVEL#A03      D#A03
|   C* GET型態說明
|   C                     MOVE SA02      DSA02
|   C                     MOVE SA03      DSA03
|   C           KEY#C     CHAIN#C0                  40
|   C   40                MOVE *BLANKS   D#C03
|   C  N40                MOVEL#C03      D#C03
|   C* GET折扣別
| 03-C           SA04      IFEQ 'N'
|   C                     MOVE '普通'  DSALE
| 03-C                     END
| 04-C           SA04      IFEQ 'S'
|   C                     MOVE '特別'  DSALE
| 04-C                     END
| 05-C           SA04      IFEQ 'A'
|   C                     MOVE '搭贈'  DSALE
| 05-C                     END
|   C* GET折扣率
|   C*                    Z-ADDSA06      DSA06
|   C           SA06      MULT 100       DSA06
|   C***  日期轉換
M001AC                     Z-ADDSA05      W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
      *生效日
B2MODC                     PARM W6        S001I2  60
B2MODC           DSA05     PARM           S001O1  60
M001AC                     Z-ADDSA13      W6
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
      *結止日
B2MODC                     PARM W6        S001I2  60
B2MODC           DSA13     PARM           S001O1  60
|   C*
|   C                     WRITESFLSR
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C*                    SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN       DRRN
|    C                     Z-ADDRRN       WRRN
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN       IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     96    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'3'       RTN225           *COPY
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
|   C           DOPT1     CASEQ'6'       RTN250           *CHK
| 01-C                     END
|    C           *LOVAL    SETLLSA0
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
11===C           RTN210    BEGSR
|    C*
|    C                     SETON                     3031  *ADD MSG
|    C                     EXSR RTN251                     *CLR FIELD
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR RTN253
|   C                     WRITESA0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
12===C           RTN220    BEGSR
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SA05
|    C           KEYSA4    CHAINSA0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     30
|   C                     SETON                     31    *CAN INPUT
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SA05
B2000C           KEYSA5    CHAINSA0                  41
|   C                     EXSR RTN253
|   C                     UPDATSA0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN225....COPY DATA
      *==============================================================*
12===C           RTN225    BEGSR
|    C*
|    C                     SETON                     3031  *ADD MSG
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SA05
|    C           KEYSA4    CHAINSA0                  40
     C           *LOVAL    SETLLSA0
|    C                     EXSR RTN254                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SA05
|   C                     EXSR RTN253
|   C                     WRITESA0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
13===C           RTN230    BEGSR
|    C*
|    C*          RRN       CHAINSFLSR                40
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SA05
|    C           KEYSA4    CHAINSA0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     3031  *NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C*
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 03-C           DLTFLG    IFEQ 'Y'
|   C                     DELETSA0
| 03-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
14===C           RTN240    BEGSR
|    C*
|    C*          RRN       CHAINSFLSR                40
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SA05
|    C           KEYSA4    CHAINSA0L                 40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     3031  *NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN04     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     Z-ADDRRN       DRRN
| 02-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN250....CHK DATA
      *==============================================================*
15===C           RTN250    BEGSR
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SA05
|    C           KEYSA4    CHAINSA0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     3031
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN99     IFEQ '0'
|   C           *IN04     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C                     EXSR RTN253
      *SA14確認碼
|   C                     MOVE *BLANKS   SA14
|   C                     UPDATSA0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
16===CSR         RTN251    BEGSR
|    C*
|    C                     MOVE *BLANKS   DSA01
|    C                     MOVE *BLANKS   DMA03
|    C                     MOVE *BLANKS   MA13
|    C                     MOVE *BLANKS   DSA02
|    C                     MOVE *BLANKS   D#A031
|    C                     MOVE '*'       DSA14
|    C                     MOVE *BLANKS   DSA03
|    C                     MOVE *BLANKS   #C03
|    C                     MOVE *BLANKS   DSA04
|    C                     Z-ADD0         DSA06
|    C                     Z-ADD0         DMA40
|    C                     Z-ADD0         DMA41
|    C                     Z-ADD0         DSA07
|    C                     Z-ADD0         DSA08
|    C                     Z-ADD0         DSA09
|    C                     Z-ADD0         DSA10
|    C                     Z-ADD0         DSA11
|    C                     Z-ADD0         DSA12
|    C                     Z-ADD0         DSA05
|    C                     Z-ADD0         DSA13
|    C                     Z-ADD0         PRICE
|    C*
16===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
17===CSR         RTN252    BEGSR
|    C*
|    C                     MOVE *BLANKS   DMA03
|    C                     MOVE *BLANKS   MA13
|    C                     Z-ADD0         MA40
|    C                     Z-ADD0         MA41
|    C                     Z-ADD0         MA45
|    C                     Z-ADD0         MA46
|    C                     MOVE SA01      DSA01
|    C           KEYMA     CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C* GET品牌
|   C                     MOVE *BLANKS   #A01
|   C                     MOVEL'BRAND'   #A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELDSA011    #A02
|   C           KEY#A     CHAIN#A0                  40
|   C  N40                MOVEL#A03      DMA03
     C                     ELSE
     C                     MOVELMA03      DMA03
| 01-C                     END
|    C* GET通路
|    C                     MOVE SA02      DSA02
|    C                     MOVE *BLANKS   #A01
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVELSA02      #A02
|    C           KEY#A     CHAIN#A0                  40
|    C   40                MOVE *BLANKS   D#A031
|    C  N40                MOVEL#A03      D#A031
|    C                     MOVE SA14      DSA14
|    C* GET型態
|    C                     MOVE SA03      DSA03
|    C           KEY#C     CHAIN#C0                  40
|    C   40                MOVE *BLANKS   #C03
|    C                     MOVE SA04      DSA04
|    C*0                   Z-ADDSA06      DSA06
|    C           SA06      MULT 100       DSA06
      *
M002AC                     CALL 'RES001'
M002AC                     PARM 'MDY'     S001I1  3
M002AC                     PARM DSA05     S001I2  60
M002AC           W6        PARM           S001O1  60
M002AC                     MOVE W6        HB2@F6  6
M002AC                     EXSR HB@68L
M002AC                     MOVE HB2@T8    XSA05   80
M002AC           DATE      IFLE XSA05
M002AC                     Z-ADDXSA05     WDATE   80
M002AC                     ELSE
M002AC                     Z-ADDDATE      WDATE
M002AC                     END
      *
B2000C*          DATE      IFLT MA39
M002MC           WDATE     IFLT MA39
|   C                     Z-ADDMA40      DMA40
|   C                     Z-ADDMA41      DMA41
| 02*C                     ELSE
|   C                     Z-ADDMA45      DMA40
|   C                     Z-ADDMA46      DMA41
| 02-C                     END
     C*售價
     C                     Z-ADD0         PRICE
     C           DSA04     IFEQ 'N'
     C           DMA41     ANDNE0
     C           100       SUB  DSA06     DISCNT  64H
     C***********DMA41     MULT DISCNT    WORK1  114H
     C           DMA41     MULT DISCNT    WORK1  154H
     C           WORK1     DIV  100       PRICE     H
     C                     END
| 03-C           SA04      IFEQ 'A'
|   C                     Z-ADDSA07      DSA07
|   C                     Z-ADDSA08      DSA08
|   C                     Z-ADDSA09      DSA09
|   C                     Z-ADDSA10      DSA10
|   C                     Z-ADDSA11      DSA11
|   C                     Z-ADDSA12      DSA12
| 03*C                     ELSE
|   C                     Z-ADD0         DSA07
|   C                     Z-ADD0         DSA08
|   C                     Z-ADD0         DSA09
|   C                     Z-ADD0         DSA10
|   C                     Z-ADD0         DSA11
|   C                     Z-ADD0         DSA12
| 03-C                     END
|    C* GET轉換日期
M001AC                     Z-ADDSA05      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           DSA05     PARM           S001O1  60
|    C* GET轉換日期
M001AC                     Z-ADDSA13      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SA13      S001I2  60
M001MC                     PARM W6        S001I2  60
B2MODC           DSA13     PARM           S001O1  60
|    C* FOR UPDAT
|    C                     MOVE SA02      HSA02
|    C                     MOVE SA03      HSA03
|    C                     MOVE SA04      HSA04
B2000C                     Z-ADDSA05      WSA05
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDSA05     HSA05
B2NEWC                     MOVE DSA05     HB2@F6  6
B2NEWC                     EXSR HB@68R                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    HSA05
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
18===CSR         RTN253    BEGSR
|    C*
|    C*
|    C                     MOVE DSA01     SA01
|    C                     MOVE DSA02     SA02
|    C                     MOVE DSA03     SA03
|    C                     MOVE DSA14     SA14
|    C                     MOVE DSA04     SA04
| 01-C           DSA04     IFEQ 'A'
|   C                     Z-ADD0         SA06
|   C                     Z-ADDDSA07     SA07
|   C                     Z-ADDDSA08     SA08
|   C                     Z-ADDDSA09     SA09
|   C                     Z-ADDDSA10     SA10
|   C                     Z-ADDDSA11     SA11
|   C                     Z-ADDDSA12     SA12
| 01*C                     ELSE
      *折扣率
|   C           DSA06     DIV  100       SA06
|   C                     Z-ADD0         SA07
|   C                     Z-ADD0         SA08
|   C                     Z-ADD0         SA09
|   C                     Z-ADD0         SA10
|   C                     Z-ADD0         SA11
|   C                     Z-ADD0         SA12
| 01-C                     END
|    C* GET轉換日期
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SA05
|    C* GET轉換日期
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA13     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    SA13
|    C**
B2000C                     Z-ADDDATE      SAXX
B2000C                     TIME           SAYY
|    C                     MOVE $USER     SAZZ
|    C*
18===CSR                   ENDSR
      *==============================================================*
      *          RTN254....MOVE DATA TO SCREEN
      *==============================================================*
17===CSR         RTN254    BEGSR
|    C*
|    C                     MOVE *BLANKS   DMA03
|    C                     MOVE *BLANKS   MA13
|    C                     Z-ADD0         MA40
|    C                     Z-ADD0         MA41
|    C                     Z-ADD0         MA45
|    C                     Z-ADD0         MA46
|    C                     MOVE SA01      DSA01
|    C           KEYMA     CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C* GET品牌
|   C                     MOVE *BLANKS   #A01
|   C                     MOVEL'BRAND'   #A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELDSA011    #A02
|   C           KEY#A     CHAIN#A0                  40
|   C  N40                MOVEL#A03      DMA03
     C                     ELSE
     C                     MOVELMA03      DMA03
| 01-C                     END
|    C* GET通路
|    C                     MOVE SA02      DSA02
|    C                     MOVE *BLANKS   #A01
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVELSA02      #A02
|    C           KEY#A     CHAIN#A0                  40
|    C   40                MOVE *BLANKS   D#A031
|    C  N40                MOVEL#A03      D#A031
|    C                     MOVE SA14      DSA14
|    C* GET型態
|    C                     MOVE SA03      DSA03
|    C           KEY#C     CHAIN#C0                  40
|    C   40                MOVE *BLANKS   #C03
|    C                     MOVE SA04      DSA04
|    C                     Z-ADDSA06      DSA06
|    C           SA06      MULT 100       DSA06
      *
M002AC                     CALL 'RES001'
M002AC                     PARM 'MDY'     S001I1  3
M002AC                     PARM DSA05     S001I2  60
M002AC           W6        PARM           S001O1  60
M002AC                     MOVE W6        HB2@F6  6
M002AC                     EXSR HB@68L
M002AC                     MOVE HB2@T8    XSA05   80
M002AC           DATE      IFLE XSA05
M002AC                     Z-ADDXSA05     WDATE   80
M002AC                     ELSE
M002AC                     Z-ADDDATE      WDATE
M002AC                     END
      *
B2000C*          DATE      IFLT MA39
M002MC           WDATE     IFLT MA39
|   C                     Z-ADDMA40      DMA40
|   C                     Z-ADDMA41      DMA41
| 02*C                     ELSE
|   C                     Z-ADDMA45      DMA40
|   C                     Z-ADDMA46      DMA41
| 02-C                     END
     C*售價
     C                     Z-ADD0         PRICE
     C           DSA04     IFEQ 'N'
     C           DMA41     ANDNE0
     C           100       SUB  DSA06     DISCNT  64H
     C           DMA41     MULT DISCNT    WORK1  154H
     C           WORK1     DIV  100       PRICE     H
     C                     END
| 03-C           SA04      IFEQ 'A'
|   C                     Z-ADDSA07      DSA07
|   C                     Z-ADDSA08      DSA08
|   C                     Z-ADDSA09      DSA09
|   C                     Z-ADDSA10      DSA10
|   C                     Z-ADDSA11      DSA11
|   C                     Z-ADDSA12      DSA12
| 03*C                     ELSE
|   C                     Z-ADD0         DSA07
|   C                     Z-ADD0         DSA08
|   C                     Z-ADD0         DSA09
|   C                     Z-ADD0         DSA10
|   C                     Z-ADD0         DSA11
|   C                     Z-ADD0         DSA12
| 03-C                     END
|    C* GET轉換日期
M001AC                     Z-ADDSA05      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           DSA05     PARM           S001O1  60
|    C* GET轉換日期
M001AC                     Z-ADDSA13      W6
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           DSA13     PARM           S001O1  60
|    C* FOR UPDAT
|    C                     MOVE SA02      HSA02
|    C                     MOVE SA03      HSA03
|    C                     MOVE SA04      HSA04
B2000C                     Z-ADDSA05      WSA05
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADDDSA05     HSA05
B2NEWC                     MOVE DSA05     HB2@F6  6
B2NEWC                     EXSR HB@68R                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    HSA05
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     MOVE '*'       DSA14
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN270....F5 -- 參考資料
      *==============================================================*
19===CSR         RTN270    BEGSR
|    C*
|    C                     EXSR RTN280
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 01-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 01-C                     END
|    C                     SETON                     99
|    C*
19===C                     ENDSR
      *==============================================================*
      *          RTN280....CHECK 'SC02' SCREEN
      *==============================================================*
20===CSR         RTN280    BEGSR
|    C*
|    C                     MOVE *BLANK    DMA03
|    C                     MOVE *BLANK    MA13
|    C                     Z-ADD0         DMA40
|    C                     Z-ADD0         DMA41
| 01-C           DSA01     IFEQ *BLANKS
|   C                     SETON                     609599
| 01*C                     ELSE
| 02-C           DSA013    IFNE *BLANKS
|   C           DSA01     CHAINMA0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     SETON                     609099
| 03*C                     ELSE
     C                     MOVELMA03      DMA03
      *
M002AC                     CALL 'RES001'
M002AC                     PARM 'MDY'     S001I1  3
M002AC                     PARM DSA05     S001I2  60
M002AC           W6        PARM           S001O1  60
M002AC                     MOVE W6        HB2@F6  6
M002AC                     EXSR HB@68L
M002AC                     MOVE HB2@T8    XSA05   80
M002AC           DATE      IFLE XSA05
M002AC                     Z-ADDXSA05     WDATE   80
M002AC                     ELSE
M002AC                     Z-ADDDATE      WDATE
M002AC                     END
      *
B2000C*          DATE      IFLT MA39
M002MC           WDATE     IFLT MA39
|   C                     Z-ADDMA40      DMA40
|   C                     Z-ADDMA41      DMA41
| 04*C                     ELSE
|   C                     Z-ADDMA45      DMA40
|   C                     Z-ADDMA46      DMA41
| 04-C                     END
| 03-C                     END
| 02*C                     ELSE
|   C           DSA01     SETLLMA0
|   C                     READ MA0                      40
|   C                     MOVE *BLANK    DMA03
|   C                     MOVE *BLANK    MA13
|   C                     Z-ADD0         DMA40
|   C                     Z-ADD0         DMA41
| 05-C           *IN40     IFEQ '0'
| 06-C           MA01L     IFNE DSA012
|   C                     SETON                     609099
| 06*C                     ELSE
|   C                     MOVEL*BLANKS   #A01
|   C                     MOVEL'BRAND'   #A01
|   C                     MOVEL*BLANKS   #A02
|   C                     MOVELDSA011    #A02
|   C           KEY#A     CHAIN#A0                  40
| 07-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      DMA03
| 07-C                     END
| 06-C                     END
| 05*C                     ELSE
|   C                     SETON                     609099
| 05-C                     END
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END280
|    C*
| 08-C           DSA02     IFEQ *BLANKS
|   C                     MOVE *BLANKS   D#A031
|   C                     SETON                     619599
| 08*C                     ELSE
|   C                     MOVE *BLANKS   #A01
|   C                     MOVEL'DISTRUBT'#A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELDSA02     #A02
|   C           KEY#A     CHAIN#A0                  40
| 09-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A031
| 09*C                     ELSE
|   C                     SETON                     619099
|   C                     MOVE *BLANKS   D#A031
| 09-C                     END
| 08-C                     END
|    C   99                GOTO END280
|    C* CHK型態
| 10-C           DSA03     IFEQ *BLANKS
|   C                     SETON                     629599
|   C                     MOVE *BLANKS   #C03
| 10*C                     ELSE
|   C           KEY#C     CHAIN#C0                  40
| 11-C           *IN40     IFEQ '1'
|   C                     SETON                     629099
|   C                     MOVE *BLANKS   #C03
| 11*C                     ELSE
|   C                     MOVEL#C03      D#C03            *FOR SCR001
| 11-C                     END
| 10-C                     END
|    C   99                GOTO END280
|    C*
| 12-C           DSA04     IFEQ *BLANKS
|   C                     SETON                     639599
| 12-C                     END
|    C   99                GOTO END280
|    C*
| 12-C           DSA04     IFEQ 'S'
|   C*          DSA04     OREQ 'N'
| 13-C           DSA06     IFEQ 0
|   C                     SETON                     649599
| 13-C                     END
| 12-C                     END
|    C   99                GOTO END280
     C*售價
     C                     Z-ADD0         PRICE
     C           DSA04     IFEQ 'N'
     C           DMA41     ANDNE0
     C           100       SUB  DSA06     DISCNT  64H
     C           DMA41     MULT DISCNT    WORK1  154H
     C           WORK1     DIV  100       PRICE     H
     C                     END
|    C*
| 14-C           DSA04     IFEQ 'A'
|   C           DSA07     ANDEQ0                          *07 = 0
|   C                     SETON                     6566
|   C                     SETON                     9599
| 14-C                     END
|    C   99                GOTO END280
| 15-C           DSA04     IFEQ 'A'
|   C           DSA07     ANDGEDSA08                      *07 >= 08
|   C                     SETON                     6566
|   C                     SETON                     9099
| 15-C                     END
|    C   99                GOTO END280
| 16-C           DSA04     IFEQ 'A'
|   C           DSA09     ANDNE0                          *07 >= 09
|   C           DSA07     ANDGEDSA09
|   C                     SETON                     678899
| 16-C                     END
|    C   99                GOTO END280
| 17-C           DSA04     IFEQ 'A'
|   C           DSA09     ANDNE0                          *09 >= 10
|   C           DSA09     ANDGEDSA10
|   C                     SETON                     6768
|   C                     SETON                     9099
| 17-C                     END
|    C   99                GOTO END280
| 18-C           DSA04     IFEQ 'A'
|   C           DSA10     ANDNE0                          *08 >= 10
|   C           DSA08     ANDGEDSA10
|   C                     SETON                     688899
| 18-C                     END
|    C   99                GOTO END280
| 19-C           DSA04     IFEQ 'A'
|   C           DSA11     ANDNE0                          *09 >= 11
|   C           DSA09     ANDGEDSA11
|   C                     SETON                     698899
| 19-C                     END
|    C   99                GOTO END280
| 20-C           DSA04     IFEQ 'A'
|   C           DSA11     ANDNE0                          *11 >= 12
|   C           DSA11     ANDGEDSA12
|   C                     SETON                     6970
|   C                     SETON                     9099
| 20-C                     END
|    C   99                GOTO END280
| 21-C           DSA04     IFEQ 'A'
|   C           DSA12     ANDNE0                          *10 >= 12
|   C           DSA10     ANDGEDSA12
|   C                     SETON                     708899
| 21-C                     END
|    C   99                GOTO END280
|    C*
B2CHKC           DSA05     IFEQ *ZEROS
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     719599
| 22*C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DSA05     P0901I  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0901O  1
| 23-C           P0901O    IFEQ 'N'
|   C                     SETON                     719299
| 23-C                     END
| 22-C                     END
|    C   99                GOTO END280
|    C*
B2CHKC           DSA13     IFEQ *ZEROS
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     729599
| 24*C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DSA13     P0901I  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0901O  1
| 25-C           P0901O    IFEQ 'N'
|   C                     SETON                     729299
| 25-C                     END
| 24-C                     END
|    C   99                GOTO END280
|    C*
|    C* GET轉換日期
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    W81     80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA13     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O2  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    W82     80
      *截止日期需＞＝生效日期ＡＮＤ系統日期
B2000C*M001M     S001O2    IFLT S001O1
M001MC           W82       IFLT W81
|   C*M001M     S001O2    ORLT DATE
M001MC           W82       ORLT DATE
|   C                     SETON                     729299
| 26-C                     END
|    C   99                GOTO END280
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSA05     S001I2  60
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    DKSA5
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          DSA02     IFNE HSA02
B2OLDC*          DSA03     ORNE HSA03
B2OLDC*          DSA04     ORNE HSA04
B2OLDC*          DSA05     ORNE HSA05
B2OLDC*          DOPT1     OREQ '1'
B2OLDC*          DOPT1     OREQ '3'
B2NEWC                     MOVE DSA05     HB2@F6  6
B2NEWC                     EXSR HB@68R                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    H@8N01  80
B2NEWC           DSA02     IFNE HSA02
B2NEWC           DSA03     ORNE HSA03
B2NEWC           DSA04     ORNE HSA04
B2NEWC           H@8N01    ORNE HSA05
B2NEWC           DOPT1     OREQ '1'
B2NEWC           DOPT1     OREQ '3'
B2INF *CVR0001 sev.00 Field DSA02 is not a date or year
B2INF *CVR0001 sev.00 Field HSA02 is not a date or year
B2INF *CVR0001 sev.00 Field DSA03 is not a date or year
B2INF *CVR0001 sev.00 Field HSA03 is not a date or year
B2INF *CVR0001 sev.00 Field DSA04 is not a date or year
B2INF *CVR0001 sev.00 Field HSA04 is not a date or year
B2INF *CVR0001 sev.00 Field DOPT1 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2000C           KEYSA1    CHAINSA0                  41
|   C  N41                SETON                     9399
|   C  N41                SETON                     606162
|   C  N41                SETON                     6371
| 27-C                     END
|    C*
20===CSR         END280    ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
21===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
21===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
22===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
| 01-C           APPSCR    IFEQ 'SCR002'
|   C**
| 02-C           DOPT1     IFEQ '1'
| 02-C           DOPT1     OREQ '3'
|   C*
| 03-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE16
|   C           D#COL     ANDLE24
|   C                     CALL 'WDS001'
|   C           DSA01     PARM DSA01     WPARM1  9
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 02-C                     END
|   C*
| 04-C           D#ROW     IFEQ 8
|   C           D#COL     ANDEQ16
|   C                     CALL 'WDS012'
|   C                     PARM 'DISTRUBT'S012I1  8
|   C           DSA02     PARM DSA02     S012O1 10
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE16
|   C           D#COL     ANDLE17
|   C*
| 06-C           DSA02     IFNE *BLANK
|   C                     CALL 'WDS009'
|   C                     PARM DSA02     S009I1  1
|   C           DSA03     PARM DSA03     S009O1  2
|   C                     GOTO ENDF4
| 06*C                     ELSE
|   C                     SETON                     619599
| 06-C                     END
| 05-C                     END
|   C*
| 01-C                     END
|    C*
22===C           ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
23===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     8099
|    C*
23===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
**
新增修改拷貝刪除查詢確認
