     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.13 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 123199 = 123129
     A*---------------------------------------------------------------
     FSOA014D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      601 6040DATE
     I                                      601 6020DATEY
     I                                      603 6040DATEM
     I                                      605 6100DSC39S
     I                                      611 6160DSC39E
M001MI                                      617 6240YSC39S
M001MI                                      625 6320YSC39E
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N10N96          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         DATE
M002MC*                    Z-ADD010101    DSC39S
M002MC                     Z-ADD010192    DSC39S
|    C                     Z-ADD$EGMDY    DSC39E
|    C                     Z-ADD0         YSC39S
|    C                     Z-ADD0         YSC39E
M001AC                     Z-ADD0         W6      60
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C****
|    C*(CHECK DATE)-°e³f¤é´Á
|    C****
| 07-C           DSC39S    IFEQ 0
M002MC*                    Z-ADD010101    DSC39S
M002MC                     Z-ADD010192    DSC39S
| 07-C                     END
|    C*
| 08-C           DSC39E    IFEQ 0
M002MC                     Z-ADD123129    DSC39E
| 08-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSC39S    P0901I  60
|    C                     PARM           P0911O  1
| 09-C           P0911O    IFEQ 'N'
|   C                     SETON                     609599
| 09-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSC39E    P0901I  60
|    C                     PARM           P0911O  1
| 10-C           P0911O    IFEQ 'N'
|   C                     SETON                     619599
| 10-C                     END
|    C   99                GOTO END100
|    C****
|    C*(CHANGE END-DATE TO CHINESE DATE)
|    C****
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC39S    S001I2  60
M001AC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSC39S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC39E    S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSC39E
|    C*
| 11-C           YSC39S    IFGT YSC39E
|   C                     SETON                     6061
|   C                     SETON                     9499
| 11-C                     END
|    C   99                GOTO END100
     C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
