     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : ARA001                                     *
     A*    AUTHOR       : A1139  JANE                                *
     A*    DATE WRITTEN : 81/03/10                                   *
     A*    UPDATE DATE  : 81/03/12                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    PROCEDURE    :發票編號資料設定 (A/U/D/I)                *
     A****************************************************************
     FARAAPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FARAALF  IF  E           K        DISK
     F            AA0                               KRENAMEAA0L
     FPA#BPF  IF  E           K        DISK
     FARA001D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     E                    WFUN2  26  26  1
     E*: A/U/D/I AUT
     E                    WA01        5  1
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I**                                    140 140 $RMK02
 @   I**                                    141 141 $RMK03
     I**                                    162 1620$EVR
     I**                                    125 1270$CPY
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I                                      506 506 $PURID
     I                                      507 508 $TRNID
     I                                      509 513 $APAUT
     I                                      514 521 $#101
M001AI                                      201 2080$EG8
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I*
     I            DS
     I                                        1   2 DD
     I                                        1   1 AA041
     I                                        2   2 AA042
     I*
     I            DS
     I                                        1   40DAA02
     I                                        1   20DAAYY
     I                                        3   40DAAMM
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN    40
     C                     MOVE *BLANKS   APPSCR  6
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C*
     C* {FOR SUBFILE (SYS+PGM CONTROL)}
     C*
     C                     MOVE *BLANK    WBOTOM  1
M001DC*          *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BOTTOM
M001DC*          *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BOTTOM
     C           *LIKE     DEFN RRN       WRRN
     C           *LIKE     DEFN RRN       WPRCD
     C           *LIKE     DEFN RRN       DSPRCD
     C*
B2MODC           *LIKE     DEFN DBGN2     WBGN2 + 2        *SUBFIL BOTTOM
B2000C           *LIKE     DEFN AA02      WAA02
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYAA1    KLIST
     C                     KFLD           DAA01
     C                     KFLD           WAA02
     C                     KFLD           DAA03
     C           KEYAA2    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           WBGN2
M001DC*          KEYAA3    KLIST
M001DC*                    KFLD           BBGN1
M001DC*                    KFLD           BBGN2
     C           KEYAA4    KLIST
     C                     KFLD           AA01
     C                     KFLD           HAA02
     C                     KFLD           AA03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     MOVE *ALL'0'   *IN,60
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN120
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
B2MODC                     Z-ADD0         DATE    80
|    C*M001D               CALL 'RES001'
|    C*M001D               PARM 'MDY'     S001I1  3
B2???C*M001D               PARM $EGMDY    S001I2  80
B2INF *CVR3012 sev.30 Field $EGMDY contains more than one year
B2INF *CVR3012 sev.30 Field S001I2 contains more than one year
B2MODC*M001D     DATE      PARM           S001O1  80
M001AC                     Z-ADD$EG8      DATE
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....CHAIN 公司簡稱
      *==============================================================*
02===C           RTN110    BEGSR
|    C           DAA01     CHAIN#B0                  20
| 01-C           *IN20     IFEQ '1'
|   C                     MOVE *BLANK    #B03
|   C                     SETON                     608999
| 01-C                     END
02===C                     ENDSR
      *==============================================================*
      *          RTN11B....CHANGE DATE TO (CHINESE-DATE)
      *==============================================================*
03===C           RTN11B    BEGSR
B2???C*          AA02      SUB  1100      DAA02            *中國年
M001MC           AA02      SUB  191100    DAA02            *中國年
B2INF *CVR0001 sev.00 Field DAA02 is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code SUB
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2TRCC*M001M               Z-ADDAA02      HAA02            *西元年
M001MC                     Z-ADDAA02      HAA02   60       *西元年
03===C                     ENDSR
      *==============================================================*
      *          RTN120....F6(ADD)
      *==============================================================*
04===C           RTN120    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9699
| 01-C                     ELSE
|    C                     EXSR RTN200
| 02-C           DRRN      IFGT 0
|   C           DRRN      SUB  1         HRRN
| 02-C                     END
|    C                     EXSR RTN191
|    C                     EXSR RTN192
| 01-C                     END
|    C                     SETOF                     12
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
05===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C                     Z-ADD0         HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN       HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
06===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR                  4040*NF
| 01-C           *IN40     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN       DRRN
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C                     UPDATSFLSR
|   C                     READCSFLSR                    40*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
07===CSR         RTN180    BEGSR
|    C*
|    C*( CHK AUTHORITY )
|    C*
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
|    C*( CHK A= 2,4 )
|    C*
B2???C           KEYAA4    CHAINAA0                  40
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields HAA02 and AA02 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
| 02-C           DOPT1     IFEQ '2'
| 03-C           AA08      IFEQ 'V'
|   C                     SETON                     608899
| 03-C                     END
| 02-C                     END
|    C   99                GOTO END180
|    C*
| 04-C           DOPT1     IFEQ '4'
| 05-C           AA08      IFEQ 'V'
|   C                     SETON                     608899
| 05*C                     ELSE
| 06-C           AA07      IFNE 0
|   C                     SETON                     608799
| 06-C                     END
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN       DRRN
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
08===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         WRRN
|    C                     Z-ADD10        WPRCD
|    C*                    Z-ADD0         DSPRCD
|    C           HRRN      DIV  WPRCD     DSPRCD
|    C                     MULT WPRCD     DSPRCD
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR
|    C                     SETOF                     52
B2???C*M001M     DBGN2     ADD  1100      WBGN2
M001MC           DBGN2     ADD  191100    WBGN2
B2INF *CVR0001 sev.00 Field DBGN2 is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code ADD
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2000C           KEYAA2    SETLLAA0L
|    C*
08===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
09===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN       DRRN
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
09===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
10===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                         54
|    C                     Z-ADDWRRN      RRN
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN       DOWLTDSPRCD
|   C                     READ AA0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     EXSR RTN11B                     *CHG TO CHINESE-DATE
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN       DRRN
|    C                     Z-ADDRRN       WRRN
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
11===C           RTN195    BEGSR
|    C*
| 01-C           RRN       IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     94    *NODATA
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
12===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C           *LOVAL    SETLLAA0
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
13===C           RTN210    BEGSR
|    C*
|    C                     SETON                     303132*ADD MSG
|    C                     EXSR RTN251                     *CLR FIELD
|    C*
|    C                     MOVE *BLANK    #B03             *CLR公司簡稱
|    C                     Z-ADD0         AA07
|    C                     MOVE *BLANK    AA08
|    C                     Z-ADD0         AA09
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     EXSR RTN280
|   C*
| 03-C           *IN99     IFEQ '0'
|   C                     EXSR RTN110                     *CHAIN #B03
|   C                     EXSR RTN253                     SCREN-->FILE
|   C                     WRITEAA0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
14===C           RTN220    BEGSR
|    C*
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
| 02-C           AA07      IFNE 0
|   C                     SETOF                     32    *PROTECT字軌
| 02*C                     ELSE
|   C                     SETON                     32
| 02-C                     END
|   C*
|   C                     SETOF                     30    *PROTECT KEY
|   C                     SETON                     31    *UNDER LINE
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 03-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     EXSR RTN280
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     EXSR RTN253                     *SCRN-->FILE
|   C                     UPDATAA0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 03-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
15===C           RTN230    BEGSR
|    C*
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     303132*NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 03-C           DLTFLG    IFEQ 'Y'
B2???C           KEYAA4    CHAINAA0                  41
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields HAA02 and AA02 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
|   C                     DELETAA0
| 03-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 02-C                     END
|   C*
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
16===C           RTN240    BEGSR
|    C*
B2???C           KEYAA4    CHAINAA0L                 40
B2INF *CVR5006 sev.50 The converter tool cannot handle add/remove century
B2INF *   between fields HAA02 and AA02 for key-field usage. Please
B2INF *   manually define a new KLIST with proper field length and use it
B2INF *   instead
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     303132*NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
|   C*                    Z-ADDRRN       DRRN
| 02-C                     END
|   C*
| 01-C                     END
|    C*
16===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
17===CSR         RTN251    BEGSR
|    C*
|    C                     MOVE *BLANK    DAA01
|    C                     Z-ADD0         DAA02
|    C                     Z-ADD0         DAA03
|    C                     MOVE *BLANK    DAA04
|    C                     Z-ADD0         DAA05
|    C                     Z-ADD0         DAA06
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
18===CSR         RTN252    BEGSR
|    C*
|    C                     MOVE AA01      DAA01
|    C                     EXSR RTN110                     *CHAIN #B03
|    C                     Z-ADDAA03      DAA03
|    C                     MOVE AA04      DAA04
|    C                     Z-ADDAA05      DAA05
|    C                     Z-ADDAA06      DAA06
|    C*
18===CSR                   ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
19===CSR         RTN253    BEGSR
|    C*
|    C                     MOVE DAA01     AA01
B2???C*M001M     DAA02     ADD  1100      AA02
M001MC           DAA02     ADD  191100    AA02
B2INF *CVR0001 sev.00 Field DAA02 is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code ADD
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|    C                     Z-ADDDAA03     AA03
|    C                     MOVE DAA04     AA04
|    C                     Z-ADDDAA05     AA05
|    C                     Z-ADDDAA06     AA06
|    C*
B2000C                     Z-ADDDATE      AAXX
B2000C                     TIME           AAYY
|    C                     MOVE $USER     AAZZ
|    C*
19===C                     ENDSR
      *==============================================================*
      *          RTN280....CHECK 'SC02' SCREEN
      *==============================================================*
20===CSR         RTN280    BEGSR
|    C*
| 01-C           DOPT1     IFEQ '1'
| 02-C           DAA01     IFEQ *BLANKS
|   C                     SETON                     609399
| 02*C                     ELSE
|   C                     EXSR RTN110                     *CHAIN #B03
| 02-C                     END
|   C   99                GOTO END280
|   C**********
| 03-C           DAA02     IFEQ 0
|   C                     SETON                     619399
| 03-C                     END
|   C   99                GOTO END280
|   C*(CHK月份)
| 04-C           DAAMM     IFLT 1
|   C           DAAMM     ORGT 12
|   C                     SETON                     619099
| 04-C                     END
|   C   99                GOTO END280
|   C**********
| 05-C           DAA03     IFEQ 0
|   C                     SETON                     629399
| 05-C                     END
|   C   99                GOTO END280
|   C**(CHK KEY是否已存在檔案中)***
|   C*
B2???C*M001M     DAA02     ADD  1100      WAA02
M001MC           DAA02     ADD  191100    WAA02
B2INF *CVR0001 sev.00 Field DAA02 is not a date or year
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code ADD
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2000C           KEYAA1    SETLLAA0                      41
| 06-C           *IN41     IFEQ '1'
|   C                     SETON                     606162
|   C                     SETON                       9199
| 06-C                     END
| 01-C                     END
|    C   99                GOTO END280
|    C**********
| 07-C           DAA04     IFEQ *BLANKS
|   C                     SETON                     639399
| 07-C                     END
|    C   99                GOTO END280
|    C*
|    C                     MOVE DAA04     DD
|    C                     Z-ADD1         WF      10
|    C           AA041     LOKUPWFUN2,WF                 10
| 08-C           *IN10     IFEQ '0'                        *NOT FOUND
|   C                     SETON                     638999
| 08-C                     END
|    C   99                GOTO END280
|    C*
|    C*                    Z-ADD1         WF      10
|    C*          AA042     LOKUPWFUN2,WF                 10
| 09-C*          *IN10     IFEQ '0'                        *NOT FOUND
|   C*                    SETON                     638999
| 09-C*                    END
|    C*  99                GOTO END280
|    C*
|    C**********
| 10-C           DAA05     IFEQ 0
|   C                     SETON                     649399
| 10-C                     END
|    C   99                GOTO END280
|    C**********
| 11-C           DAA06     IFEQ 0
|   C                     SETON                     659399
| 11-C                     END
|    C   99                GOTO END280
|    C*
|    C**********
|    C*
| 12-C           DOPT1     IFEQ '2'
|   C**
| 13-C           AA07      IFNE 0
| 14-C           DAA05     IFGT AA07
|   C                     SETON                     648999
| 14-C                     END
|   C   99                GOTO END280
| 15-C           DAA06     IFLT AA07
|   C                     SETON                     658999
| 15-C                     END
|   C   99                GOTO END280
| 13-C                     END
|   C**
| 12-C                     END
|    C*
| 16-C           DAA06     IFLE DAA05
|   C                     SETON                     658999
| 16-C                     END
|    C   99                GOTO END280
|    C*
20===CSR         END280    ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
21===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
22===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     2899
|    C*
22===C                     ENDSR'*DETC'
**
新增修改      刪除查詢
**
ABCDEFGHIJKLMNOPQRSTUVWXYZ
