     A*===============================================================
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001 |MICHELLE|        |
     A*---------------------------------------------------------------
     A*===============================================================
     FSOSCPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSDPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSDPFX IF  E           K        DISK
     F            SD0                               KRENAMESDX0
     FSOSEPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSFPF  IF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMEPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
     FSOA0113DCF  E                    WORKSTN
     F                                        RRN1  KSFILE SFLSR1
     E*: FUNCTION DATA :
     E*                   WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        8  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I*                                     135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I                                      140 140 $RMK02
 @   I                                      141 141 $RMK03
M001AI                                      201 2080$EG8
     I* 單價AUT
     I                                      508 508 $AUT1
     I* 額度AUT
     I                                      509 509 $AUT2
     I* 逾期AUT
     I                                      510 510 $AUT3
     I* 搭贈AUT
     I                                      511 511 $AUT4
     I* 試飲AUT
     I                                      512 512 $AUT5
     I* 換貨AUT
     I                                      522 522 $AUT6
     I* 單價AUT
     I                                      601 601 A1
     I* 額度AUT
     I                                      602 602 A2
     I* 逾期AUT
     I                                      603 603 A3
     I* 搭贈AUT
     I                                      604 604 A4
     I* 試飲AUT
     I                                      605 605 A5
     I* 換貨AUT
     I                                      606 606 A6
     I***
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           DSC02     PARM           A112O1 12
     C*          *IN12     PARM *IN12     IN12    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEYME     KLIST
     C                     KFLD           SM04
     C                     KFLD           SM05
     C           KEYSC     KLIST
     C                     KFLD           DSC02
     C           KEYSD     KLIST
     C                     KFLD           DSC02
     C                     KFLD           DSD03
     C           KEYSF     KLIST
     C                     KFLD           DSC02
     C                     KFLD           DSD03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN193                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C           *IN12     ANDEQ'0'                        *03    OFF
    C*
    C                     EXSR RTN170
    C  N03N12             EXSR RTN195
    C*
  01-C                     END
  02-C           *IN03     IFEQ '1'
    C                     SETOF                     03
    C                     SETON                     12
  02*C                     ELSE
    C                     SETOF                     12
  02-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
      *
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
      *
|    C           DSC02     CHAINSC0                  20
|    C   20      DSC02     CHAINSE0                  21
| 03-C           *IN20     IFEQ '0'
|   C                     MOVELSC03      SM03
|   C                     MOVELSC04      SM04
|   C                     MOVELSC05      SM05
B2TRCC                     Z-ADDSC08      SM08    80
|    C                     MOVELSC18      SM20
| 03*C                     ELSE
|   C                     MOVELSE03      SM03
|   C                     MOVELSE04      SM04
|   C                     MOVELSE05      SM05
B2TRCC                     Z-ADDSE06      SM08
|    C                     MOVELSE12      SM20
| 03-C                     END
|    C*
|    C                     MOVELSC03      #201
|    C                     MOVELSC03      #202
|    C           KEY#2     CHAIN#20                  40
|    C           KEYME     CHAINME0                  40
|    C*
     C                     Z-ADDSM08      WSM08   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2???C                     PARM WSM08     S001I2  60
B2MODC           DSC08     PARM           S001O1  60
     C           *LOVAL    SETLLSC0
     C           *LOVAL    SETLLSE0
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....READC SFL
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN03     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
      *
| 05-C           *IN20     IFEQ '0'
|   C           DSC02     CHAINSC0                  40
|   C           *LOVAL    SETLLSC0
| 06-C           SC29      IFNE *BLANKS
|   C                     SETON                     608999
| 06-C                     END
| 05*C                     ELSE
|   C           DSC02     CHAINSE0                  40
|   C           *LOVAL    SETLLSE0
| 07-C           SE25      IFNE *BLANKS
|   C                     SETON                     608999
| 07-C                     END
| 05-C                     END
      *
|   C  N99                EXSR RTN181                     *CALL SUBPGM
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
      *
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     97
| 05-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
03===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C   99                GOTO END180
|    C*
|    C*
03===C           END180    ENDSR
      *==============================================================*
      *          RTN181....CALL SUBPGM
      *==============================================================*
04===CSR         RTN181    BEGSR
|    C*
| 01-C           DOPT1     CASEQ'2'       RTN182           核准
|   C           DOPT1     CASEQ'4'       RTN184           核准取消
| 01-C                     END
|    C*
|    C*
04===C           END181    ENDSR
      *==============================================================*
      *          RTN182....UPD DATA 核准
      *==============================================================*
05===C           RTN182    BEGSR
|    C*
|    C           RRN1      CHAINSFLSR1               40
| 01-C           *IN20     IFEQ '0'
|   C*
|   C           KEYSC     CHAINSC0                  40
| 02-C           SC29      IFEQ *BLANKS
|   C*
| 05-C           A5        IFEQ 'Y'
|   C           $AUT5     ANDEQ'Y'
|   C           SC26      ANDEQ'*'
|   C                     MOVE *BLANKS   SC26              試飲
|   C*                    MOVE *BLANKS   SM12
| 05-C                     END
|   C*                    MOVE *BLANKS   SM13
|   C* CHANGE 訂單狀態
| 06-C           SC22      IFEQ '*'
|   C           SC23      OREQ '*'
|   C           SC24      OREQ '*'
|   C           SC25      OREQ '*'
|   C           SC26      OREQ '*'
|   C                     MOVE '*'       SC13
| 06*C                     ELSE
|   C                     MOVE *BLANKS   SC13
| 06-C                     END
|   C* GET異動日期
|   C                     Z-ADD$EG8      SCXX
|   C* GET異動時間／人員
|   C                     TIME           SCYY
|   C                     MOVE $USER     SCZZ
|   C*
|   C                     UPDATSC0
| 02*C                     ELSE
|   C                     SETON                     608999
|   C           *LOVAL    SETLLSC0
|   C                     GOTO END182
| 02-C                     END
| 01-C                     END
|    C*
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
05===C           END182    ENDSR
      *==============================================================*
      *          RTN184....DLT DATA 核准取消
      *==============================================================*
06===C           RTN184    BEGSR
|    C*
|    C           RRN1      CHAINSFLSR1               40
| 01-C           *IN20     IFEQ '0'
|   C           KEYSC     CHAINSC0                  40
| 02-C           SC29      IFEQ *BLANKS
|   C*
| 05-C           A5        IFEQ 'Y'
|   C           $AUT5     ANDEQ'Y'
|   C           SC26      ANDEQ' '
|   C                     MOVE '*'       SC26              試飲
|   C*                    MOVE '*'       SM12
| 05-C                     END
|   C*                    MOVE *BLANKS   SM13
|   C* CHANGE 訂單狀態
| 06-C           SC22      IFEQ '*'
|   C           SC23      OREQ '*'
|   C           SC24      OREQ '*'
|   C           SC25      OREQ '*'
|   C           SC26      OREQ '*'
|   C                     MOVE '*'       SC13
| 06*C                     ELSE
|   C                     MOVE *BLANKS   SC13
| 06-C                     END
|   C* GET異動日期
|   C                     Z-ADD$EG8      SCXX
|   C* GET異動時間／人員
|   C                     TIME           SCYY
|   C                     MOVE $USER     SCZZ
|   C*
|   C                     UPDATSC0
| 02*C                     ELSE
|   C                     SETON                     608999
|   C           *LOVAL    SETLLSC0
|   C                     GOTO END184
| 02-C                     END
| 01-C                     END
|   C*
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
06===C           END184    ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
07===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD1         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
| 01-C           *IN20     IFEQ '0'
|   C           KEYSD     SETLLSD0
     C                     ELSE
|   C           KEYSF     SETLLSF0
     C                     END
      *
|   C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|   C*
|   C                     SETOF                     54
| 01-C           *IN20     IFEQ '0'
|   C           DSC02     READESD0                      46
| 01*C                     ELSE
|   C           DSC02     READESF0                      46
| 01-C                     END
      *
| 02-C           *IN46     DOWEQ'0'
|   C*
| 03-C           *IN20     IFEQ '0'
|   C                     MOVELSD03      DSD03
|   C                     Z-ADDSD04      DSD04
|   C                     Z-ADDSD05      DSD05
|   C           KEYSD     CHAINSDX0                 47
| |  C           *IN47     IFEQ '0'
     C                     MOVELSD99      DSD99
     C                     MOVELSD98      DSD98
     C                     ELSE
     C                     MOVEL*BLANKS   DSD99
     C                     MOVEL*BLANKS   DSD98
     C                     END
| 03*C                     ELSE
|   C                     MOVELSF03      DSD03
|   C                     Z-ADDSF04      DSD04
|   C                     Z-ADDSF05      DSD05
     C                     MOVEL*BLANKS   DSD99
     C                     MOVEL*BLANKS   DSD98
| 03-C                     END
|   C*
     C                     MOVEL*BLANKS   MA03
     C           DSD03     CHAINMA0                  40
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
|   C*
| 04-C           *IN20     IFEQ '0'
|   C           DSC02     READESD0                      46
| 04*C                     ELSE
|   C           DSC02     READESF0                      46
| 04-C                     END
      *
| 02-C                     END
|   C*
|   C           *LOVAL    SETLLSOSDPF
|   C           *LOVAL    SETLLSOSDPFX
|   C           *LOVAL    SETLLSOSFPF
|   C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|   C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     96    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|   C*
|   C                     SETON                     51    *SFLDSPCTL
|   C                     WRITEDSPC1
|   C                     EXFMTSFLCR1
|   C                     SETOF                     5051
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
09===C                     ENDSR
    C*==============================================================*
    C*          RTN990....AUT CHK (CALL SUBPGM)
    C*==============================================================*
10===C           RTN990    BEGSR
|   C*
|   C                     CALL 'S#S01'
|   C                     PARM $USER     S0101I 10
|   C                     PARM           S0102I 10
|   C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|   C*
10===C                     ENDSR
    C*==============================================================*
    C*          ERRSR ....DATA LOCK ROUTINE
    C*==============================================================*
11===C           ERRSR     BEGSR
|   C*
|   C                     CALL 'P50'
|   C           DMSG      PARM           P5001O 78
|   C                     SETON                     8099
|   C*
11===C                     ENDSR'*DETC'
M001AC/COPY HBP2CVTR
