     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : SOA032                                     *
     H*    PROGRAM NAME :                                            *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  : 84/03/28                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.05 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     F****************************************************************
     FSOSIPF  IF  E           K        DISK
B2CHKFSOA032D CF  E                    WORKSTN      KINFDS DSPFDS
B2INF *CVR3009 sev.30 DISPLAY file SOA032D must be converted, because
B2INF *   field SI29 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert SOA032D, enlarging SI29
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     F                                        RRN1  KSFILE SFLSR1
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN1
     IPTDA01      DS
     I                                        1   1 $PFMT
     I                                        2   2 $PTYPE
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      141 141 $RMK03
     I                                      142 147 $DEP
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      217 218 $PRTCD
     I*           DS
     I                                      501 510 SI02
     I                                      508 510 #SI02
     I*PR0GRAM USE DATA DEFINE
     I*
     I*DEFIND STRAT KEY
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C           *LIKE     DEFN $A8YMD    FDATE            .TRANS DATE USE
     C           *LIKE     DEFN RRN1      @DRCD            DSP REC NUM
     C           *LIKE     DEFN RRN1      PRRN1            BOTTOM RRN
     C           *LIKE     DEFN RRN1      @PRCD            PAGE REC
     C*==============================================================*
     C*                    *ENTRY PLIST
     C*==============================================================*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYSI     KLIST                           *MAIN FILE
     C                     KFLD           DSI01
     C                     KFLD           DSI02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INIT
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR R1000                      *SCR PROCESS
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*
| 02-C           $RMK03    IFEQ 'Y'
|   C                     SETOF                     31
| 02*C                     ELSE
|   C                     SETON                     31
|   C                     ENDIF
|   C                     IN   PTDA01
|   C                     MOVEL$A8YMD    FDATE
|   C                     CALL 'P31'
|   C                     PARM FDATE     P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM $PFMT     P3104I  1
|   C                     PARM $PTYPE    P3105I  1
|   C                     PARM           P3111O  80
|   C                     Z-ADDP3111O    $EGMDY
|   C* INIT VALUE SET *---------------------------------------------*
|   C                     Z-ADD12        @PRCD            .PAGE SIZE
|   C                     EXSR R1A00                      .SFL INIT
|   C*
01===C                     ENDSR
    C*==============================================================*
    C*          R1000 ....SCREEN  PROCESS
    C*==============================================================*
02===C           R1000     BEGSR
|   C*
|   C                     WRITEDSPC1
|   C                     EXFMTSFLCR1
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD*ZERO     #LIN
|   C                     Z-ADD*ZERO     #COL
|   C*
| 01-C           *IN03     IFEQ '1'                        *END
|   C                     GOTO E1000
| 01-C                     END
|   C*
| 02-C           *IN06     IFEQ '1'                        *ADD
|   C                     EXSR R1C20
|   C                     EXSR R1A00                      *SFL INIT
|   C                     GOTO E1000
| 02-C                     END
|   C*
| 03-C           *IN25     IFEQ '1'                        *NEXT PAGE
|   C                     EXSR R1N00
|   C                     GOTO E1000
| 03-C                     END
|   C*
| 04-C           *IN27     IFEQ '1'                        *START KEY
|   C                     EXSR R1A00                      *SFL INIT
|   C                     GOTO E1000
| 04-C                     END
|   C*
|   C                     EXSR R1B00                      *SCREEN CHK
|   C*
| 05-C           *IN99     IFEQ '0'                        *START KEY
|   C                     EXSR R1C00                      *OPTION
|   C*
| 06-C           DELFLG    IFEQ 'Y'
|   C                     EXSR R1A00                      *SFL INIT
| 06-C                     END
| 05-C                     END
|   C*
02===C           E1000     ENDSR
    C*=============================================================*
    C*          R1A00 ....SUBFILE INIT PREPARE
    C*=============================================================*
03===C           R1A00     BEGSR
|   C*
|   C                     Z-ADD0         DRRN1
|   C                     Z-ADD0         PRRN1
|   C                     Z-ADD0         RRN1
|   C                     Z-ADD0         @DRCD            *DSP RCD
|   C                     MOVEL'N'       @BOTOM  1        *BOTTOM
|   C                     SETOF                     51
|   C*
|   C                     SETON                     52    *SFLCLR
|   C                     WRITESFLCR1
|   C                     SETOF                     52
|   C*
|   C                     SETON                     51    *SFLDSPCTL
|   C                     SETOF                     5053  *SFLDSP,END
|   C*
|   C           KEYSI     SETLLSI0
|   C*
|   C                     EXSR R1A10                      *ADD SFL DTA
|   C*
| 01-C           RRN1      IFGT 0
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
|   C                     SETON                     99    *NO DTA
|   C                     MOVEL'UPT2050' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|   C*
03===C                     ENDSR
    C*=============================================================*
    C*          R1A10 .... ADD SUBFILE DATA
    C*=============================================================*
04===C           R1A10     BEGSR
|   C*
|   C                     ADD  @PRCD     @DRCD
| 01-C           PRRN1     DOWLT@DRCD
|   C*
|   C                     READ SI0                      46
M001AC                     Z-ADDSI29      DSI29   60
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     EXSR R1A11                      *WRITE SFL
| 02*C                     ELSE                            *EOF
|   C                     Z-ADDRRN1      @DRCD
|   C                     MOVE 'Y'       @BOTOM
|   C                     SETON                       53  *SFLEND
| 02-C                     END
|   C*
| 01-C                     END
|   C*
|   C                     Z-ADDRRN1      DRRN1
|   C*
04===C                     ENDSR
    C*=============================================================*
    C*          R1A11 .... WRITE SUBFILE DATA
    C*=============================================================*
05===C           R1A11     BEGSR
|   C*
|   C           PRRN1     ADD  1         RRN1
|   C                     Z-ADDRRN1      PRRN1
|   C                     WRITESFLSR1
|   C*
05===C                     ENDSR
    C*=============================================================*
    C*          R1B00 ....ＳＣＲＥＥＮ　ＣＨＫ
    C*=============================================================*
06===C           R1B00     BEGSR
|   C*
|   C                     Z-ADD0         DETAIL  10
|   C                     READCSFLSR1                   42
| 01-C           *IN42     DOWEQ'0'
|   C           *IN99     ANDEQ'0'
|   C                     SETON                     54
|   C*
| 02-C*          DOPT1     IFEQ '4'
|   C*
|   C*          WE01      SETLLWD0
|   C*          WE01      READEWD0                      43
| 03-C*          *IN43     IFEQ '0'
|   C*                    ADD  1         DETAIL
| 03-C*                    END
|   C*
|   C*          WE01      SETLLWI0
|   C*          WE01      READEWI0                      43
| 04-C*          *IN43     IFEQ '0'
|   C*                    ADD  1         DETAIL
| 04-C*                    END
|   C*
| 05-C*          DETAIL    IFGT 0
|   C*                    MOVEL'URE0155' ERRID
|   C*                    MOVEL'REMF'    ERRF
|   C*                    SETON                     6099
| 05-C*                    END
|   C*
| 02-C*                    END
|   C                     Z-ADDRRN1      DRRN1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   42
|   C*
| 01-C                     END
|   C*
06===C                     ENDSR
    C*=============================================================*
    C*          R1C00 ....挑選資料
    C*=============================================================*
07===C           R1C00     BEGSR
|   C*
|   C                     MOVEL'N'       DELFLG  1
|   C                     READCSFLSR1                 4242
| 01-C           *IN42     DOWEQ'0'
|   C*
|   C*不是假發票不可做修改
| 02-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
|   C           DOPT1     OREQ '6'
| 03-C           #SI02     IFNE *BLANK
|   C                     MOVEL'UPT2503' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6099
|   C                     SETOF                     54
|   C   99                GOTO E1C00
| 03-C                     END
| 02-C                     END
|   C*
| 04-C           DOPT1     IFNE *BLANK
| 05-C           *IN99     IFEQ '0'
|   C                     EXSR R1C20                      *DOPT WORK
| 05*C                     ELSE
|   C                     SETOF                     54
| 05-C                     END
| 04-C                     END
|   C                     MOVEL*BLANK    DOPT1
|   C                     Z-ADDRRN1      DRRN1
|   C                     UPDATSFLSR1
|   C  N42                READCSFLSR1                   42
|   C*
| 01-C                     END
|   C*
07===C           E1C00     ENDSR
    C*=============================================================*
    C*          R1C20 ....  OPTION WORK
    C*=============================================================*
08===C           R1C20     BEGSR
|   C*
|   C                     MOVEL*BLANK    RTNID   2
|   C                     MOVELSI01      PSI01   2        *PARM
|   C                     MOVELSI02      PSI02  10        *PARM
|   C                     MOVELDOPT1     FUNID   10
|   C*
| 01-C           *IN06     IFEQ '1'
|   C                     MOVEL*BLANK    PSI01
|   C                     MOVEL*BLANK    PSI02
|   C                     Z-ADD1         FUNID
| 01-C                     END
|   C*
| 02-C           DOPT1     IFLT '6'
|   C                     CALL 'SOA0321'
|   C                     PARM           PSI01
|   C                     PARM           PSI02
|   C                     PARM           FUNID
|   C                     PARM           RTNID
| 02-C                     END
|   C*
| 03-C           DOPT1     IFEQ '6'
|   C                     CALL 'SOA0322'
|   C                     PARM           PSI01
|   C                     PARM           PSI02
|   C                     PARM           RTNID
| 03-C                     END
|   C*
| 04-C           RTNID     IFEQ '03'
|   C                     SETON                     0342
|   C                     GOTO END20
| 04-C                     END
|   C*
| 05-C           RTNID     IFEQ '12'
|   C                     GOTO END20
| 05-C                     END
|   C* SET START KEY
| 06-C           FUNID     IFEQ 1
|   C                     MOVELPSI01     DSI01
|   C                     MOVELPSI02     DSI02
| 06-C                     END
|   C*
| 07-C           FUNID     IFNE 5
|   C                     MOVEL'Y'       DELFLG
| 07-C                     END
|   C*
08===C           END20     ENDSR
    C*=============================================================*
    C*          R1N00 ....ROLLUP MAIN ROUTINE
    C*=============================================================*
09===C           R1N00     BEGSR
|   C*
| 01-C           @BOTOM    IFEQ 'Y'                        *EOF
|   C                     SETON                         53*LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR R1A10                      *ADD SFL DTA
| 01-C                     END
|   C*
09===C                     ENDSR
    C*==============================================================*
    C*          R9100 ....DATE TYPE CHANGE 2.(SCREEN TO FILE)
    C*==============================================================*
10===C           R9100     BEGSR
|   C*
|   C                     CALL 'P31'
|   C                     PARM FDATE     P3101I  80
|   C                     PARM $PFMT     P3102I  1
|   C                     PARM $PTYPE    P3103I  1
|   C                     PARM '2'       P3104I  1
|   C                     PARM '1'       P3105I  1
|   C                     PARM           P3111O  80
|   C*
10===C                     ENDSR
    C*==============================================================*
    C*          R9200 ....DATE TYPE CHANGE 2.(FILE TO SCREEN)
    C*==============================================================*
11===C           R9200     BEGSR
|   C*
|   C                     CALL 'P31'
|   C                     PARM FDATE     P3101I  80
|   C                     PARM '2'       P3102I  1
|   C                     PARM '1'       P3103I  1
|   C                     PARM $PFMT     P3104I  1
|   C                     PARM $PTYPE    P3105I  1
|   C                     PARM           P3111O  80
|   C*
11===C                     ENDSR
    C*==============================================================*
