     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : SOA034                                     *
     H*    AUTHOR       : A1491   EASON                              *
     H*    CREATE DATE  : 97/02/13                                   *
     H****************************************************************
     FSOS0PF  UF  E           K        DISK
     FSOA034D CF  E                    WORKSTN
     F*---------------------------------------------------------------
     I*---------------------------------------------------------------
     I*
     ILDA        UDS
     I                                      203 2080DDATE
     I                                      101 110 $USER
     I                                      201 2080$A8YMD
     I                                      201 2060DYM
     I                                      139 139 $RMK01
     I*
     I                                      500 500 DOPT
     I                                      501 5060WSU02
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INI. RTN.
     C*
  01-C           *IN03     DOWEQ'0'
    C                     EXSR RTN100                     *MAIN
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL ROUTINE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     IN   *NAMVAR
|    C*
     C           'KN'      CHAINS00                  40
|    C*
|    C                     CALL 'P39'
|    C                     PARM S002      P3901I  60
|    C                     PARM '2'       P3902I  1
|    C                     PARM '1'       P3903I  1
|    C                     PARM '3'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           SSU02     PARM           P3901O  60
|     *
|    C                     CALL 'P39'
|    C                     PARM DYM       P3901I  60
|    C                     PARM '2'       P3902I  1
|    C                     PARM '1'       P3903I  1
|    C                     PARM '3'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           DSU02     PARM           P3901O  60
|    C*
|    C                     MOVEL'Y'       DO      1
|    C                     MOVEL'N'       DOPT
|    C                     Z-ADD0         WSU02   60
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100.... MAIN ROUTINE
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     SETON                     97
|    C                     EXFMTDSPC1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 02-C           *IN03     IFEQ '1'
|   C                     GOTO END100
| 02-C                     END
|    C*
|    C                     EXSR RTN110                     *CHK SCREEN1
|    C*
|    C*
| 03-C           *IN99     IFEQ '0'
|   C           DO        ANDEQ'Y'
|   C           *IN13     ANDEQ'1'
|   C                     EXSR RTN120                     *PROCESS
|    *
|    *
| 03-C                     END
|    C*
|    C*
02===C           END100    ENDSR
     C*==============================================================*
     C*          RTN110....CHECK SCREEN1
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
| 01-C           DSU02     IFEQ 0
|   C                     SETON                     956099
| 01-C                     ENDIF
|    C*
| 02-C           DSU02     IFEQ SSU02
|   C                     SETON                     62
| 03-C           DOPT      IFEQ 'Y'
|   C                     MOVEL'Y'       DO
| 03*C                     ELSE
|   C                     MOVEL'N'       DO
| 03-C                     ENDIF
| 02-C                     ENDIF
|     *
|    C                     CALL 'P39'
|    C                     PARM DSU02     P3901I  60
|    C                     PARM '3'       P3902I  1
|    C                     PARM '1'       P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C                     PARM           P3901O  60
|    C*
| 04-C           P3901O    IFLT S002
|   C                     SETON                     999060
| 04-C                     ENDIF
|    C*
03===C           END110    ENDSR
     C*==============================================================*
     C*          RTN120.... PROCESS
     C*==============================================================*
04===C           RTN120    BEGSR
|    C*
|    C                     SETON                     96
|    C                     WRITEDSPC1
|    C*------------------------------------------------------------
     C           'KN'      CHAINS00                  40
|    C*------------------------------------------------------------
|    C                     CALL 'P39'
|    C                     PARM DSU02     P3901I  60
|    C                     PARM '3'       P3902I  1
|    C                     PARM '1'       P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           S002      PARM           P3901O  60
|    C                     Z-ADDS002      WSU02   60
|     *
|    C                     OUT  LDA
|    C*
|    C                     CALL 'SOA034C'
|    C*
     C  N40                UPDATS00
|    C*
|    C                     SETON                     93
|    C                     SETOF                     96
|    C*
04===C                     ENDSR
