     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SOA025D                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 82/11/22                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR025                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :通路新增報價拷貝批次作業                  *
     A****************************************************************
     FSOSALF  IP  E           K        DISK
     F            SA0                               KRENAMESA0CP
     FSOSAPF  IF  E           K        DISK                      A
     FPA#CPF  IF  E           K        DISK
     E*新增通路之ＡＲＲＡＹ
     E                    W01        20  3
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
M001AI                                      201 2080$EG8
     I                                      601 603 DSA02
     I                                      601 601 DSA021
     I                                      602 603 DSA022
     I                                      606 606 DSA04
M001MI                                      607 6140YSA05
M001MI                                      615 6220YSA13
     I                                      701 760 W01
     I                                      701 703 D1011
     I                                      704 716 D1012
     I                                      707 709 D1013
     I                                      710 712 D1014
     I                                      713 715 D1015
     I                                      716 718 D1021
     I                                      719 721 D1022
     I                                      722 724 D1023
     I                                      725 727 D1024
     I                                      728 730 D1025
     I                                      731 733 D1031
     I                                      734 736 D1032
     I                                      737 739 D1033
     I                                      740 742 D1034
     I                                      743 745 D1035
     I                                      746 748 D1041
     I                                      749 751 D1042
     I                                      752 754 D1043
     I                                      755 757 D1044
     I                                      758 760 D1045
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWSA    KLIST
     C                     KFLD           WSA01
     C                     KFLD           WSA02
     C                     KFLD           WSA03
     C                     KFLD           WSA04
     C                     KFLD           WSA05
     C           KEYWPA    KLIST
     C                     KFLD           W#C01
     C                     KFLD           W#C02
      *==============================================================*
      *                   *LIKE DEFN
      *==============================================================*
     C           *LIKE     DEFN SA01      WSA01
     C           *LIKE     DEFN SA02      WSA02
     C           *LIKE     DEFN SA03      WSA03
     C           *LIKE     DEFN SA04      WSA04
B2000C           *LIKE     DEFN SA05      WSA05
     C           *LIKE     DEFN #C01      W#C01
     C           *LIKE     DEFN #C02      W#C02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN000                     *SET INIT
     C*
     C*
     CLR                   RETRN
     C*==============================================================*
     C*          RTN000....
     C*==============================================================*
01===C           RTN000    BEGSR
|    C*
|    C                     MOVELSA01      WSA01
|    C                     MOVELSA04      WSA04
B2000C                     Z-ADDSA05      WSA05
| 01-C           1         DO   20        I       20
| 02-C           W01,I     IFNE *BLANK
|   C                     MOVELW01,I     W#C01
|   C                     MOVE W01,I     W#C02
|   C*CHECK #C0中是否存在此通路型態　　
|   C           KEYWPA    CHAIN#C0                  41
| 03-C           *IN41     IFEQ '0'
|   C                     MOVELW01,I     WSA02
|   C                     MOVE W01,I     WSA03
|   C*CHECK SA0中是否有相同之報價
B2000C           KEYWSA    CHAINSA0                  40
|   C*無相同報價時即可WRITE SA0
| 04-C           *IN40     IFEQ '1'
|   C                     MOVELW01,I     SA02
|   C                     MOVE W01,I     SA03
|   C                     MOVE '*'       SA14
B2000C                     Z-ADD$EG8      SAXX
B2000C                     TIME           SAYY
|   C                     MOVE $USER     SAZZ
|   C                     WRITESA0
| 04-C                     END                             'ENDIF 40
| 03-C                     END                             'ENDIF 41
| 02-C                     END                             'ENDIF W01
| 01-C                     END                             'ENDDO
|    C*
01===C           MAINED    ENDSR
      *===============================================================*
02===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  LDA
|    C*
02===C           ENDLDA    ENDSR
