      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOA008                                        *
      * AUTHER       : A1118 PHILIP                                  *
      * CREATE DATE  : 81/03/10                                      *
      * UPDATE DATE  : 81/04/13 ERROR REPORT CREATE                  *
      * UPDATE DATE  : 81/04/17 結帳註記 ADD FIELD                 *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :訂單批次處理                                 *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.18 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 00.04.11 | FOR DUTY菸酒稅法實施
     A*---------------------------------------------------------------
     A* M003      | 03.03.21 |欄位擴增事項
     A*---------------------------------------------------------------
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FPOPBPF  O   E           K        DISK
     FPOPCPF  O   E           K        DISK
     I**********
     I           UDS
     I                                      101 110 $USER
M001MI                                      201 2080$DATE
     I                                      603 603 DSEL
     I                                      609 613 PSC11
     I*(MM/DD/YY)
     I                                      621 6260PSC08
M001MI                                      640 6470YSE06
     I                                      680 680 ERRCDE
     I            DS
     I                                        1   2 SC01
     I                                        1   1 SC01L
     I                                        2   2 SC01R
     I            DS
     I                                        1   2 PB01
     I                                        1   1 PB01L
     I                                        2   2 PB01R
     I            DS
B2MODI                                        1   80PB04
B2MODI                                        1   40PB04Y
M002AIDA02        DS
M002AI                                        1   43DUTY
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                   *LIKE DEFN
      *==============================================================*
      *==============================================================*
      *                    PARM LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           SC02
M002AC           *NAMVAR   DEFN           DA02
M002AC                     IN   DA02
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C*專櫃訂單
|    C           SC02      CHAINSC0                  40
  01-C           SC04      IFEQ 'B0000'
  01-C           SC03      ANDEQ'S1'
    C                     EXSR RTN100
    C                     EXSR RTN110
  01-C                     END
|   C                     SETON                     LR
     C*
     C*==============================================================*
     C*          RTN100....GET SOSCPF
     C*==============================================================*
03===C           RTN100    BEGSR
|    C*
|   C                     MOVEL'K'       PB01L
|   C                     MOVELSC01R     PB01R
|   C                     MOVEL'P2'      PB03
B2000C                     Z-ADDSC07      PB04
|   C                     MOVEL'LR000'   PB05
B2000C                     Z-ADDSC08      PB06
|   C                     MOVEL'NT$'     PB07
|   C                     Z-ADDSC12      PB08
|   C                     MOVEL'A5'      PB09
|   C                     MOVEL'05'      PB10
|   C                     MOVELSC02      PB11
|   C                     MOVEL'03'      PB12
|   C                     MOVEL*BLANK    PB13
|   C                     Z-ADD0         PB14
|   C                     Z-ADD0         PB15
|   C                     MOVEL*BLANK    PB16
|   C                     MOVEL*BLANK    PB17
|   C                     MOVEL*BLANK    PB18
|   C                     MOVEL*BLANK    PB19
|   C                     MOVEL*BLANK    PB20
|   C                     Z-ADD0         PB21
|   C*M002D               Z-ADD0         PB22
M002AC           SC37      IFEQ 'D'
M002AC           PB08      MULT DUTY      WPB22   70H
M002AC                     Z-ADDWPB22     PB22
M002AC                     ELSE
M002AC                     Z-ADD0         PB22
M002AC                     END
B2000C                     Z-ADD$DATE     PBXX
B2000C                     TIME           PBYY
|   C                     MOVEL$USER     PBZZ
|    C*
M001AC                     Z-ADDPB04Y     W2      20
|   C                     CALL 'RES002'
|   C                     PARM PB01      S002I1  2
|   C                     PARM PB03      S002I2  2
|   C                     PARM '1'       S002I3  1
B2MODC*M001M               PARM PB04Y     S002I4  40
M001MC                     PARM W2        S002I4  20
|   C           PB02      PARM           S002O1 12
|    C*
|    C                     WRITEPB0
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN110....INIT OTHER HEADING FILE 1
      *==============================================================*
04===C           RTN110    BEGSR
|    C*
|    C           SC02      SETLLSD0                  40
|    C           SC02      READESD0                      42
| 01-C           *IN42     DOWEQ'0'
|    C*
|   C                     MOVELPB01      PC01
|   C                     MOVELPB02      PC02
|   C                     MOVELSD03      PC03
B2000C                     Z-ADDPB04      PC04
|   C                     MOVEL'LR000'   PC05
|   C           SD04      ADD  SD05      PC06
|   C                     Z-ADDSD07      PC08
|   C*M003M     PC08      DIV  PC06      PC07
M003MC           SD131     DIV  PC06      PC07
|   C                     MOVEL'BOTTLE'  PC09
|   C                     Z-ADD1         PC10
|   C                     Z-ADD0         PC11
|   C                     MOVEL*BLANK    PC12
|   C*M002D               Z-ADD0         PC13
M002AC           SC37      IFEQ 'D'
M002AC           PC08      MULT DUTY      WPC13   70H
M002AC                     Z-ADDWPC13     PC13
M002AC                     ELSE
M002AC                     Z-ADD0         PC13
M002AC                     END
     C*
B2000C                     Z-ADD$DATE     PCXX
B2000C                     TIME           PCYY
|   C                     MOVEL$USER     PCZZ
|    C*
|    C                     WRITEPC0
|    C*
|    C           SC02      READESD0                      42
|    C*
| 01-C                     END
|    C*
03===C                     ENDSR
