     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SOA025D                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 82/11/22                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR025                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :通路新增報價拷貝批次作業                  *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.13 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     FSOA025D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     E*新增通路之ＡＲＲＡＹ
     E                    W01        20  3
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      601 603 DSA02
     I                                      601 601 DSA021
     I                                      602 603 DSA022
     I                                      606 606 DSA04
M001MI                                      607 6140YSA05
M001MI                                      615 6220YSA13
     I                                      701 760 W01
     I                                      701 703 D1011
     I                                      704 706 D1012
     I                                      707 709 D1013
     I                                      710 712 D1014
     I                                      713 715 D1015
     I                                      716 718 D1021
     I                                      719 721 D1022
     I                                      722 724 D1023
     I                                      725 727 D1024
     I                                      728 730 D1025
     I                                      731 733 D1031
     I                                      734 736 D1032
     I                                      737 739 D1033
     I                                      740 742 D1034
     I                                      743 745 D1035
     I                                      746 748 D1041
     I                                      749 751 D1042
     I                                      752 754 D1043
     I                                      755 757 D1044
     I                                      758 760 D1045
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN04     PARM *IN04     IN04    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN97     PARM *IN97     IN97    1
     C           *IN96     PARM *IN96     IN96    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N10N96          EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
    C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  03-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSA02
|    C                     MOVE 'A'       DSA04
|    C                     Z-ADD0         DSA05
|    C                     Z-ADD0         DSA13
M001AC                     Z-ADD0         W6      60
|    C                     MOVEA*BLANK    W01
|    C                     SETON                     10
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
      *USE TIME
|    C*客戶代號檢查
| 01-C           DSA02     IFEQ *BLANKS
|   C                     SETON                     609599
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C*折扣別
| 02-C           DSA04     IFEQ *BLANK
|   C                     SETON                     649599
| 02-C                     END
|    C   99                GOTO END100
|    C*日期檢查
|    C** DEFAULT VALUE
| 03-C           DSA05     IFEQ 0
|   C                     SETON                     659599
| 03-C                     END
|    C   99                GOTO END100
| 04-C           DSA13     IFEQ 0
|   C                     SETON                     669599
| 04-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'P09'
|    C                     PARM DSA05     P0901I  60
|    C                     PARM           P0911O  1
| 05-C           P0911O    IFEQ 'N'
|   C                     SETON                     659899
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSA13     P0901I  60
|    C                     PARM           P0911O  1
| 06-C           P0911O    IFEQ 'N'
|   C                     SETON                     669899
| 06-C                     END
|    C   99                GOTO END100
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSA05     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSA05
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSA13     S001I2  60
|    C           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YSA13
|    C*日期區間檢查
| 07-C           YSA05     IFGT YSA13
|   C                     SETON                     656692
|   C                     SETON                     99
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶代號ＡＲＲＡＹ檢查
|    C                     Z-ADD0         WI      20
| 08-C           1         DO   20        I       20
| 09-C           W01,I     IFNE *BLANKS
|   C                     ADD  1         WI
| 09-C                     END
| 08-C                     END
| 10-C           WI        IFEQ 0
|   C                     SETON                     619599
| 10-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*
| 02-C           D#ROW     IFEQ 5
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS009'
|   C                     PARM           DSA021
|   C                     PARM           DSA022
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
