     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : SOA0062N                                   *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/01/30                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :訂單／送貨核准發放處理－單據／搭贈查詢    *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.11 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A*                                                              *
     A****************************************************************
     FSOSMLF  IF  E           K        DISK
     F                                              KINFDS SMRCDN
     F            SC0                               KRENAMESC0L
     F            SE0                               KRENAMESE0L
     FSOSDPF  IF  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
B2CHKFSOA0061DCF  E                    WORKSTN
B2INF *CVR3010 sev.30 DISPLAY file SOA0061D must be converted, because
B2INF *   file SM06 (and more) are shared by name with other database
B2INF *   fields which require to be expanded. Please convert SOA0061D,
B2INF *   enlarging all involved fields prior to compilation, or manually
B2INF *   insert in this source the proper RENAME and MOVE statements to
B2INF *   avoid name sharing
     F                                        RRN3  KSFILE SFLSR3
     E*: FUNCTION DATA :
     E*                   WFUN    5   5  6
     E*: A/U/D/I AUT
     E*                   WA01        8  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I*                                     135 135 $ADD
 @   I*                                     136 136 $UPD
 @   I*                                     137 137 $DLT
 @   I*                                     138 138 $INQ
 @   I*                                     139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I*                                     501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 508 $TRNID
     I*                                     509 513 $APAUT
     I*                                     514 521 $#101
     I*           DS
     I*                                       1   1 DOPT1
     I*                                       1   10WNUM
     I* FOR -- GET RECORD NAME
     ISMRCDN      DS
     I                                     *RECORD  RCDN
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           SM02      PARM           A062I1 12        單據號碼
     C                     PARM *IN03     IN03    1
     C                     PARM *IN12     IN12    1
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN3   40
     C                     MOVE *BLANKS   APPSCR  6
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSM     KLIST
     C                     KFLD           SM02
     C           KEY#B     KLIST
     C                     KFLD           SM01
     C           KEY#D     KLIST
     C                     KFLD           SM14
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEYMA     KLIST
     C                     KFLD           DS03
     C           KEYME     KLIST
     C                     KFLD           SM04
     C           KEYSD     KLIST
     C                     KFLD           SM02
     C           KEYSF     KLIST
     C                     KFLD           SM02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN191                     *INIT SFL
     C                     EXSR RTN193                     *READ DATA  AGE
     C*
     C                     EXSR RTN151                     *FILE TO SCR
     C                     WRITEDSPC3
     C                     EXFMTSFLCR3
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C                     SETON                     LR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
01===C           RTN191    BEGSR
|    C*
|    C                     Z-ADD1         DRRN3
|    C                     Z-ADD0         RRN3
|    C                     Z-ADD0         WRRN3   40
|    C                     SETOF                     53
|    C                     SETON                     52
|    C                     WRITESFLCR3
|    C                     SETOF                     52
|    C                     SETON                     51
|    C           KEYSM     CHAINSOSMLF               40
|    C*
01===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
02===C           RTN193    BEGSR
|    C*
| 01-C           RCDN      IFEQ 'SC0L'
|   C           KEYSD     SETLLSD0
|   C           KEYSD     READESD0                      44
| 01*C                     ELSE
|   C           KEYSF     SETLLSF0
|   C           KEYSF     READESF0                      44
| 01-C                     END
|    C*
| 02-C           *IN44     DOWEQ'0'
|   C*
|   C                     EXSR RTN152                     *FILE TO SFL
|   C*
|   C                     ADD  1         RRN3
|   C                     WRITESFLSR3
| 03-C           RCDN      IFEQ 'SC0L'
|   C           KEYSD     READESD0                      44
| 03*C                     ELSE
| 04-C           RCDN      IFEQ 'SE0L'
|   C           KEYSF     READESF0                      44
| 04-C                     END
| 03-C                     END
| 02-C                     END
|    C                     SETON                     53
|    C*
|    C                     Z-ADDRRN3      WRRN3      50
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN151....MOVE DATA TO SCREEN
      *==============================================================*
03===CSR         RTN151    BEGSR
|    C* GET 公司代號
|    C           KEY#B     CHAIN#B0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#B02      D#B02
| 01*C                     ELSE
|   C                     MOVE *BLANK    D#B02
| 01-C                     END
|    C* GET 地區
|    C           KEY#D     CHAIN#D0                  40
|    C   40                MOVE *BLANK    #D02
|    C* GET 單別
|    C                     MOVELSM03      #201
|    C                     MOVELSM03      #202
|    C           KEY#2     CHAIN#20                  40
|    C   40                MOVE *BLANK    DDOC
|    C* 單據日期轉換
M001AC                     Z-ADDSM06      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM W6        S001I2  60
B2MODC           LSM06     PARM           S001O1  60
|    C* GET 客戶簡稱
|    C           KEYME     SETLLME0
|    C                     READ ME0                      46
|    C   46                MOVE *BLANK    ME04
|    C*
03===CSR                   ENDSR
      *==============================================================*
      *          RTN152....MOVE DATA TO SUBFILE
      *==============================================================*
04===CSR         RTN152    BEGSR
|    C*
| 01-C           RCDN      IFEQ 'SC0L'
|   C                     MOVE SD03      DS03
|   C                     MOVE SD04      DS04
|   C                     MOVE SD05      DS05
|   C                     MOVE SD06      DS06
|   C                     MOVE SD08      DS08
|   C                     MOVE SD09      DS09
| 01-C                     END
| 02-C           RCDN      IFEQ 'SE0L'
|   C                     MOVE SF03      DS03
|   C                     MOVE SF04      DS04
|   C                     MOVE SF05      DS05
|   C                     MOVE SF06      DS06
|   C                     MOVE SF08      DS08
|   C                     MOVE SF09      DS09
| 02-C                     END
|    C* GET 產品名稱／單位
|    C           KEYMA     CHAINMA0                  40
|    C   40                MOVE *BLANK    MA03
|    C   40                MOVE *BLANK    MA13
|    C*
04===CSR                   ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
05===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
06===C*          ERRSR     BEGSR
|    C*
|    C*                    CALL 'P50'
|    C*          DMSG      PARM           P5001O 78
|    C*                    SETON                     8099
|    C*
06===C*                    ENDSR'*DETC'
