      ****************************************************************
      *                                                              *
      * PROGRAM NAME : SOA0281                                       *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 05/16/02                                      *
      * UPDATE DATE  :                                               *
      * UPDATE DATE  :                                               *
      * SYSTEM       :寰盛洋酒                                     *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :專櫃匯東訂單轉驗收單之稅額與發票同步         *
     A*===============================================================
     A* MODI CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*           |        |        |
     A*---------------------------------------------------------------
      ****************************************************************
     FPOPHPF  UF  E           K        DISK
     FSOSILF10IF  E           K        DISK
     FSOSEPF  IF  E           K        DISK
     FSOSSPF  IF  E           K        DISK
     FREWFD1  IP  E           K        DISK
     FREWFD1LFUF  E           K        DISK
     F            WFD1                              KRENAMEWFDL1
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*
     C           KEYSS     KLIST
     C                     KFLD           SI01
     C                     KFLD           SI02
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C           SE02      CHAINSE0                  47
     C           *IN47     IFEQ '0'
  01-C           SE30      CHAINSI0                  45
     C           *IN45     IFEQ '0'
     C           SI18      ANDNE'*'
     C           SI35      ANDNE*ZERO
     C           KEYSS     CHAINSS0                  50
     C           *IN50     IFEQ '0'
     C                     Z-ADDSS29      WPH12
     C                     ELSE
     C                     Z-ADDSI24      WPH12  112
     C                     END
     C           PH02      CHAINPH0                  46
     C           *IN46     IFEQ '0'
     C                     Z-ADDWPH12     PH12
     C                     UPDATPH0
     C           SE02      CHAINWFDL1                48
     C           *IN48     IFEQ '0'
     C                     DELETWFDL1
     C                     END
     C                     END
     C                     END
     C                     END
     C*
     CLR                   RETRN
     C*==============================================================*
