     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*--------------------------------------------------------------*
     H*    PROGRAM ID   : SOA019                                     *
     H*    AUTHOR       : A1092  TAYLOR                              *
     H*    DATE WRITTEN : 81/01/21                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人頭馬匯東                                *
     H*    SUBSYSTEM    :銷售資料建檔子系統                        *
     H*    PROCEDURE    :                                            *
     H*    REMARK       :送貨資料處理 (A/U/D/I)                    *
     H****************************************************************
     FSOSEPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FSOSELF3 IF  E           K        DISK
     F            SE0                               KRENAMESE0L
     FSOSFPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMDPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FIMIAPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMAPF  IF  E           K        DISK
     FSOSAPF  IF  E           K        DISK
     FSOSBPF  IF  E           K        DISK
     FSOSILF01IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FPA#BLF01IF  E           K        DISK
     F            #B0                               KRENAME#B0L1
     FPA#2PF  IF  E           K        DISK
B2CHKFSOA019D CF  E                    WORKSTN
B2INF *CVR3009 sev.30 DISPLAY file SOA019D must be converted, because
B2INF *   field SE06 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert SOA019D, enlarging SE06
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     E*: FUNCTION DATA :
     E                    WFUN    7   7  6
     E*: A/U/D/I AUT
     E                    WA01        8  1
     E*: 訂單狀態
     E                    ARR1    4   4 12
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
B2MODI                                      121 1260$EGMDY
B2MODI                                      154 163 $USERN
B2MODI                                      111 1180$CHYMD
B2MODI                                      137 137 $ADD
B2MODI                                      138 138 $UPD
B2MODI                                      139 139 $DLT
B2MODI                                      140 140 $INQ
B2MODI                                      141 141 $RMK01
B2MODI                                      515 515 $WRHTY
     I*                                     514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I**   SCR002 CHANGE (Y/N)
     I            DS
B2MODI                                        1   80WSE06
B2MODI                                        1   60SE06YM
     I            DS
     I                                        1   60DSE39
     I                                        5   60SE395N
      *SCR2CN KEEP SF25 SF26 SF27
     I            DS
     I                                        1  16 SCR2CN
      *交貨日期
     I                                        1   60DSE06
     I* FOR UPDATE AND CHECK交貨日期年份不能修改
     I                                        5   60SE065N
      *出貨物流點
     I                                        7  11 DSE07
     I                                        7   7 DSE07L
      *收貨物流點
     I                                       12  16 DSE26
     I            DS
     I                                        1   2 DSE01
     I                                        1   1 DSE01L
     I            DS
     I                                        1   9 DSF03
     I                                        1   4 DSF03L
     I            DS
     I                                        1  52 SE14
     I                                        1   2 SE141
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6        *CTL
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C                     MOVE *BLANK    WQUERY  1
B2MODC           *LIKE     DEFN DBGN1     OBGN1 + 2        *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C*  FOR SUBFILE (SYS+PGM CONTROL)
B2MODC           *LIKE     DEFN DBGN1     BBGN1 + 2        *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN1     DBGN1D+ 2        *SUBFIL BUTTOM
B2MODC           *LIKE     DEFN DBGN1     BBGN1D+ 2        *SUBFIL BUTTOM
     C           *LIKE     DEFN DBGN2     BBGN2            *SUBFIL BUTTOM
     C           *LIKE     DEFN SE08      TMON                         OM
     C           *LIKE     DEFN SE03      HSE03                        OM
     C           *LIKE     DEFN SE08      HSE08                        OM
     C           *LIKE     DEFN SF03      KSF03                        OM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSE1    KLIST
     C                     KFLD           DSE02
     C           KEYSE2    KLIST
     C                     KFLD           DBGN1D
     C                     KFLD           DBGN2
     C           KEYSE3    KLIST
     C                     KFLD           BBGN1D
     C                     KFLD           BBGN2
     C           KEYSE4    KLIST
     C                     KFLD           SE02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEYIA     KLIST
     C                     KFLD           IA01
     C                     KFLD           IA02
     C                     KFLD           DSF03
      *KEY FOR 單位成本
     C           KEYSA3    KLIST
     C                     KFLD           DSF03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
     C                     KFLD           WSE06
     C           KEYSA4    KLIST
     C                     KFLD           DSF03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
      *KEY FOR 通路報價
     C           KEYSA1    KLIST
     C                     KFLD           DSF03
     C                     KFLD           HSE27
     C                     KFLD           HSE28
     C                     KFLD           SA04
     C                     KFLD           WSE06
     C           KEYSA2    KLIST
     C                     KFLD           DSF03
     C                     KFLD           HSE27
     C                     KFLD           HSE28
     C                     KFLD           SA04
     C           KEYSB1    KLIST
     C                     KFLD           SB01
     C                     KFLD           DSF03
     C                     KFLD           SB04
     C                     KFLD           WSE06
     C           KEYSB2    KLIST
     C                     KFLD           SB01
     C                     KFLD           DSF03
     C                     KFLD           SB04
      *KEY FOR 單位成本
     C           SA3KEY    KLIST
     C                     KFLD           KSF03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
     C                     KFLD           WSE06
     C           SA4KEY    KLIST
     C                     KFLD           KSF03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
      *KEY FOR 通路報價
     C           SA1KEY    KLIST
     C                     KFLD           KSF03
     C                     KFLD           HSE27
     C                     KFLD           HSE28
     C                     KFLD           SA04
     C                     KFLD           WSE06
     C           SA2KEY    KLIST
     C                     KFLD           KSF03
     C                     KFLD           HSE27
     C                     KFLD           HSE28
     C                     KFLD           SA04
     C           SB1KEY    KLIST
     C                     KFLD           SB01
     C                     KFLD           KSF03
     C                     KFLD           SB04
     C                     KFLD           WSE06
     C           SB2KEY    KLIST
     C                     KFLD           SB01
     C                     KFLD           KSF03
     C                     KFLD           SB04
     C           KEY#B1    KLIST
     C                     KFLD           DSE04
     C                     KFLD           DSE05
     C           KEYSF1    KLIST
     C                     KFLD           DSE02
     C           KEYSF     KLIST
     C                     KFLD           DSE02
     C                     KFLD           DSF03
     C           KEY#C     KLIST
     C                     KFLD           MD07
     C                     KFLD           MD08
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD123199    OBGN1                        ENT
B2VFYC                     Z-ADD20123199  OBGN1                        ENT
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN110
    C           *IN09     CASEQ'1'       RTN120
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $INQ      WA01,6
|    C                     MOVE $UPD      WA01,7
|    C                     MOVE $RMK01    WA01,8
|    C                     MOVE 'SCR001'  APPSCR
|    C*
B2MODC                     Z-ADD0         DATE    80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9699
| 01*C                     ELSE
|   C                     EXSR RTN200
| 02-C           DRRN1     IFGT 0
|   C           DRRN1     SUB  1         HRRN1
| 02-C                     END
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 01-C                     END
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN120....F9(PRINT)
      *==============================================================*
03===C           RTN120    BEGSR
|    C*CHECK新增權利
|    C                     MOVE '8'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9699
| 01*C                     ELSE
|   C                     CALL 'SOR060C'
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
04===C           RTN170    BEGSR
|    C*
      *
B2CHKC           DBGN1     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE DBGN1     OBGN1
B2NEWC                     MOVE DBGN1     HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    OBGN1
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN2     OBGN2
| 01*C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          DBGN1     IFNE OBGN1
B2NEWC                     MOVE DBGN1     HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    H@8N01  80
B2NEWC           H@8N01    IFNE OBGN1
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE DBGN1     OBGN1
B2NEWC                     MOVE DBGN1     HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    OBGN1
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN2     OBGN2
| 02*C                     ELSE
| 03-C****       WRRN1     IFGT 0
|   C                     EXSR RTN171
| 04-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 04-C                     END
| 03-C                     END
| 02-C                     END
|   C*
04===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
05===C           RTN171    BEGSR
|   C*
|   C                     SETON                     54
|   C*
|   C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
      *
| 05-C           DOPT1     IFNE '7'
|   C                     EXSR RTN200
| 05*C                     ELSE
|   C                     EXSR RTN400
| 05-C                     END
      *
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   57*NF
|   C*
| 01-C                     END                             *40 END
| 06-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 06-C                     END
|   C*
05===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SE01' SCREEN
      *==============================================================*
06===CSR         RTN180    BEGSR
|   C*
|   C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|   C   99                GOTO END180
|   C*
| 02-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
|   C           DOPT1     OREQ '7'
      *
| 03-C           HSE40     IFEQ 'V'
|   C                     SETON                     608599
| 03-C                     END
|   C   99                GOTO END180
      *
|   C                     MOVE 'D'       #201
|   C                     MOVE SE03      #202
|   C           KEY#2     CHAIN#20                  40
| 04-C           #204      IFEQ 'N'
|   C           *IN40     OREQ '1'
|   C                     SETON                     608799
| 04*C                     ELSE
|   C           KEYSE4    CHAINSE0                  40
|   C           *LOVAL    SETLLSE0
| 05-C           SE09      IFEQ 'V'
|   C                     SETON                     608899
| 05*C                     ELSE
| 06-C           SE25      IFNE *BLANKS
|   C                     SETON                     608699
| 06-C                     END
| 05-C                     END
| 04-C                     END
| 02-C                     END
|   C   99                GOTO END180
|   C*
|   C           END180    TAG
|   C   99                Z-ADDRRN1      DRRN1
|   C*
06===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
07===C           RTN191    BEGSR
|   C*
|   C                     MOVE *BLANKS   DOPT1
|   C                     Z-ADD0         DRRN1
|   C                     Z-ADD0         RRN1
|   C                     Z-ADD0         WRRN1   40
|   C                     Z-ADD10        WPRCD1  30
|   C                     Z-ADD0         DSPRC1  40
|   C           HRRN1     DIV  WPRCD1    DSPRC1
|   C                     MULT WPRCD1    DSPRC1
|   C                     MOVE 'N'       WBOTM1  1
|   C                     SETOF                     53
|   C                     SETON                     5254
|   C                     WRITESFLCR1
|   C                     SETOF                     52
      *
B2CHKC           DBGN1     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     Z-ADD123199    DBGN1
| 01-C                     END
      *
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DBGN1     S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           DBGN1D    PARM           S001O1  80
|   C*
B2000C           KEYSE2    SETLLSE0L
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    MOVE DBGN1     BBGN1
B2NEWC                     MOVE DBGN1     HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    BBGN1
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C                     MOVE DBGN2     BBGN2
|   C*
07===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
08===C           RTN192    BEGSR
|   C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          BBGN1     IFNE DBGN1
B2OLDC*          BBGN2     ORNE DBGN2
B2NEWC                     MOVE DBGN1     HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    H@8N01  80
B2NEWC           BBGN1     IFNE H@8N01
B2NEWC           BBGN2     ORNE DBGN2
B2INF *CVR0001 sev.00 Field BBGN2 is not a date or year
B2INF *CVR0001 sev.00 Field DBGN2 is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2000C           KEYSE3    SETGTSE0L
| 02-C                     END
|   C                     EXSR RTN193
B2MODC                     Z-ADD0         WSE061  80
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2MODC                     PARM SE06      S001I2  80
B2MODC           WSE061    PARM           S001O1  80
      *
B2000C                     Z-ADDWSE061    BBGN1D
B2000C                     Z-ADDSE06      BBGN1
|   C                     MOVE SE02      BBGN2
B2000C           *LOVAL    SETLLSE0L
| 01-C                     END
|   C*
08===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
09===C           RTN193    BEGSR
|   C*
|   C                     MOVE *BLANKS   DOPT1
|   C                     SETOF                     54
|   C                     Z-ADDWRRN1     RRN1
|   C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C                     READ SE0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C                     EXSR RTN194                     *GET DATA
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     END
|   C*
|   C                     Z-ADDRRN1      DRRN1      50
|   C                     Z-ADDRRN1      WRRN1
|   C*
09===C                     ENDSR
      *=========================================================*
      *          RTN194 .. GET DATA
      *=========================================================*
10===C           RTN194    BEGSR
|   C*
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE06      S001I2  80
B2MODC           SE06      PARM           S001O1  80
|   C* GET 單別
|   C                     MOVE 'D'       #201
|   C                     MOVELSE03      #202
|   C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#203      D#203
| 01*C                     ELSE
|   C                     MOVE *BLANK    D#203
| 01-C                     END
|   C* GET客戶簡稱
|   C                     MOVELSE04      ME01
|   C                     MOVELSE05      ME02
|   C           KEYME     CHAINME0                  40
|   C   40                MOVE *BLANK    ME04
|   C*
|   C                     MOVELSE40      HSE40
|   C*
| 02-C           SE20      IFGT 0
|   C                     MOVE *BLANK    DSTA
| 02*C                     ELSE
      *
| 03-C           SE36      IFEQ 'T'
|   C                     MOVE *BLANK    DSTA
| 03*C                     ELSE
|   C                     MOVE '*'       DSTA
| 03-C                     END
      *
| 02-C                     END
      *
10===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
11===C           RTN195    BEGSR
|   C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     94    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|   C*
|   C                     SETON                     51    *SFLDSPCTL
|   C                     WRITEDSPC1
|   C                     EXFMTSFLCR1
|   C                     SETOF                     5051
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
11===C                     ENDSR
      *==============================================================*
      *          RTN200....'SE02' SCREEN MAIN ROUTINE
      *==============================================================*
12===C           RTN200    BEGSR
|   C*
|   C                     MOVE 'SCR002'  APPSCR
|   C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
|   C           DOPT1     CASEQ'6'       RTN250           *送貨明細
| 01-C                     END
|   C*
|   C           *LOVAL    SETLLSE0
|   C*
12===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
13===C           RTN210    BEGSR
|   C*
|   C                     SETON                     303132*ADD MSG
|   C                     EXSR RTN261                     *CLR FIELD
|   C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     Z-ADD0         DSE08
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 04-C                     END
|   C*
| 02*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 02-C                     END
|   C*
| 01-C                     END
|   C*
13===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
14===C           RTN220    BEGSR
|   C*
|   C                     SETOF                     30
|   C                     SETON                     31    *CAN INPUT
| 01-C           SE03      IFNE 'D8'
|   C                     SETON                     32
| 01*C                     ELSE
|   C                     SETOF                     32
| 01-C                     END
|   C           KEYSE4    CHAINSE0                  40
|   C           *LOVAL    SETLLSE0
|   C                     EXSR RTN262                     *FILE->SCRN
| 02-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     Z-ADDSE08      DSE08
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
| 04-C           *IN12     IFEQ '0'
|   C*
| 05-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN270
|   C                     CAS            RTN280
| 05-C                     END
|   C*
| 06-C           *IN99     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
|   C*
| 06-C                     END
|   C*
| 04*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 03-C                     END
|   C*
| 02-C                     END
|   C*
14===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
15===C           RTN230    BEGSR
|   C*
|   C                     SETOF                     303132*NO INPUT
|   C           KEYSE4    CHAINSE0                  40
|   C           *LOVAL    SETLLSE0
|   C                     EXSR RTN262                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
      *
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|   C*
15===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
16===C           RTN240    BEGSR
|   C*
|   C                     SETOF                     303132*NO INPUT
|   C           KEYSE4    CHAINSE0                  40
|   C           *LOVAL    SETLLSE0
|   C                     EXSR RTN262                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
      *
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|   C*
16===C                     ENDSR
      *==============================================================*
      *          RTN250....採購明細
      *==============================================================*
17===C           RTN250    BEGSR
|   C*
|   C                     SETOF                     303132*NO INPUT
|   C           KEYSE4    CHAINSE0                  40
|   C           *LOVAL    SETLLSE0
|   C                     EXSR RTN262                     *FIEL->SCRN
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
      *
|   C                     MOVE 'SCR001'  APPSCR
|   C*
17===C                     ENDSR
      *==============================================================*
      *          RTN261....CLEAR SCREEN DATA
      *==============================================================*
18===CSR         RTN261    BEGSR
|   C*
|   C                     MOVE *BLANK    DSE01
|   C                     MOVE *BLANK    DSE02
|   C                     MOVE *BLANK    DSE03
|   C                     MOVE *BLANK    DSE04
|   C                     MOVE *BLANK    DSE05
|   C                     Z-ADD0         DSE06
|   C                     MOVE *BLANKS   DSE07
|   C                     Z-ADD0         DSE08
|   C                     Z-ADD0         HSE08
|   C                     MOVE '*'       DSE09
|   C                     MOVE *BLANK    DSE10
|   C                     MOVE *BLANK    DSE11
|   C                     MOVE *BLANK    DSE12
|   C                     MOVE *BLANK    DSE13
|   C                     MOVE *BLANK    DSE14
|   C                     Z-ADD0         SE24
|   C                     Z-ADD0         DSE24
|   C                     MOVE *BLANK    DSE32
|   C                     MOVE *BLANK    DSE34
|   C                     Z-ADD0         SE37
|   C                     MOVEL*BLANKS   SE29
|   C                     MOVEL*BLANKS   SE30
|   C                     MOVE *BLANK    SE38
B2000C                     Z-ADD$EGMDY    DSE39
|   C                     MOVE *BLANK    DSE41
|   C                     MOVE *BLANK    DSE42
|   C*
|   C                     MOVE *BLANKS   D#B031
|   C                     MOVE *BLANKS   #D02
|   C                     MOVE *BLANKS   DME04
|   C                     MOVE *BLANKS   #203
|   C                     MOVE *BLANKS   D#A03
|   C                     MOVE *BLANKS   MC02
|   C                     MOVE *BLANKS   DSE09C
|   C                     MOVE *BLANKS   DME03
|   C                     MOVE *BLANKS   DME05
|   C                     MOVE *BLANKS   DME06
|   C                     MOVE *BLANKS   DME031
|   C                     MOVE *BLANKS   DME051
|   C                     MOVE *BLANKS   DME061
|   C*
18===CSR                   ENDSR
      *==============================================================*
      *          RTN262....MOVE DATA TO SCREEN
      *==============================================================*
19===CSR         RTN262    BEGSR
|   C*
|   C                     MOVE SE01      DSE01
|   C                     MOVE SE02      DSE02
|   C                     MOVE SE03      DSE03
|   C                     MOVE SE03      HSE03
|   C                     MOVE SE04      DSE04
|   C                     MOVE SE05      DSE05
|   C* DATE               Z-ADDSE06      DSE06
|   C                     MOVE SE07      DSE07
|   C                     Z-ADDSE08      DSE08
|   C                     Z-ADDSE08      HSE08
|   C                     MOVE SE09      DSE09
|   C                     MOVE SE10      DSE10
|   C                     MOVE SE11      DSE11
|   C                     MOVE SE12      DSE12
|   C                     MOVE SE13      DSE13
|   C                     MOVE SE14      DSE14
|   C                     MOVE SE32      DSE32
|   C                     MOVE SE34      DSE34
|   C                     MOVE SE27      HSE27
|   C                     MOVE SE28      HSE28
|   C                     MOVE SE41      DSE41
|   C                     MOVE SE42      DSE42
|   C*
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE06      S001I2  80
B2MODC           DSE06     PARM           S001O1  80
B2000C                     Z-ADDSE06      WSE06
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE24      S001I2  80
B2MODC           DSE24     PARM           S001O1  80
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE39      S001I2  80
B2MODC           DSE39     PARM           S001O1  80
|   C* GET 公司代號
|   C           DSE01     CHAIN#B0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVE #B03      D#B031
| 01*C                     ELSE
|   C                     MOVE *BLANK    D#B031
| 01-C                     END
|   C* GET 地區代號
|   C           DSE34     CHAIN#D0                  40
|   C   40                MOVE *BLANK    #D02
|   C* GET 客戶代號
|   C                     MOVELDSE04     ME01
|   C                     MOVELDSE05     ME02
|   C           KEYME     CHAINME0                  40
|   C   40                MOVE *BLANK    DME04
|   C  N40                MOVE ME04      DME04
|   C* GET 單別
|   C*                    MOVELDSE03     #201
|   C                     MOVELDSE03     #202
|   C           KEY#2     CHAIN#20                  40
|   C   40                MOVE *BLANK    #203
|   C* GET 出貨倉庫
|   C                     MOVE *BLANK    #A01
|   C                     MOVEL'STORAGE' #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVELDSE07     #A02
|   C           KEY#A     CHAIN#A0                  40
|   C   40                MOVE *BLANK    D#A03
|   C  N40                MOVEL#A03      D#A03
|   C* GET 業務員
|   C           SE32      CHAINMC0                  40
|   C   40                MOVE *BLANK    MC02
|   C* GET 送貨單狀態
| 02-C           DSE09     IFEQ '*'
|   C                     MOVELARR1,1    DSE09C
| 02*C                     ELSE
| 03-C           DSE09     IFEQ 'V'
|   C                     MOVELARR1,2    DSE09C
| 03*C                     ELSE
B2CHKC           SE21      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     MOVELARR1,3    DSE09C
| 04*C                     ELSE
|   C                     MOVELARR1,4    DSE09C
| 04-C                     END
| 03-C                     END
| 02-C                     END
|   C* GET 送貨地址
|   C                     MOVELDSE10     ME01
|   C                     MOVELDSE11     ME02
|   C           KEYME     CHAINME0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME03
|   C                     MOVE *BLANK    DME05
|   C                     MOVE *BLANK    DME06
| 05*C                     ELSE
|   C                     MOVELME04      DME03
|   C                     MOVE ME05      DME05
|   C                     MOVE ME06      DME06
| 05-C                     END
|   C* GET 發票地址
|   C                     MOVELDSE41     ME01
|   C                     MOVELDSE42     ME02
|   C           KEYME     CHAINME0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME031
|   C                     MOVE *BLANK    DME051
|   C                     MOVE *BLANK    DME061
| 06*C                     ELSE
|   C                     MOVELME04      DME031
|   C                     MOVE ME05      DME051
|   C                     MOVE ME06      DME061
| 06-C                     END
|   C* FOR UPDATE
| 07-C****       DOPT1     IFEQ '2'
|   C                     Z-ADDSE395N    SE395O  20       * FOR 年份
|   C*    HSE11,HSE36 FOR 物流點改變CHK -- SCR003
|   C                     MOVE DSE07     HSE07
|   C                     MOVE SE26      DSE26
|   C                     MOVE SE26      HSE26
|   C* FOR UPDATE : CHECK SCREEN2 CHANGE 19920417 PHILIP CHANGE
B2???C                     MOVE SCR2CN    SCR2CO 18        *FOR SCR2 CHANGE
B2INF *CVR5020 sev.50 Field SCR2CN is too long and cannot be handled by
B2INF *   ADD/REMOVE century routines
B2INF *CVR5020 sev.50 Field SCR2CO is too long and cannot be handled by
B2INF *   ADD/REMOVE century routines
| 07-C****                 END
|   C*
19===CSR                   ENDSR
      *==============================================================*
      *          RTN270....F5 -- 參考資料
      *==============================================================*
20===CSR         RTN270    BEGSR
|   C*
|   C                     EXSR RTN280
|   C********************
|   C*  GET ROW,COL     *
|   C********************
| 01-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 01-C                     END
|   C                     SETON                     99
|   C*
20===C                     ENDSR
      *==============================================================*
      *          RTN280....CHECK 'SE02' SCREEN
      *==============================================================*
21===CSR         RTN280    BEGSR
|   C* CHK,GET公司
| 01-C           DSE01     IFEQ *BLANK
|   C                     SETON                     609399
| 01*C                     ELSE
|   C           DSE01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVE #B03      D#B031
| 03-C           DSE01L    IFNE 'W'
|   C                     SETON                     607499
| 03-C                     END
| 02*C                     ELSE
|   C                     MOVE *BLANK    D#B031
|   C                     SETON                     608999
| 02-C                     END
| 01-C                     END
|   C   99                GOTO END280
|   C*
|   C* CHK,GET 單別
|   C                     MOVELDSE04     WQUERY
|   C                     MOVELDSE03     #201
|   C                     MOVELDSE03     #202
|   C           KEY#2     CHAIN#20                  40
| 05-C           *IN40     IFEQ '1'
|   C           #204      OREQ 'N'
|   C   40                MOVE *BLANK    #203
|   C                     SETON                     628899
| 05-C                     END
|   C   99                GOTO END280
|   C* 修改時　單別不可改變
| 06-C           DOPT1     IFEQ '2'
|   C           DSE03     ANDNEHSE03
|   C                     SETON                     628599
| 06-C                     END
|   C   99                GOTO END280
|   C* CHK,GET客戶代號
|   C                     MOVELDSE04     ME01
|   C                     MOVELDSE05     ME02
|   C           KEYME     CHAINME0                  40
| 07-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME04
|   C                     SETON                     618999
| 07*C                     ELSE
|   C                     MOVE ME04      DME04
|   C                     MOVE ME07      DSE34
      *不往來客戶
| 08-C           ME20      IFEQ 'I'
|   C                     SETON                     618099
| 08*C                     ELSE
|   C*業務員
|   C                     MOVE ME15      DSE32
|   C                     MOVELDSE04     WQUERY
| 09-C           DSE03     IFEQ 'D2'
|   C           WQUERY    ANDNE'B'
|   C                     SETON                     618399
| 09-C                     END
| 08-C                     END
| 07-C                     END
|   C   99                GOTO END280
|   C           DSE32     CHAINMC0                  40
|   C* CHK 業務員
| 10-C           *IN40     IFEQ '1'
|   C                     SETON                     678999
|   C   40                MOVE *BLANKS   MC02
| 10-C                     END
|   C   99                GOTO END280
|   C* CHK 寄賣
|   C** UPDATE BY STEPHANIE  D5->D3
|   C           DSE04     CHAINMD0                  40
|   C           *LOVAL    SETLLMD0
| 11-C           DSE03     IFEQ 'D3'
|   C           MD20      ANDNE'Y'
|   C                     SETON                     618199
| 11-C                     END
|   C   99                GOTO END280
      *
| 12-C           MD07      IFNE 'C'
|   C           MD08      ORNE '13'
|   C                     SETON                     617399
| 12-C                     END
|   C   99                GOTO END280
      *寄賣，寄放
| 13-C           DSE03     IFNE 'D3'
|   C           DSE03     ANDNE'D5'
|   C                     SETON                     628999
| 13-C                     END
|   C   99                GOTO END280
|   C** UPDATE BY STEPHANIE  D3->D5
| 14-C           DSE03     IFEQ 'D5'
|   C           MD21      ANDNE'Y'
|   C                     SETON                     618199
| 14-C                     END
|   C   99                GOTO END280
|   C* CHK 送貨單日期
B2CHKC           DSE39     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     659399
| 15*C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DSE39     P0901I  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0901O  1
| 16-C           P0901O    IFEQ 'N'
|   C                     SETON                     659099
| 16-C                     END
| 15-C                     END
|   C   99                GOTO END280
|   C* 日期轉換
B2MODC                     Z-ADD0         WSE39   80
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE39     S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WSE39     PARM           S001O1  80
      *
      *
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          DSE39     IFNE $EGMDY
B2NEWC                     MOVE DSE39     HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    H@8N01  80
B2NEWC                     MOVE $EGMDY    HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    H@8N02  80
B2NEWC           H@8N01    IFNE H@8N02
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2MODC                     Z-ADD$CHYMD    CHKMDY  80
B2CHKC                     MOVE '01'      CHKMDY
B2INF *CVR0004 sev.00 Assumed to be the update of a date field in the zone
B2INF *   that does not contain a year
|   C                     CALL 'P62'
B2MODC                     PARM CHKMDY    P6201I  80
|   C                     PARM -1        P6202I  40
B2MODC           CHKMDY    PARM           P6201O  80
B2CHKC                     ADD  110000    CHKMDY
B2000C           WSE39     IFNE CHKMDY
|   C                     SETON                     657599
| 20-C                     END
| 19-C                     END
|   C   99                GOTO END280
      *
|   C* CHK 送貨日期
B2CHKC           DSE06     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     639399
| 17*C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DSE06     P0901I  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0901O  1
| 18-C           P0901O    IFEQ 'N'
|   C                     SETON                     639099
| 18-C                     END
| 17-C                     END
|   C   99                GOTO END280
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE06     S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WSE06     PARM           S001O1  80
      *送貨日期不可大於月結月份
B2000C           SE06YM    IFLE #B16
|   C                     SETON                     638499
| 21-C                     END
|   C   99                GOTO END280
|   C* UPDATE -- 年份不得變更
| 22-C           DOPT1     IFEQ '2'
|   C           SE395N    ANDNESE395O
|   C                     SETON                     658699
| 22-C                     END
|   C   99                GOTO END280
|   C* CHK,GET 發票地址
| 23-C           DSE41     IFEQ *BLANK
|   C           DSE42     ANDEQ*BLANK
|   C                     MOVE DSE04     DSE41
|   C                     MOVE *BLANKS   DSE42
| 23-C                     END
|   C                     MOVELDSE41     ME01
|   C                     MOVELDSE42     ME02
|   C           KEYME     CHAINME0                  40
| 24-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME031
|   C                     MOVE *BLANK    DME051
|   C                     MOVE *BLANK    DME061
|   C                     SETON                     688999
| 24*C                     ELSE
|   C                     MOVELME04      DME031
|   C                     MOVE ME05      DME051
|   C                     MOVE ME06      DME061
      *不往來客戶
| 25-C           ME20      IFEQ 'I'
|   C                     SETON                     688099
| 25-C                     END
| 24-C                     END
|   C   99                GOTO END280
|   C* CHK,GET 送貨地址
| 26-C           DSE10     IFEQ *BLANK
|   C           DSE11     ANDEQ*BLANK
|   C                     MOVE DSE04     DSE10
|   C                     MOVE DSE05     DSE11
| 26-C                     END
|   C                     MOVELDSE10     ME01
|   C                     MOVELDSE11     ME02
|   C           KEYME     CHAINME0                  40
| 27-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME03
|   C                     MOVE *BLANK    DME05
|   C                     MOVE *BLANK    DME06
|   C                     SETON                     648999
| 27*C                     ELSE
|   C                     MOVELME04      DME03
|   C                     MOVE ME05      DME05
|   C                     MOVE ME06      DME06
      *不往來客戶
| 28-C           ME20      IFEQ 'I'
|   C                     SETON                     647599
| 28-C                     END
| 27-C                     END
|   C   99                GOTO END280
      *
| 29-C           DSE07     IFEQ *BLANK
|   C                     SETON                     669399
| 29*C                     ELSE
| 30-C           DSE07L    IFNE 'V'
|   C                     SETON                     667299
| 30-C                     END
| 29-C                     END
|   C   99                GOTO END280
|   C* GET 出貨物流點
|   C           ME07      CHAIN#D0                  40
| 31-C           *IN40     IFEQ '1'
|   C                     SETON                     648999
|   C                     MOVE *BLANK    DSE07
|   C                     MOVE *BLANK    D#A03
| 31*C                     ELSE
| 32-C           DSE07     IFEQ *BLANKS
|   C                     MOVEL#D03      DSE07
| 32-C                     END
|   C                     MOVE *BLANK    #A01
|   C                     MOVEL'STORAGE' #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVELDSE07     #A02
|   C           KEY#A     CHAIN#A0                  40
| 33-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    D#A03
|   C                     SETON                     668999
| 33*C                     ELSE
|   C                     MOVEL#A03      D#A03
| 33-C                     END
| 31-C                     END
|   C   99                GOTO END280
|   C*
|   C                     MOVELDSE07     WQUERY
| 34-C*          WQUERY    IFNE 'W'
|   C*                    SETON                     668299
| 34-C*                    END
|   C*  99                GOTO END280
|   C*
|   C* GET 送貨單狀況
| 35-C           DSE09     IFEQ '*'
|   C                     MOVELARR1,1    DSE09C
| 35*C                     ELSE
| 36-C           DSE09     IFEQ 'V'
|   C                     MOVELARR1,2    DSE09C
| 36*C                     ELSE
B2CHKC           SE21      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     MOVELARR1,3    DSE09C
| 37*C                     ELSE
|   C                     MOVELARR1,4    DSE09C
| 37-C                     END
| 36-C                     END
| 35-C                     END
|   C           DSE41     CHAINMD0                  40
|   C           *LOVAL    SETLLMD0
| 38-C           *IN40     IFEQ '0'
|   C                     MOVE MD33      DSE26
| 38*C                     ELSE
|   C                     MOVE *BLANK    DSE26
| 38-C                     END
|   C* GET 通路　型態
|   C           DSE04     CHAINMD0                  40
|   C                     MOVE MD07      HSE27
|   C                     MOVE MD08      HSE28
|   C* FOR RECORD LOCK ---> SETLL
|   C           END280    TAG
|   C           *LOVAL    SETLLMD0
|   C*
21===CSR                   ENDSR
    C*==============================================================*
    C*          RTN29S....SCREEN TO FILE --- H
    C*==============================================================*
22===C*          RTN29S    BEGSR
|   C*
|   C*
22===C*                    ENDSR
    C*==============================================================*
    C*          RTN300....'SE03' SCREEN MAIN ROUTINE --- SFLSR
    C*==============================================================*
23===C           RTN300    BEGSR
|   C*
| 01-C           DOPT1     CASEQ'1'       RTN310           *ADD
|   C           DOPT1     CASEQ'2'       RTN320           *UPD
|   C           DOPT1     CASEQ'4'       RTN330           *DLT
|   C           DOPT1     CASEQ'5'       RTN340           *INQ
|   C           DOPT1     CASEQ'6'       RTN340           *採購明細
| 01-C                     END
|   C   12                SETOF                     12
|   C* FOR RECORD LOCK
|   C           *LOVAL    SETLLSF0
|   C           *LOVAL    SETLLIA0
|   C           *LOVAL    SETLLMD0
|   C           *LOVAL    SETLLMA0
|   C*
23===C                     ENDSR
    C*==============================================================*
    C*          RTN310....ADD DATA --- SFLSR
    C*==============================================================*
24===C           RTN310    BEGSR
|   C*
|   C                     SETON                     3233
| 01-C***        DSE03     IFEQ 'D2'                       *專櫃
|   C*          DSE03     OREQ 'D3'                       *寄賣
|   C*          DSE03     OREQ 'D5'                       *寄放
|   C*          DSE03     OREQ 'D6'                       *換貨
|   C*          DSE03     OREQ 'D8'                       *補貨
|   C                     SETOF                     3435
| 01*C***                  ELSE
|   C**                   SETON                     3435
| 01-C**                   END
|   C*
|   C                     EXSR RTN391                     *INT SFLSR
|   C                     EXSR RTN397                     *READ BLANK
|   C*
| 02-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
| 04-C           *IN12     IFEQ '0'
|   C*
| 05-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 05-C                     END
|   C*
| 06-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C                     EXSR RTN39S                     *SAVE
|   C                     MOVE 'SCR001'  APPSCR
| 06-C                     END
|   C*
| 04*C                     ELSE
|   C           *LOVAL    SETLLSF0
|   C                     MOVE 'SCR002'  APPSCR
| 04-C                     END                             *IN03 ENDIF
| 03-C                     END                             *IN12 ENDIF
|   C*
| 02-C                     END                             *ENDDO
|   C*
24===C                     ENDSR
    C*==============================================================*
    C*          RTN320....UPD DATA --- SFLSR
    C*==============================================================*
25===C           RTN320    BEGSR
|   C*
|   C                     SETON                     33
|   C                     SETOF                     32
|   C                     SETOF                     3435
|   C*
|   C                     EXSR RTN391                     *INT SFLSR
|   C                     EXSR RTN398                     *READ DATA
| 01-C           *IN99     IFEQ '0'
|   C                     EXSR RTN397                     *READ BLANK
| 01*C                     ELSE
|   C                     MOVE 'SCR002'  APPSCR
|   C           *LOVAL    SETLLSF0
| 01-C                     END
|   C*
| 02-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
| 04-C           *IN12     IFEQ '0'
|   C*
| 05-C           *IN05     IFEQ '1'
|   C                     MOVE 'N'       WINDLT  1
| 05*C                     ELSE
|   C                     MOVE 'Y'       WINDLT
| 05-C                     END
|   C*
| 06-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 06-C                     END
|   C*
| 07-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'                         SAVE
|   C                     EXSR RTN39S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
| 07-C                     END
|   C*
| 04*C                     ELSE
|   C           *LOVAL    SETLLSF0
|   C                     MOVE 'SCR002'  APPSCR
| 04-C                     END                             *IN03 ENDIF
| 03-C                     END                             *IN12 ENDIF
|   C*
| 02-C                     END                             *ENDDO
|   C*
25===C                     ENDSR
    C*==============================================================*
    C*          RTN330....DEL DATA --- SFLSR2
    C*==============================================================*
26===C           RTN330    BEGSR
|   C*
|   C                     SETOF                     323334*NO INPUT
|   C                     SETOF                     35    *NO INPUT
|   C                     EXSR RTN391                     *INT SFLSR
|   C                     EXSR RTN398                     *READ DATA TO SFLSR
|   C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
|   C                     MOVE 'N'       WINDLT
|   C*
| 04-C           *IN04     CASEQ'1'       RTN381
|   C                     CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 06-C           DLTFLG    IFEQ 'Y'
|   C                     EXSR RTN39T                      DLT D
| 06-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLSF0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|   C*
26===C                     ENDSR
    C*==============================================================*
    C*          RTN340....INQ DATA --- SFLSR2
    C*==============================================================*
27===C           RTN340    BEGSR
|   C*
|   C                     SETOF                     323334*NO INPUT
|   C                     SETOF                     35    *NO INPUT
|   C                     EXSR RTN391                     *INT SFLSR
|   C                     EXSR RTN398                     *READ DATA TO SFLSR
|   C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTN381
|   C*                    CAS            RTN380            CHK SFLSR
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN05     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLSF0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|   C*
27===C                     ENDSR
    C*==============================================================*
    C*          RTN380....CHECK 'SE03' --- SFLSR
    C*==============================================================*
28===C           RTN380    BEGSR
|   C*
|   C                     Z-ADDHSE08     DSE08
|   C*CHK SCREEN
|   C                     SETON                     54
|   C                     READCSFLSR2                 5757
|   C*
| 01-C           *IN57     DOWEQ'0'
|   C*
| 02-C           DOPT1     IFEQ '4'
|   C                     MOVE '4'       DOPT2
| 02-C                     END
|   C*
|   C                     SETOF                     606162
|   C                     SETOF                     6364
|   C*                                  DATA ENTRY & *IN99 OFF ->CHECK
| 03-C           DCHK      IFEQ 'Y'
|   C                     SETOF                     32    *PROTECT FIELD
| 03*C                     ELSE
|   C                     SETON                     32
| 03-C                     END
|   C   99                GOTO UPD
|   C*
| 04-C           DOPT2     IFEQ *BLANK
|   C           DSF03     ANDEQ*BLANK
|   C                     EXSR RTN39A
|   C                     GOTO UPD
| 04-C                     END
|   C*
| 05-C           DCHK      IFEQ 'Y'
| 06-C           DOPT2     IFEQ '1'
|   C                     SETON                     609199
| 06-C                     END
| 05*C                     ELSE
| 07-C           DOPT2     IFEQ '2'
|   C           DOPT2     OREQ '4'
|   C*****      DOPT2     OREQ '5'
|   C                     SETON                     609299
| 07-C                     END
| 05-C                     END
|   C   99                GOTO DSP
|   C* DLETE : WINDOW CHK FOR SUMMARY
| 08-C           DOPT2     IFEQ '4'
|   C           WINDLT    ANDEQ'Y'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 09-C           DLTFLG    IFNE 'Y'
|   C                     MOVE *BLANK    DOPT2
| 09-C                     END
|   C* WDS000 SHARE OPEN ---> DON'T WRITE
| 08-C                     END
|   C* 5.庫存查詢
| 10-C           DOPT2     IFEQ '5'
|   C                     CALL 'IMI0211'
|   C                     PARM DSF03     I021I1  9
|   C                     PARM           I021O1  1
|   C                     SETON                     99
|   C                     MOVE *BLANKS   DOPT2
|   C                     GOTO UPD
| 10-C                     END
|   C* CHK 產品代號
| 11-C           DOPT2     IFNE *BLANK
| 12-C           DSF03     IFEQ *BLANK
|   C                     SETON                     619399
|   C                     MOVE *BLANK    MA03
|   C                     MOVE *BLANK    MA13
| 12*C                     ELSE
|   C           DSF03     CHAINMA0                  40
| 13-C           *IN40     IFEQ '1'
|   C                     SETON                     618999
|   C                     MOVE *BLANK    MA03
|   C                     MOVE *BLANK    MA13
| 13*C                     ELSE
|   C                     MOVE MA07      HSF16            *產品歸屬
      *MA58='A'表可出貨
| 14-C           MA58      IFNE 'A'
|   C                     SETON                     618999
| 14*C                     ELSE
| 15-C           DSE03     IFEQ 'D5'
      *寄放
|   C           MA56      ANDNE'Y'
|   C                     SETON                     618299
| 15*C                     ELSE
      *寄賣
| 16-C           DSE03     IFEQ 'D3'
|   C           MA55      ANDNE'Y'
|   C                     SETON                     618399
| 16-C                     END
| 15-C                     END
| 14-C                     END
| 13-C                     END
| 12-C                     END
| 11-C                     END
|   C   99                GOTO DSP
|   C* CHK 課稅別
| 17-C           DOPT2     IFEQ '4'
|   C                     SUB  1         COUNT
| 18-C           COUNT     IFEQ 0
|   C                     MOVE *BLANKS   SE38
| 18-C                     END
| 17*C                     ELSE
| 19-C           DOPT2     IFEQ '1'
| 20-C           SE38      IFEQ *BLANKS
|   C                     MOVE MA59      SE38
| 20*C                     ELSE
| 21-C           MA59      IFNE SE38
|   C                     SETON                     618499
| 21-C                     END
| 20-C                     END
| 19-C                     END
| 17-C                     END
|   C   99                GOTO DSP
|   C* GET 零售價
B2000C           WSE06     IFLT MA39
|   C                     Z-ADDMA41      HSF15
|   C                     Z-ADDMA41      HSF08
|   C                     Z-ADDMA41      HSF10
| 22*C                     ELSE
|   C                     Z-ADDMA46      HSF15
|   C                     Z-ADDMA46      HSF08
|   C                     Z-ADDMA46      HSF10
| 22-C                     END
      *未報牌價
| 23-C           HSF15     IFEQ 0
|   C                     SETON                     617999
| 23-C                     END
|   C   99                GOTO DSP
|   C* GET 正常單價，正常折扣，特別折扣
| 24-C           #214      IFEQ 'Y'
|   C                     SETOF                     81
|   C                     MOVE DSE04     SB01
|   C                     Z-ADD1         RATE    54
|   C                     MOVE 'N'       SA04
|   C                     MOVE 'N'       SB04
|   C                     EXSR RTN38B
|   C                     MOVE 'S'       SA04
|   C                     MOVE 'S'       SB04
|   C                     EXSR RTN38B
      *售價＝牌價も（１－（正折％＋特折％））
|   C           HSF15     MULT RATE      HSF08     H
      *折扣ＵＮＩＴ＝牌價－售價
|   C           HSF15     SUB  HSF08     WRK     90H
      *特折ＵＮＩＴ＝折扣ＵＮＩＴ－正折ＵＮＩＴ
|   C           WRK       SUB  HSF13     HSF14   50
| 25-C           HSF14     IFLT 0
|   C                     ADD  HSF14     HSF13
|   C                     Z-ADD0         HSF14
| 25-C                     END
| 24*C                     ELSE
|   C                     Z-ADD0         HSF08
|   C                     Z-ADD0         HSF13
|   C                     Z-ADD0         HSF14
| 24-C                     END
|   C   99                GOTO DSP
|   C* CHK,GET 單位成本
|   C                     MOVELDSE01     WQUERY
| 26-C           HSF16     IFEQ WQUERY
|   C                     Z-ADDMA31      HSF10
|   C                     Z-ADDMA32      HSF11
|   C                     Z-ADDMA33      HSF12
| 26*C                     ELSE
|   C                     SETOF                     81
|   C           DSE01     CHAIN#B0                  40
|   C                     MOVE #B14      SB01
|   C                     Z-ADD1         RATE
|   C                     MOVE 'N'       SA04
|   C                     MOVE 'N'       SB04
|   C                     EXSR RTN38C
|   C                     MOVE 'S'       SA04
|   C                     MOVE 'S'       SB04
|   C                     EXSR RTN38C
|   C           HSF15     MULT RATE      HSF10     H
      *HSF10四捨五入－－＞元
|   C                     Z-ADDHSF10     WORK   100H
|   C                     Z-ADDWORK      HSF10
| 26-C                     END
|   C   99                GOTO DSP
|   C* GET 正常搭贈
|   C                     EXSR RTN38A
|   C* CHK 訂購數量，搭贈數量
| 27-C           DOPT2     IFNE *BLANK
|   C           DSF03     ANDNE*BLANK
| 28-C           DSF04     IFEQ 0
|   C           DSF05     ANDEQ0
|   C                     SETON                     629399
| 28-C                     END
| 27-C                     END
|   C   99                GOTO DSP
|   C* CHK 可用量
|   C                     MOVELHSF16     IA01             *FOR KEY
|   C                     MOVE DSE07     IA02             *FOR KEY
|   C           KEYIA     CHAINIA0                  40
|   C           *LOVAL    SETLLIA0
|   C   40                Z-ADD0         IA10
| 29-C           DSE07     IFEQ HSE07                      *物流點未變
| 30-C           DOPT2     IFEQ '4'
|   C                     Z-ADDHSF04     STOR    60
|   C                     ADD  HSF05     STOR
| 30*C                     ELSE
|   C           HSF04     SUB  DSF04     STOR
|   C                     ADD  HSF05     STOR
|   C                     SUB  DSF05     STOR
| 30-C                     END
| 29*C                     ELSE                            *物流點改變
| 31-C           DOPT2     IFEQ '4'
|   C                     Z-ADDHSF04     STOR    60
|   C                     ADD  HSF05     STOR
| 31*C                     ELSE
|   C                     Z-SUBDSF04     STOR
|   C                     SUB  DSF05     STOR
| 31-C                     END
| 29-C                     END
|   C                     ADD  IA10      STOR
| 32-C           STOR      IFLT 0
|   C                     SETON                     62
| 33-C******     DSE03     IFEQ 'D2'
|   C*****      DSE03     OREQ 'D3'
|   C**         DSE03     OREQ 'D5'
|   C**                   SETON                     63
| 33-C***                  END
|   C                     SETON                     8899
| 32-C                     END
|   C   99                GOTO DSP
|   C* CHK 庫存量
| 34-C           DSE03     IFEQ 'D8'
|   C                     MOVE DSE26     IA02
|   C           KEYIA     CHAINIA0                  40
|   C           *LOVAL    SETLLIA0
|   C   40                Z-ADD0         IA09
| 35-C           DSE26     IFEQ HSE26                      *物流點未變
| 36-C           DOPT2     IFEQ '4'
|   C                     Z-SUBHSF04     STOR    60
|   C                     SUB  HSF05     STOR
| 36*C                     ELSE
|   C           DSF04     SUB  HSF04     STOR
|   C                     ADD  DSF05     STOR
|   C                     SUB  HSF05     STOR
| 36-C                     END
| 35*C                     ELSE                            *物流點改變
| 37-C           DOPT2     IFEQ '4'
|   C                     Z-SUBHSF04     STOR    60
|   C                     SUB  HSF05     STOR
| 37*C                     ELSE
|   C                     Z-ADDDSF04     STOR
|   C                     ADD  DSF05     STOR
| 37-C                     END
| 35-C                     END
|   C                     ADD  IA09      STOR
| 38-C           STOR      IFGT 0
|   C                     SETON                     62
| 39-C****       DSE03     IFEQ 'D2'
|   C**         DSE03     OREQ 'D3'
|   C*          DSE03     OREQ 'D5'
|   C*                    SETON                     63
| 39-C****                 END
|   C                     SETON                     8799
| 38-C                     END
| 34-C                     END
|   C   99                GOTO DSP
|   C                     Z-ADDHSF08     DSF06
|   C* GET 送貨數量　金額AND總金額
|   C           DSF04     ADD  DSF05     DFLD1
|   C           DSF06     MULT DSF04     DSF07
|   C                     SELEC
|   C           DOPT2     WHEQ '1'
|   C                     ADD  DSF07     DSE08
|   C           DOPT2     WHEQ '2'
|   C                     ADD  DSF07     DSE08
|   C                     SUB  HSF07     DSE08
|   C           DOPT2     WHEQ '4'
|   C                     SUB  HSF07     DSE08
|   C                     ENDSL
|   C*
|   C           DSP       TAG
|   C   99                Z-ADDRRN2      DRRN2
|   C*
|   C           UPD       TAG
| 40-C           DOPT1     IFEQ '4'
|   C                     MOVE *BLANK    DOPT2
| 40-C                     END
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
|   C*
|   C   99                GOTO END380
|   C* FOR RECORD LOCK
|   C           END380    TAG
|   C           *LOVAL    SETLLSF0
|   C           *LOVAL    SETLLIA0
|   C           *LOVAL    SETLLMD0
|   C           *LOVAL    SETLLMA0
|   C********************
|   C*  GET ROW,COL     *
|   C********************
| 41-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 41-C                     END
|   C*
28===C                     ENDSR
    C*==============================================================*
    C*          RTN38A....GET 正常搭贈
    C*==============================================================*
29===C           RTN38A    BEGSR
|   C*
| 01-C           #213      IFEQ 'N'
|   C                     Z-ADD0         HSF09
| 01*C                     ELSE
|   C                     MOVE DSE04     SB01
|   C                     MOVE 'A'       SA04
|   C                     MOVE 'A'       SB04
|   C                     SETOF                     59
      *----------------------------------------------------------------
|   C*客戶產品全稱
B2000C           KEYSB1    SETGTSB0
|   C           KEYSB2    REDPESB0                      48
| 02-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SB05
|   C           WSE06     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
|   C*
| 04-C           DSF04     IFLT SB08
|   C           SB08      OREQ 0
|   C                     Z-ADD0         HSF09
| 04*C                     ELSE
| 05-C           DSF04     IFGE SB08
|   C           DSF04     ANDLTSB10
|   C           DSF04     ORGE SB08
|   C           SB10      ANDEQ0
|   C           DSF04     DIV  SB08      HSF09
|   C                     MULT SB07      HSF09
| 05*C                     ELSE
| 06-C           DSF04     IFGE SB10
|   C           DSF04     ANDLTSB12
|   C           DSF04     ORGE SB10
|   C           SB12      ANDEQ0
|   C           DSF04     DIV  SB10      HSF09
|   C                     MULT SB09      HSF09
| 06*C                     ELSE
| 07-C           DSF04     IFGE SB12
|   C           SB12      ANDNE0
|   C           DSF04     DIV  SB12      HSF09
|   C                     MULT SB11      HSF09
| 07-C                     END
| 06-C                     END
| 05-C                     END
| 04-C                     END
|   C                     SETON                     59
| 03*C                     ELSE
|   C           KEYSB2    REDPESB0                      48
| 03-C                     END
| 02-C                     END
|   C*
      *----------------------------------------------------------------
| 08-C           *IN59     IFEQ '0'
|   C*客戶產品前四碼
|   C                     MOVELDSF03L    KSF03
B2000C           SB1KEY    SETGTSB0
|   C           SB2KEY    REDPESB0                      48
| 09-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SB05
|   C           WSE06     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
|   C*
| 11-C           DSF04     IFLT SB08
|   C           SB08      OREQ 0
|   C                     Z-ADD0         HSF09
| 11*C                     ELSE
| 12-C           DSF04     IFGE SB08
|   C           DSF04     ANDLTSB10
|   C           DSF04     ORGE SB08
|   C           SB10      ANDEQ0
|   C           DSF04     DIV  SB08      HSF09
|   C                     MULT SB07      HSF09
| 12*C                     ELSE
| 13-C           DSF04     IFGE SB10
|   C           DSF04     ANDLTSB12
|   C           DSF04     ORGE SB10
|   C           SB12      ANDEQ0
|   C           DSF04     DIV  SB10      HSF09
|   C                     MULT SB09      HSF09
| 13*C                     ELSE
| 14-C           DSF04     IFGE SB12
|   C           SB12      ANDNE0
|   C           DSF04     DIV  SB12      HSF09
|   C                     MULT SB11      HSF09
| 14-C                     END
| 13-C                     END
| 12-C                     END
| 11-C                     END
|   C                     SETON                     59
| 10*C                     ELSE
|   C           SB2KEY    REDPESB0                      48
| 10-C                     END
| 09-C                     END
| 08-C                     END
|   C*
      *----------------------------------------------------------------
|   C*客戶產品全稱
| 15-C           *IN59     IFEQ '0'
B2000C           KEYSA1    SETGTSA0
|   C           KEYSA2    REDPESA0                      48
| 16-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SA05
|   C           WSE06     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
|   C*
| 18-C           DSF04     IFLT SA08
|   C           SA08      OREQ 0
|   C                     Z-ADD0         HSF09
| 18*C                     ELSE
| 19-C           DSF04     IFGE SA08
|   C           DSF04     ANDLTSA10
|   C           DSF04     ORGE SA08
|   C           SA10      ANDEQ0
|   C           DSF04     DIV  SA08      HSF09
|   C                     MULT SA07      HSF09
| 19*C                     ELSE
| 20-C           DSF04     IFGE SA10
|   C           DSF04     ANDLTSA12
|   C           DSF04     ORGE SA10
|   C           SA12      ANDEQ0
|   C           DSF04     DIV  SA10      HSF09
|   C                     MULT SA09      HSF09
| 20*C                     ELSE
| 21-C           DSF04     IFGE SA12
|   C           SA12      ANDNE0
|   C           DSF04     DIV  SA12      HSF09
|   C                     MULT SA11      HSF09
| 21-C                     END
| 20-C                     END
| 19-C                     END
| 18-C                     END
|   C                     SETON                     59
| 17*C                     ELSE
|   C           KEYSA2    REDPESA0                      48
| 17-C                     END
| 16-C                     END
| 15-C                     END
      *----------------------------------------------------------------
|   C*客戶產品前四碼
| 22-C           *IN59     IFEQ '0'
B2000C           SA1KEY    SETGTSA0
|   C           SA2KEY    REDPESA0                      48
| 23-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SA05
|   C           WSE06     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
|   C*
| 25-C           DSF04     IFLT SA08
|   C           SA08      OREQ 0
|   C                     Z-ADD0         HSF09
| 25*C                     ELSE
| 26-C           DSF04     IFGE SA08
|   C           DSF04     ANDLTSA10
|   C           DSF04     ORGE SA08
|   C           SA10      ANDEQ0
|   C           DSF04     DIV  SA08      HSF09
|   C                     MULT SA07      HSF09
| 26*C                     ELSE
| 27-C           DSF04     IFGE SA10
|   C           DSF04     ANDLTSA12
|   C           DSF04     ORGE SA10
|   C           SA12      ANDEQ0
|   C           DSF04     DIV  SA10      HSF09
|   C                     MULT SA09      HSF09
| 27*C                     ELSE
| 28-C           DSF04     IFGE SA12
|   C           SA12      ANDNE0
|   C           DSF04     DIV  SA12      HSF09
|   C                     MULT SA11      HSF09
| 28-C                     END
| 27-C                     END
| 26-C                     END
| 25-C                     END
|   C                     SETON                     59
| 24*C                     ELSE
|   C           SA2KEY    REDPESA0                      48
| 24-C                     END
| 23-C                     END
| 22-C                     END
      *
| 01-C                     END
|   C*
29===C                     ENDSR
    C*==============================================================*
    C*          RTN38B....GET 正常單價，正常折扣，特別折扣
    C*==============================================================*
30===C           RTN38B    BEGSR
|   C*
|   C                     SETOF                     59
      *----------------------------------------------------------------
|   C*客戶產品全稱
B2000C           KEYSB1    SETGTSB0
|   C           KEYSB2    REDPESB0                      48
| 01-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SB05
|   C           WSE06     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
|   C*
| 03-C           SB04      IFEQ 'N'
|   C           HSF15     MULT SB06      HSF13     H      *正常折扣
|   C                     SUB  SB06      RATE             *正常折扣
| 03*C                     ELSE
|   C                     SUB  SB06      RATE
| 03-C                     END
|   C                     SETON                     59
| 02*C                     ELSE
|   C           KEYSB2    REDPESB0                      48
| 02-C                     END
| 01-C                     END
      *----------------------------------------------------------------
| 04-C           *IN59     IFEQ '0'
|   C*客戶產品前四碼
|   C                     MOVELDSF03L    KSF03
B2000C           SB1KEY    SETGTSB0
|   C           SB2KEY    REDPESB0                      48
| 05-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SB05
|   C           WSE06     ANDLESB13
|   C           SB14      ANDEQ*BLANKS
|   C*
| 07-C           SB04      IFEQ 'N'
|   C           HSF15     MULT SB06      HSF13     H      *正常折扣
|   C                     SUB  SB06      RATE             *正常折扣
| 07*C                     ELSE
|   C                     SUB  SB06      RATE
| 07-C                     END
|   C                     SETON                     59
| 06*C                     ELSE
|   C           SB2KEY    REDPESB0                      48
| 06-C                     END
| 05-C                     END
| 04-C                     END
|   C*
      *----------------------------------------------------------------
|   C*客戶產品全稱
| 08-C           *IN59     IFEQ '0'
B2000C           KEYSA1    SETGTSA0
|   C           KEYSA2    REDPESA0                      48
| 09-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SA05
|   C           WSE06     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
|   C*
| 11-C           SB04      IFEQ 'N'
|   C           HSF15     MULT SA06      HSF13     H      *正常折扣
|   C                     SUB  SA06      RATE
| 11*C                     ELSE
|   C                     SUB  SA06      RATE
| 11-C                     END
|   C                     SETON                     59
| 10*C                     ELSE
|   C           KEYSA2    REDPESA0                      48
| 10-C                     END
| 09-C                     END
| 08-C                     END
      *----------------------------------------------------------------
|   C*客戶產品前四碼
| 12-C           *IN59     IFEQ '0'
B2000C           SA1KEY    SETGTSA0
|   C           SA2KEY    REDPESA0                      48
| 13-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SA05
|   C           WSE06     ANDLESA13
|   C           SA14      ANDEQ*BLANKS
|   C*
| 15-C           SB04      IFEQ 'N'
|   C           HSF15     MULT SA06      HSF13     H      *正常折扣
|   C                     SUB  SA06      RATE
| 15*C                     ELSE
|   C                     SUB  SA06      RATE
| 15-C                     END
|   C                     SETON                     59
| 14*C                     ELSE
|   C           SA2KEY    REDPESA0                      48
| 14-C                     END
| 13-C                     END
| 12-C                     END
|   C*
| 16-C           *IN59     IFEQ '0'
|   C   81                SETON                     618699
|   C                     SETON                     81
| 16-C                     END
|   C*
30===C                     ENDSR
    C*==============================================================*
    C*          RTN38C....GET 單位成本
    C*==============================================================*
31===C           RTN38C    BEGSR
|   C*
|   C                     SETOF                     59
      *----------------------------------------------------------------
|   C*客戶產品全稱
B2000C           KEYSB1    SETGTSB0
|   C           KEYSB2    REDPESB0                      48
| 01-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SB05
|   C           WSE06     ANDLESB13
| 03-C           SB04      IFEQ 'N'
|   C                     SUB  SB06      RATE
| 03*C                     ELSE
|   C                     SUB  SB06      RATE
| 03-C                     END
|   C                     Z-ADD0         HSF11
|   C                     Z-ADD0         HSF12
|   C                     SETON                     59
| 02*C                     ELSE
|   C           KEYSB2    REDPESB0                      48
| 02-C                     END
| 01-C                     END
|   C*
      *----------------------------------------------------------------
|   C*客戶產品前四碼
|   C                     MOVELDSF03L    KSF03
B2000C           SB1KEY    SETGTSB0
|   C           SB2KEY    REDPESB0                      48
| 04-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SB05
|   C           WSE06     ANDLESB13
| 06-C           SB04      IFEQ 'N'
|   C                     SUB  SB06      RATE
| 06*C                     ELSE
|   C                     SUB  SB06      RATE
| 06-C                     END
|   C                     Z-ADD0         HSF11
|   C                     Z-ADD0         HSF12
|   C                     SETON                     59
| 05*C                     ELSE
|   C           SB2KEY    REDPESB0                      48
| 05-C                     END
| 04-C                     END
|   C*
|   C*
|   C           #B14      CHAINMD0                  40
|   C           *LOVAL    SETLLMD0
| 07-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MD07
|   C                     MOVEL*BLANKS   MD08
| 07-C                     END
      *
      *----------------------------------------------------------------
|   C*客戶產品全稱
| 08-C           *IN59     IFEQ '0'
B2000C           KEYSA3    SETGTSA0
|   C           KEYSA4    REDPESA0                      48
| 09-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SA05
|   C           WSE06     ANDLESA13
| 11-C           SB04      IFEQ 'N'
|   C                     SUB  SA06      RATE
| 11*C                     ELSE
|   C                     SUB  SA06      RATE
| 11-C                     END
|   C                     Z-ADD0         HSF11
|   C                     Z-ADD0         HSF12
|   C                     SETON                     59
| 10*C                     ELSE
|   C           KEYSA4    REDPESA0                      48
| 10-C                     END
| 09-C                     END
| 08-C                     END
      *----------------------------------------------------------------
|   C*客戶產品前四碼
| 12-C           *IN59     IFEQ '0'
B2000C           SA3KEY    SETGTSA0
|   C           SA4KEY    REDPESA0                      48
| 13-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           WSE06     IFGE SA05
|   C           WSE06     ANDLESA13
| 15-C           SB04      IFEQ 'N'
|   C                     SUB  SA06      RATE
| 15*C                     ELSE
|   C                     SUB  SA06      RATE
| 15-C                     END
|   C                     Z-ADD0         HSF11
|   C                     Z-ADD0         HSF12
|   C                     SETON                     59
| 14*C                     ELSE
|   C           SA4KEY    REDPESA0                      48
| 14-C                     END
| 13-C                     END
| 12-C                     END
|   C*
| 16-C           *IN59     IFEQ '0'
|   C   81                SETON                     618599
|   C                     SETON                     81
| 16-C                     END
|   C*
31===C                     ENDSR
    C*==============================================================*
    C*          RTN381....HELP  'SE03' --- SFLSR
    C*==============================================================*
32===C           RTN381    BEGSR
|   C*
|   C********************
|   C*  GET ROW,COL     *
|   C********************
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
|   C*CHK SCREEN
|   C                     SETOF                     38
|   C                     SETON                     54
|   C                     SETOF                     606162
|   C                     SETOF                     6364
|   C                     READCSFLSR2                 5757
|   C*
| 01-C           *IN57     DOWEQ'0'
| 02-C           DCHK      IFEQ 'Y'
|   C                     SETOF                     32    *PROTECT FIELD
| 02*C                     ELSE
|   C                     SETON                     32
| 02-C                     END
|   C*挑選產品代號
|   C                     MOVELDSF03     WQUERY
| 03-C           WQUERY    IFEQ '?'
|   C                     CALL 'WDS001'
|   C           DSF03     PARM DSF03     DS01O1  9
|   C                     SETON                     38
|   C                     MOVELDSF03     WQUERY
| 04-C           WQUERY    IFEQ '?'
|   C                     MOVEL' '       DSF03
| 04-C                     END
| 03-C                     END
|   C   38                GOTO UPD1
|   C*
|   C           UPD1      TAG
|   C                     UPDATSFLSR2
| 05-C           *IN38     IFEQ '1'
|   C                     SETON                     37
|   C                     WRITEDSPC3
|   C                     WRITESFLCR2
|   C                     SETOF                     3738
| 05-C                     END
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
|   C*
|   C                     SETON                     99
|   C*
32===C           END381    ENDSR
    C*==============================================================*
    C*          RTN391....INIT 'SE03' -- SFLSR2
    C*==============================================================*
33===C           RTN391    BEGSR
|   C*
|   C                     Z-ADD1         DRRN2
|   C                     Z-ADD0         WRRN2   40
|   C                     Z-ADD0         RRN2
|   C                     Z-ADD8         DSPRC2  40
|   C                     Z-ADD8         WPRCD2  40       *PAG RCD
|   C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|   C*
|   C                     SETON                     52    *SFLCLR
|   C                     WRITESFLCR2
|   C                     SETOF                     525053
|   C                     SETON                     51    *SFLDSPCTL
|   C*
|   C           KEYSF1    SETLLSF0
|   C* FOR HEADING
|   C                     MOVELD#B031    D#B03
|   C                     MOVEL#D02      D#D02
|   C*
|   C           DSE04     CHAINMD0                  41
|   C   41                MOVE *BLANK    MD07
|   C   41                MOVE *BLANK    MD08
|   C*
|   C           KEY#C     CHAIN#C0                  42
|   C*
|   C   42                MOVE *BLANK    #C03
|   C*
33===C                     ENDSR
    C*==============================================================*
    C*          RTN397....FILE TO SCREEN --- SFLSR(FOR ADD OR UPD)
    C*==============================================================*
34===C           RTN397    BEGSR
|   C*
|   C                     SETOF                     54    *54 FOR BLANK LOOP
|   C                     SETON                     32
|   C                     EXSR RTN39A                     *INIT SFLDTA
|   C*
| 01-C           RRN2      DOWLTDSPRC2
      *
| 02-C           RRN2      IFEQ 0
|   C                     MOVEL'1'       DOPT2
| 02*C                     ELSE
|   C                     MOVEL*BLANKS   DOPT2
| 02-C                     END
      *
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
| 01-C                     END
|   C*
|   C                     SETON                     5053
|   C*
34===C                     ENDSR
    C*==============================================================*
    C*          RTN398....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
    C*==============================================================*
35===C           RTN398    BEGSR
|   C*
B2???C           SCR2CN    IFNE SCR2CO
B2INF *CVR5020 sev.50 Field SCR2CN is too long and cannot be handled by
B2INF *   ADD/REMOVE century routines
B2INF *CVR5020 sev.50 Field SCR2CO is too long and cannot be handled by
B2INF *   ADD/REMOVE century routines
B2INF *CVR0001 sev.00 Field DSE07 is not a date or year
B2INF *CVR0001 sev.00 Field HSE07 is not a date or year
B2INF *CVR0001 sev.00 Field DOPT1 is not a date or year
|   C           DSE07     ORNE HSE07
|   C           DOPT1     OREQ '4'
|   C                     SETON                     54
| 01*C                     ELSE
|   C                     SETOF                     54
| 01-C                     END
|   C*
|   C           KEYSF1    READESF0                      44*NF/EOF
|   C*
| 02-C           *IN44     DOWEQ'0'
|   C           *IN99     ANDEQ'0'
|   C                     EXSR RTN39B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           KEYSF1    READESF0                      44*NF/EOF
| 02-C                     END
|   C           *LOVAL    SETLLSF0
|   C                     Z-ADDRRN2      COUNT   10
|   C*
|   C                     SETON                     53
|   C                     Z-ADDRRN2      WRRN2      50
|   C*
| 03-C           DOPT1     IFEQ '5'
|   C           DOPT1     OREQ '6'
|   C           *LOVAL    SETLLSF0
| 03-C                     END
|   C* FOR DATA LOCK
|   C           *LOVAL    SETLLMD0
|   C           *LOVAL    SETLLIA0
|   C*
35===C                     ENDSR
    C*==============================================================*
    C*          RTN39A....INIT 'SCR003' --- SFLSR(DTA)
    C*==============================================================*
36===C           RTN39A    BEGSR
|   C*
|   C                     MOVE *BLANK    DCHK
|   C                     MOVE *BLANKS   DOPT2
|   C                     MOVE *BLANKS   DSF03
|   C                     MOVE *BLANKS   MA03
|   C                     MOVE *BLANKS   MA13
|   C                     Z-ADD0         DSF04
|   C                     Z-ADD0         DSF05
|   C                     Z-ADD0         DFLD1
|   C                     Z-ADD0         DSF06
|   C                     Z-ADD0         DSF07
|   C                     Z-ADD0         HSF04
|   C                     Z-ADD0         HSF05
|   C****                 Z-ADD0         HSF06
|   C                     Z-ADD0         HSF07
|   C                     Z-ADD0         HSF08
|   C                     Z-ADD0         HSF09
|   C                     Z-ADD0         HSF10
|   C                     Z-ADD0         HSF11
|   C                     Z-ADD0         HSF12
|   C                     Z-ADD0         HSF13
|   C                     Z-ADD0         HSF15
|   C                     MOVE *BLANK    HSF16
|   C*
36===C                     ENDSR
    C*==============================================================*
    C*          RTN39B....FILE TO SCREEN --- MOVE
    C*==============================================================*
37===C           RTN39B    BEGSR
|   C*
|   C                     MOVE *BLANKS   DOPT2
| 01-C           DOPT1     IFEQ '2'
|   C                     MOVEL'2'       DOPT2
| 01-C                     END
      *
|   C                     MOVE 'Y'       DCHK
|   C                     MOVE SF03      DSF03
| 02-C           SE09      IFEQ 'V'
|   C                     Z-ADDSF19      DSF04
|   C                     Z-ADDSF20      DSF05
| 02*C                     ELSE
|   C                     Z-ADDSF04      DSF04
|   C                     Z-ADDSF05      DSF05
| 02-C                     END
|   C           DSF04     ADD  DSF05     DFLD1
|   C                     Z-ADDSF06      DSF06
| 03-C           SE09      IFEQ 'V'
|   C           DSF04     MULT DSF06     DSF07
| 03*C                     ELSE
|   C                     Z-ADDSF07      DSF07
| 03-C                     END
|   C                     Z-ADDSF04      HSF04
|   C                     Z-ADDSF05      HSF05
|   C                     Z-ADDSF07      HSF07
|   C                     Z-ADDSF08      HSF08
|   C                     Z-ADDSF09      HSF09
|   C                     Z-ADDSF10      HSF10
|   C                     Z-ADDSF11      HSF11
|   C                     Z-ADDSF12      HSF12
|   C                     Z-ADDSF13      HSF13
|   C                     Z-ADDSF15      HSF15
|   C                     MOVE SF16      HSF16
|   C* GET 產品名稱，單位
|   C           DSF03     CHAINMA0                  40
|   C* FOR SE25
| 04-C           SF05      IFNE SF09
|   C                     MOVE '*'       HSE18
| 04-C                     END
|   C*
37===C           END39B    ENDSR
    C*==============================================================*
    C*          RTN39C....SCREEN TO FILE --- HEADER
    C*==============================================================*
38===C           RTN39C    BEGSR
|   C*
|   C                     MOVE DSE01     SE01
|   C                     MOVE DSE02     SE02
|   C                     MOVE DSE03     SE03
|   C                     MOVE DSE04     SE04
|   C                     MOVE DSE05     SE05
B2000C                     Z-ADDWSE06     SE06
|   C                     MOVE DSE07     SE07             *DATE
|   C                     Z-ADDDSE08     SE08
|   C*                    MOVE DSE09     SE09
|   C                     MOVE DSE10     SE10
|   C                     MOVE DSE11     SE11
|   C                     MOVE DSE12     SE12
|   C                     MOVE DSE13     SE13
|   C                     MOVE DSE14     SE14
|   C                     MOVE HSE15     SE15
|   C                     MOVE HSE18     SE18
|   C                     MOVE DSE26     SE26
|   C                     MOVE HSE27     SE27
|   C                     MOVE HSE28     SE28
|   C                     MOVE DSE32     SE32
|   C                     MOVE DSE34     SE34
|   C                     Z-ADDDSE08     SE37
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE39     S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           SE39      PARM           S001O1  80
|   C*
|   C* SE16
|   C                     MOVE 'C'       SE16
| 01-C           #216      IFEQ 'Y'
|   C           SE04      CHAINMD0                  40
|   C           *LOVAL    SETLLMD0
|   C           MD29      ADD  MD30      TMON
|   C                     ADD  DSE08     TMON
|   C                     SUB  HSE08     TMON
| 02-C           MD22      IFLT TMON
|   C                     MOVE '*'       SE16
| 02-C                     END
| 01-C                     END
|   C* SE17
|   C                     MOVE 'C'       SE17
| 03-C           #215      IFEQ 'Y'
|   C           SE04      SETLLSI0
|   C           SE04      READESI0                      44
B2000C           *IN44     IFEQ '0'
|   C           SI29      ANDLTSE06
|   C                     MOVE '*'       SE17
| 04-C                     END
| 03-C                     END
|   C* SE19
| 05-C           SE03      IFEQ 'D6'
|   C                     MOVE '*'       SE19
| 05*C                     ELSE
|   C                     MOVE 'C'       SE19
| 05-C                     END
|   C* SE09
| 06-C           SE15      IFEQ '*'
|   C           SE16      OREQ '*'
|   C           SE17      OREQ '*'
|   C           SE18      OREQ '*'
|   C           SE19      OREQ '*'
|   C                     MOVE '*'       SE09
| 06*C                     ELSE
|   C                     MOVE 'C'       SE09
| 06-C                     END
|   C* SE35
|   C                     MOVE DSE04     ME01
|   C                     MOVE DSE05     ME02
|   C           KEYME     CHAINME0                  40
|   C                     MOVE ME08      SE35
|   C* SE33,SE20-->SE25,SE29,SE30
| 07-C           DOPT1     IFEQ '1'
|   C           SE32      CHAINMC0                  40
|   C                     MOVE MC03      SE33
|   C                     Z-ADD0         SE20
|   C                     Z-ADD0         SE21
|   C                     MOVE *BLANK    SE22
|   C                     Z-ADD0         SE23
|   C                     Z-ADD0         SE24
|   C                     MOVE *BLANK    SE25
|   C                     MOVE *BLANK    SE29
|   C                     MOVE *BLANK    SE30
|   C                     MOVE *BLANK    SE31
|   C                     MOVE *BLANK    SE40
| 07-C                     END
|   C                     MOVE DSE41     SE41
|   C                     MOVE DSE42     SE42
|   C* SE35
|   C           KEY#B1    CHAIN#B0L1                40
| 08-C           *IN40     IFEQ '0'
|   C           #B06      ANDEQ'A'
|   C                     MOVE '*'       SE36
| 08*C                     ELSE
|   C                     MOVE *BLANK    SE36
| 08-C                     END
|   C*
B2000C                     Z-ADDDATE      SEXX
B2000C                     TIME           SEYY
|   C                     MOVE $USER     SEZZ
|   C*
38===C                     ENDSR
    C*==============================================================*
    C*          RTN39D....SCREEN TO FILE --- DETAIL
    C*==============================================================*
39===C           RTN39D    BEGSR
|   C*
| 01-C           DOPT2     IFNE *BLANK
|   C                     Z-ADDDSF04     SF04
|   C                     Z-ADDDSF05     SF05
|   C                     Z-ADDDSF06     SF06
|   C                     Z-ADDDSF07     SF07
|   C                     Z-ADDHSF08     SF08
|   C                     Z-ADDHSF09     SF09
|   C                     Z-ADDHSF10     SF10
|   C                     Z-ADDHSF11     SF11
|   C                     Z-ADDHSF12     SF12
      * COUNT1=訂購＋搭贈
|   C* SF13=單位正常折扣も數量
|   C           SF04      ADD  SF05      COUNT1 130
|   C                     Z-ADDHSF13     SF13
|   C                     MULT SF04      SF13
|   C                     Z-ADDHSF15     SF15
|   C* SF14
|   C           COUNT1    MULT SF15      WORK2  134
|   C                     SUB  SF13      WORK2
|   C           WORK2     SUB  SF07      SF14
| 02-C           SF14      IFLT 0
|   C                     ADD  SF14      SF13
|   C                     Z-ADD0         SF14
| 02-C                     END
|   C* SF17
| 03-C           #214      IFEQ 'Y'
|   C           SF06      ANDNESF08
|   C                     MOVE '*'       SF17
| 03*C                     ELSE
|   C                     MOVE 'C'       SF17
| 03-C                     END
|   C* SF18
| 04-C           #213      IFEQ 'Y'
|   C           SF05      ANDNESF09
|   C                     MOVE '*'       SF18
| 04*C                     ELSE
|   C                     MOVE 'C'       SF18
| 04-C                     END
|   C* SF25 SF26 SF27
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE06     S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           SF25      PARM           S001O1  80
|   C*
|   C                     MOVELDSE07     SF26
|   C                     MOVELDSE26     SF27
|   C* FOR ADD
| 05-C           DOPT2     IFEQ '1'
|   C                     MOVE DSE01     SF01
|   C                     MOVE DSE02     SF02
|   C                     MOVE DSF03     SF03
|   C                     MOVE HSF16     SF16
|   C                     Z-ADD0         SF19
|   C                     Z-ADD0         SF20
|   C                     Z-ADD0         SF22
|   C                     MOVE *BLANK    SF23
|   C                     Z-ADD0         SF24
| 05-C                     END
| 01-C                     END
|   C* 進貨日期修改時，明細檔每筆需更新
|   C* 日期轉換
|   C           DSF03     CHAINMA0                  40
|   C                     Z-ADDMA31      SF28
|   C                     Z-ADDMA32      SF29
|   C                     Z-ADDMA33      SF30
|   C*
B2000C                     Z-ADDDATE      SFXX
B2000C                     TIME           SFYY
|   C                     MOVE $USER     SFZZ
|   C*
39===C                     ENDSR
    C*==============================================================*
    C*          RTN39F....UPDATE POPCPF , IMIAPF , MTMAPF
    C*==============================================================*
40===C           RTN39F    BEGSR
|   C*****************
|   C* UPDATE IMIAPF *
|   C*****************
|   C*
|   C* FOR KEYIA
|   C                     MOVELHSF16     IA01
|   C***
|   C* FOR 出貨物流點
|   C***
| 01-C           #212      IFEQ 'Y'
|   C*
| 02-C           DOPT2     IFEQ '4'
|   C           HSE07     ORNE DSE07
|   C           DOPT2     ANDNE'1'
|   C                     MOVE HSE07     IA02             *原物流點
|   C           KEYIA     CHAINIA0                  40
B2000C                     Z-ADDDATE      IAXX
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 03-C           *IN40     IFEQ '0'                        *新增時不做
|   C                     SUB  SF04      IA09
|   C                     SUB  SF05      IA09
|   C                     ADD  SF04      IA10
|   C                     ADD  SF05      IA10
|   C                     UPDATIA0
| 03-C                     END
| 02-C                     END
|   C* 出貨物流點改變
| 04-C           HSE07     IFNE DSE07
|   C*
| 05-C           DOPT2     IFNE '4'
|   C                     MOVE DSE07     IA02
|   C           KEYIA     CHAINIA0                  40
B2000C                     Z-ADDDATE      IAXX
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 06-C           *IN40     IFEQ '0'
      *
| 07-C           DOPT2     IFNE *BLANKS
|   C                     ADD  DSF04     IA09
|   C                     ADD  DSF05     IA09
|   C                     SUB  DSF04     IA10
|   C                     SUB  DSF05     IA10
     C                     ELSE
|   C                     ADD  SF04      IA09
|   C                     ADD  SF05      IA09
|   C                     SUB  SF04      IA10
|   C                     SUB  SF05      IA10
     C                     END
      *
| 07-C           DOPT2     IFNE *BLANKS
|   C           DOPT2     ANDNE'2'
|   C                     SUB  SF04      IA09
|   C                     SUB  SF05      IA09
|   C                     ADD  SF04      IA10
|   C                     ADD  SF05      IA10
| 07-C                     END
|   C                     UPDATIA0
| 06-C                     END
| 05-C                     END
|   C* 出貨物流點未變
| 04*C                     ELSE
|   C* CHECK DOPT2 ---> FROM POA003
| 08-C           DOPT2     IFEQ '1'
|   C           DOPT2     OREQ '2'
|   C                     MOVE DSE07     IA02
|   C           KEYIA     CHAINIA0                  40
B2000C                     Z-ADDDATE      IAXX
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 09-C           *IN40     IFEQ '0'
|   C                     ADD  DSF04     IA09
|   C                     ADD  DSF05     IA09
|   C                     SUB  SF04      IA09
|   C                     SUB  SF05      IA09
|   C                     SUB  DSF04     IA10
|   C                     SUB  DSF05     IA10
|   C                     ADD  SF04      IA10
|   C                     ADD  SF05      IA10
|   C                     UPDATIA0
| 09-C                     END
| 08-C                     END
| 04-C                     END
|   C*
| 01-C                     END
|   C***
|   C* FOR D8-補貨送貨單 ADD BY STEPHANIE 81/04/10
|   C***
| 10-C           DSE03     IFEQ 'D8'
|   C*
| 11-C           DOPT2     IFEQ '4'
|   C           HSE26     ORNE DSE26
|   C           DOPT2     ANDNE'1'
|   C                     MOVE HSE26     IA02             *原物流點
|   C           KEYIA     CHAINIA0                  40
B2000C                     Z-ADDDATE      IAXX
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 12-C           *IN40     IFEQ '0'                        *新增時不做
|   C                     SUB  SF04      IA09
|   C                     SUB  SF05      IA09
|   C                     ADD  SF04      IA10
|   C                     ADD  SF05      IA10
|   C                     UPDATIA0
| 12-C                     END
| 11-C                     END
|   C* 出貨物流點改變
| 13-C           HSE26     IFNE DSE26
|   C*
| 14-C           DOPT2     IFNE '4'
|   C                     MOVE DSE26     IA02
|   C           KEYIA     CHAINIA0                  40
B2000C                     Z-ADDDATE      IAXX
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 15-C           *IN40     IFEQ '0'
|   C                     ADD  DSF04     IA09
|   C                     ADD  DSF05     IA09
|   C                     SUB  DSF04     IA10
|   C                     SUB  DSF05     IA10
| 16-C           DOPT2     IFNE *BLANKS
|   C           DOPT2     ANDNE'2'
|   C                     SUB  SF04      IA09
|   C                     SUB  SF05      IA09
|   C                     ADD  SF04      IA10
|   C                     ADD  SF05      IA10
| 16-C                     END
|   C                     UPDATIA0
| 15-C                     END
| 14-C                     END
|   C* 出貨物流點未變
| 13*C                     ELSE
|   C* CHECK DOPT2 ---> FROM POA003
| 17-C           DOPT2     IFEQ '1'
|   C           DOPT2     OREQ '2'
|   C                     MOVE DSE26     IA02
|   C           KEYIA     CHAINIA0                  40
B2000C                     Z-ADDDATE      IAXX
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 18-C           *IN40     IFEQ '0'
|   C                     ADD  DSF04     IA09
|   C                     ADD  DSF05     IA09
|   C                     SUB  SF04      IA09
|   C                     SUB  SF05      IA09
|   C                     SUB  DSF04     IA10
|   C                     SUB  DSF05     IA10
|   C                     ADD  SF04      IA10
|   C                     ADD  SF05      IA10
|   C                     UPDATIA0
| 18-C                     END
| 17-C                     END
| 13-C                     END
|   C*
| 10-C                     END
|   C*
40===C                     ENDSR
    C*==============================================================*
    C*          RTN39S....SAVE
    C*==============================================================*
41===C           RTN39S    BEGSR
|   C*
|   C* GET 驗收單號
| 01-C           DOPT1     IFEQ '1'
|   C                     CALL 'RES005'
|   C                     PARM DSE01     S004I1  2
|   C                     PARM DSE03     S004I2  2
|   C                     PARM SE065N    S004I3  20
|   C           DSE02     PARM           S004O1 12
| 01-C                     END
|   C*
| 02-C           DOPT1     IFEQ '1'
|   C                     MOVE 'C'       HSE15
|   C                     MOVE 'C'       HSE18
| 02*C                     ELSE
|   C                     MOVE SE15      HSE15
|   C                     MOVE SE18      HSE18
| 02-C                     END
|   C*****************
|   C* UPDATE POSFPF *
|   C*****************
|   C                     Z-ADDHSE08     DSE08
|   C                     READCSFLSR2                 5757
| 03-C           *IN57     DOWEQ'0'
|   C*
| 04-C           DOPT2     IFEQ '1'
|   C           KEYSF     CHAINSF0                  40
| 05-C           *IN40     IFEQ '0'
|   C                     SUB  SF07      DSE08
|   C                     ADD  DSF07     DSE08
|   C                     EXSR RTN39F                     *SAV OTHER FILE
|   C                     EXSR RTN39D
|   C                     UPDATSF0
| 05*C                     ELSE
|   C                     ADD  DSF07     DSE08
|   C                     Z-ADD0         SF04
|   C                     Z-ADD0         SF05
|   C                     EXSR RTN39F                     *SAV OTHER FILE
|   C                     EXSR RTN39D
|   C                     WRITESF0
| 05-C                     END
| 04-C                     END
|   C*
| 06-C           DOPT2     IFEQ '2'
|   C           KEYSF     CHAINSF0                  40
|   C                     SUB  SF07      DSE08
|   C                     ADD  DSF07     DSE08
|   C                     EXSR RTN39F                     *SAV OTHER FILE
|   C                     EXSR RTN39D
|   C                     UPDATSF0
| 06-C                     END
|   C*
| 07-C           DOPT2     IFEQ '4'
|   C           KEYSF     CHAINSF0                  40
|   C                     SUB  SF07      DSE08
|   C                     EXSR RTN39F                     *SAV OTHER FILE
|   C                     DELETSF0
| 07-C                     END
|   C*
| 08-C           DOPT2     IFEQ *BLANK
| 09-C           DSE07     IFNE HSE07
|   C           KEYSF     CHAINSF0                  40
|   C  N40                EXSR RTN39F                     *SAV OTHER FILE
| 09-C                     END
| 08-C                     END
|   C* FOR SE15
| 10-C           SF06      IFNE SF08
|   C                     MOVE '*'       HSE15   1
| 10-C                     END
|   C* FOR SE18
| 11-C           SF05      IFNE SF09
|   C                     MOVE '*'       HSE18   1
| 11-C                     END
|   C*
|   C                     READCSFLSR2                   57
| 03-C                     END
|   C           *LOVAL    SETLLSF0
|   C*****************
|   C* UPDATE POSEPF *
|   C*****************
| 12-C           DOPT1     IFEQ '1'
|   C                     EXSR RTN39C
|   C                     WRITESE0
|   C                     SETON                     80
| 12-C                     END
|   C*
| 13-C           DOPT1     IFEQ '2'
|   C           KEYSE1    CHAINSE0                  40
|   C                     EXSR RTN39C
|   C                     UPDATSE0
| 13-C                     END
|   C*
|   C*****************
|   C* UPDATE MTMDPF *
|   C*****************
| 14-C           #216      IFEQ 'Y'
|   C           DSE41     CHAINMD0                  40
|   C                     ADD  DSE08     MD30
|   C                     SUB  HSE08     MD30
|   C                     UPDATMD0
| 14-C                     END
|   C*
41===C                     ENDSR
    C*==============================================================*
    C*          RTN39T....DLT D
    C*==============================================================*
42===C           RTN39T    BEGSR
|   C* DLT DETAIL
|   C           KEYSF1    SETLLSF0
|   C           KEYSF1    READESF0                      44
| 01-C           *IN44     DOWEQ'0'
|   C* FOR OTHER FILE AND KEY
|   C                     MOVE '4'       DOPT2
|   C                     MOVE SF03      DSF03
|   C                     MOVE SF04      DSF04
|   C                     MOVE SF16      HSF16
|   C*
|   C                     EXSR RTN39F
|   C                     DELETSF0
|   C           KEYSF1    READESF0                      44
| 01-C                     END
|   C* DLT HEADER
|   C           KEYSE1    CHAINSE0                  40
|   C                     DELETSE0
|   C*****************
|   C* UPDATE MTMDPF *
|   C*****************
| 02-C           #216      IFEQ 'Y'
|   C           DSE41     CHAINMD0                  40
|   C                     SUB  HSE08     MD30
|   C                     UPDATMD0
| 02-C                     END
|   C*
|   C*
42===C                     ENDSR
      *==============================================================*
      *          RTN400....'SE02' SCREEN MAIN ROUTINE
      *==============================================================*
43===C           RTN400    BEGSR
|   C*
|   C                     MOVE 'SCR004'  APPSCR
|   C                     MOVE WFUN,WNUM DFUN
|   C*
|   C                     SETOF                     30
|   C                     SETON                     31    *CAN INPUT
|   C           KEYSE4    CHAINSE0                  40
|   C           *LOVAL    SETLLSE0
|   C                     EXSR RTN410                     *FILE->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR004'
|   C*
|   C                     Z-ADDSE08      DSE08
|   C                     EXFMTDSPD4
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTNF4
|   C           *IN05     CASEQ'1'       RTN470
|   C                     CAS            RTN480
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'
|   C           *IN04     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C           KEYSE4    CHAINSE0                  40
|   C                     EXSR RTN49C
|   C                     EXSR RTN49D
|   C  N40                UPDATSE0
|   C                     SETON                     12
|   C                     MOVE 'SCR001'  APPSCR
|   C*
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|   C           *LOVAL    SETLLSE0
|   C           *LOVAL    SETLLSF0
|   C   12                SETOF                     12
|   C*
43===C                     ENDSR
      *==============================================================*
      *          RTN410....MOVE DATA TO SCREEN
      *==============================================================*
44===CSR         RTN410    BEGSR
|   C*
|   C                     MOVE SE01      DSE01
|   C                     MOVE SE02      DSE02
|   C                     MOVE SE03      DSE03
|   C                     MOVE SE03      HSE03
|   C                     MOVE SE04      DSE04
|   C                     MOVE SE05      DSE05
|   C* DATE               Z-ADDSE06      DSE06
|   C                     MOVE SE07      DSE07
|   C                     Z-ADDSE08      DSE08
|   C                     MOVE SE09      DSE09
|   C                     MOVE SE10      DSE10
|   C                     MOVE SE11      DSE11
|   C                     MOVE SE12      DSE12
|   C                     MOVE SE13      DSE13
|   C                     MOVE SE14      DSE14
|   C                     MOVE SE32      DSE32
|   C                     MOVE SE34      DSE34
|   C                     MOVE SE27      HSE27
|   C                     MOVE SE28      HSE28
|   C                     MOVE SE41      DSE41
|   C                     MOVE SE42      DSE42
|   C*
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE06      S001I2  80
B2MODC           DSE06     PARM           S001O1  80
B2000C                     Z-ADDSE06      WSE06
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE24      S001I2  80
B2MODC           DSE24     PARM           S001O1  80
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE39      S001I2  80
B2MODC           DSE39     PARM           S001O1  80
|   C* GET 公司代號
|   C           DSE01     CHAIN#B0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVE #B03      D#B031
| 01*C                     ELSE
|   C                     MOVE *BLANK    D#B031
| 01-C                     END
|   C* GET 地區代號
|   C           DSE34     CHAIN#D0                  40
|   C   40                MOVE *BLANK    #D02
|   C* GET 客戶代號
|   C                     MOVELDSE04     ME01
|   C                     MOVELDSE05     ME02
|   C           KEYME     CHAINME0                  40
|   C   40                MOVE *BLANK    DME04
|   C  N40                MOVE ME04      DME04
|   C* GET 單別
|   C*                    MOVELDSE03     #201
|   C                     MOVELDSE03     #202
|   C           KEY#2     CHAIN#20                  40
|   C   40                MOVE *BLANK    #203
|   C* GET 出貨倉庫
|   C                     MOVE *BLANK    #A01
|   C                     MOVEL'STORAGE' #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVELDSE07     #A02
|   C           KEY#A     CHAIN#A0                  40
|   C   40                MOVE *BLANK    D#A03
|   C  N40                MOVEL#A03      D#A03
|   C* GET 業務員
|   C           SE32      CHAINMC0                  40
|   C   40                MOVE *BLANK    MC02
|   C* GET 送貨單狀態
| 02-C           DSE09     IFEQ '*'
|   C                     MOVELARR1,1    DSE09C
| 02*C                     ELSE
| 03-C           DSE09     IFEQ 'V'
|   C                     MOVELARR1,2    DSE09C
| 03*C                     ELSE
B2CHKC           SE21      IFNE 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     MOVELARR1,3    DSE09C
| 04*C                     ELSE
|   C                     MOVELARR1,4    DSE09C
| 04-C                     END
| 03-C                     END
| 02-C                     END
|   C* GET 發票地址
|   C                     MOVELDSE41     ME01
|   C                     MOVELDSE42     ME02
|   C           KEYME     CHAINME0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME031
|   C                     MOVE *BLANK    DME051
|   C                     MOVE *BLANK    DME061
| 05*C                     ELSE
|   C                     MOVELME04      DME031
|   C                     MOVE ME05      DME051
|   C                     MOVE ME06      DME061
| 05-C                     END
|   C* GET 送貨地址
|   C                     MOVELDSE10     ME01
|   C                     MOVELDSE11     ME02
|   C           KEYME     CHAINME0                  40
| 06-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME03
|   C                     MOVE *BLANK    DME05
|   C                     MOVE *BLANK    DME06
| 06*C                     ELSE
|   C                     MOVELME04      DME03
|   C                     MOVE ME05      DME05
|   C                     MOVE ME06      DME06
| 06-C                     END
|   C* FOR UPDATE
|   C                     Z-ADDSE395N    SE395O  20       * FOR 年份
|   C*    HSE11,HSE36 FOR 物流點改變CHK -- SCR003
|   C                     MOVE DSE07     HSE07
|   C                     MOVE SE26      DSE26
|   C                     MOVE SE26      HSE26
|   C* FOR UPDATE : CHECK SCREEN2 CHANGE 19920417 PHILIP CHANGE
B2???C                     MOVE SCR2CN    SCR2CO 18        *FOR SCR2 CHANGE
B2INF *CVR5020 sev.50 Field SCR2CN is too long and cannot be handled by
B2INF *   ADD/REMOVE century routines
B2INF *CVR5020 sev.50 Field SCR2CO is too long and cannot be handled by
B2INF *   ADD/REMOVE century routines
| 01-C****                 END
|    C*
44===CSR                   ENDSR
      *==============================================================*
      *          RTN470....F5 -- 參考資料
      *==============================================================*
45===CSR         RTN470    BEGSR
|    C*
|    C                     EXSR RTN480
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 01-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 01-C                     END
|    C                     SETON                     99
|    C*
45===C                     ENDSR
      *==============================================================*
      *          RTN480....CHECK 'SE02' SCREEN
      *==============================================================*
46===CSR         RTN480    BEGSR
|    C*
|    C* CHK,GET客戶代號
|    C                     MOVELDSE04     ME01
|    C                     MOVELDSE05     ME02
|    C           KEYME     CHAINME0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME04
|   C                     SETON                     618999
| 01*C                     ELSE
|   C                     MOVE ME04      DME04
|   C                     MOVE ME15      DSE32
|   C                     MOVE ME07      DSE34
      *不往來客戶
| 02-C           ME20      IFEQ 'I'
|   C                     SETON                     618099
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END480
|    C                     MOVELDSE04     WQUERY
|    C* CHK 送貨日期
B2CHKC           DSE06     IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     639399
| 03*C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DSE06     P0901I  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
|   C                     PARM           P0901O  1
| 04-C           P0901O    IFEQ 'N'
|   C                     SETON                     639099
| 04-C                     END
| 03-C                     END
|    C   99                GOTO END480
|    C* 日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE06     S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           WSE06     PARM           S001O1  80
      *送貨日期不可小於月結月份
B2000C           SE06YM    IFLE #B16
|   C                     SETON                     638499
| 05-C                     END
|    C   99                GOTO END480
|    C* UPDATE -- 年份不得變更
| 06-C           DOPT1     IFEQ '2'
|   C           SE395N    ANDNESE395O
|   C                     SETON                     658699
| 06-C                     END
|    C   99                GOTO END480
|    C* CHK,GET 發票地址
| 07-C           DSE41     IFEQ *BLANK
|   C           DSE42     ANDEQ*BLANK
|   C                     MOVE DSE04     DSE41
|   C                     MOVE *BLANKS   DSE42
| 07-C                     END
      *
|    C                     MOVELDSE41     ME01
|    C                     MOVELDSE42     ME02
|    C           KEYME     CHAINME0                  40
| 08-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME031
|   C                     MOVE *BLANK    DME051
|   C                     MOVE *BLANK    DME061
|   C                     SETON                     688999
| 08*C                     ELSE
|   C                     MOVELME04      DME031
|   C                     MOVE ME05      DME051
|   C                     MOVE ME06      DME061
      *不往來客戶
| 09-C           ME20      IFEQ 'I'
|   C                     SETON                     688099
| 09-C                     END
| 08-C                     END
|    C   99                GOTO END480
|    C* CHK,GET 送貨地址
| 10-C           DSE10     IFEQ *BLANK
|   C           DSE11     ANDEQ*BLANK
|   C                     MOVE DSE04     DSE10
|   C                     MOVE DSE05     DSE11
| 10-C                     END
      *
|    C                     MOVELDSE10     ME01
|    C                     MOVELDSE11     ME02
|    C           KEYME     CHAINME0                  40
| 11-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    DME03
|   C                     MOVE *BLANK    DME05
|   C                     MOVE *BLANK    DME06
|   C                     SETON                     648999
| 11*C                     ELSE
|   C                     MOVELME04      DME03
|   C                     MOVE ME05      DME05
|   C                     MOVE ME06      DME06
      *不往來客戶
| 12-C           ME20      IFEQ 'I'
|   C                     SETON                     647599
| 12-C                     END
| 11-C                     END
|    C   99                GOTO END480
|    C* FOR RECORD LOCK ---> SETLL
|    C           END480    TAG
|    C           *LOVAL    SETLLMD0
|    C*
46===CSR                   ENDSR
     C*==============================================================*
     C*          RTN49C....SCREEN TO FILE --- HEADER
     C*==============================================================*
47===C           RTN49C    BEGSR
|    C*
|    C                     MOVE DSE05     SE05
B2000C                     Z-ADDWSE06     SE06
|    C                     MOVE DSE11     SE11
|    C                     MOVE DSE12     SE12
|    C                     MOVE DSE13     SE13
|    C                     MOVE DSE14     SE14
|    C                     MOVE DSE32     SE32
|    C           SE32      CHAINMC0                  40
|    C                     MOVE MC03      SE33
|    C*
|    C                     MOVE DSE34     SE34
|    C* SE35
|    C                     MOVE DSE04     ME01
|    C                     MOVE DSE05     ME02
|    C           KEYME     CHAINME0                  40
|    C                     MOVE ME08      SE35
|    C                     MOVE DSE41     SE41
|    C                     MOVE DSE42     SE42
B2000C                     Z-ADDDATE      SEXX
B2000C                     TIME           SEYY
|    C                     MOVE $USER     SEZZ
|    C*
47===C                     ENDSR
     C*==============================================================*
     C*          RTN49D....SCREEN TO FILE --- DETAIL
     C*==============================================================*
48===C           RTN49D    BEGSR
|    C*
|    C           DSE02     SETLLSF0
|    C           DSE02     READESF0                      46
| 01-C           *IN46     DOWEQ'0'
B2000C                     Z-ADDWSE06     SF25
|   C*
B2000C                     Z-ADDDATE      SFXX
B2000C                     TIME           SFYY
|   C                     MOVE $USER     SFZZ
|   C                     UPDATSF0
|   C           DSE02     READESF0                      46
| 01-C                     END
|    C*
48===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
49===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
49===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
50===C           RTNF4     BEGSR
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C********************
|    C*  FOR  SCR002     *
|    C********************
| 01-C           APPSCR    IFEQ 'SCR002'
|   C** 客戶代號
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE14
|   C           D#COL     ANDLE23
|   C                     CALL 'WDS003'
|   C                     PARM           S003O1  9
|   C                     MOVE S003O1    DSE05
|   C                     MOVELS003O1    DSE04
| 02-C                     END
|   C* 單別
| 03-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE54
|   C           D#COL     ANDLE55
|   C                     CALL 'WDS008'
|   C                     PARM 'D'       S008I1  1
|   C                     PARM 'Y '      S008I2  2
|   C           DSE03     PARM DSE03     S008O1  2
| 03-C                     END
|   C**業務員
| 04-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE54
|   C           D#COL     ANDLE59
|   C                     CALL 'WDS015'
|   C                     PARM           DSE32
| 04-C                     END
|   C** SCR002
| 01-C                     END
|    C*
|    C                     SETON                     99
|    C*
50===C           ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
51===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
51===C                     ENDSR'*DETC'
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
**
新增修改      刪除查詢明細核修
**
待核準    已送貨確認已派車　　未派車　　
