      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR042A                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 82/03/01                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :客戶報價到期表                               *
      ****************************************************************
     FSOR042ADCF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*
     I                                      601 6060DDATE
B2MODI                                      611 6220YDATE
     I                                      607 607 DSA02S
     I                                      608 608 DSA02E
B2MODI                                      646 647 DSA03S
B2MODI                                      648 649 DSA03E
B2MODI                                      627 635 DSA01S
B2MODI                                      637 645 DSA01E
      *產品組別
B2MODI                                      803 803 DMA11
B2MODI                                      804 804 DMA11S
B2MODI                                      805 805 DMA11E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         DDATE
|    C                     MOVE *BLANK    DSA01S
|    C                     MOVE *BLANK    DSA01E
|    C                     MOVE *BLANK    DSA03S
|    C                     MOVE *BLANK    DSA03E
|    C                     MOVE *BLANK    DSA02S
|    C                     MOVE *BLANK    DSA02E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*通路
| 01-C           DSA02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSA02S
| 01-C                     END
|    C*
| 02-C           DSA02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSA02E
| 02-C                     END
|    C*
| 03-C           DSA02S    IFGT DSA02E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*型態
| 01-C           DSA03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSA03S
| 01-C                     END
|    C*
| 02-C           DSA03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSA03E
| 02-C                     END
|    C*
| 03-C           DSA03S    IFGT DSA03E
|   C                     SETON                     6566
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C* CHK組別
| 01-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
     C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 01-C                     END
|    C*產品代號
| 04-C           DSA01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSA01S
| 04-C                     END
|    C*
| 05-C           DSA01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSA01E
| 05-C                     END
|    C*
| 06-C           DSA01S    IFGT DSA01E
|   C                     SETON                     6364
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
B2???C                     PARM DDATE     P0901I  80
B2INF *CVR3012 sev.30 Field DDATE contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0911O  1
| 07-C           P0911O    IFEQ 'N'
|   C                     SETON                     609499
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHANGE END-DATE TO CHINESE DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DDATE     S001I2  80
B2INF *CVR3012 sev.30 Field DDATE contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           YDATE     PARM           S001O1  80
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
     C*通路
| 02-C           D#ROW     IFEQ 5
| 03-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C                     PARM           DSA02S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 50
|   C                     CALL 'WDS018'
|   C                     PARM           DSA02E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*型態
| 05-C           D#ROW     IFEQ 7
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
     C                     PARM DSA02S    PDA02S  1
|   C                     PARM           DSA03S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFEQ 50
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS009'
     C                     PARM DSA02E    PDA02E  1
|   C                     PARM           DSA03E
|   C                     GOTO ENDF4
| 07-C                     END
| 05-C                     END
|   C*
| 05-C           D#ROW     IFEQ 10
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSA01S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFEQ 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSA01E
|   C                     GOTO ENDF4
| 07-C                     END
| 05-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
