      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR0981                                       *
      * AUTHOR       :                                               *
      * CREATE DATE  : 11/18/96                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :                                 *
      * REMARK       :康齡專櫃銷項稅額                          *
      ****************************************************************
     FSOSIPF  IP  E           K        DISK
B2CHKFSOR089P O   E             39     PRINTER
B2INF *CVR3009 sev.30 PRINTER file SOR089P must be converted, because
B2INF *   field SI21 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert SOR089P, enlarging SI21
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     E*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*M002D                                612 6170DSI21
     I*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C  N10                EXSR RTN010                     *HEADING
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CLR                   EXSR RTNLR                      *NO DATA
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
     C                     ADD  SI23      AMT1
     C                     ADD  SI24      AMT2
M001AC                     Z-ADDSI21      DSI21   60
|    C                     WRITEPD1
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
      *
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
04===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
