      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0732                                       *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/09/22                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品銷售分析週報表                           *
      ****************************************************************
     FREW108  IF  E           K        DISK
     FIMIAPF  IF  E           K        DISK
     FSOR088P O   E             39     PRINTER
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*公司
     I                                      603 603 #K
     I*退貨日期
     I                                      622 6270DSG06S
     I                                      628 6330DSG06E
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF108B    BMGA
     C           *LIKE     DEFN WF108D    BMGB
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYAB     KLIST
     C                     KFLD           BMGA
     C                     KFLD           BMGB
     C           KEYWF     KLIST
     C                     KFLD           #K
     C                     KFLD           WF108B
     C                     KFLD           WF108D
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     WRITEPH1                        *HEADING
     C*
     C                     READ WF108                    46
  01-C           *IN46     DOWEQ'0'
    C*
    C                     EXSR RTNR1
    C           KEYAB     SETGTWF108                43
    C                     READ WF108                    46
  01-C                     END
     C*
     C                     EXSR RTNLR
     C                     SETON                     LR
     C                     RETRN
      *==============================================================*
      *          RTNR1....READE DETAIL
      *==============================================================*
01===C           RTNR1     BEGSR
|    C*
|    C*                    READEWF108                    42
| 02-C           *IN42     DOUEQ'1'
|   C                     ADD  WF108E    PTEMP2
|   C                     MOVE WF108B    BMGA
|   C                     MOVE WF108D    BMGB
|   C           KEYAB     READEWF108                    42
| 02-C                     END
|    C*
|    C                     EXSR RTNL1
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTNL1  ...CHAIN IMIAPF
      *==============================================================*
02===C           RTNL1     BEGSR
|    C*
|    C           KEYWF     CHAINIA0                  40
| 01-C           *IN40     IFEQ '0'
|   C           IA06      SUB  PTEMP2    PTEMP3
| 01-C                     END
|    C*
|    C*庫存量IA06 減退貨量加總PTEMP2小於零則做RTNL2 WRITE PD1
| 02-C           PTEMP3    IFLT 0
|   C                     EXSR RTNL2
| 02-C                     END
|    C                     Z-ADD0         PTEMP2
|    C                     Z-ADD0         PTEMP3
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL2....
      *==============================================================*
03===C           RTNL2     BEGSR
|    C*
|    C           KEYAB     SETLLWF108                41  42
|    C                     READ WF108                    46
| 01-C           *IN44     DOUEQ'1'
|   C   39                EXSR RTN900                     *OVERFLOW
|   C                     WRITEPD1
|   C           KEYAB     READEWF108                    44
|   C                     ENDDO
|   C*
|   C   39                EXSR RTN900                     *OVERFLOW
|   C                     WRITEPD2
|   C  N10                SETON                     10
|   C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR
      *==============================================================*
04===C           RTNLR     BEGSR
|   C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPE9
| 01*C                     ELSE
|   C                     WRITEPE2
| 01-C                     END
|   C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
      *
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
      *
05===C                     ENDSR
