      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR052                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/18                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :客戶應收到期明細表                           *
      ****************************************************************
     FSOR052D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 604 DSI32S
     I                                      605 608 DSI32E
     I                                      609 614 DSI31S
     I                                      615 620 DSI31E
     I*(MM/DD/YY)
     I                                      621 6260DDATE
     I*(YY/MM/DD)
     I                                      640 6450YDATE
     I                                      653 661 CSI23S
     I                                      662 670 CSI23E
     I*增加辦事處的挑選
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      678 678 DSEL
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
     C                     MOVEL$USER     AUT     3
     C           AUT       IFNE 'D91'
     C           AUT       ANDNE'REP'
|    C                     SETON                     31
     C                     END
|    C                     MOVE *BLANK    CSI23S
|    C                     MOVE *BLANK    CSI23E
|    C                     MOVE *BLANK    DSI32S
|    C                     MOVE *BLANK    DSI32E
|    C                     MOVE *BLANK    DSI31S
|    C                     MOVE *BLANK    DSI31E
|    C                     Z-ADD0         DDATE
|    C                     Z-ADD0         YDATE
|    C                     MOVE *BLANK    DSEL
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*組別代號
| 01-C           DSI32S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI32S
| 01-C                     END
|    C*
| 02-C           DSI32E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI32E
| 02-C                     END
|    C*
| 03-C           DSI32S    IFGT DSI32E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C*業務員代號
| 04-C           DSI31S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI31S
| 04-C                     END
|    C*
| 05-C           DSI31E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI31E
| 05-C                     END
|    C*
| 06-C           DSI31S    IFGT DSI31E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 06-C                     END
|    C   99                GOTO END100
|    C*
| 04-C           CSI23S    IFEQ *BLANK
|   C                     MOVE *LOVAL    CSI23S
| 04-C                     END
|    C*
| 05-C           CSI23E    IFEQ *BLANK
|   C                     MOVE *HIVAL    CSI23E
| 05-C                     END
|    C*
| 06-C           CSI23S    IFGT CSI23E
|   C                     SETON                     6566
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C****
|    C*(CHECK END-DATE)-截止日期
|    C                     CALL 'P09'
|    C                     PARM DDATE     P0901I  60
|    C                     PARM           P0911O  1
| 07-C           P0911O    IFEQ 'N'
|   C                     SETON                     649499
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHANGE END-DATE TO CHINESE DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DDATE     S001I2  60
|    C           YDATE     PARM           S001O1  60
M001AC                     MOVE YDATE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
|    C***********
|    C* CHK公司
|    C***********
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
|   C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C* CHK 選項
| 21-C           DSEL      IFEQ *BLANKS
|   C                     SETON                     709995
| 21-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS016'
|   C                     PARM           DSI32S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 50
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS016'
|   C                     PARM           DSI32E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C                     PARM           DSI31S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 50
|   C           D#COL     ANDLE55
|   C                     CALL 'WDS015'
|   C                     PARM           DSI31E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
|   C*
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS003'
|   C                     PARM           CSI23S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS003'
|   C                     PARM           CSI23E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
