      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR0702                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 82/02/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品辦事處通路彙總表                         *
      ****************************************************************
     FREWF61  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSOR070P O   E             39     PRINTER
     E*
     IWF610
     I                                              WF6101L1
     I                                              WF6111L2
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *辦事處
     I                                      603 603 COMPS
     I                                      604 604 COMPE
      *SELECT起迄日期
      *YY/MM/DD
     I                                      610 6150YMDS
     I                                      616 6210YMDE
     I                                      622 6270DSC39S
     I                                      628 6330DSC39E
     I                                      662 6670DSC08S
     I                                      668 6730DSC08E
     I                                      750 750 IN20
     I                                      640 648 DSD03S
     I                                      650 658 DSD03E
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11A
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
    C  N10                EXSR RTN010                     *HEADING
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*種類
     C                     MOVEL*BLANKS   GROUP
| 02-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'GROUP
| 02*C                     ELSE
| 03-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'GROUP
| 03*C                     ELSE
| 04-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'GROUP
| 04*C                     ELSE
|   C                     MOVEL'全部'  GROUP
| 04-C                     END
| 03-C                     END
| 02-C                     END
|    C*
|    C                     Z-ADD0         T16103
|    C                     Z-ADD0         T16104
|    C                     Z-ADD0         T16105
|    C                     Z-ADD0         T16106
|    C                     Z-ADD0         T16107
|    C                     Z-ADD0         T16108
|    C                     Z-ADD0         T16109
|    C                     Z-ADD0         T16110
|    C                     Z-ADD0         T86101
|    C                     Z-ADD0         T86102
|    C                     Z-ADD0         T86103
|    C                     Z-ADD0         T86104
|    C                     Z-ADD0         T26103
|    C                     Z-ADD0         T26104
|    C                     Z-ADD0         T26105
|    C                     Z-ADD0         T26106
|    C                     Z-ADD0         T26107
|    C                     Z-ADD0         T26108
|    C                     Z-ADD0         T26109
|    C                     Z-ADD0         T26110
|    C                     Z-ADD0         T96101
|    C                     Z-ADD0         T96102
|    C                     Z-ADD0         T96103
|    C                     Z-ADD0         T96104
     C*
     C           IN20      IFEQ '0'
     C                     SETOF                     20
     C                     ELSE
     C                     SETON                     20
     C                     END
|    C                     WRITEPH1
     C                     SETON                     10
     C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*辦事處
| 01-C           WF6101    IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 01*C                     ELSE
| 02-C           WF6101    IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 02*C                     ELSE
|   C                     MOVEL'高雄'  COMPC
| 02-C                     END
| 01-C                     END
|    C*
|    C*通路
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVELWF6102    #A02
|    C           KEY#A     CHAIN#A0                  41
| 03-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    D#A03
| 03*C                     ELSE
|   C                     MOVEL#A03      D#A03
| 03-C                     END
     C*
     C           WF6111    CHAINMA0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA03
| 02-C                     END
|    C*
|    C           WF6103    SUB  WF6107    T06101
|    C           WF6104    SUB  WF6108    T06102
|    C           WF6105    SUB  WF6109    T06103
|    C           WF6106    SUB  WF6110    T06104
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     21
|    C                     SETON                     3130
|    C                     ADD  WF6103    T16103
|    C                     ADD  WF6104    T16104
|    C                     ADD  WF6105    T16105
|    C                     ADD  WF6106    T16106
|    C                     ADD  WF6107    T16107
|    C                     ADD  WF6108    T16108
|    C                     ADD  WF6109    T16109
|    C                     ADD  WF6110    T16110
|    C                     ADD  T06101    T86101
|    C                     ADD  T06102    T86102
|    C                     ADD  T06103    T86103
|    C                     ADD  T06104    T86104
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETOF                     31
|    C                     SETON                     21
|    C                     ADD  T16103    T26103
|    C                     ADD  T16104    T26104
|    C                     ADD  T16105    T26105
|    C                     ADD  T16106    T26106
|    C                     ADD  T16107    T26107
|    C                     ADD  T16108    T26108
|    C                     ADD  T16109    T26109
|    C                     ADD  T16110    T26110
|    C                     ADD  T86101    T96101
|    C                     ADD  T86102    T96102
|    C                     ADD  T86103    T96103
|    C                     ADD  T86104    T96104
|    C                     Z-ADD0         T16103
|    C                     Z-ADD0         T16104
|    C                     Z-ADD0         T16105
|    C                     Z-ADD0         T16106
|    C                     Z-ADD0         T16107
|    C                     Z-ADD0         T16108
|    C                     Z-ADD0         T16109
|    C                     Z-ADD0         T16110
|    C                     Z-ADD0         T86101
|    C                     Z-ADD0         T86102
|    C                     Z-ADD0         T86103
|    C                     Z-ADD0         T86104
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   SUBTOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     SETOF                     3130
|    C                     Z-ADD0         T26103
|    C                     Z-ADD0         T26104
|    C                     Z-ADD0         T26105
|    C                     Z-ADD0         T26106
|    C                     Z-ADD0         T26107
|    C                     Z-ADD0         T26108
|    C                     Z-ADD0         T26109
|    C                     Z-ADD0         T26110
|    C                     Z-ADD0         T96101
|    C                     Z-ADD0         T96102
|    C                     Z-ADD0         T96103
|    C                     Z-ADD0         T96104
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR ....
      *==============================================================*
04===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     3130
|    C                     SETOF                     21
      *
05===C                     ENDSR
