      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR0731                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 05/24/93                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :組產產品銷售週報表                           *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FSOSGPF  IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FREWF74  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I                                      601 604 DSC28S
     I                                      605 608 DSC28E
     I                                      651 656 DSC27S
     I                                      657 662 DSC27E
      *產品
     I                                      633 641 DSD03S
     I                                      642 650 DSD03E
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF7404    WORK04
     C           *LIKE     DEFN WF7405    WORK05
     C           *LIKE     DEFN WF7406    WORK06
     C           *LIKE     DEFN WF7407    WORK07
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF7401
     C                     KFLD           WF742$
     C                     KFLD           WF7402
     C                     KFLD           WF7403
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *銷售
     C                     READ SC0                      45
  01-C           *IN45     DOWEQ'0'
    C                     MOVELSC28      WF7401
    C           SC02      SETLLSD0
    C           SC02      READESD0                      46
  02-C           *IN46     DOWEQ'0'
    C*
  03-C           SD03      IFGE DSD03S
    C           SD03      ANDLEDSD03E
    C*
    C                     MOVELSD03      WF742$
    C                     MOVELSD03      WF7402
    C                     MOVELSD03      WF7403
    C           KEYWF     CHAINWF740                40
    C                     EXSR RTN100
  03-C                     END
    C*
    C           SC02      READESD0                      46
  02-C                     END
    C*
    C                     READ SC0                      45
  01-C                     END
     C*
     C*銷退
     C                     READ SG0                      45
  04-C           *IN45     DOWEQ'0'
    C                     MOVELSG12      WF7401
    C           SG02      SETLLSH0
    C           SG02      READESH0                      46
  05-C           *IN46     DOWEQ'0'
    C*
  06-C           SH03      IFGE DSD03S
    C           SH03      ANDLEDSD03E
    C*
    C                     MOVELSH03      WF742$
    C                     MOVELSH03      WF7402
    C                     MOVELSH03      WF7403
    C           KEYWF     CHAINWF740                40
    C                     EXSR RTN200
  06-C                     END
    C*
    C           SG02      READESH0                      46
  05-C                     END
    C*
    C                     READ SG0                      45
  04-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN100....WRITE OR UPDATE REWF74
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     Z-ADD0         WORK04
|    C                     Z-ADD0         WORK05
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C*
|    C                     Z-ADDSD04      WORK04
|    C                     Z-ADDSD07      WORK06
|    C*
| 07-C           *IN40     IFEQ '0'
|   C                     ADD  WORK04    WF7404
|   C                     ADD  WORK05    WF7405
|   C                     ADD  WORK06    WF7406
|   C                     ADD  WORK07    WF7407
|   C*
|   C                     UPDATWF740
| 07*C                     ELSE
|   C                     Z-ADDWORK04    WF7404
|   C                     Z-ADDWORK05    WF7405
|   C                     Z-ADDWORK06    WF7406
|   C                     Z-ADDWORK07    WF7407
| 08-C           WF7404    IFNE 0
|   C           WF7405    ORNE 0
|   C                     WRITEWF740
| 08-C                     END
|   C*
| 07-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE OR UPDATE REWF74
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
|    C                     Z-ADD0         WORK04
|    C                     Z-ADD0         WORK05
|    C                     Z-ADD0         WORK06
|    C                     Z-ADD0         WORK07
|    C*
|    C                     Z-ADDSH12      WORK05
|    C                     Z-ADDSH07      WORK07
|    C*
| 01-C           *IN40     IFEQ '0'
|   C                     ADD  WORK04    WF7404
|   C                     ADD  WORK05    WF7405
|   C                     ADD  WORK06    WF7406
|   C                     ADD  WORK07    WF7407
|   C*
|   C                     UPDATWF740
| 01*C                     ELSE
|   C                     Z-ADDWORK04    WF7404
|   C                     Z-ADDWORK05    WF7405
|   C                     Z-ADDWORK06    WF7406
|   C                     Z-ADDWORK07    WF7407
| 02-C           WF7404    IFNE 0
|   C           WF7405    ORNE 0
|   C                     WRITEWF740
| 02-C                     END
|   C*
| 01-C                     END
|    C*
02===C                     ENDSR
