      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR050                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/19                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :業務員產品銷售彙總表                         *
      ****************************************************************
     FSOR050D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSOR050Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I                                      601 604 DSC28S
     I                                      605 608 DSC28E
     I                                      609 614 DSC27S
     I                                      615 620 DSC27E
     I*(MM/DD/YY)
     I                                      621 6260DSC39S
     I                                      627 6320DSC39E
     I*(YY/MM/DD)
     I                                      640 6450YSC39S
     I                                      646 6510YSC39E
     I*通路，型態，客戶代號
     I                                      652 652 DSC33S
     I                                      653 653 DSC33E
     I                                      654 655 DSC34S
     I                                      656 657 DSC34E
     I                                      658 662 DSC04S
     I                                      663 667 DSC04E
      *辦事處
     I                                      671 671 COMPS
     I                                      672 672 COMPE
      *產品代號
     I                                      673 681 DSD03S
     I                                      682 690 DSD03E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      750 750 IN20
     I*
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DSC28S
|    C                     MOVE *BLANK    DSC28E
|    C                     MOVE *BLANK    DSC27S
|    C                     MOVE *BLANK    DSC27E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C*通路
| 02-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 02-C                     END
|    C*
| 03-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 03-C                     END
|    C*
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*型態
| 05-C           DSC34S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC34S
| 05-C                     END
|    C*
| 06-C           DSC34E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC34E
| 06-C                     END
|    C*
| 07-C           DSC34S    IFGT DSC34E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C* 客戶
| 08-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 08-C                     END
| 09-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 09-C                     END
| 10-C           DSC04S    IFGT DSC04E
|   C                     SETON                     7273
|   C                     SETON                     9099
| 10-C                     END
|    C   99                GOTO END100
|    C*組別代號
| 11-C           DSC28S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC28S
| 11-C                     END
|    C*
| 12-C           DSC28E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC28E
| 12-C                     END
|    C*
| 13-C           DSC28S    IFGT DSC28E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C*業務員代號
| 14-C           DSC27S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC27S
| 14-C                     END
|    C*
| 15-C           DSC27E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC27E
| 15-C                     END
|    C*
| 16-C           DSC27S    IFGT DSC27E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 16-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK種類
| 01-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
     C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 01-C                     END
|    C*產品代號
| 17-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 17-C                     END
|    C*
| 18-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 18-C                     END
|    C*
| 19-C           DSD03S    IFGT DSD03E
|   C                     SETON                     7475
|   C                     SETON                     9299
| 19-C                     END
|    C   99                GOTO END100
|    C*送貨日期或確認日期只輸入一項
| 20-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 21-C           DSC39S    IFNE 0
|   C                     SETON                     668999
| 21-C                     END
| 22-C           DSC39E    IFNE 0
|   C                     SETON                     678999
| 22-C                     END
| 20-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK銷售日期
| 23-C           DSC08S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 24-C           P0901O    IFEQ 'N'
|   C                     SETON                     649399
| 24-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 25-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 25-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08S    S001I2  60
|   C           YSC39S    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08E    S001I2  60
|   C           YSC39E    PARM           S001O1  60
M001AC                     MOVE YSC39S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C**
M001AC                     MOVE YSC39E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YSC39S    IFGT YSC39E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 26-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 23*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 27-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 27-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 28-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 28-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           YSC39S    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           YSC39E    PARM           S001O1  60
|   C**
M001AC                     MOVE YSC39S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C**
M001AC                     MOVE YSC39E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YSC39S    IFGT YSC39E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 29-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 23-C                     END
|    C*
     C                     OPEN SOR050Z
     C                     WRITEPH1
     C                     CLOSESOR050Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*通路
| 02-C           D#ROW     IFEQ 5
|   C           D#COL     ANDEQ38
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 5
|   C           D#COL     ANDEQ49
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*型態
| 04-C           D#ROW     IFEQ 6
| 05-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33   1
|   C           DSC34S    PARM DSC34S    PSC34   2
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 06-C           D#COL     IFGE 49
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33
|   C           DSC34E    PARM DSC34E    PSC34
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 04-C                     END
|   C* 客戶
| 07-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C           DSC04S    PARM DSC04S    S008O1  5
| 07-C                     END
| 08-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C           DSC04E    PARM DSC04E    S008O1  5
| 08-C                     END
|   C*
| 09-C           D#ROW     IFEQ 8
| 10-C           D#COL     IFGE 38
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28S
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 11-C           D#COL     IFGE 49
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28E
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 09-C                     END
|   C*
| 12-C           D#ROW     IFEQ 9
| 13-C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27S
|   C                     GOTO ENDF4
| 13-C                     END
|   C*
| 14-C           D#COL     IFGE 49
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27E
|   C                     GOTO ENDF4
| 14-C                     END
|   C*
| 12-C                     END
|   C*產品代號
| 15-C           D#ROW     IFEQ 11
| 16-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 16-C                     END
|   C*
| 17-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 17-C                     END
|   C*
| 15-C                     END
|   C*
| 18-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 18-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
