     FREWF30  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR055P O   E             39     PRINTER
     E                    TYPE    6   6 12
     IWF300
     I                                              WF3001L3
     I                                              WF3002L2
     I                                              WF3003L1
     I                                              WF3004L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*(MM/DD/YY)
     I                                      621 6260DSC08S
     I                                      627 6320DSC08E
     I*(YY/MM/DD)
     I                                      640 6450YSC08S
     I                                      646 6510YSC08E
     I*物流點
     I                                      652 656 DSC11S
     I                                      657 661 DSC11E
     I*增加辦事處的挑選
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      673 673 COMP
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           WF3003
     C                     KFLD           WF3004
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100                     *SALSE
     C*
     CL1 10                SETOF                     32
     CL2 10                SETOF                     31
     CL3 10                EXSR RTN200
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
     C           COMP      IFEQ *BLANKS
     C                     MOVEL'*ALL'    COMPC
     C                     ELSE
     C           COMP      IFEQ '1'
     C                     MOVEL'台北'  COMPC
     C                     ELSE
     C           COMP      IFEQ *BLANKS
     C                     MOVEL'台中'  COMPC
     C                     ELSE
     C           COMP      IFEQ *BLANKS
     C                     MOVEL'高雄'  COMPC
     C                     ELSE
     C                     END
     C                     END
     C                     END
     C                     END
      *
     C                     WRITEPH1
|    C                     SETON                         10
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....JUDGE SALSES  NUMBER
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
M001AC                     Z-ADDWF3001    XF3001  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF3001    S001I2  80
M001AC                     PARM XF3001    S001I2  60
|    C           PWF301    PARM           S001O1  60
|    C*
| 01-C           KEYME     CHAINME0                  40
     C           *IN40     IFEQ '1'
     C                     MOVEL*BLANKS   ME04
     C                     END
      *
|   C           WF3005    CHAINMA0                  40
     C           *IN40     IFEQ '1'
     C                     MOVEL*BLANKS   MA03
     C                     MOVEL*BLANKS   MA13
     C                     END
     C                     Z-ADDWF3006    QTY1
     C                     ADD  WF3007    QTY1
      *
     C                     MOVEL*BLANKS   DTYPE
      *
     C           WF3008    IFEQ '*'
     C                     Z-ADD1         I       10
     C                     ELSE
     C           WF3008    IFEQ 'T'
     C                     Z-ADD2         I
     C                     ELSE
     C           WF3008    IFEQ 'V'
     C                     Z-ADD3         I
     C                     ELSE
     C           WF3008    IFEQ 'P'
     C                     Z-ADD4         I
     C                     ELSE
     C           WF3008    IFEQ 'K'
     C                     Z-ADD5         I
     C                     ELSE
     C                     Z-ADD6         I
     C                     END
     C                     END
     C                     END
     C                     END
     C                     END
     C                     MOVELTYPE,I    DTYPE
      *
     C   39                EXSR RTN900                     *OVRFLW-THE SAME SALE
     C                     WRITEPD1
     C                     SETON                     303132
     C                     SETOF                     29
     C                     ADD  QTY1      T1QTY1
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....READE DETAIL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
     C                     WRITEPT1
     C                     ADD  T1QTY1    T2QTY1
     C                     Z-ADD0         T1QTY1
|    C*
     C                     SETOF                     30
|    C                     SETON                     29
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW --同一業務員
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
     C                     SETOF                     39
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTNLR ....END
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|    C                     WRITEPH1
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPT2
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
**
待核準　　待轉送貨單待撿料　　待印送貨單待送貨確認其它
