      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR053                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/25                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應應系統                                     *
      * REMARK       :收款明細表                                   *
      ****************************************************************
     FSOR053D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSOR053Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*通路型態
     I                                      601 601 DSI03S
     I                                      602 602 DSI03E
     I                                      603 604 DSI04S
     I                                      605 606 DSI04E
     I*客戶代號
     I                                      613 621 CSI23S
     I                                      622 630 CSI23E
     I*(MM/DD/YY)
     I                                      631 6360DSI06S
     I                                      637 6420DSI06E
     I*(YY/MM/DD)
     I                                      650 6550YSI06S
     I                                      656 6610YSI06E
     I*公司
     I                                      674 675 DSI01S
     I                                      676 677 DSI01E
     I                                      678 678 DSEL
     I                                      690 695 DSI31S
     I                                      696 701 DSI31E
     I*(MM/DD/YY)
     I                                      681 6860DSI06
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSI01S
|    C                     MOVE *BLANK    DSI01E
|    C                     MOVE *BLANK    DSI03S
|    C                     MOVE *BLANK    DSI03E
|    C                     MOVE *BLANK    DSI04S
|    C                     MOVE *BLANK    DSI04E
|    C                     MOVE *BLANK    CSI23S
|    C                     MOVE *BLANK    CSI23E
|    C                     MOVE *BLANK    DSI31S
|    C                     MOVE *BLANK    DSI31E
|    C                     MOVE *BLANK    DSEL
|    C                     Z-ADD0         DSI06
|    C                     Z-ADD0         DSI06S
|    C                     Z-ADD0         DSI06E
|    C                     Z-ADD0         YSI06S
|    C                     Z-ADD0         YSI06E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C****
|    C*公司
|    C****
| 01-C           DSI01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI01S
| 01-C                     END
|    C*
| 02-C           DSI01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI01E
| 02-C                     END
|    C*
| 03-C           DSI01S    IFGT DSI01E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C****
|    C*通路
|    C****
| 04-C           DSI03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI03S
| 04-C                     END
|    C*
| 05-C           DSI03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI03E
| 05-C                     END
|    C*
| 06-C           DSI03S    IFGT DSI03E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C****
|    C*型態
|    C****
| 07-C           DSI04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI04S
| 07-C                     END
|    C*
| 08-C           DSI04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI04E
| 08-C                     END
|    C*
| 09-C           DSI04S    IFGT DSI04E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 09-C                     END
|    C   99                GOTO END100
|    C****
|    C*客戶代號
|    C****
| 10-C           CSI23S    IFEQ *BLANK
|   C                     MOVE *LOVAL    CSI23S
| 10-C                     END
|    C*
| 11-C           CSI23E    IFEQ *BLANK
|   C                     MOVE *HIVAL    CSI23E
| 11-C                     END
|    C*
| 12-C           CSI23S    IFGT CSI23E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 12-C                     END
|    C   99                GOTO END100
|    C****
|    C*業務員　
|    C****
| 10-C           DSI31S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI31S
| 10-C                     END
|    C*
| 11-C           DSI31E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI31E
| 11-C                     END
|    C*
| 12-C           DSI31S    IFGT DSI31E
|   C                     SETON                     7273
|   C                     SETON                     9299
| 12-C                     END
|    C   99                GOTO END100
|    C****
|    C*(CHECK END-DATE)-收款日期
|    C****
| 13-C           DSI06     IFNE 0
| 14-C           DSI06S    IFNE 0
|   C           DSI06E    ORNE 0
|   C                     SETON                     646471
|   C                     SETON                     9099
| 14-C                     END
| 13-C                     END
|    C   99                GOTO END100
      *
| 15-C           DSI06S    IFEQ 0
|   C           DSI06E    ANDEQ0
|   C           DSI06     ANDEQ0
|   C                     SETON                     719599
| 15-C                     END
|    C   99                GOTO END100
      *
| 16-C           DSI06     IFEQ 0
      *
|   C                     CALL 'P09'
|   C                     PARM DSI06S    P0901I  60
|   C                     PARM           P0911O  1
| 17-C           P0911O    IFEQ 'N'
|   C                     SETON                     649399
| 17-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSI06E    P0901I  60
|   C                     PARM           P0911O  1
| 18-C           P0911O    IFEQ 'N'
|   C                     SETON                     659399
| 18-C                     END
|   C   99                GOTO END100
|   C****
|   C*(CHANGE END-DATE TO CHINESE DATE)
|   C****
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSI06S    S001I2  60
|   C           YSI06S    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSI06E    S001I2  60
|   C           YSI06E    PARM           S001O1  60
|   C*
M001AC                     MOVE YSI06S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C*
M001AC                     MOVE YSI06E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|   C*
M001DC*          YSI06S    IFGT YSI06E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9199
| 19-C                     END
|   C   99                GOTO END100
| 16*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSI06     P0901I  60
|   C                     PARM           P0911O  1
| 20-C           P0911O    IFEQ 'N'
|   C                     SETON                     719399
| 20-C                     END
|   C   99                GOTO END100
      *
|   C                     Z-ADD0         YSI06S
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSI06     S001I2  60
|   C           YSI06E    PARM           S001O1  60
|   C*
M001AC                     MOVE YSI06S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C*
M001AC                     MOVE YSI06E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|   C*
| 16-C                     END
|    C* CHK 選項
| 21-C           DSEL      IFEQ *BLANKS
|   C                     SETON                     709995
| 21-C                     END
|    C   99                GOTO END100
|    C*
|    C                     OPEN SOR053Z
|    C                     WRITEPH1
|    C                     CLOSESOR053Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 6
| 03-C           D#COL     IFEQ 39
|   C                     CALL 'WDS018'
|   C                     PARM           DSI03S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 44
|   C                     CALL 'WDS018'
|   C                     PARM           DSI03E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 7
| 06-C           D#COL     IFGE 39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS009'
|   C                     PARM DSI03S    PSI03S  1
|   C                     PARM           DSI04S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 48
|   C           D#COL     ANDLE49
|   C                     CALL 'WDS009'
|   C                     PARM DSI03E    PSI03E  1
|   C                     PARM           DSI04E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
| 08-C           D#ROW     IFEQ 8
| 09-C           D#COL     IFGE 39
|   C           D#COL     ANDLE47
|   C                     CALL 'WDS003'
|   C                     PARM           CSI23S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 51
|   C           D#COL     ANDLE59
|   C                     CALL 'WDS003'
|   C                     PARM           CSI23E
|   C                     GOTO ENDF4
| 10-C                     END
| 08-C                     END
|   C*
| 08-C           D#ROW     IFEQ 9
| 09-C           D#COL     IFGE 39
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS005'
|   C                     PARM           DSI31S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 51
|   C           D#COL     ANDLE56
|   C                     CALL 'WDS005'
|   C                     PARM           DSI31E
|   C                     GOTO ENDF4
| 10-C                     END
| 08-C                     END
|   C*
| 11-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
