     FSOR058D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSOR058Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      609 6140DSC39S
     I                                      615 6200DSC39E
     I                                      621 6260YSC39S
     I                                      627 6320YSC39E
     I                                      633 634 DSC03S
     I                                      635 636 DSC03E
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      673 673 DSEL
     I                                      674 674 DSEL1
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      713 721 DSC04S
     I                                      722 730 DSC04E
     I                                      731 739 DSD03S
     I                                      741 749 DSD03E
     I                                      750 750 IN20
     I*
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE '1'       COMP
|    C                     MOVE 'N'       DSEL
|    C                     MOVE 'A'       DSEL1
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         YSC39S
|    C                     Z-ADD0         YSC39E
|    C                     MOVE *BLANK    DSC03S
|    C                     MOVE *BLANK    DSC03E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C*送貨日期或確認日期只輸入一項
| 02-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 03-C           DSC39S    IFNE 0
|   C                     SETON                     648999
| 03-C                     END
| 04-C           DSC39E    IFNE 0
|   C                     SETON                     658999
| 04-C                     END
| 02-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK銷售日期
| 05-C           DSC08S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 06-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 07-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08S    S001I2  60
|   C           YSC39S    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08E    S001I2  60
|   C           YSC39E    PARM           S001O1  60
M001AC                     MOVE YSC39S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C**
M001AC                     MOVE YSC39E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YSC39S    IFGT YSC39E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 08-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 05*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 09-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 09-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 10-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           YSC39S    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           YSC39E    PARM           S001O1  60
|   C**
M001AC                     MOVE YSC39S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C**
M001AC                     MOVE YSC39E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YSC39S    IFGT YSC39E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 11-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 05-C                     END
|    C*
|    C* 客戶
| 12-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 12-C                     END
| 13-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 13-C                     END
| 14-C           DSC04S    IFGT DSC04E
|   C                     SETON                     6970
|   C                     SETON                     9099
| 14-C                     END
|    C   99                GOTO END100
|    C*產品代號
| 14-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 14-C                     END
|    C*
| 15-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 15-C                     END
|    C*
| 16-C           DSD03S    IFGT DSD03E
|   C                     SETON                     7172
|   C                     SETON                     9299
| 16-C                     END
|    C   99                GOTO END100
|    C*
|    C* 單別
| 12-C           DSC03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC03S
| 12-C                     END
| 13-C           DSC03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC03E
| 13-C                     END
| 14-C           DSC03S    IFGT DSC03E
|   C                     SETON                     6667
|   C                     SETON                     9399
| 14-C                     END
|    C   99                GOTO END100
     C*
     C                     OPEN SOR058Z
     C                     WRITEPH1
     C                     CLOSESOR058Z
     C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C* 客戶
| 03-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS003'
|   C           DSC04S    PARM DSC04S    S008O1  2
| 03-C                     END
| 04-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS003'
|   C           DSC04E    PARM DSC04E    S008O1  2
| 04-C                     END
|   C*產品代號
| 14-C           D#ROW     IFEQ 13
| 15-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 15-C                     END
|   C*
| 16-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 16-C                     END
|   C*
| 14-C                     END
|   C* 單別
| 03-C           D#ROW     IFEQ 14
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS008'
|   C                     PARM 'S'       S008I1  1
|   C                     PARM 'Y '      S008I2  2
|   C           DSC03S    PARM DSC03S    S008O1  2
| 03-C                     END
| 04-C           D#ROW     IFEQ 14
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS008'
|   C                     PARM 'S'       S008I1  1
|   C                     PARM 'Y '      S008I2  2
|   C           DSC03E    PARM DSC03E    S008O1  2
| 04-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
