     FSOR065D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *公司
     I                                      601 602 DSC01S
     I                                      603 604 DSC01E
      *客戶
     I                                      605 609 DSC04S
     I                                      610 614 DSC04E
      *訂單號碼
     I                                      623 634 DSC02S
     I                                      635 646 DSC02E
      *SELECT起迄日期
     I                                      647 6520DSC08S
     I                                      653 6580DSC08E
      *YY/MM/DD
B2MODI                                      661 6720DATES
B2MODI                                      673 6840DATEE
     I* FOR F4 HELP -- GET CURSOR POSITION
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
     C                     IN   LDA
|    C                     MOVE *BLANK    DSC01S
|    C                     MOVE *BLANK    DSC01E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DSC02S
|    C                     MOVE *BLANK    DSC02E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司
| 01-C           DSC01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC01S
| 01-C                     END
|    C*
| 02-C           DSC01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC01E
| 02-C                     END
|    C*
| 03-C           DSC01S    IFGT DSC01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*客戶
| 01-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 01-C                     END
|    C*
| 02-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 02-C                     END
|    C*
| 03-C           DSC04S    IFGT DSC04E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*訂單號碼
| 01-C           DSC02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC02S
| 01-C                     END
|    C*
| 02-C           DSC02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC02E
| 02-C                     END
|    C*
| 03-C           DSC02S    IFGT DSC02E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-日期
B2CHKC           DSC08S    IFEQ 0
B2INF *CVR3012 sev.30 Field DSC08S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     Z-ADD010101    DSC08S
B2INF *CVR3012 sev.30 Field DSC08S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
     C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DSC08S    P0901I  80
B2INF *CVR3012 sev.30 Field DSC08S contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 17-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 17-C                     END
| 17-C                     END
|   C   99                GOTO END100
|    C*(CHECK DATE)-日期
B2CHKC           DSC08E    IFEQ 0
B2INF *CVR3012 sev.30 Field DSC08E contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     Z-ADD123199    DSC08E
B2INF *CVR3012 sev.30 Field DSC08E contains more than one year
     C                     ELSE
|   C                     CALL 'P09'
B2???C                     PARM DSC08E    P0901I  80
B2INF *CVR3012 sev.30 Field DSC08E contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 17-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 17-C                     END
| 17-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSC08S    S001I2  80
B2INF *CVR3012 sev.30 Field DSC08S contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           DATES     PARM           S001O1  80
|   C*
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSC08E    S001I2  80
B2INF *CVR3012 sev.30 Field DSC08E contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           DATEE     PARM           S001O1  80
|   C*
B2000C           DATES     IFGT DATEE
|   C                     SETON                     6667
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
      *
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
