     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.05.12  Y2K MODIFY                    */
     /*=============================================================*/
     FPA#APF  IF  E           K        DISK
     FSOR063D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *物流點
     I                                      601 605 DSE07
     I                                      606 614 DSF03S
     I                                      615 623 DSF03E
     I                                      624 625 DSE03S
     I                                      626 627 DSE03E
      *SELECT起迄日期
     I                                      628 6330DSE24S
     I                                      634 6390DSE24E
      *YY/MM/DD
     I                                      640 6450YMDS
     I                                      646 6510YMDE
     I                                      661 6660DSE06S
     I                                      667 6720DSE06E
     I                                      675 683 DSE04S
     I                                      684 692 DSE04E
     I                                      750 750 IN20
     I                                      751 751 COMPS
     I                                      752 752 COMPE
M001AI                                      851 8580Y01S
M001AI                                      861 8680Y01E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
     C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DSE07
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSE03S
|    C                     MOVE *BLANK    DSE03E
|    C                     MOVE *BLANK    DSE04S
|    C                     MOVE *BLANK    DSE04E
|    C                     MOVE *BLANK    DSF03S
|    C                     MOVE *BLANK    DSF03E
|    C                     Z-ADD0         DSE24S
|    C                     Z-ADD0         DSE24E
|    C                     Z-ADD0         DSE06S
|    C                     Z-ADD0         DSE06E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
M001AC                     Z-ADD0         Y01S
M001AC                     Z-ADD0         Y01E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK物流點
| 01-C           DSE07     IFEQ *BLANKS
|   C                     SETON                     609599
     C                     ELSE
     C                     MOVEL'STORAGE' #A01
     C                     MOVELDSE07     #A02
     C           KEY#A     SETLL#A0                      40
|   C  N40                SETON                     609499
| 01-C                     END
|    C   99                GOTO END100
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
     C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*產品
| 01-C           DSF03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSF03S
| 01-C                     END
|    C*
| 02-C           DSF03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSF03E
| 02-C                     END
|    C*
| 03-C           DSF03S    IFGT DSF03E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*客戶代號
| 11-C           DSE04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE04S
| 11-C                     END
|    C*
| 12-C           DSE04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE04E
| 12-C                     END
|    C*
| 13-C           DSE04S    IFGT DSE04E
|   C                     SETON                     6970
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C*單別
| 01-C           DSE03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE03S
     C                     END
      *
| 01-C           DSE03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE03E
     C                     END
      *
| 03-C           DSE03S    IFGT DSE03E
|   C                     SETON                     6364
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-日期
|    C*送貨日期或確認日期只輸入一項
B2CHKC           DSE06S    IFNE 0
|   C           DSE06E    ORNE 0
B2CHKC           DSE24S    IFNE 0
|   C                     SETON                     658999
| 14-C                     END
B2CHKC           DSE24E    IFNE 0
|   C                     SETON                     668999
| 15-C                     END
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
B2CHKC           DSE06S    IFNE 0
|   C                     CALL 'P09'
B2???C                     PARM DSE06S    P0901I  60
|   C                     PARM           P0901O  1
| 17-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 17-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
B2???C                     PARM DSE06E    P0901I  60
|   C                     PARM           P0901O  1
| 18-C           P0901O    IFEQ 'N'
|   C                     SETON                     689399
| 18-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE06S    S001I2  60
     C           YMDS      PARM           S001O1  60
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    Y01S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSE06E    S001I2  60
     C           YMDE      PARM           S001O1  60
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    Y01E
|   C**
M001MC*          YMDS      IFGT YMDE
M001MC           Y01S      IFGT Y01E
|   C                     SETON                     6768
|   C                     SETON                     9299
| 19-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 16*C                     ELSE
|   C                     CALL 'P09'
     C                     PARM DSE24S    P0901I  60
|   C                     PARM           P0901O  1
| 20-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 20-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
     C                     PARM DSE24E    P0901I  60
|   C                     PARM           P0901O  1
| 21-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 21-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
     C                     PARM DSE24S    S001I2  60
     C           YMDS      PARM           S001O1  60
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    Y01S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
     C                     PARM DSE24E    S001I2  60
     C           YMDE      PARM           S001O1  60
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    Y01E
|   C**
M001MC*          YMDS      IFGT YMDE
M001MC           Y01S      IFGT Y01E
|   C                     SETON                     6566
|   C                     SETON                     9299
| 22-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 16-C                     END
|   C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*產品
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS001'
|   C                     PARM           DSF03S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS001'
|   C                     PARM           DSF03E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C*
|   C*客戶代號
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     IFGE 40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS003'
|   C                     PARM           DSE04S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS003'
|   C                     PARM           DSE04E
|   C                     GOTO ENDF4
| 02-C                     END
| 02-C                     END
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
      *
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
