      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0751                                       *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/08/23                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :產品退貨分佈明細表                           *
      ****************************************************************
     FSOSGPF  IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FSOSNPF  IF  E           K        DISK
     FSOSOPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FREWF29  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *型態
     I                                      603 604 DSC34S
     I                                      605 606 DSC34E
      *地區
     I                                      607 608 DSG15S
     I                                      609 610 DSG15E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      611 6160YMDS
     I                                      617 6220YMDE
     I                                      623 6280DSG26S
     I                                      629 6340DSG26E
     I                                      635 6400DSG06S
     I                                      641 6460DSG06E
     I                                      647 655 DSH03S
     I                                      656 664 DSH03E
     I*增加辦事處的挑選
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      750 750 IN20
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF2908    WORK08
     C           *LIKE     DEFN WF2909    WORK09
     C           *LIKE     DEFN WF2910    WORK10
     C           *LIKE     DEFN WF2911    WORK11
     C           *LIKE     DEFN WF2914    WORK14
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF2901
     C                     KFLD           WF2902
     C                     KFLD           WF2903
     C                     KFLD           WF2904
     C                     KFLD           WF2905
     C                     KFLD           WF2951
     C                     KFLD           WF2907
     C           KEYME     KLIST
     C                     KFLD           WF2905
     C                     KFLD           WF2951
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C                     EXSR RTN100
     C                     EXSR RTN300
     C                     SETON                     LR
      *==============================================================*
      *                    RTN100 SOSGPF
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C                     READ SG0                      45
| 01-C           *IN45     DOWEQ'0'
|   C*通路型態
|   C           SG04      CHAINMD0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELMD07      WF2902
|   C                     MOVELMD08      WF2903
| 02*C                     ELSE
|   C                     MOVEL*BLANKS   WF2902
|   C                     MOVEL*BLANKS   WF2903
| 02-C                     END
|   C*
| 03-C           WF2902    IFGE DSC33S
|   C           WF2902    ANDLEDSC33E
| 04-C           WF2903    IFGE DSC34S
|   C           WF2903    ANDLEDSC34E
|   C                     MOVELSG15      WF2904
|   C                     MOVELSG04      WF2905
|   C                     MOVELSG05      WF2951
|   C                     MOVELSG02      WF2907
B2000C                     Z-ADDSG06      WF2906
B2000C                     Z-ADDSG26      WF2913
|   C                     MOVELSG11      WF2912
|   C*
|   C           SG02      SETLLSH0
|   C           SG02      READESH0                      46
| 05-C           *IN46     DOWEQ'0'
| 06-C           SH03      IFGE DSH03S
|   C           SH03      ANDLEDSH03E
      *
|   C                     MOVELSH03      WF2901
|   C           KEYWF     CHAINWF290                40
|   C                     EXSR RTN200
| 06-C                     END
|   C           SG02      READESH0                      46
| 05-C                     END
      *
| 04-C                     END
| 03-C                     END
      *
|   C                     READ SG0                      45
| 01-C                     END
     C                     ENDSR
|    C*
      *==============================================================*
      *          RTN200....WRITE OR UPDATE REWF29
      *==============================================================*
02===C           RTN200    BEGSR
      *
|    C                     Z-ADD0         WORK08
|    C                     Z-ADD0         WORK09
|    C                     Z-ADD0         WORK10
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK14
      *
B2CHKC           SG26      IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     Z-ADDSH04      WORK08
|   C                     Z-ADDSH05      WORK09
| 07*C                     ELSE
|   C                     Z-ADDSH12      WORK08
|   C                     Z-ADDSH13      WORK09
| 07-C                     END
|    C                     Z-ADDSH07      WORK11
      *
      *
| 08-C           *IN40     IFEQ '0'
|   C                     ADD  WORK08    WF2908
|   C                     ADD  WORK09    WF2909
|   C                     ADD  WORK11    WF2911
      *
|   C                     UPDATWF290
| 08*C                     ELSE
|   C                     Z-ADDWORK08    WF2908
|   C                     Z-ADDWORK09    WF2909
|   C                     Z-ADDWORK11    WF2911
|   C                     Z-ADD0         WF2914
     C           WF2908    IFNE 0
     C           WF2909    ORNE 0
|   C                     WRITEWF290
| 08-C                     END
| 08-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *                    RTN300 SOSNPF
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
|    C                     READ SN0                      45
| 01-C           *IN45     DOWEQ'0'
|   C*通路型態
|   C           SN03      CHAINMD0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELMD07      WF2902
|   C                     MOVELMD08      WF2903
| 02*C                     ELSE
|   C                     MOVEL*BLANKS   WF2902
|   C                     MOVEL*BLANKS   WF2903
| 02-C                     END
|   C*
| 03-C           WF2902    IFGE DSC33S
|   C           WF2902    ANDLEDSC33E
| 04-C           WF2903    IFGE DSC34S
|   C           WF2903    ANDLEDSC34E
|   C                     MOVELSN03      WF2905
|   C                     MOVELSN11      WF2951
|   C*GET地區
|   C           KEYME     CHAINME0                  41
| 05-C           *IN41     IFEQ '0'
|   C                     MOVELME07      WF2904
| 05-C                     END
| 06-C           WF2904    IFGE DSG15S
|   C           WF2904    ANDLEDSG15E
|   C                     MOVELSN02      WF2907
B2000C                     Z-ADDSN05      WF2906
B2000C                     Z-ADDSN06      WF2913
|   C                     MOVELSN07      WF2912
|   C*
|   C           SN02      SETLLSO0
|   C           SN02      READESO0                      46
| 07-C           *IN46     DOWEQ'0'
| 08-C           SO03      IFGE DSH03S
|   C           SO03      ANDLEDSH03E
      *
|   C                     MOVELSO03      WF2901
|   C           KEYWF     CHAINWF290                40
|   C                     EXSR RTN400
| 08-C                     END
|   C           SN02      READESO0                      46
| 07-C                     END
      *
| 06-C                     END
| 04-C                     END
| 03-C                     END
      *
|   C                     READ SN0                      45
| 01-C                     END
     C                     ENDSR
|    C*
      *==============================================================*
      *          RTN400....WRITE OR UPDATE REWF29
      *==============================================================*
04===C           RTN400    BEGSR
      *
|    C                     Z-ADD0         WORK14
      *
B2CHKC           SN06      IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     Z-ADDSO06      WORK14
| 09*C                     ELSE
|   C                     Z-ADDSO05      WORK14
| 09-C                     END
      *
| 10-C           *IN40     IFEQ '0'
|   C                     ADD  WORK14    WF2914
      *
|   C                     UPDATWF290
| 10*C                     ELSE
|   C                     Z-ADD0         WF2908
|   C                     Z-ADD0         WF2909
|   C                     Z-ADD0         WF2911
|   C                     Z-ADDWORK14    WF2914
     C           WF2914    IFNE 0
|   C                     WRITEWF290
| 10-C                     END
| 10-C                     END
|    C*
04===C                     ENDSR
