     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : SOR0421                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/02/11                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :產品客戶報價表                            *
     A*                                                              *
     A****************************************************************
     FREWF07  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMAPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     F            MD0                               KRENAMEMD1
     FMTMEPF  IF  E           K        DISK
     FREWF06  IF  E           K        DISK
     FSOSAPF  IF  E           K        DISK
     FMTMDLF01IF  E           K        DISK
     I*
     I           UDS
     I                                      101 110 $USER
B2MODI                                      119 1300$EGMDY
B2MODI                                      168 1680$EVR
B2MODI                                      131 1330$CPY
B2MODI                                      604 6050$PRTID
B2MODI                                      607 615 DMA01S
B2MODI                                      616 624 DMA01E
B2MODI                                      627 627 DMD07S
B2MODI                                      628 628 DMD07E
B2MODI                                      629 630 DMD08S
B2MODI                                      631 632 DMD08E
B2MODI                                      633 634 DME07S
B2MODI                                      635 636 DME07E
      *產品組別
B2MODI                                      803 803 DMA11
B2MODI                                      804 804 DMA11S
B2MODI                                      805 805 DMA11E
     I            DS
     I                                        1   2 MA11
     I                                        1   1 MA11A
     I            DS
     I                                        1   9 MA01
     I                                        1   4 MA01L
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C*          *LIKE     DEFN WF0705    WF01
     C*          *LIKE     DEFN WF0709    WF02                         OM
     C           *LIKE     DEFN MA01      KMA01                        OM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYMD     KLIST
     C                     KFLD           SA02
     C                     KFLD           SA03
     C           KEYWF7    KLIST
     C                     KFLD           MA01
     C                     KFLD           MD01
     C           KWF701    KLIST
     C                     KFLD           MA01
     C                     KFLD           SB01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     CALL 'RES001'
     C                     PARM 'MDY'     S001I1  3
     C                     PARM $EGMDY    S001I2  80
     C                     PARM           S001O1  80
     C*
     C                     READ MA0                      46*READ DATA  AGE
     C*
  01-C           *IN46     DOWEQ'0'
    C*
  02-C           MA11A     IFGE DMA11S
    C           MA11A     ANDLEDMA11E
    C                     EXSR RTN200                     *DATA->FILE
    C                     EXSR RTN100                     *DATA->FILE
    C                     MOVEA*ALL'0'   *IN,60
    C                     READ MA0                      46*READ DATA  AGE
    C*
  02-C                     END
  01-C                     END
     C*
     C                     SETON                     LR
      *=========================================================*
      *          RTN100....DATA TO WORKFILE                     *
      *=========================================================*
01===C           RTN100    BEGSR
|    C*產品前四碼
|    C                     MOVELMA01L     KMA01
|    C           KMA01     SETLLSB0
|    C           KMA01     READESB0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C           SB01      CHAINME0                  42
|   C*
| 02-C           ME07      IFLT DME07S
|   C           ME07      ORGT DME07E
|   C                     SETON                     98
| 02-C                     END
|   C*
|   C           SB01      CHAINMD1                  42
|   C*
| 03-C           MD07      IFLT DMD07S
|   C           MD07      ORGT DMD07E
|   C                     SETON                     98
| 03-C                     END
|   C*
| 04-C           MD08      IFLT DMD08S
|   C           MD08      ORGT DMD08E
|   C                     SETON                     98
| 04-C                     END
|   C*
| 05-C           *IN98     IFEQ '0'
|   C                     EXSR RTN120
| 05-C                     END
|   C*
|   C                     SETOF                     98
|   C*
|   C           KMA01     READESB0                      44
| 01-C                     END
|    C*
|    C*產品前四碼
|    C           MA01      SETLLSB0
|    C           MA01      READESB0                      44
| 06-C           *IN44     DOWEQ'0'
|    *
|   C           SB01      CHAINME0                  42
|   C*
| 07-C           ME07      IFLT DME07S
|   C           ME07      ORGT DME07E
|   C                     SETON                     98
| 07-C                     END
|   C*
|   C           SB01      CHAINMD1                  42
|   C*
| 08-C           MD07      IFLT DMD07S
|   C           MD07      ORGT DMD07E
|   C                     SETON                     98
| 08-C                     END
|   C*
| 09-C           MD08      IFLT DMD08S
|   C           MD08      ORGT DMD08E
|   C                     SETON                     98
| 09-C                     END
|   C*
| 10-C           *IN98     IFEQ '0'
|   C                     EXSR RTN120
| 10-C                     END
|   C*
|   C                     SETOF                     98
|   C*
|   C           MA01      READESB0                      44
| 06-C                     END
|    C*
01===C                     ENDSR
      *=========================================================*
      *          RTN110....INITIAL                              *
      *=========================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVE *BLANKS   WF0703
|    C                     MOVE *BLANKS   WF0704
|    C**正常折扣
|    C                     Z-ADD0         WF0705
|    C                     Z-ADD0         WF0706
|    C                     Z-ADD0         WF0707
|    C                     Z-ADD0         WF0708
|    C**特別折扣
|    C                     Z-ADD0         WF0709
|    C                     Z-ADD0         WF0710
|    C                     Z-ADD0         WF0711
|    C                     Z-ADD0         WF0712
|    C**搭贈
|    C                     Z-ADD0         WF0713
|    C                     Z-ADD0         WF0714
|    C                     Z-ADD0         WF0715
|    C                     Z-ADD0         WF0716
|    C                     Z-ADD0         WF0717
|    C                     Z-ADD0         WF0718
|    C                     Z-ADD0         WF0719
|    C                     Z-ADD0         WF0720
|    C*
02===C                     ENDSR
      *=========================================================*
      *          RTN120....DATA TO WORKFILE                     *
      *=========================================================*
03===C           RTN120    BEGSR
|    C*
|    C           KWF701    CHAINWF070                40
|    C   40                EXSR RTN110                     *INITIAL
|    C*
|    C                     MOVE SB01      WF0703
|    C                     MOVE MA01      WF0704
|    C**正常折扣
| 01-C           SB04      IFEQ 'N'
|   C                     Z-ADDSB06      WF0705
|   C                     Z-ADDSB05      WF0707
|   C                     Z-ADDSB13      WF0708
| 02-C           S001O1    IFLT MA39
|   C           1         SUB  WF0705    WF01    54
|   C           MA41      MULT WF01      WF0706    H
| 02*C                     ELSE
|   C           1         SUB  WF0705    WF01
|   C           MA46      MULT WF01      WF0706    H
| 02-C                     END
|    *
| 03-C           S001O1    IFLT MA39
|   C           WF0705    ADD  WF0709    WF01
|   C           1         SUB  WF01      WF02    54
|   C           MA41      MULT WF02      WF0710    H
| 03*C                     ELSE
|   C           WF0705    ADD  WF0709    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0710    H
| 03-C                     END
|   C*
|   C* GET折扣價
| 01-C                     END
|    C**特別折扣
| 04-C           SB04      IFEQ 'S'
|   C*          SB06      MULT 100       WF0709
|   C                     Z-ADDSB06      WF0709
|   C                     Z-ADDSB05      WF0711
|   C                     Z-ADDSB13      WF0712
|   C* GET折扣價
| 05-C           S001O1    IFLT MA39
|   C           WF0705    ADD  WF0709    WF01
|   C           1         SUB  WF01      WF02    54
|   C           MA41      MULT WF02      WF0710    H
| 05*C                     ELSE
|   C           WF0705    ADD  WF0709    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0710    H
| 05-C                     END
|   C*
| 04-C                     END
|    C**搭贈
| 06-C           SB04      IFEQ 'A'
|   C                     Z-ADDSB07      WF0713
|   C                     Z-ADDSB08      WF0714
|   C                     Z-ADDSB09      WF0715
|   C                     Z-ADDSB10      WF0716
|   C                     Z-ADDSB11      WF0717
|   C                     Z-ADDSB12      WF0718
|   C                     Z-ADDSB05      WF0719
|   C                     Z-ADDSB13      WF0720
| 06-C                     END
|    C*
| 07-C           *IN40     IFEQ '0'
|   C                     UPDATWF070
| 07*C                     ELSE
|   C                     WRITEWF070
| 07-C                     END
|    C*
03===C                     ENDSR
      *=========================================================*
      *          RTN200 .. DATA TO WORKFILE
      *=========================================================*
04===C           RTN200    BEGSR
|    C*
|    C*產品前四碼
|    C                     MOVELMA01L     KMA01
|    C           KMA01     SETLLSA0
|    C           KMA01     READESA0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
|   C           KEYMD     SETLLMD0
|   C           KEYMD     READEMD0                      45
| 02-C           *IN45     DOWEQ'0'
|   C*
|   C           KEYWF7    CHAINWF070                40
| 03-C           *IN40     IFEQ '0'
|   C                     EXSR RTN210                     *UPDAT->FILE
| 03*C                     ELSE
|   C                     EXSR RTN110                     *INITIAL
|   C                     EXSR RTN220                     *WRITE->FILE
| 03-C                     END
|   C*
|   C           KEYMD     READEMD0                      45
| 02-C                     END
|   C*
|   C           KMA01     READESA0                      44
| 01-C                     END
|    C*產品全稱
|    C           MA01      SETLLSA0
|    C           MA01      READESA0                      44
| 04-C           *IN44     DOWEQ'0'
|   C*
|   C           KEYMD     SETLLMD0
|   C           KEYMD     READEMD0                      45
| 05-C           *IN45     DOWEQ'0'
|   C*
|   C           KEYWF7    CHAINWF070                40
| 06-C           *IN40     IFEQ '0'
|   C                     EXSR RTN210                     *UPDAT->FILE
| 06*C                     ELSE
|   C                     EXSR RTN110                     *INITIAL
|   C                     EXSR RTN220                     *WRITE->FILE
| 06-C                     END
|   C*
|   C           KEYMD     READEMD0                      45
| 05-C                     END
|   C*
|   C           MA01      READESA0                      44
| 04-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN210....UPDAT DATA TO WORKFILE
      *==============================================================*
05===CSR         RTN210    BEGSR
|    C*
|    C**正常折扣
| 01-C           SA04      IFEQ 'N'
|   C                     Z-ADDSA06      WF0705
|   C                     Z-ADDSA05      WF0707
|   C                     Z-ADDSA13      WF0708
|   C* GET折扣價（正常）
|   C*
| 02-C           S001O1    IFLT MA39
|   C           1         SUB  WF0705    WF01      H
|   C           MA41      MULT WF01      WF0706    H
| 02*C                     ELSE
|   C           1         SUB  WF0705    WF01      H
|   C           MA46      MULT WF01      WF0706    H
| 02-C                     END
|   C* GET折扣價（特別）
| 03-C           S001O1    IFLT MA39
|   C           WF0705    ADD  WF0709    WF01      H
|   C           1         SUB  WF01      WF02      H
|   C           MA41      MULT WF02      WF0710    H
| 03*C                     ELSE
|   C           WF0705    ADD  WF0709    WF01      H
|   C           1         SUB  WF01      WF02      H
|   C           MA46      MULT WF02      WF0710    H
| 03-C                     END
|   C*
|   C                     UPDATWF070
| 01-C                     END
|    C**特別折扣
| 04-C           SA04      IFEQ 'S'
|   C                     Z-ADDSA06      WF0709
|   C                     Z-ADDSA05      WF0711
|   C                     Z-ADDSA13      WF0712
|   C* GET折扣價
| 05-C           S001O1    IFLT MA39
|   C           WF0705    ADD  WF0709    WF01      H
|   C           1         SUB  WF01      WF02      H
|   C           MA41      MULT WF02      WF0710    H
| 05*C                     ELSE
|   C           WF0705    ADD  WF0709    WF01      H
|   C           1         SUB  WF01      WF02      H
|   C           MA46      MULT WF02      WF0710    H
| 05-C                     END
|   C*
|   C                     UPDATWF070
| 04-C                     END
|    C**搭贈
| 06-C           SA04      IFEQ 'A'
|   C                     Z-ADDSA07      WF0713
|   C                     Z-ADDSA08      WF0714
|   C                     Z-ADDSA09      WF0715
|   C                     Z-ADDSA10      WF0716
|   C                     Z-ADDSA11      WF0717
|   C                     Z-ADDSA12      WF0718
|   C                     Z-ADDSA05      WF0719
|   C                     Z-ADDSA13      WF0720
|   C                     UPDATWF070
| 06-C                     END
|    C*
05===CSR                   ENDSR
      *==============================================================*
      *          RTN220....WRITE DATA TO WORKFILE
      *==============================================================*
06===CSR         RTN220    BEGSR
|    C*
|    C                     MOVE MD01      WF0703
|    C                     MOVE MA01      WF0704
|    C**正常折扣
| 01-C           SA04      IFEQ 'N'
|   C                     Z-ADDSA06      WF0705
|   C                     Z-ADDSA05      WF0707
|   C                     Z-ADDSA13      WF0708
|   C* GET折扣價
| 02-C           S001O1    IFLT MA39
|   C           1         SUB  WF0705    WF01      H
|   C           MA41      MULT WF01      WF0706    H
| 02*C                     ELSE
|   C           1         SUB  WF0705    WF01      H
|   C           MA46      MULT WF01      WF0706    H
| 02-C                     END
|   C* GET折扣價（特別）
| 03-C           S001O1    IFLT MA39
|   C           WF0705    ADD  WF0709    WF01      H
|   C           1         SUB  WF01      WF02      H
|   C           MA41      MULT WF02      WF0710    H
| 03*C                     ELSE
|   C           WF0705    ADD  WF0709    WF01      H
|   C           1         SUB  WF01      WF02      H
|   C           MA46      MULT WF02      WF0710    H
| 03-C                     END
|   C*
| 01-C                     END
|    C**特別折扣
| 04-C           SA04      IFEQ 'S'
|   C                     Z-ADDSA06      WF0709
|   C                     Z-ADDSA05      WF0711
|   C                     Z-ADDSA13      WF0712
|   C* GET折扣價
|   C*
| 05-C           S001O1    IFLT MA39
|   C           WF0705    ADD  WF0709    WF01      H
|   C           1         SUB  WF01      WF02      H
|   C           MA41      MULT WF02      WF0710    H
| 05*C                     ELSE
|   C           WF0705    ADD  WF0709    WF01      H
|   C           1         SUB  WF01      WF02      H
|   C           MA46      MULT WF02      WF0710    H
| 05-C                     END
|   C*
| 04-C                     END
|    C**搭贈
| 06-C           SA04      IFEQ 'A'
|   C                     Z-ADDSA07      WF0713
|   C                     Z-ADDSA08      WF0714
|   C                     Z-ADDSA09      WF0715
|   C                     Z-ADDSA10      WF0716
|   C                     Z-ADDSA11      WF0717
|   C                     Z-ADDSA12      WF0718
|   C                     Z-ADDSA05      WF0719
|   C                     Z-ADDSA13      WF0720
| 06-C                     END
|    C*
|    C                     WRITEWF070
|    C*
06===CSR                   ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
07===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
08===C           ERRSR     BEGSR
|    C*
|    C*                    CALL 'P50'
|    C*          DMSG      PARM           P5001O 78
|    C*                    SETON                     8099
|    C*
|    C                     ENDSR'*DETC'
