      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0571                                       *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/08/31                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶搭贈報價明細表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.14  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSOSAPF  IF  E           K        DISK
     FSOSALF09IF  E           K        DISK
     F            SA0                               KRENAMESA9
     FSOSBLF1 IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FREWF35  O   E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 601 DSA02S
     I                                      602 602 DSA02E
     I                                      611 612 DSA03S
     I                                      613 614 DSA03E
     I                                      621 625 DSB01S
     I                                      626 630 DSB01E
     I                                      631 639 DSA01S
     I                                      641 649 DSA01E
     I*MM/DD/YY
     I                                      651 6560DDATE
     I*YY/MM/DD
     I                                      661 6660WDATE
M001AI                                      850 8570WDAT8
     I*
     I                                      671 671 DSEL
     I                                      672 672 WMD07
     I                                      673 674 WMD08
     I                                      680 685 DME15S
     I                                      686 691 DME15E
     I*
     I            DS
     I                                        1   5 WF3502
     I                                        2   2 WF021
     I                                        4   5 WF022
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *SET INIT
     C*
     C                     EXSR RTN100                     *READ SA0
     C*
     C                     EXSR RTN200                     *READ SB0
     C*
     C  N97                EXSR RTN300                     *READ SA9
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN010....SET INIT
      *==============================================================*
03===C           RTN010    BEGSR
     C*
     C           *LOVAL    SETLLSA0
     C           *LOVAL    SETLLSA9
     C           *LOVAL    SETLLSB0
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN100....READ SA0
      *==============================================================*
03===C           RTN100    BEGSR
     C*
     C                     SETOF                     97
     C*
     C                     READ SA0                      40
     C*
     C           *IN40     DOWEQ'0'
     C                     EXSR RTN110                     *MOVE DATA
     C                     WRITEWF350
     C*
     C           SA02      IFEQ WMD07
     C           SA03      ANDEQWMD08
     C                     SETON                     97
     C                     END
     C                     READ SA0                      40
     C                     END
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN110....MOVE DATA
      *==============================================================*
03===C           RTN110    BEGSR
     C*
     C                     MOVE *BLANK    WF3501
     C                     MOVE *BLANK    WF3502
     C                     MOVE *BLANK    WF3503
     C                     Z-ADD0         WF3504
     C                     Z-ADD0         WF3505
     C                     Z-ADD0         WF3506
     C                     Z-ADD0         WF3507
     C                     Z-ADD0         WF3508
     C                     Z-ADD0         WF3509
     C                     Z-ADD0         WF3510
     C                     Z-ADD0         WF3511
     C                     MOVE *BLANK    WF3512
     C*
     C                     MOVE SA01      WF3501
     C                     MOVE SA02      WF021
     C                     MOVE SA03      WF022
     C                     MOVE SA04      WF3503
     C                     Z-ADDSA07      WF3504
     C                     Z-ADDSA08      WF3505
     C                     Z-ADDSA09      WF3506
     C                     Z-ADDSA10      WF3507
     C                     Z-ADDSA11      WF3508
     C                     Z-ADDSA12      WF3509
B2000C                     Z-ADDSA05      WF3510
B2000C                     Z-ADDSA13      WF3511
     C                     MOVE SA14      WF3512
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN200....READ  SB0
      *==============================================================*
03===C           RTN200    BEGSR
     C*
     C           WMD07     IFEQ *BLANK
     C           DSA02S    ANDNE*LOVAL
     C           DSA02E    ANDNE*HIVAL
     C                     MOVE *BLANK    DSB01S
     C                     MOVE *BLANK    DSB01E
     C                     SETON                     96
     C                     END
     C*
     C                     READ SB0                      41
     C*
     C           *IN41     DOWEQ'0'
     C*
     C   96                EXSR RTN210
     C*
     C   96                EXSR RTN210
     C*
     C           *IN98     IFEQ '0'
     C                     EXSR RTN220                     *MOVE DATA
     C                     WRITEWF350
     C                     END
     C                     READ SB0                      41
     C                     END
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN210....MOVE DATA
      *==============================================================*
03===C           RTN210    BEGSR
     C*
     C           SB01      CHAINMD0                  42
     C*
     C           *IN42     IFEQ '0'
     C           MD07      ANDGEDSA02S
     C           MD07      ANDLEDSA02E
     C           MD08      ANDGEDSA03S
     C           MD08      ANDLEDSA03E
     C           SB01      CHAINME0                  43
     C           ME02      IFEQ *BLANKS
     C           ME15      IFGE DME15S
     C           ME15      ANDLEDME15E
     C                     SETOF                     98
     C                     ELSE
     C                     SETON                     98
     C                     END
     C                     END
     C                     END
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN220....MOVE DATA
      *==============================================================*
03===C           RTN220    BEGSR
     C*
     C                     MOVE *BLANK    WF3501
     C                     MOVE *BLANK    WF3502
     C                     MOVE *BLANK    WF3503
     C                     Z-ADD0         WF3504
     C                     Z-ADD0         WF3505
     C                     Z-ADD0         WF3506
     C                     Z-ADD0         WF3507
     C                     Z-ADD0         WF3508
     C                     Z-ADD0         WF3509
     C                     Z-ADD0         WF3510
     C                     Z-ADD0         WF3511
     C                     MOVE *BLANK    WF3512
     C*
     C                     MOVE SB02      WF3501
     C                     MOVE SB01      WF3502
     C                     MOVE SB04      WF3503
     C                     Z-ADDSB07      WF3504
     C                     Z-ADDSB08      WF3505
     C                     Z-ADDSB09      WF3506
     C                     Z-ADDSB10      WF3507
     C                     Z-ADDSB11      WF3508
     C                     Z-ADDSB12      WF3509
B2000C                     Z-ADDSB05      WF3510
B2000C                     Z-ADDSB13      WF3511
     C                     MOVE SB14      WF3512
     C*
     C                     ENDSR
      *==============================================================*
      *          RTN300....LAST CHECK
      *==============================================================*
03===C           RTN300    BEGSR
     C*
     C                     READ SA9                      40
     C*
     C           *IN40     DOWEQ'0'
     C                     EXSR RTN110
     C                     WRITEWF350
     C                     READ SA9                      40
     C                     END
     C*
     C                     ENDSR
