      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR072                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 04/19/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :普銷子系統                                   *
      * REMARK       :普銷統一發票列印                             *
      ****************************************************************
     FPA#BPF  IF  E           K        DISK
     FSOR072D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I                                      601 602 DSI01
     I                                      603 6080DSI21S
     I                                      609 6140DSI21E
     I                                      615 619 DSI05S
     I                                      615 615 DSI051
B2MODI                                      667 671 DSI05E
B2MODI                                      667 667 DSI052
     I                                      621 630 DSI02S
     I                                      631 640 DSI02E
B2MODI                                      641 6520WSI21S
B2MODI                                      653 6640WSI21E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         DSI21S
|    C                     Z-ADD0         DSI21E
|    C                     Z-ADD0         WSI21S
|    C                     Z-ADD0         WSI21E
|    C                     MOVE *BLANK    DSI01
|    C                     MOVE *BLANK    DSI05S
|    C                     MOVE *BLANK    DSI05E
|    C                     MOVE *BLANK    DSI02S
|    C                     MOVE *BLANK    DSI02E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*公司別
| 01-C           DSI01     IFEQ *BLANK
|   C                     SETON                     966999
| 01*C                     ELSE
|   C           DSI01     CHAIN#B0                  42
|   C   42                SETON                     896999
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-發票日期
|    C*
B2CHKC           DSI21S    IFEQ 0
B2INF *CVR3012 sev.30 Field DSI21S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     MOVE '010100'  DSI21S
B2INF *CVR3012 sev.30 Field DSI21S contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
| 02-C                     END
|    C*
B2CHKC           DSI21E    IFEQ 0
B2INF *CVR3012 sev.30 Field DSI21E contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     MOVE '123199'  DSI21E
B2INF *CVR3012 sev.30 Field DSI21E contains more than one year
| 03-C                     END
|    C*
|    C                     CALL 'P09'
B2???C                     PARM DSI21S    P0901I  80
B2INF *CVR3012 sev.30 Field DSI21S contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0911O  1
| 04-C           P0911O    IFEQ 'N'
|   C                     SETON                     609499
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
B2???C                     PARM DSI21E    P0901I  80
B2INF *CVR3012 sev.30 Field DSI21E contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0911O  1
| 05-C           P0911O    IFEQ 'N'
|   C                     SETON                     619499
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHANGE DATE FORMAT)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSI21S    S001I2  80
B2INF *CVR3012 sev.30 Field DSI21S contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           WSI21S    PARM           S001OI  80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSI21E    S001I2  80
B2INF *CVR3012 sev.30 Field DSI21E contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           WSI21E    PARM           S001OI  80
|    C*
B2000C           WSI21S    IFGT WSI21E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*物流點
| 07-C           DSI05S    IFEQ *BLANK
     C           DSI05S    OREQ *LOVAL
|   C                     MOVE *LOVAL    DSI05S
     C                     ELSE
| 09-C           DSI051    IFNE 'V'
|   C                     SETON                     919962
| 09-C                     END
| 07-C                     END
|    C*
| 08-C           DSI05E    IFEQ *BLANK
     C           DSI05E    OREQ *HIVAL
|   C                     MOVE *HIVAL    DSI05E
     C                     ELSE
| 09-C           DSI052    IFNE 'V'
|   C                     SETON                     919963
| 09-C                     END
| 08-C                     END
|    C*
| 10-C           DSI05S    IFGT DSI05E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 10-C                     END
|    C   99                GOTO END100
|    C*發票號碼
| 11-C           DSI02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSI02S
| 11-C                     END
|    C*
| 12-C           DSI02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSI02E
| 12-C                     END
|    C*
| 13-C           DSI02S    IFGT DSI02E
|   C                     SETON                     6667
|   C                     SETON                     9399
| 13-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
