      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0461                                       *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/02/21                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :核准簽章明細表                               *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSEPF  IF  E           K        DISK
     FSOSILF01IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
B2CHKFSOR046APO   E             39     PRINTER
B2INF *CVR3010 sev.30 PRINTER file SOR046AP must be converted, because
B2INF *   file SI06 (and more) are shared by name with other database
B2INF *   fields which require to be expanded. Please convert SOR046AP,
B2INF *   enlarging all involved fields prior to compilation, or manually
B2INF *   insert in this source the proper RENAME and MOVE statements to
B2INF *   avoid name sharing
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
     I                                      603 604 DSC31S
     I                                      605 606 DSC31E
     I                                      611 611 COMP
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      673 673 DSEL
     I                                      621 6260DSC08T
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           *LIKE     DEFN SC04      WSC04
     C           *LIKE     DEFN SC24      WSC24
     C           *LIKE     DEFN SE17      WSE17
     C           KEYSI     KLIST
     C                     KFLD           WSC04
     C           KEYMC     KLIST
     C                     KFLD           DSC27
     C           KEYMD     KLIST
     C                     KFLD           DSC04
     C           KEYME     KLIST
     C                     KFLD           DSC04
     C                     KFLD           DSC05
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRM
     C                     EXSR RTN100                     *GET HEADING
     C*
     C                     SETOF                     10
     C                     READ SC0                      46
     C  N46                MOVELSC04      WSC04
     C  N46                MOVELSC24      WSC24
  01-C           *IN46     DOWEQ'0'
    C                     SETON                     10
    C                     EXSR RTN210
    C   39                EXSR RTN900                     *OVERFLOW
    C                     EXSR RTN200
    C                     MOVELSC04      WSC04
    C                     MOVELSC24      WSC24
    C                     MOVEA*ALL'0'   *IN,60
    C                     READ SC0                      46
  01-C                     END
     C*
     C   10                EXSR RTN210
     C*
     C                     SETOF                     10
     C                     READ SE0                      46
     C  N46                MOVELSE04      WSC04
     C  N46                MOVELSE17      WSE17
  02-C           *IN46     DOWEQ'0'
    C                     SETON                     10
    C                     EXSR RTN310
    C   39                EXSR RTN900                     *OVERFLOW
    C                     EXSR RTN300
    C                     MOVELSE04      WSC04
    C                     MOVELSE17      WSE17
    C                     MOVEA*ALL'0'   *IN,60
    C                     READ SE0                      46
  02-C                     END
     C   10                EXSR RTN310
     C  N10                WRITEPE9
     C                     WRITEPE2
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANKS   DSC02
|    C                     MOVE *BLANKS   DSC27
|    C                     MOVE *BLANKS   DMC02
|    C                     MOVE *BLANKS   DSC04
|    C                     MOVE *BLANKS   DSC05
|    C                     MOVE *BLANKS   ME04
|    C                     Z-ADD0         DSC12
|    C                     MOVE *BLANKS   DSC22
|    C                     MOVE *BLANKS   DSC23
|    C                     MOVE *BLANKS   DSC24
|    C                     MOVE *BLANKS   DSC25
|    C                     MOVE *BLANKS   DSC26
|    C                     MOVE *BLANKS   DSE19
|    C                     MOVE *BLANKS   DSC21
|    C*
|    C                     Z-ADD0         MD22
|    C                     Z-ADD0         MD31
|    C                     Z-ADD0         MD32
|    C                     Z-ADD0         MD30
|    C*
|    C                     Z-ADD0         SI06
|    C                     MOVE *BLANK    SI10
|    C                     MOVE *BLANK    SI02
|    C                     Z-ADD0         SI29
|    C                     Z-ADD0         VOICE
|    C                     Z-ADD0         DIREC
|    C                     Z-ADD0         DWREC
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
    C                     SETOF                     20
     C*
| 02-C           DSEL      IFEQ '1'
|   C                     SETON                     20
     C                     END
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....PROCESS (SOSCPF) TO SCREEN
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     EXSR RTN260                     *FILE TO SCR
|    C***
| 01-C           SC23      IFEQ '*'
|   C           SC24      OREQ '*'
|   C           KEYMD     SETLLMD0
|   C           KEYMD     READEMD0                      44
| 02-C           *IN44     DOWEQ'0'
|   C                     SETON                     70
|   C   39                EXSR RTN900                     *OVERFLOW
|   C                     WRITEPD2
|   C                     WRITEPE4
|   C           KEYMD     READEMD0                      44
| 02-C                     END                             *44 END
|   C                     SETOF                     70
| 01-C                     END
03===C                     ENDSR
     C*==============================================================*
     C*          RTN210....PROCESS (SOSCPF) TO SCREEN
     C*==============================================================*
04===C           RTN210    BEGSR
|    C*
| 01-C           WSC24     IFEQ '*'
| 02-C           SC04      IFNE WSC04
|   C           *IN46     OREQ '1'
|   C           KEYSI     SETLLSI0
|   C           KEYSI     READESI0                      44
| 03-C           *IN44     DOWEQ'0'
|   C                     SETON                     70
|   C   39                EXSR RTN900                     *OVERFLOW
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SI29      S001I2  80
B2MODC           SI29      PARM           S001O1  80
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SI06      S001I2  80
B2MODC           SI06      PARM           S001O1  80
|   C*
|   C           SI25      SUB  SI27      SI25
|   C           SI25      SUB  SI28      VOICE
|   C                     Z-ADDSI26      DIREC
|   C           VOICE     SUB  SI26      DWREC
|   C*
|   C                     WRITEPD3
|   C                     WRITEPE4
|   C           KEYSI     READESI0                      44
| 03-C                     END                             *44 END
|   C                     SETOF                     70
| 02-C                     END
| 01-C                     END
04===C                     ENDSR
     C*
      *==============================================================*
      *          RTN260....FILE TO SCREEN
      *==============================================================*
05===C           RTN260    BEGSR
|    C*
|    C                     MOVE SC02      DSC02
|    C                     MOVE SC27      DSC27
|    C* GET業務員中文名稱
|    C           KEYMC     CHAINMC0                  40
|    C  N40                MOVELMC02      DMC02
|    C   40                MOVE *BLANKS   DMC02
|    C*
|    C                     MOVE SC04      DSC04
|    C                     MOVE SC05      DSC05
|    C* GET客戶簡稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANKS   ME04
|    C* 日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SC08      S001I2  80
B2???C           DSC08     PARM           S001O1  80
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field DSC08 contains more than one year
|    C*
|    C                     Z-ADDSC12      DSC12
|    C                     MOVE SC22      DSC22
|    C                     MOVE SC23      DSC23
|    C                     MOVE SC24      DSC24
|    C                     MOVE SC25      DSC25
|    C                     MOVE SC26      DSC26
|    C                     MOVE *BLANKS   DSE19
|    C                     MOVE SC21      DSC21
|    C*
|    C                     WRITEPD1
|   C                     SETON                     10
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN300....PROCESS (SOSEPF) TO SCREEN
     C*==============================================================*
06===C           RTN300    BEGSR
|    C*
|    C                     EXSR RTN360                     *FILE TO SCR
|    C***
| 01-C           SE16      IFEQ '*'
|   C           SE17      OREQ '*'
|   C           KEYMD     SETLLMD0
|   C           KEYMD     READEMD0                      44
| 02-C           *IN44     DOWEQ'0'
|   C                     SETON                     70
|   C   39                EXSR RTN900                     *OVERFLOW
|   C                     WRITEPD2
|   C                     WRITEPE4
|   C           KEYMD     READEMD0                      44
| 02-C                     END                             *44 END
|   C                     SETOF                     70
| 01-C                     END
|    C***
06===C                     ENDSR
     C*==============================================================*
     C*          RTN310....PROCESS (SOSEPF) TO SCREEN
     C*==============================================================*
07===C           RTN310    BEGSR
      *
| 01-C           WSE17     IFEQ '*'
| 02-C           SE04      IFNE WSC04
|   C           *IN46     OREQ '1'
|   C           KEYSI     SETLLSI0
|   C           KEYSI     READESI0                      44
| 03-C           *IN44     DOWEQ'0'
|   C                     SETON                     70
|   C   39                EXSR RTN900                     *OVERFLOW
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SI29      S001I2  80
B2MODC           SI29      PARM           S001O1  80
|   C*
|   C* 日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SI06      S001I2  80
B2MODC           SI06      PARM           S001O1  80
|   C*
|   C           SI25      SUB  SI27      SI25
|   C           SI25      SUB  SI28      VOICE
|   C                     Z-ADDSI26      DIREC
|   C           VOICE     SUB  SI26      DWREC
|   C*
|   C                     WRITEPD3
|   C                     WRITEPE4
|   C           KEYSI     READESI0                      44
| 03-C                     END                             *44 END
|   C                     SETOF                     70
| 02-C                     END
| 01-C                     END
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN360....FILE TO SCREEN
      *==============================================================*
08===C           RTN360    BEGSR
|    C*
|    C                     MOVE SE02      DSC02
|    C                     MOVE SE32      DSC27
|    C* GET業務員中文名稱
|    C           KEYMC     CHAINMC0                  40
|    C  N40                MOVELMC02      DMC02
|    C   40                MOVE *BLANKS   DMC02
|    C*
|    C                     MOVE SE04      DSC04
|    C                     MOVE SE05      DSC05
|    C* GET客戶簡稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANKS   ME04
|    C* 日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE06      S001I2  80
B2???C           DSC08     PARM           S001O1  80
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field DSC08 contains more than one year
|    C*
|    C                     Z-ADDSE08      DSC12
|    C                     MOVE SE15      DSC22
|    C                     MOVE SE16      DSC23
|    C                     MOVE SE17      DSC24
|    C                     MOVE SE18      DSC25
|    C                     MOVE *BLANKS   DSC26
|    C                     MOVE SE19      DSE19
|    C                     MOVE *BLANKS   DSC21
|    C*
|    C                     WRITEPD1
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
09===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
| 01-C           *IN70     IFEQ '1'
|   C*                    WRITEPD1
| 01-C                     END
|    C                     SETOF                     39
|    C*
09===C                     ENDSR
