      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR0682                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/12/21                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :辦事處通路搭贈／試飲彙總表                   *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /*                                                          */
     /*=============================================================*/
      ****************************************************************
     FREWF58  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FSOR068P O   E             39     PRINTER
     E*
     IWF580
     I                                              WF5801L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *辦事處
     I                                      603 603 COMPS
     I                                      604 604 COMPE
      *SELECT起迄日期
      *YY/MM/DD
     I                                      610 6150YMDS
     I                                      616 6210YMDE
     I                                      622 6270DSC39S
     I                                      628 6330DSC39E
     I                                      640 648 DSD03S
     I                                      650 658 DSD03E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
     C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*辦事處
| 01-C           WF5801    IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 01*C                     ELSE
| 02-C           WF5801    IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 02*C                     ELSE
|   C                     MOVEL'高雄'  COMPC
| 02-C                     END
| 01-C                     END
|    C*
|    C*通路
|    C                     MOVEL'DISTRUBT'#A01
|    C                     MOVELWF5802    #A02
|    C           KEY#A     CHAIN#A0                  41
| 03-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    D#A03
| 03*C                     ELSE
|   C                     MOVEL#A03      D#A03
| 03-C                     END
|    C*
|    C           WF5803    SUB  WF5807    T05801
|    C           WF5804    SUB  WF5808    T05802
|    C           WF5805    ADD  WF5811    T05803
|    C                     SUB  WF5809    T05803
|    C           WF5806    SUB  WF5810    T05804
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     21
|    C                     SETON                     30
|    C                     ADD  WF5803    T15803
|    C                     ADD  WF5804    T15804
|    C                     ADD  WF5805    T15805
|    C                     ADD  WF5811    T15811
|    C                     ADD  WF5812    T15812
|    C                     ADD  WF5806    T15806
|    C                     ADD  WF5807    T15807
|    C                     ADD  WF5808    T15808
|    C                     ADD  WF5809    T15809
|    C                     ADD  WF5810    T15810
|    C                     ADD  T05801    T85801
|    C                     ADD  T05802    T85802
|    C                     ADD  T05803    T85803
|    C                     ADD  T05804    T85804
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETOF                     30
|    C                     SETON                     21
|    C                     ADD  T15803    T25803
|    C                     ADD  T15804    T25804
|    C                     ADD  T15805    T25805
|    C                     ADD  T15811    T25811
|    C                     ADD  T15812    T25812
|    C                     ADD  T15806    T25806
|    C                     ADD  T15807    T25807
|    C                     ADD  T15808    T25808
|    C                     ADD  T15809    T25809
|    C                     ADD  T15810    T25810
|    C                     ADD  T85801    T95801
|    C                     ADD  T85802    T95802
|    C                     ADD  T85803    T95803
|    C                     ADD  T85804    T95804
|    C                     Z-ADD0         T15803
|    C                     Z-ADD0         T15804
|    C                     Z-ADD0         T15805
|    C                     Z-ADD0         T15811
|    C                     Z-ADD0         T15812
|    C                     Z-ADD0         T15806
|    C                     Z-ADD0         T15807
|    C                     Z-ADD0         T15808
|    C                     Z-ADD0         T15809
|    C                     Z-ADD0         T15810
|    C                     Z-ADD0         T85801
|    C                     Z-ADD0         T85802
|    C                     Z-ADD0         T85803
|    C                     Z-ADD0         T85804
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR ....NO DATA
      *==============================================================*
04===C           RTNLR     BEGSR
|    C*
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPT1
|   C                     WRITEPT2
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     30
|    C                     SETOF                     21
      *
05===C                     ENDSR
