      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0861                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/10                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售系統                                     *
      * REMARK       :待核准單據彙總表                             *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.15  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FSOSMLF5 IF  E           K        DISK
     F                                              KINFDS SMRCDN
     F*OSDPF  IF  E           K        DISK
     F*OSFPF  IF  E           K        DISK
     F*TMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR086P O   E             39     PRINTER
     ISMRCDN      DS
     I                                     *RECORD  RCDN
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I*(MM/DD/YY)
     I                                      601 6060DDATES
     I                                      607 6120DDATEE
     I*(YY/MM/DD)
     I                                      640 6450YDATES
     I                                      646 6510YDATEE
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I*
     I                                      621 621 COMP
     I                                      625 625 DPATHS
     I                                      626 626 DPATHE
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      673 678 DSALES
     I                                      679 684 DSALEE
     I*
     I            DS
     I                                        1   5 SM04
     I                                        1   1 SM041
     I                                        6   7 SM01
     I                                        7   7 SM011
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYSM     KLIST
     C                     KFLD           SM04
     C                     KFLD           SM05
      *==============================================================*
      *                    DEFN PDATEE  & PDATES
      *==============================================================*
     C           *LIKE     DEFN DDATEE    PDATEE
     C           *LIKE     DEFN DDATES    PDATES
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100
     C                     READ SOSMLF5                  46
  01-C           *IN46     DOWEQ'0'
B2000C*          SM06      IFLE YDATEE
M001MC*          SM06      ANDGEYDATES
M001MC           SM06      IFLE YMD8E
M001MC           SM06      ANDGEYMD8S
    C           SM011     ANDGECOMPS
    C           SM011     ANDLECOMPE
    C           SM041     ANDGEDPATHS
    C           SM041     ANDLEDPATHE
    C           SM16      ANDGEDSALES
    C           SM16      ANDLEDSALEE
    C   39                EXSR RTN900                     *OVRFLW
    C*  10                WRITEPE3
    C                     EXSR RTN400                     該筆
  02-C                     END
    C                     READ SOSMLF5                  46
  01-C                     END
     C  N11                WRITEPE9
     C                     WRITEPD2
     C                     WRITEPE2
     C*
     C                     SETON                         LR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     WRITEPH1
|    C                     SETON                         10
     C                     Z-ADD0         COUNT
01===C                     ENDSR
      *==============================================================*
      *          RTN300....DATA OF ONE
      *==============================================================*
02===C           RTN300    BEGSR
|    C*業務員名稱
|    C           SM16      CHAINMC0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MC02
| 01-C                     END
|    C*客戶簡稱
|    C           KEYSM     CHAINME0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    ME04
| 02-C                     END
|    C*日期轉換
M001AC                     Z-ADDSM06      W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM SM06      S001I2  80
M001MC                     PARM W6        S001I2  60
|    C           PSM06     PARM           S001O1  60
02===C                     ENDSR
      *==============================================================*
      *          RTN400....CHECK RECORD NAME (ONE)
      *==============================================================*
03===C           RTN400    BEGSR
| 01-C           RCDN      IFEQ 'SC0'
|   C                     MOVE *BLANK    SM13
| 01*C                     ELSE
|   C                     MOVE *BLANK    SM12
| 01-C                     END
|    C                     EXSR RTN300
|    C*電腦核準者，Ｃ清為空白，人工核準者，給も　
| 02-C           SM08      IFEQ 'C'
|   C                     MOVEL*BLANKS   SM08
| 02*C                     ELSE
|   C                     MOVEL'*'       SM08
| 02-C                     END
| 03-C           SM09      IFEQ 'C'
|   C                     MOVEL*BLANKS   SM09
| 03*C                     ELSE
|   C                     MOVEL'*'       SM09
| 03-C                     END
| 04-C           SM10      IFEQ 'C'
|   C                     MOVEL*BLANKS   SM10
| 04*C                     ELSE
|   C                     MOVEL'*'       SM10
| 04-C                     END
| 05-C           SM11      IFEQ 'C'
|   C                     MOVEL*BLANKS   SM11
| 05*C                     ELSE
|   C                     MOVEL'*'       SM11
| 05-C                     END
| 06-C           SM12      IFEQ 'C'
|   C                     MOVEL*BLANKS   SM12
| 06*C                     ELSE
|   C                     MOVEL'*'       SM12
| 06-C                     END
     C*
|    C                     WRITEPD1
     C                     ADD  1         COUNT
|    C                     SETON                     1011
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     10
|    C*
04===C                     ENDSR
