      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : IMR082                                        *
      * AUTHER       : SAM                                           *
      * CREATE DATE  : 85/07/25                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :                                               *
      ****************************************************************
     FSOSGPF  IF  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FREW108  O   E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *辦事處
      *SELECT起迄日期
      *YY/MM/DD
     I                                      622 6270DSG06S
     I                                      628 6330DSG06E
      *
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     READ SG0                      46
  01-C           *IN46     DOWEQ'0'
    C*
    C           SG02      SETLLSH0                  41  42
    C           SG02      READESH0                      44
  02-C           *IN44     DOWEQ'0'
    C*                    MOVELSG01      WF108A
    C                     MOVELSG18      WF108B
    C                     MOVE SG02      WF108C
    C                     MOVE SH03      WF108D
    C                     Z-ADDSH04      WF108E
    C                     WRITEWF108
    C*
    C           SG02      READESH0                      44
    C                     ENDDO
    C*
    C                     READ SG0                      46
    C                     ENDDO
    C*
    C                     SETON                     LR
