      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      * PROGRAM NAME : SOR0912                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/12/08                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :客戶銷售明細表                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.15  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREWF55B IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR091P O   E             39     PRINTER
     E*
     IWF550
     I                                              WF5504L2
     I                                              WF5505L2
     I                                              WF5508L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*辦事處
     I                                      601 601 COMPA
     I*產品代號
     I                                      630 638 DSD03S
     I                                      640 648 DSD03E
     I*日期
     I                                      650 6550DSC08S
     I                                      650 6510YY08S
     I                                      652 6530MM08S
     I                                      656 6610DSC08E
     I                                      701 706 DSC27S
     I                                      707 712 DSC27E
     I*                                     750 750 IN20
      *==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           COMPA     PARM           COMP    1        辦事處
     C*==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *HEADING
  01-C           *IN10     IFEQ '0'
    C                     SETON                     10
  01-C                     END
     C*
  02-C           *INL1     IFEQ '1'
    C                     SETOF                       32
  02-C                     END
     C*
  03-C           *INL2     IFEQ '1'
    C                     SETOF                       31
  03-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SELEC
|    C           COMPA     WHEQ '1'
|    C                     MOVE 'R1'      COMPX   2
|    C                     MOVE 'W1'      COMPY   2
|    C                     MOVE '台北'  COMPB
|    C           COMPA     WHEQ '2'
|    C                     MOVE 'R2'      COMPX
|    C                     MOVE 'W2'      COMPY
|    C                     MOVE '台中'  COMPB
|    C           COMPA     WHEQ '3'
|    C                     MOVE 'R3'      COMPX
|    C                     MOVE 'W3'      COMPY
|    C                     MOVE '高雄'  COMPB
|    C                     END
|    C*
|    C*日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*                    PARM DSC08S    S001I2  80
B2???C*          PSC08S    PARM           S001O1  80
M001MC                     PARM DSC08S    S001I2  60
M001MC           PSC08S    PARM           S001O1  60
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field PSC08S contains more than one year
|    C*
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           WF5501    IFEQ COMPX
|   C           WF5501    OREQ COMPY
|   C*
|   C*客戶
|   C                     MOVELWF5504    ME01
|   C                     MOVELWF5505    ME02
|   C           KEYME     CHAINME0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   ME04
| 02-C                     END
|   C*產品
|   C           WF5506    CHAINMA0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 03-C                     END
|   C*業務員
|   C           WF5513    CHAINMC0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   MC02
| 04-C                     END
|   C*日期轉換
M001AC                     Z-ADDWF5507    W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM WF5507    S001I2  80
B2???C*M001M     PSC07     PARM           S001O1  80
M001MC                     PARM W6        S001I2  60
M001MC           PSC07     PARM           S001O1  60
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field PSC07 contains more than one year
|   C*
M001AC                     Z-ADDWF5514    W6      60
|   C                     CALL 'RES001'
|   C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM WF5514    S001I2  80
B2???C*M001M     PSC39     PARM           S001O1  80
M001MC                     PARM W6        S001I2  60
M001MC           PSC39     PARM           S001O1  60
B2INF *CVR5011 sev.50 Field S001O1 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2INF *CVR3012 sev.30 Field PSC39 contains more than one year
|   C*
| 05-C           WF5522    IFNE '*'
|   C                     MOVE ' '       WF5522
| 05-C                     END
| 06-C           WF5523    IFNE '*'
|   C                     MOVE ' '       WF5523
| 06-C                     END
| 07-C           WF5524    IFNE '*'
|   C                     MOVE ' '       WF5524
| 07-C                     END
| 08-C           WF5525    IFNE '*'
|   C                     MOVE ' '       WF5525
| 08-C                     END
| 09-C           WF5526    IFNE '*'
|   C                     MOVE ' '       WF5526
| 09-C                     END
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPD1
|   C                     SETON                       3132
|   C*
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                       3132
|    C                     SETOF                     21
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNLR  ...LR
      *==============================================================*
04===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
|    C*
04===C                     ENDSR
