      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR0721                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 04/19/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :普銷系統                                     *
      * REMARK       :普銷統一發票列印                             *
      ****************************************************************
     FSOSIPF  UP  E           K        DISK
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FSOSJPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR072P O   E             39     PRINTER
     F*===========================================================
     E*: FUNCTION DATA :
     E                    PM          8  1               總計金額
     E                    PC          8  4               中文大寫
     E                    TAB1   10  10  1   TAB2    4   金額轉換
     E*===========================================================
     I           UDS
     I                                      101 110 $USER
B2MODI                                      119 1300$EGMDY
B2MODI                                      168 1680$EVR
B2MODI                                      131 1330$CPY
B2MODI                                      604 6050$LPRT
B2MODI                                      609 618 DSI02
     I*發票日期
     I            DS
     I                                        1   60WSI21
     I                                        1   20PSI21Y
     I                                        3   40PSI21M
     I                                        5   60PSI21D
     I*發票金額中文大寫欄位
     I            DS
     I                                        1  32 PCT
     I                                        1   4 PC1
     I                                        5   8 PC2
     I                                        9  12 PC3
     I                                       13  16 PC4
     I                                       17  20 PC5
     I                                       21  24 PC6
     I                                       25  28 PC7
     I                                       29  32 PC8
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYSJ     KLIST
     C                     KFLD           SI01
     C                     KFLD           SI02
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEYME1    KLIST
     C                     KFLD           ME01
     C           KEYSD     KLIST
     C                     KFLD           SI10
     C                     KFLD           SJ03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100                     WRITE HEAD
     C                     EXSR RTN200                     WRITE DETAILL
     C                     EXSR RTN300                     WRITE TOTAL L
     C*
     CLR                   SETON                     LR
      *==============================================================*
      *          RTN100....WRITE HEADING
      *==============================================================*
02===C           RTN100    BEGSR
|    C*發票年份轉中國年
B2TRCC                     Z-ADDSI21      WSI21
B2CHKC                     SUB  11        PSI21Y
|    C*客戶訂單單號
|    C           SI10      CHAINSC0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    SC06
| 01-C                     END
|    C****三聯式，讀取客戶檔買受人，統一編號，地址
| 02-C           SI17      IFEQ 3
|   C                     SETON                     30
|   C*
|   C                     MOVE SI12      ME01
|   C                     MOVE *BLANK    ME02
|   C           KEYME     CHAINME0                  40
| 03-C           *IN40     IFEQ '0'
|   C****                 MOVE ME04      ME041
|   C                     MOVE ME05      ME051
|   C                     MOVE ME06      ME061
| 03*C                     ELSE
|   C                     MOVE *BLANK    ME03
|   C****                 MOVE *BLANK    ME041
|   C                     MOVE *BLANK    ME051
|   C                     MOVE *BLANK    ME061
| 03-C                     END
|   C*
|   C           KEYME1    CHAINME0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVE ME03      ME031
| 04*C                     ELSE
|   C                     MOVE *BLANK    ME031
| 04-C                     END
|   C*統一編號
|   C           SI12      CHAINMD0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MD17
| 05-C                     END
|   C*
| 02*C                     ELSE
|   C                     SETOF                     30
| 02-C                     END
|    C*****
|    C*送貨地址
|    C*                    MOVE SI14      ME01
|    C*                    MOVE SI15      ME02
|    C*          KEYME     CHAINME0                  40
| 06-C*          *IN40     IFEQ '0'
|   C*                    MOVE ME04      ME042
|   C*                    MOVE ME05      ME052
|   C*                    MOVE ME06      ME062
| 06*C*                    ELSE
|   C*                    MOVE *BLANK    ME042
|   C*                    MOVE *BLANK    ME052
|   C*                    MOVE *BLANK    ME062
| 06-C*                    END
|    C*業務員
|    C           SI31      CHAINMC0                  40
| 07-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MC02
| 07-C                     END
|    C*清總折扣金額
|    C                     Z-ADD0         TSJ07
|    C*IN31 國防部或縣聯社送貨地址不列印
| 08-C           SI08      IFEQ 'C0504'
|   C           SI08      OREQ 'C0534'
|   C                     SETON                     31
| 08*C                     ELSE
|   C                     SETOF                     31
| 08-C                     END
|    C*
|    C                     WRITEPH1
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE DETAIL
      *==============================================================*
02===C           RTN200    BEGSR
|    C*送貨單明細資料列印
|    C           KEYSJ     SETLLSJ0
|    C           KEYSJ     READESJ0                      41
| 01-C           *IN41     DOWEQ'0'
|   C*產品主檔資料
|   C           SJ03      CHAINMA0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA03
| 02-C                     END
|   C           KEYSD     CHAINSD0                  40
| 03-C           *IN40     IFEQ '0'
|   C*判斷新舊列印方式
|   C           SJ05      SUB  SD06      CHKFLD 152
|   C**********           MULT SD04      CHKFLD
|   C                     MULT SD04      CHKFLD 152H
| 04-C           CHKFLD    IFEQ SJ07
|   C           SD05      ANDNE0
      *新
|   C           SJ04      SUB  SJ13      SJ04A
     C           SJ04A     IFNE 0
|   C********             Z-ADDSJ05      SJ05A
|   C                     Z-ADDSJ05      SJ05A
|   C                     Z-ADDSJ07      SJ07A
|   C*銷售金額
     C           SJ04A     MULT SJ05      WFLD   130H
|   C********** WFLD      SUB  SJ07      SJ06C
|   C           WFLD      SUB  SJ07      SJ06C
|   C*總折扣金額加總
|   C                     ADD  SJ07A     TSJ07
|   C*
|   C                     WRITEPD1
     C                     END
      *
|   C                     Z-ADDSJ13      SJ04A
|   C                     Z-ADD0         SJ05A
|   C                     Z-ADD0         SJ06C
|   C***************      Z-ADD0         SJ06C
|   C                     Z-ADD0         SJ07A
|   C*總折扣金額加總
|   C                     ADD  SJ07A     TSJ07
|   C*
|   C                     WRITEPD1
| 04*C                     ELSE
      *舊
|   C                     Z-ADDSJ04      SJ04A
|   C*******************  Z-ADDSJ05      SJ05A
|   C                     Z-ADDSJ05      SJ05A
|   C                     Z-ADDSJ07      SJ07A
|   C*銷售金額
|   C********** SJ06      SUB  SJ07      SJ06C
|   C           SJ06      SUB  SJ07      SJ06C
|   C*總折扣金額加總
|   C                     ADD  SJ07A     TSJ07
|   C*
|   C                     WRITEPD1
| 04-C                     END
|   C                     SETON                     10
| 03-C                     END
      *
|   C           KEYSJ     READESJ0                      41
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE TOTAL AND FOOT
      *==============================================================*
04===C           RTN300    BEGSR
|    C*發票總計金額轉換
|    C                     MOVE SI25      WSI25   8
|    C                     MOVEAWSI25     PM
|    C                     Z-ADD1         I       10
| 01-C           I         DOWLE8
|   C           PM,I      LOKUPTAB1      TAB2           38
|   C*營業稅
|   C                     MOVE *BLANK    PSI221
|   C                     MOVE *BLANK    PSI222
|   C                     MOVE *BLANK    PSI223
|   C                     SELEC
|   C           SI22      WHEQ 'D'
|   C                     MOVE 'V'       PSI221
|   C           SI22      WHEQ 'Z'
|   C                     MOVE 'V'       PSI222
|   C           SI22      WHEQ 'B'
|   C                     MOVE 'V'       PSI223
|   C                     OTHER
|   C                     MOVE *BLANK    PSI221
|   C                     MOVE *BLANK    PSI222
|   C                     MOVE *BLANK    PSI223
|   C                     ENDSL
|   C*中文大寫金額ARRAY
|   C   38                MOVE TAB2      PC,I
|   C                     ADD  1         I
| 01-C                     END
|    C                     MOVEAPC        PCT
|    C                     WRITEPE1
|    C*更新主檔資料
B2MODC                     Z-ADD0         DATE    80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2MODC                     PARM $EGMDY    S001I2  80
B2MODC           DATE      PARM           S001O1  80
|    C*
|    C                     ADD  1         SI33
B2000C                     Z-ADDDATE      SIXX
B2000C                     TIME           SIYY
|    C                     MOVE $USER     SIZZ
|    C                     UPDATSI0
04===C                     ENDSR
**
0零1壹2貳3參4肆5伍6陸7柒8捌9玖
