      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR083                                        *
      * AUTHER       :                                               *
      * CREATE DATE  : 11/06/95                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :專櫃庫存數量週轉報表                         *
      ****************************************************************
     FSOR083D CF  E                    WORKSTN
     FMTMEPF  IF  E           K        DISK
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 605 DST01S
     I                                      606 610 DST01E
      *MM/DD/YY
     I                                      621 6240DST02
     I                                      621 6220DST02M
     I                                      623 6240DST02Y
      *YY/MM/DD START
     I                                      625 6280WST02
     I                                      625 6260WST02Y
     I                                      627 6280WST02M
      *YY/MM/DD END
     I                                      630 6330WST03
     I                                      630 6310WST03Y
     I                                      632 6330WST03M
      *YY/MM/DD ADD 1
     I                                      634 6370WST04
     I                                      634 6350WST04Y
     I                                      636 6370WST04M
M001AI*(YYYY/MM/DD)
M001AI                                      850 855 YMD82
M001AI                                      858 863 YMD83
     I                                      866 871 YMD84
      *WINE SHOP DESC
     I                                      641 658 DESC
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DST01S
|    C                     MOVE *BLANK    DESC
|    C                     Z-ADD0         DST02
|    C                     Z-ADD0         WST02
|    C                     Z-ADD0         WST03
|    C                     Z-ADD0         WST04
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*專櫃代號
| 01-C           DST01S    IFLT 'B0000'
| 01-C           DST01S    ORGT 'B9999'
|   C                     SETON                     6099
| 01-C                     END
|    C*專櫃代號
| 01-C           DST01S    CHAINMTMEPF               40
     C           *IN40     IFEQ '1'
|   C                     SETON                     6099
| 01-C                     ELSE
     C                     MOVELME04      DESC
| 01-C                     END
|    C*
|    C*(CHECK DATE)-日期
| 04-C           DST02     IFEQ 0
|   C                     SETON                     629599
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C                     Z-ADDDST02Y    WST02Y
|    C                     Z-ADDDST02M    WST02M
| 05-C           WST02M    IFGT 12
|   C           WST02M    ORLT 1
|   C                     SETON                     629399
| 05-C                     END
|    C   99                GOTO END100
|    C*
| 05-C           WST02M    IFEQ 12
     C           WST02M    ADD  1         WST04Y
     C                     Z-ADD1         WST04M
| 05-C                     ELSE
     C           WST02M    ADD  1         WST04M
     C                     Z-ADDWST02Y    WST04Y
| 05-C                     END
|    C*
| 05-C           WST02M    IFEQ 12
     C                     Z-ADD1         WST03M
     C                     Z-ADDWST02Y    WST03Y
| 05-C                     ELSE
     C           WST02M    ADD  1         WST03M
M001AC                     MOVE WST02Y    HB2@YY  2
M001AC                     EXSR HB@24Y
M001AC                     MOVE HB2@Y4    XST02Y  40
     C           XST02Y    SUB  1         WST03Y
| 05-C                     END
|    C*
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE WST02     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD82
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE WST03     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD83
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE WST04     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD84
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
