      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR076                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 09/13/93                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :專櫃五日銷售數量報表                         *
      ****************************************************************
     FSOR076D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 605 DST01S
     I                                      606 610 DST01E
     I                                      630 631 DST14S
     I                                      632 633 DST14E
     I                                      634 642 DST04S
     I                                      643 651 DST04E
      *MM/DD/YY
     I                                      621 6240DST02
     I                                      621 6220DST02M
     I                                      623 6240DST02Y
      *YY/MM/DD
     I                                      625 6280WST02
     I                                      625 6260WST02Y
     I                                      627 6280WST02M
M001AI*(YYYY/MM/DD)
M001AI                                      850 855 YMD8S
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DST01S
|    C                     MOVE *BLANK    DST01E
|    C                     MOVE *BLANK    DST14S
|    C                     MOVE *BLANK    DST14E
|    C                     MOVE *BLANK    DST04S
|    C                     MOVE *BLANK    DST04E
|    C                     Z-ADD0         DST02
|    C                     Z-ADD0         WST02
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*專櫃代號
| 01-C           DST01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DST01S
| 01-C                     END
|    C*
| 02-C           DST01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DST01E
| 02-C                     END
|    C*
| 03-C           DST01S    IFGT DST01E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*部門
| 01-C           DST14S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DST14S
| 01-C                     END
|    C*
| 02-C           DST14E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DST14E
| 02-C                     END
|    C*
| 03-C           DST14S    IFGT DST14E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*產品代號
| 01-C           DST04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DST04S
| 01-C                     END
|    C*
| 02-C           DST04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DST04E
| 02-C                     END
|    C*
| 03-C           DST04S    IFGT DST04E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK DATE)-日期
| 04-C           DST02     IFEQ 0
|   C                     SETON                     669599
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C                     Z-ADDDST02Y    WST02Y
|    C                     Z-ADDDST02M    WST02M
| 05-C           WST02M    IFGT 12
|   C           WST02M    ORLT 1
|   C                     SETON                     629399
| 05-C                     END
|    C   99                GOTO END100
|    C*
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE WST02     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8S
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*產品代號
| 02-C           D#ROW     IFEQ 9
| 03-C           D#COL     IFGE 40
|   C           D#COL     ANDLE47
|   C                     CALL 'WDS001'
|   C                     PARM           DST04S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 52
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS001'
|   C                     PARM           DST04E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
     C*客戶
| 02-C           D#ROW     IFEQ 5
| 03-C           D#COL     IFGE 40
| 03-C           D#COL     ANDLE44
|   C                     CALL 'WDS003'
|   C                     PARM           DST01S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 48
| 03-C           D#COL     ANDLE52
|   C                     CALL 'WDS003'
|   C                     PARM           DST01E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
