     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.18  Y2K MODIFY                    */
     /*=============================================================*/
     FSOR060D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSOR060Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      609 6140DSE24S
     I                                      615 6200DSE24E
     I*M001M                                621 6260YSE24S
     I*M001M                                627 6320YSE24E
M001MI                                      721 7280YSE24S
M001MI                                      731 7380YSE24E
     I                                      633 634 DSE03S
     I                                      635 636 DSE03E
     I                                      637 645 DSF03S
     I                                      646 654 DSF03E
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      673 673 DSEL
     I                                      674 682 DSE45S
     I                                      683 691 DSE45E
     I                                      701 7060DSE06S
     I                                      707 7120DSE06E
     I                                      750 750 IN20
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE '1'       COMP
|    C                     MOVE 'N'       DSEL
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     Z-ADD0         DSE24S
|    C                     Z-ADD0         DSE24E
|    C                     Z-ADD0         DSE06S
|    C                     Z-ADD0         DSE06E
|    C                     Z-ADD0         YSE24S
|    C                     Z-ADD0         YSE24E
M001AC                     Z-ADD0         W6      60
|    C                     MOVE *BLANK    DSE03S
|    C                     MOVE *BLANK    DSE03E
|    C                     MOVE *BLANK    DSE45S
|    C                     MOVE *BLANK    DSE45E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C*送貨日期或確認日期只輸入一項
| 02-C           DSE06S    IFNE 0
|   C           DSE06E    ORNE 0
| 03-C           DSE24S    IFNE 0
|   C                     SETON                     648999
| 03-C                     END
| 04-C           DSE24E    IFNE 0
|   C                     SETON                     658999
| 04-C                     END
| 02-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK銷售日期
| 05-C           DSE06S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSE06S    P0901I  60
|   C                     PARM           P0901O  1
| 06-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 06-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSE06E    P0901I  60
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 07-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSE06S    S001I2  60
|   C*M001M     YSE24S    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YSE24S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSE06E    S001I2  60
|   C*M001M     YSE24E    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YSE24E
|   C**
| 08-C           YSE24S    IFGT YSE24E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 08-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 05*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSE24S    P0901I  60
|   C                     PARM           P0901O  1
| 09-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 09-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSE24E    P0901I  60
|   C                     PARM           P0901O  1
| 10-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 10-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSE24S    S001I2  60
|   C*M001M     YSE24S    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YSE24S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSE24E    S001I2  60
|   C*          YSE24E    PARM           S001O1  60
M001MC           W6        PARM           S001O1  60
M001AC                     MOVE W6        HB2@F6  6
M001AC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
M001AC                     MOVE HB2@T8    YSE24E
|   C**
| 11-C           YSE24S    IFGT YSE24E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 11-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 05-C                     END
|    C*
|    C* 單別
| 12-C           DSE03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE03S
| 12-C                     END
| 13-C           DSE03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE03E
| 13-C                     END
| 14-C           DSE03S    IFGT DSE03E
|   C                     SETON                     6667
|   C                     SETON                     9399
| 14-C                     END
|    C* 客戶代號
| 12-C           DSE45S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSE45S
| 12-C                     END
| 13-C           DSE45E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSE45E
| 13-C                     END
| 14-C           DSE45S    IFGT DSE45E
|   C                     SETON                     6869
|   C                     SETON                     9399
| 14-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 14-C           DSF03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSF03S
| 14-C                     END
|    C*
| 15-C           DSF03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSF03E
| 15-C                     END
|    C*
| 16-C           DSF03S    IFGT DSF03E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 16-C                     END
|    C   99                GOTO END100
|    C*
     C                     OPEN SOR060Z
     C                     WRITEPH1
     C                     CLOSESOR060Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C* 單別
| 03-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS008'
|   C                     PARM 'D'       S008I1  1
|   C                     PARM 'Y '      S008I2  2
|   C           DSE03S    PARM DSE03S    S008O1  2
| 03-C                     END
| 04-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS008'
|   C                     PARM 'D'       S008I1  1
|   C                     PARM 'Y '      S008I2  2
|   C           DSE03E    PARM DSE03E    S008O1  2
| 04-C                     END
|   C*客戶代號
| 05-C           D#ROW     IFEQ 13
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS003'
|   C                     PARM           DSE45S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS003'
|   C                     PARM           DSE45E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
|   C*產品代號
| 14-C           D#ROW     IFEQ 14
| 15-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSF03S
|   C                     GOTO ENDF4
| 15-C                     END
|   C*
| 16-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSF03E
|   C                     GOTO ENDF4
| 16-C                     END
|   C*
| 14-C                     END
|   C*印表機
| 17-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 17-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
