      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0481                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/15                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :預定送貨明細表                               *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FSOSEPF  IF  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FREWF31  O   E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*(MM/DD/YY)
     I                                      621 6260DSC08S
     I                                      627 6320DSC08E
     I*(YY/MM/DD)
     I                                      640 6450YSC08S
     I                                      646 6510YSC08E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100                     *SC
     C                     EXSR RTN200                     *SE         L
     C                     SETON                     LR
     C*
      *==============================================================*
      *          RTN100....SC0
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
     C                     READ SC0                      45
     C           *IN45     DOWEQ'0'
B2000C                     Z-ADDSC08      WF3101
     C                     MOVELSC02      WF3102
     C                     MOVELSC04      WF3103
     C                     MOVELSC05      WF3104
     C                     MOVELSC27      WF3108
     C                     EXSR RTN150
     C                     READ SC0                      45
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN150....SD0
      *==============================================================*
03===C           RTN150    BEGSR
|    C*
     C           SC02      SETLLSD0
     C           SC02      READESD0                      46
     C           *IN46     DOWEQ'0'
     C                     MOVELSD03      WF3105
     C                     Z-ADDSD04      WF3106
     C                     Z-ADDSD05      WF3107
     C                     WRITEWF310
     C           SC02      READESD0                      46
| 01-C                     END
      *
03===C                     ENDSR
      *==============================================================*
      *          RTN200....SE0
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
     C                     READ SE0                      45
     C           *IN45     DOWEQ'0'
B2000C                     Z-ADDSE39      WF3101
     C                     MOVELSE02      WF3102
     C                     MOVELSE04      WF3103
     C                     MOVELSE05      WF3104
     C                     MOVELSE32      WF3108
     C                     EXSR RTN250
     C                     READ SE0                      45
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN250....SF0
      *==============================================================*
03===C           RTN250    BEGSR
|    C*
     C           SE02      SETLLSF0
     C           SE02      READESF0                      46
     C           *IN46     DOWEQ'0'
     C                     MOVELSF03      WF3105
     C                     Z-ADDSF04      WF3106
     C                     Z-ADDSF05      WF3107
     C                     WRITEWF310
     C           SE02      READESF0                      46
| 01-C                     END
      *
03===C                     ENDSR
