      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR090                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/12/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      *    SUBSYSTEM    :訂單系統                                  *
      *    REMARK       :客戶銷售明細表                            *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.14  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*處事處
     I                                      601 601 COMP
     I                                      602 602 COMPS
     I                                      603 603 COMPE
     I*通路
     I                                      604 604 DSC33S
     I                                      605 605 DSC33E
     I*型態
     I                                      606 607 DSC34S
     I                                      608 609 DSC34E
     I*客戶代號
     I                                      610 614 DSC04S
     I                                      620 624 DSC04E
     I*產品代號
     I                                      630 638 DSD03S
     I                                      640 648 DSD03E
     I*日期
     I                                      650 6550DSC08S
     I                                      650 6510YY08S
     I                                      652 6530MM08S
     I                                      654 6550DD08S
     I                                      656 6610DSC08E
     I                                      680 6850YMDS
     I                                      686 6910YMDE
M001MI                                      850 8570YMD8S
M001MI                                      858 8650YMD8E
     I                                      701 706 DSC27S
     I                                      707 712 DSC27E
     I                                      750 750 IN20
      *產品組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I                                      800 800 DMA54
     I                                      801 801 DMA54S
     I                                      802 802 DMA54E
     I*日期
     I                                      811 816 MMDDYY
     I                                      811 8120MM
     I                                      815 8160YY
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C                     MOVEA*ALL'0'   *IN,60
     C**********************
     C*  F4 PROMPT PROCESS *
     C**********************
     C                     EXSR RTN100                     .CHECK      ?
     C*
     C                     EXSR OUTLDA
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVE '01'      $PRTID
|    C                     Z-ADD1         $CPY
|    C                     MOVEL$USER     AUT     3
| 01-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 01-C                     END
     C                     MOVE $EGMDY    MMDDYY  6
     C                     MOVE $EGMDY    DSC08E
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DSC27S
|    C                     MOVE *BLANK    DSC27E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     MOVE 'A'       DMA54
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*辦事處
|    C                     MOVE *LOVAL    COMPS
|    C                     MOVE *HIVAL    COMPE
|    C* CHK種類
|    C                     MOVE *LOVAL    DMA11S
|    C                     MOVE *HIVAL    DMA11E
|    C*通路
|    C                     MOVE *LOVAL    DSC33S
|    C                     MOVE *HIVAL    DSC33E
|    C*型態
|    C                     MOVE *LOVAL    DSC34S
|    C                     MOVE *HIVAL    DSC34E
|    C*客戶代號
|    C                     MOVE *LOVAL    DSC04S
|    C                     MOVE *HIVAL    DSC04E
|    C*產品代號
|    C                     MOVE *LOVAL    DSD03S
|    C                     MOVE *HIVAL    DSD03E
|    C*----------------------------------------------------------------
|    C*固定用出貨日期：當月第一天至當天
|    C*
B2000C                     Z-ADDMM        MM08S
B2000C                     Z-ADDYY        YY08S
|    C                     Z-ADD1         DD08S
B2000C                     MOVE DSC08S    YMDS
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
B2000C                     MOVE $EGMDY    DSC08E
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
     C                     PARM DSC08E    S001I2  60
     C           YMDE      PARM           S001O1  60
M001AC                     MOVE YMDE      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*----------------------------------------------------------------
|    C*業務員
|    C                     MOVE *LOVAL    DSC27S
|    C                     MOVE *HIVAL    DSC27E
|    C*禮盒
|    C                     MOVEL*LOVAL    DMA54S
|    C                     MOVEL*HIVAL    DMA54E
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
