      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR078                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/09/10                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :專櫃銷售淨額報表                             *
      ****************************************************************
     FSOSTLF2 IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSOR078P O   E             39     PRINTER
     IST0
     I                                              ST04A L2
     I                                              ST04  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 609 DST04S
     I                                      611 619 DST04E
      *MM/DD/YY
     I                                      621 6240DST02
     I                                      621 6220DST02M
     I                                      623 6240DST02Y
      *YY/MM/DD
     I                                      625 6280WST02
     I                                      625 6260WST02Y
     I                                      627 6280WST02M
     I            DS
     I                                        1   9 ST04
     I                                        1   4 ST04W
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C                     EXSR RTN100
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
|    C                     Z-ADD0         SUM
|    C                     Z-ADD0         AMT
|    C                     Z-ADD0         DUTY
|    C                     Z-ADD0         NET
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C                     Z-ADD0         T2TOT1
|    C                     Z-ADD0         T2TOT2
|    C                     Z-ADD0         T2TOT3
|    C                     Z-ADD0         T2TOT4
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READ DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*數量
|    C                     Z-ADDST06      WORK0   50
|    C                     ADD  ST07      WORK0
|    C                     ADD  ST08      WORK0
|    C                     ADD  ST09      WORK0
|    C                     ADD  ST10      WORK0
|    C                     ADD  ST11      WORK0
     C*金額
     C           ST6$      MULT ST06      WORK11  92
     C           ST7$      MULT ST07      WORK12  92
     C           ST8$      MULT ST08      WORK13  92
     C           ST9$      MULT ST09      WORK14  92
     C           ST0$      MULT ST10      WORK15  92
     C           ST1$      MULT ST11      WORK16  92
     C                     Z-ADDWORK11    WORK1   92
     C                     ADD  WORK12    WORK1
     C                     ADD  WORK13    WORK1
     C                     ADD  WORK14    WORK1
     C                     ADD  WORK15    WORK1
     C                     ADD  WORK16    WORK1
     C*
|    C           ST12      MULT WORK0     WORK2  134
|    C           WORK1     SUB  WORK2     WORK3  134
|    C                     ADD  WORK0     SUM              *數量
|    C                     ADD  WORK1     AMT              *金額
|    C                     ADD  WORK2     DUTY             *公賣
|    C                     ADD  WORK3     NET              *淨額
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL1 ....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTNL1     BEGSR
|    C*
|    C*產品簡稱
|    C           ST04      CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
     C           SUM       IFNE 0
|    C                     WRITEPD1
     C                     END
|    C*
|    C                     ADD  SUM       T1TOT1
|    C                     ADD  AMT       T1TOT2
|    C                     ADD  DUTY      T1TOT3
|    C                     ADD  NET       T1TOT4
|    C*
|    C                     Z-ADD0         SUM
|    C                     Z-ADD0         AMT
|    C                     Z-ADD0         DUTY
|    C                     Z-ADD0         NET
|    C                     Z-ADD0         WORK0
|    C                     Z-ADD0         WORK1
|    C                     Z-ADD0         WORK2
|    C                     Z-ADD0         WORK3
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK12
|    C                     Z-ADD0         WORK13
|    C                     Z-ADD0         WORK14
|    C                     Z-ADD0         WORK15
|    C                     Z-ADD0         WORK16
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL2 ....WRITE PT1   SUBTOTAL
      *==============================================================*
04===C           RTNL2     BEGSR
|    C   39                EXSR RTN900
     C           T1TOT1    IFNE 0
|    C                     WRITEPT1
     C                     END
|    C                     ADD  T1TOT1    T2TOT1
|    C                     ADD  T1TOT2    T2TOT2
|    C                     ADD  T1TOT3    T2TOT3
|    C                     ADD  T1TOT4    T2TOT4
|    C                     Z-ADD0         T1TOT1
|    C                     Z-ADD0         T1TOT2
|    C                     Z-ADD0         T1TOT3
|    C                     Z-ADD0         T1TOT4
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR  ...WRITE PT2
      *==============================================================*
05===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
     C           T2TOT1    IFNE 0
|    C                     WRITEPT2
     C                     END
|    C                     WRITEPE2
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
06===C                     ENDSR
