     FREWFA7  IP  E           K        DISK
     FSOSIPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR058BPO   E             39     PRINTER
     ISC0
     I                                              SC01  L3
     I                                              SC39  L2
     I                                              SC02  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      609 6140DSC39S
     I                                      615 6200DSC39E
     I                                      621 6260YSC39S
     I                                      627 6320YSC39E
     I                                      633 634 DSC03S
     I                                      635 636 DSC03E
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      673 673 DSEL
     I                                      674 674 DSEL1
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      713 721 DSC04S
     I                                      722 730 DSC04E
     I                                      731 739 DSD03S
     I                                      741 749 DSD03E
     I                                      750 750 IN20
     I            DS
     I                                        1   5 SC04
     I                                        1   1 SC04A
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           SC04
     C                     KFLD           SC05
     C           KEYMA     KLIST
     C                     KFLD           SD03
     C           KEYSI     KLIST
     C                     KFLD           SC01
     C                     KFLD           SC30
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *INIT ENVIRM
  01*C                     ELSE
  02-C           *INL3     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010                     *INIT ENVIRM
  02-C                     END
  01-C                     END
     C*
  03-C           DSEL1     IFEQ 'A'
    C           SC04A     IFNE 'B'
    C   L1                EXSR RTN100
    C                     EXSR RTN110
  03-C                     END
  ERRC                     ELSE
     C   L1                EXSR RTN100
     C                     EXSR RTN110
  ERRC                     END
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CL3 10                EXSR RTN400
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
      *
| 04-C           DSEL      IFEQ 'Y'
|   C                     MOVEL'轉帳'  DSELC
| 04*C                     ELSE
|   C                     MOVEL'非轉帳'DSELC
| 04-C                     END
|    C* GET 公司代號
|    C           SC01      CHAIN#B0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    #B03
| 05-C                     END
|    C                     WRITEPH1
|    C*
|    C                     SETON                     10
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
|    C* GET客戶簡稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANKS   ME04
|    C*
|    C* GET轉換日期
M001AC                     Z-ADDSC08      PSC08   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SC08      S001I2  80
M001AC                     PARM PSC08     S001I2  60
|    C           PSC08     PARM           S001O1  60
|    C*
|    C* GET轉換日期
M001AC                     Z-ADDSC39      PSC39   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SC39      S001I2  80
M001AC                     PARM PSC39     S001I2  60
|    C           PSC39     PARM           S001O1  60
|    C*
|    C                     Z-ADD0         SI21
|    C           KEYSI     CHAINSI0                  40
|    C* GET轉換日期
M001AC                     Z-ADDSI21      PSI21   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SI21      S001I2  80
M001AC                     PARM PSI21     S001I2  60
|    C           PSI21     PARM           S001O1  60
|    C*
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETON                     3020
02===C                     ENDSR
     C*==============================================================*
     C*          RTN110....GET SD
     C*==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C* GET產品簡稱／單位
|    C           KEYMA     CHAINMA0                  40
|    C   40                MOVE *BLANKS   MA03
|    C*
|    C* GET銷售量／試飲
| 01-C           SC03      IFNE 'S4'
|   C                     Z-ADDSD04      SD04A
|   C                     Z-ADD0         SD04B
| 01-C                     END
| 02-C           SC03      IFEQ 'S4'
|   C                     Z-ADD0         SD04A
|   C                     Z-ADDSD04      SD04B
| 02-C                     END
|    C**
|    C   39                EXSR RTN900
|    C                     WRITEPD2
|    C                     ADD  SD04A     T104A
|    C                     ADD  SD05      T105
|    C                     ADD  SD04B     T104B
|    C                     ADD  SD07      T107
|    C                     Z-ADD0         SD04A
|    C                     Z-ADD0         SD04B
|    C                     Z-ADD0         SD05
|    C                     Z-ADD0         SD07
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN200....SUBTOT1
     C*==============================================================*
04===C           RTN200    BEGSR
      *
|    C   39                EXSR RTN900
     C           T104A     IFNE 0
     C           T105      ORNE 0
     C           T104B     ORNE 0
     C           T107      ORNE 0
M001AC           SC37      IFEQ 'D'
M001AC           T107      MULT 1.05      T109      H
M001AC           T109      SUB  T107      T108
M001AC                     ELSE
M001AC                     Z-ADDT107      T109
M001AC                     Z-ADD0         T108
M001AC                     END
|    C                     WRITEPT1
     C                     END
|    C                     ADD  T104A     T204A
|    C                     ADD  T105      T205
|    C                     ADD  T104B     T204B
|    C                     ADD  T107      T207
M001AC                     ADD  T108      T208
M001AC                     ADD  T109      T209
M001AC                     ADD  T108      T308
M001AC                     ADD  T109      T309
|    C                     Z-ADD0         T104A
|    C                     Z-ADD0         T104B
|    C                     Z-ADD0         T105
|    C                     Z-ADD0         T107
M001AC                     Z-ADD0         T108
M001AC                     Z-ADD0         T109
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN300....SUBTOT2
     C*==============================================================*
05===C           RTN300    BEGSR
      *
|    C   39                EXSR RTN900
     C           T204A     IFNE 0
     C           T205      ORNE 0
     C           T204B     ORNE 0
     C           T207      ORNE 0
|    C                     WRITEPT2
     C                     END
|    C                     ADD  T204A     T304A
|    C                     ADD  T205      T305
|    C                     ADD  T204B     T304B
|    C                     ADD  T207      T307
|    C                     Z-ADD0         T204A
|    C                     Z-ADD0         T204B
|    C                     Z-ADD0         T205
|    C                     Z-ADD0         T207
M001AC                     Z-ADD0         T208
M001AC                     Z-ADD0         T209
|    C                     SETOF                     30
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN400....SUBTOT2
     C*==============================================================*
06===C           RTN400    BEGSR
      *
|    C   39                EXSR RTN900
     C           T304A     IFNE 0
     C           T305      ORNE 0
     C           T304B     ORNE 0
     C           T307      ORNE 0
|    C                     WRITEPT3
     C                     END
|    C                     Z-ADD0         T304A
|    C                     Z-ADD0         T304B
|    C                     Z-ADD0         T305
|    C                     Z-ADD0         T307
M001AC                     Z-ADD0         T308
M001AC                     Z-ADD0         T309
|    C                     SETOF                     20
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTNLR  ...LR
      *==============================================================*
08===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
|    C*
08===C                     ENDSR
