      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR079                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 09/17/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析作業                                 *
      * REMARK       :試飲訂單明細分析表                           *
     A*===============================================================
     A* MODI CODE |  AUTHOR  |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*  M003     | MICHELLE | 991227 |增加試飲原因選項
     A*---------------------------------------------------------------
     A*  M004     | MICHELLE | 011116 |增加試飲客戶名稱
     A*===============================================================
      ****************************************************************
     FSOR079D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I*增加辦事處的挑選
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      602 607 DSC27S
     I                                      608 613 DSC27E
     I                                      615 619 DSC04S
     I                                      620 624 DSC04E
     I                                      625 633 DSD03S
     I                                      634 642 DSD03E
     I                                      645 6500DSC39S
     I                                      651 6560DSC39E
     I                                      657 6620YSC39S
     I                                      663 6680YSC39E
     I                                      670 670 DSEL
M004AI                                      680 684 DSC16S
M004AI                                      685 689 DSC16E
      *產品組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
M003A *試飲原因
M003AI                                      800 801 DSC10S
M003AI                                      802 803 DSC10E
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         YSC39S
|    C                     Z-ADD0         YSC39E
|    C                     MOVE 'A'       DSEL
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC27S
|    C                     MOVE *BLANK    DSC27E
M004AC                     MOVE *BLANK    DSC16S
M004AC                     MOVE *BLANK    DSC16E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     MOVEL'SCR001'  APPSCR  6
M003AC                     MOVE *BLANK    DSC10S
M003AC                     MOVE *BLANK    DSC10E
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK業務員
| 02-C           DSC27S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC27S
| 02-C                     END
|    C*
| 03-C           DSC27E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC27E
| 03-C                     END
|    C*
| 04-C           DSC27S    IFGT DSC27E
|   C                     SETON                     606193
|   C                     SETON                     99
| 04-C                     END
|    C*
|    C   99                GOTO END100
|    C*
|    C* CHK客戶
| 05-C           DSC04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC04S
| 05-C                     END
|    C*
| 06-C           DSC04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC04E
| 06-C                     END
|    C*
| 07-C           DSC04S    IFGT DSC04E
|   C                     SETON                     626393
|   C                     SETON                     99
| 07-C                     END
|    C   99                GOTO END100
|    C*
M004AC* CHK試飲客戶
| 05-C           DSC16S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC16S
| 05-C                     END
|    C*
| 06-C           DSC16E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC16E
| 06-C                     END
|    C*
| 07-C           DSC16S    IFGT DSC16E
|   C                     SETON                     7093
|   C                     SETON                     99
| 07-C                     END
M004AC   99                GOTO END100
|    C*
|    C* CHK產品組別
| 01-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
     C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 01-C                     END
|    C* CHK產品代號
| 08-C           DSD03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSD03S
| 08-C                     END
|    C*
| 09-C           DSD03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSD03E
| 09-C                     END
|    C*
| 10-C           DSD03S    IFGT DSD03E
|   C                     SETON                     646593
|   C                     SETON                     99
| 10-C                     END
|    C   99                GOTO END100
|    C*
M003AC* CHK試飲原因
M003AC           DSC10S    IFEQ *BLANKS
M003AC                     MOVE *LOVAL    DSC10S
M003AC                     END
M003AC*
M003AC           DSC10E    IFEQ *BLANKS
M003AC                     MOVE *HIVAL    DSC10E
M003AC                     END
M003AC*
M003AC           DSC10S    IFGT DSC10E
M003AC                     SETON                     686993
M003AC                     SETON                     99
M003AC                     END
M003AC   99                GOTO END100
     C*
|    C* CHK確認日期
| 11-C           DSC39S    IFEQ 0
M001DC*                    Z-ADD010101    DSC39S
M001AC                     Z-ADD010192    DSC39S
| 11-C                     END
|    C                     CALL 'P09'
|    C                     PARM DSC39S    P0901I  60
|    C                     PARM           P0901O  1
| 12-C           P0901O    IFEQ 'N'
|   C                     SETON                     669499
| 12-C                     END
|    C*
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC39S    S001I2  60
|    C           YSC39S    PARM           S001O1  60
|    C*
| 13-C           DSC39E    IFEQ 0
M001DC*                    Z-ADD123199    DSC39E
M001AC                     Z-ADD123129    DSC39E
| 13-C                     END
|    C                     CALL 'P09'
|    C                     PARM DSC39E    P0901I  60
|    C                     PARM           P0901O  1
| 14-C           P0901O    IFEQ 'N'
|   C                     SETON                     679499
| 14-C                     END
|    C*
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC39E    S001I2  60
|    C           YSC39E    PARM           S001O1  60
|    C*
M001AC                     MOVE YSC39S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|   C**
M001AC                     MOVE YSC39E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YSC39S    IFGT YSC39E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     666793
|   C                     SETON                     99
| 15-C                     END
|    C*
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*業務員
| 02-C           D#ROW     IFEQ 5
| 03-C           D#COL     IFGE 37
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 49
|   C           D#COL     ANDLE54
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*客戶代號
| 05-C           D#ROW     IFEQ 6
| 06-C           D#COL     IFGE 37
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04E
|   C                     GOTO ENDF4
| 07-C                     END
| 05-C                     END
|   C*
|   C*試飲客戶代號
| 05-C           D#ROW     IFEQ 7
| 06-C           D#COL     IFGE 37
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS003'
|   C                     PARM           DSC16S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C                     PARM           DSC16E
|   C                     GOTO ENDF4
| 07-C                     END
| 05-C                     END
M004AC*
|   C*產品代號
| 08-C           D#ROW     IFEQ 9
| 09-C           D#COL     IFGE 37
|   C           D#COL     ANDLE45
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 49
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*
| 11-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE37
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
|   C*
M003AC*試飲原因
| 08-C           D#ROW     IFEQ 11
| 09-C           D#COL     IFGE 37
|   C           D#COL     ANDLE45
|   C                     CALL 'WDS035'
|   C                     PARM           DSC10S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 49
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS035'
|   C                     PARM           DSC10E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
M003AC*
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
