      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR057                                        *
      * AUTHER       : ANDY                                          *
      * CREATE DATE  : 81/08/27                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶搭贈報價明細表                           *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.14  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FMTMDPF  IF  E           K        DISK
     FSOR057D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 601 DSA02S
     I                                      602 602 DSA02E
     I                                      611 612 DSA03S
     I                                      613 614 DSA03E
     I                                      621 625 DSB01S
     I                                      622 625 SSB01S
     I                                      626 630 DSB01E
     I                                      631 639 DSA01S
     I                                      641 649 DSA01E
     I*MM/DD/YY
     I                                      651 6560DDATE
     I*YY/MM/DD
     I                                      661 6660WDATE
M001AI                                      850 8570WDAT8
     I*
     I                                      671 671 DSEL
     I                                      672 672 WMD07
     I                                      673 674 WMD08
     I                                      680 685 DME15S
     I                                      686 691 DME15E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSA02S
|    C                     MOVE *BLANK    DSA02E
|    C                     MOVE *BLANK    DSA03S
|    C                     MOVE *BLANK    DSA03E
|    C                     MOVE *BLANK    DSB01S
|    C                     MOVE *BLANK    DSB01E
|    C                     MOVE *BLANK    DSA01S
|    C                     MOVE *BLANK    DSA01E
|    C                     MOVE *BLANK    DME15S
|    C                     MOVE *BLANK    DME15E
|    C                     MOVE *BLANK    DSEL
B2000C                     Z-ADD$EGMDY    DDATE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C***********
|    C*客戶代號
|    C***********
| 01-C           DSB01S    IFNE *BLANK
|   C                     MOVE DSB01S    DSB01E
|   C           DSB01S    CHAINMD0                  40
|   C*
| 02-C           *IN40     IFEQ '0'
|   C                     MOVE MD07      WMD07
|   C                     MOVE MD08      WMD08
| 02-C                     END
|   C*
| 03-C           DSA02S    IFEQ *BLANK
|   C           DSA02E    ANDEQ*BLANK
|   C                     MOVE WMD07     DSA02S
|   C                     MOVE WMD07     DSA02E
|   C                     MOVE WMD08     DSA03S
|   C                     MOVE WMD08     DSA03E
| 03-C                     END
| 01*C                     ELSE
|   C                     MOVE *BLANK    WMD07
|   C                     MOVE *BLANK    WMD08
| 04-C           DSA02S    IFEQ *BLANK
|   C           DSA02E    ANDEQ*BLANK
|   C                     MOVE *LOVAL    DSB01S
|   C                     MOVE *HIVAL    DSB01E
| 04*C                     ELSE
|   C                     MOVE *BLANK    DSB01S
|   C                     MOVELDSA02S    DSB01S
|   C                     MOVELDSA02E    DSB01E
|   C                     MOVE '9999'    DSB01E
| 04-C                     END
| 01-C                     END
|    C*
|    C*******
|    C*通路
|    C*******
| 05-C           DSA02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSA02S
| 05-C                     END
|    C*
| 06-C           DSA02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSA02E
| 06-C                     END
|    C*
| 07-C           DSA02S    IFGT DSA02E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*******
|    C*型態
|    C*******
| 08-C           DSA03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSA03S
| 08-C                     END
|    C*
| 09-C           DSA03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSA03E
| 09-C                     END
|    C*
| 10-C           DSA03S    IFGT DSA03E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C***********
|    C*業務員　
|    C***********
| 11-C           DME15S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DME15S
| 11-C                     END
|    C*
| 12-C           DME15E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DME15E
| 12-C                     END
|    C*
| 13-C           DME15S    IFGT DME15E
|   C                     SETON                     7071
|   C                     SETON                     9399
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C***********
|    C*產品代號
|    C***********
| 11-C           DSA01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSA01S
| 11-C                     END
|    C*
| 12-C           DSA01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSA01E
| 12-C                     END
|    C*
| 13-C           DSA01S    IFGT DSA01E
|   C                     SETON                     6667
|   C                     SETON                     9399
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C***********
|    C*有效日期
|    C***********
B2CHKC           DDATE     IFEQ 0
B2INF *CVR3012 sev.30 Field DDATE contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     SETON                     689499
| 14*C                     ELSE
|   C                     CALL 'P09'                      *CHK DATE
     C                     PARM DDATE     P0901I  60
B2INF *CVR3012 sev.30 Field DDATE contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|   C                     PARM           P0901O  1
| 15-C           P0901O    IFEQ 'N'
|   C                     SETON                     689499
| 15-C                     END
| 14-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
     C                     PARM DDATE     S001I2  60
B2INF *CVR3012 sev.30 Field DDATE contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           WDATE     PARM           S001O1  60
M001AC                     MOVE WDATE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    WDAT8
|    C*
|    C*******
|    C*選項
|    C*******
| 16-C           DSEL      IFEQ *BLANK
|   C                     SETON                     699699
| 16-C                     END
     C*
     C           END100    TAG
     C*
     C           *IN99     IFEQ '1'
     C           DSA02S    IFEQ *LOVAL
     C                     MOVE *BLANK    DSA02S
     C                     END
     C           DSA02E    IFEQ *HIVAL
     C                     MOVE *BLANK    DSA02E
     C                     END
     C           SSB01S    IFEQ *BLANK
     C           SSB01S    OREQ *LOVAL
     C                     MOVE *BLANK    DSB01S
     C                     MOVE *BLANK    DSB01E
     C                     END
     C                     END
|    C*
02===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 4
| 03-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C           DSA02S    PARM DSA02S    PSA02   1
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 50
|   C                     CALL 'WDS018'
|   C           DSA02E    PARM DSA02E    PSA02
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 5
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSA02S    PSA02
|   C           DSA03S    PARM DSA03S    PSA03   2
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 50
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS009'
|   C                     PARM DSA02E    PSA02
|   C           DSA03E    PARM DSA03E    PSA03
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*業務員
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C                     PARM           DME15S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE55
|   C                     CALL 'WDS015'
|   C                     PARM           DME15E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
| 08-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 08-C                     END
|   C*
| 01-C                     END
|    C*
|    C           ENDF4     TAG
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
03===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
