     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR085D                                    *
     A*    AUTHOR       : D910074  TINA                              *
     A*    CREATE DATE  : 81/02/18                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR085 D                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :訂單系統                                  *
     A*    REMARK       :月品牌通路銷售彙總表                      *
     A****************************************************************
     FSOR085D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*辦事處，通路，產品
     I                                      601 6040DST02
     I                                      601 6020DST02M
     I                                      603 6040DST02Y
     I                                      605 6080DDATE
     I                                      613 617 DST01S
     I                                      613 613 DST01A
     I                                      618 622 DST01E
     I                                      618 618 DST01B
M001AI*(YYYY/MM/DD)
M001AI                                      850 855 YMD8S
     I*(YY/MM)
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C           AUT       ANDNE'CWD'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DST01S
|    C                     MOVE *BLANK    DST01E
|    C                     Z-ADD0         DST02
|    C                     Z-ADD0         DDATE
|    C                     Z-ADD0         DST02M
|    C                     Z-ADD0         DST02Y
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*(CHECK DATE)-日期
| 17-C           DST02     IFEQ 0
|   C                     SETON                     609599
| 17-C                     END
|    C   99                GOTO END100
|    C*
| 18-C           DST02M    IFGT 12
|   C           DST02M    ORLT 1
|   C                     SETON                     609399
| 18-C                     END
|    C   99                GOTO END100
     C                     MOVE DST02M    DDATE
     C                     MOVELDST02Y    DDATE
M001AC                     MOVE DDATE     YMD8S
M001AC                     MOVE '004N7'   HB2@FA
M001AC                     MOVE DDATE     HB2@F
M001AC                     MOVE '006N7'   HB2@TA
M001AC                     EXSR HB@ADD                     ADD CENTURY
M001AC                     MOVE HB2@T     YMD8S
|    C*
|    C*專櫃　　
| 02-C           DST01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DST01S
| 02-C                     END
|    C*
| 03-C           DST01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DST01E
| 03-C                     END
|    C*
| 04-C           DST01S    IFGT DST01E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
     C           DST01A    IFNE 'B'
     C           DST01B    ORNE 'B'
|   C                     SETON                     6162
|   C                     SETON                     9099
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*專櫃
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 37
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS003'
|   C                     PARM           DST01S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 49
| 04-C           D#COL     ANDLE52
|   C                     CALL 'WDS003'
|   C                     PARM           DST01E
|   C                     GOTO ENDF4
| 04-C                     END
| 02-C                     END
|   C*
| 11-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE37
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C*          *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
