     F*================================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE
     F*----------------------------------------------------------------
     F*  M002     | 99.11.08 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     F*  M003     | 00.11.08 |增加大區域選項
     F*----------------------------------------------------------------
     F*           |          |
     F*----------------------------------------------------------------
@@   FREWF371 IP  E           K        DISK
     F*A#BPF  IF  E           K        DISK
     FPA#HPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
M002AFPA#APF  IF  E           K        DISK
@@   FMTMCPF  IF  E           K        DISK
@@   FMTMEPF  IF  E           K        DISK
M003AFPA#LPF  IF  E           K        DISK
     FSOR092P O   E             39     PRINTER
     E*
     IWF370
@@   I                                              WF3713L5
@@   I                                              WF3714L5
     I                                              WF3711L4
     I                                              WF3712L3
     I                                              WF3701L2
     I                                              WF3702L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *型態
     I                                      603 604 DSC34S
     I                                      605 606 DSC34E
      *地區
     I                                      607 608 DSC31S
     I                                      609 610 DSC31E
      *組別
     I                                      801 806 DSC27S
     I                                      807 812 DSC27E
     I                                      646 654 DSD03S
     I                                      655 663 DSD03E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      611 6160YMDS
     I                                      617 6220YMDE
     I                                      623 6280DSC39S
     I                                      629 6340DSC39E
     I                                      681 689 DSC45S
     I                                      690 698 DSC45E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
M003A *大區域別
M003AI                                      730 731 D#L01S
M003AI                                      732 733 D#L01E
     I                                      750 750 IN20
     I                                      720 720 DSEL2
     I                                      664 664 COMP
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
M002A *集團代號
M002AI                                      820 821 DMD06S
M002AI                                      822 823 DMD06E
     I            DS
     I                                        1   9 WF3701
     I                                        1   4 WFTYPE
     I                                        3   4 W3701L
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#H     KLIST
     C                     KFLD           #H01
     C                     KFLD           #H02
     C           MTMEK     KLIST
     C                     KFLD           WF3713
     C                     KFLD           WF3714
M002AC           KEY#A     KLIST
M002AC                     KFLD           #A01
M002AC                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL2 10                EXSR RTN200
     CL3 10                EXSR RTN300
     CL4 10                EXSR RTN400
     CL5 10                EXSR RTN500
     CLR                   EXSR RTN600
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
| 02-C           COMP      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 02*C                     ELSE
| 03-C           COMP      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 03*C                     ELSE
| 04-C           COMP      IFEQ '3'
|   C                     MOVEL'高雄'  COMPC
| 04*C                     ELSE
|   C                     MOVEL'全部'  COMPC
| 04-C                     END
| 03-C                     END
| 02-C                     END
| 05-C           IN20      IFEQ '0'
|   C                     SETOF                     20
| 05*C                     ELSE
|   C                     SETON                     20
| 05-C                     END
|    C*種類
     C                     MOVEL*BLANKS   GROUP
| 02-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'GROUP
| 02*C                     ELSE
| 03-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'GROUP
| 03*C                     ELSE
| 04-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'GROUP
| 04*C                     ELSE
|   C                     MOVEL'全　部'GROUP
| 04-C                     END
| 03-C                     END
| 02-C                     END
|    C*禮盒
|   C                     SETOF                     22
| 03-C           DSEL2     IFEQ 'A'
|   C                     SETOF                     22
| 03*C                     ELSE
|   C                     SETON                     22
| 03-C                     END
M002AC                     MOVEL'CUSTGRP' #A01
M002AC                     MOVELDMD06S    #A02
M002AC           KEY#A     CHAIN#A0                  42
M002AC           *IN42     IFEQ '0'
M002AC                     MOVEL#A03      D#A03S
M002AC                     ELSE
M002AC                     MOVE *BLANKS   D#A03S
M002AC                     END
M002AC                     MOVEL'CUSTGRP' #A01
M002AC                     MOVELDMD06E    #A02
M002AC           KEY#A     CHAIN#A0                  42
M002AC           *IN42     IFEQ '0'
M002AC                     MOVEL#A03      D#A03E
M002AC                     ELSE
M002AC                     MOVE *BLANKS   D#A03E
M002AC                     END
     C*
M003AC           D#L01S    CHAIN#L0                  50
M003AC           *IN50     IFEQ '0'
M003AC                     MOVEL#L02      D#L02S
M003AC                     ELSE
M003AC                     MOVE *BLANKS   D#L02S
M003AC                     END
     C*
M003AC           D#L01E    CHAIN#L0                  51
M003AC           *IN51     IFEQ '0'
M003AC                     MOVEL#L02      D#L02E
M003AC                     ELSE
M003AC                     MOVE *BLANKS   D#L02E
M003AC                     END
|    C                     WRITEPH1
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*產品
|    C           WF3701    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 01-C                     END
      *
|    C*GET標準容積
     C                     MOVEL'STANDARD'#H01
     C                     MOVELW3701L    #H02
|    C           KEY#H     CHAIN#H0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         DCASE   52
     C                     ELSE
|   C                     Z-ADD#H03      DCASE   52
| 01-C                     END
|    C*公司
|    C*          WF3702    CHAIN#B0                  40
| 02-C*          *IN40     IFEQ '1'
|   C*                    MOVEL*BLANKS   #B03
| 02-C*                    END
      *
|    C           WF3701    CHAINMA0                  40
|    C*訂購實際及標準箱數之計算QTY1,ASE1
|    C           WF3703    SUB  WF3707    QTY1
|    C                     Z-ADD0         TCASE1 153
|    C           QTY1      MULT MA15      TCASE1
|    C                     ADD  TCASE1    W1CAS1 173
|    C                     ADD  TCASE1    W2CAS1 173
|    C                     ADD  TCASE1    W3CAS1 173
|    C                     ADD  TCASE1    W4CAS1 173
@@   C                     ADD  TCASE1    W5CAS1 173
|    C*                    ADD  QTY1      T1QTY1
|    C                     ADD  QTY1      T2QTY1
|    C                     ADD  QTY1      T3QTY1
|    C                     ADD  QTY1      T4QTY1
@@   C                     ADD  QTY1      T5QTY1
|    C*搭贈實際及標準箱數之計算QTY2,CASE2
|    C           WF3704    SUB  WF3708    QTY2
|    C                     Z-ADD0         TCASE2 153
|    C           QTY2      MULT MA15      TCASE2
|    C                     ADD  TCASE2    W1CAS2 173
|    C                     ADD  TCASE2    W2CAS2 173
     C                     ADD  TCASE2    W3CAS2 173
|    C                     ADD  TCASE2    W4CAS2 173
@@   C                     ADD  TCASE2    W5CAS2 173
|    C*                    ADD  QTY2      T1QTY2
|    C                     ADD  QTY2      T2QTY2
|    C                     ADD  QTY2      T3QTY2
|    C                     ADD  QTY2      T4QTY2
@@   C                     ADD  QTY2      T5QTY2
|    C*試飲實際及標準箱數之計算QTY3,CASE3
|    C           WF3705    SUB  WF3709    QTY3
|    C                     Z-ADD0         TCASE3 153
|    C           QTY3      MULT MA15      TCASE3
|    C                     ADD  TCASE3    W1CAS3 173
|    C                     ADD  TCASE3    W2CAS3 173
|    C                     ADD  TCASE3    W3CAS3 173
|    C                     ADD  TCASE3    W4CAS3 173
@@   C                     ADD  TCASE3    W5CAS3 173
|    C*                    ADD  QTY3      T1QTY3
|    C                     ADD  QTY3      T2QTY3
|    C                     ADD  QTY3      T3QTY3
|    C                     ADD  QTY3      T4QTY3
@@   C                     ADD  QTY3      T5QTY3
|    C*
|    C*實際金額之計算QTY4
|    C           WF3706    SUB  WF3710    QTY4
|    C*                    ADD  QTY4      T1QTY4
|    C                     ADD  QTY4      T2QTY4
|    C                     ADD  QTY4      T3QTY4
|    C                     ADD  QTY4      T4QTY4
@@   C                     ADD  QTY4      T5QTY4
      *標準箱數
     C           DCASE     IFNE 0
|    C           TCASE1    DIV  DCASE     CASE1     H
|    C           TCASE2    DIV  DCASE     CASE2     H
|    C           TCASE3    DIV  DCASE     CASE3     H
     C                     END
     C*
|    C   39                EXSR RTN900
     C   L5                SETOF                     29
     C   L5      MTMEK     CHAINME0                  25
     C   L5      WF3715    CHAINMC0                  25
|    C                     WRITEPD1
|    C*                    SETOF                     21
|    C                     SETON                     30
|    C                     SETON                     29
|    C                     Z-ADD0         CASE1
|    C                     Z-ADD0         CASE2
|    C                     Z-ADD0         CASE3
|    C                     Z-ADD0         QTY1
|    C                     Z-ADD0         QTY2
|    C                     Z-ADD0         QTY3
|    C                     Z-ADD0         QTY4
|    C*
02===C                     ENDSR
      *==============================================================*
      *                 ...WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
| 01-C*          DCASE     IFEQ 0
|   C*                    Z-ADD0         T1CAS1
|   C*                    Z-ADD0         T1CAS2
|   C*                    Z-ADD0         T1CAS3
| 01*C*                    ELSE
|   C*總容積數／標準容積＝標準箱數之合計
|   C*          W1CAS1    DIV  DCASE     T1CAS1    H
|   C*          W1CAS2    DIV  DCASE     T1CAS2    H
|   C*          W1CAS3    DIV  DCASE     T1CAS3    H
| 01-C*                    END
|    C*
|    C   39                EXSR RTN900
|    C*                    WRITEPT1
|    C                     SETOF                     30
|    C*                    SETON                     21
|    C                     Z-ADD0         W1CAS1
|    C                     Z-ADD0         W1CAS2
|    C                     Z-ADD0         W1CAS3
|    C*                    Z-ADD0         T1CAS1
|    C*                    Z-ADD0         T1CAS2
|    C*                    Z-ADD0         T1CAS3
|    C*                    Z-ADD0         T1QTY1
|    C*                    Z-ADD0         T1QTY2
|    C*                    Z-ADD0         T1QTY3
|    C*                    Z-ADD0         T1QTY4
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   SUBTOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
| 01-C           DCASE     IFEQ 0
|   C                     Z-ADD0         T2CAS1
|   C                     Z-ADD0         T2CAS2
|   C                     Z-ADD0         T2CAS3
| 01*C                     ELSE
|   C*總容積數／標準容積＝標準箱數之合計
|   C           W2CAS1    DIV  DCASE     T2CAS1    H
|   C           W2CAS2    DIV  DCASE     T2CAS2    H
|   C           W2CAS3    DIV  DCASE     T2CAS3    H
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
     C           WFTYPE    IFNE 'ESRM'
     C                     ELSE
|    C                     WRITEPT2
     C                     END
|    C                     Z-ADD0         W2CAS1
|    C                     Z-ADD0         W2CAS2
|    C                     Z-ADD0         W2CAS3
|    C                     Z-ADD0         T2CAS1
|    C                     Z-ADD0         T2CAS2
|    C                     Z-ADD0         T2CAS3
|    C                     Z-ADD0         T2QTY1
|    C                     Z-ADD0         T2QTY2
|    C                     Z-ADD0         T2QTY3
|    C                     Z-ADD0         T2QTY4
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT3   SUBTOTAL
      *==============================================================*
05===C           RTN400    BEGSR
|    C*
  01-C           DCASE     IFEQ 0
|   C                     Z-ADD0         T3CAS1
|   C                     Z-ADD0         T3CAS2
|   C                     Z-ADD0         T3CAS3
| 01*C                     ELSE
|   C*總容積數／標準容積＝標準箱數之合計
|   C           W3CAS1    DIV  DCASE     T3CAS1    H
|   C           W3CAS2    DIV  DCASE     T3CAS2    H
|   C           W3CAS3    DIV  DCASE     T3CAS3    H
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
|    C                     Z-ADD0         W3CAS1
|    C                     Z-ADD0         W3CAS2
|    C                     Z-ADD0         W3CAS3
|    C                     Z-ADD0         T3CAS1
|    C                     Z-ADD0         T3CAS2
|    C                     Z-ADD0         T3CAS3
|    C                     Z-ADD0         T3QTY1
|    C                     Z-ADD0         T3QTY2
|    C                     Z-ADD0         T3QTY3
|    C                     Z-ADD0         T3QTY4
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN500....WRITE PT4   SUBTOTAL
      *==============================================================*
05===C           RTN500    BEGSR
|    C*
  01-C           DCASE     IFEQ 0
|   C                     Z-ADD0         T4CAS1
|   C                     Z-ADD0         T4CAS2
|   C                     Z-ADD0         T4CAS3
| 01*C                     ELSE
|   C*總容積數／標準容積＝標準箱數之合計
|   C           W4CAS1    DIV  DCASE     T4CAS1    H
|   C           W4CAS2    DIV  DCASE     T4CAS2    H
|   C           W4CAS3    DIV  DCASE     T4CAS3    H
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT4
@@   C                     ADD  T4CAS1    T5CAS1
@@   C                     ADD  T4CAS2    T5CAS2
@@   C                     ADD  T4CAS3    T5CAS3
|    C                     Z-ADD0         W4CAS1
|    C                     Z-ADD0         W4CAS2
|    C                     Z-ADD0         W4CAS3
|    C                     Z-ADD0         T4CAS1
|    C                     Z-ADD0         T4CAS2
|    C                     Z-ADD0         T4CAS3
|    C                     Z-ADD0         T4QTY1
|    C                     Z-ADD0         T4QTY2
|    C                     Z-ADD0         T4QTY3
|    C                     Z-ADD0         T4QTY4
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN600....WRITE PT6   SUBTOTAL
      *==============================================================*
06===C           RTN600    BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     WRITEPE9
     C                     ELSE
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT5
|    C                     SETOF                     31
|    C                     Z-ADD0         W5CAS1
|    C                     Z-ADD0         W5CAS2
|    C                     Z-ADD0         W5CAS3
|    C                     Z-ADD0         T5CAS1
|    C                     Z-ADD0         T5CAS2
|    C                     Z-ADD0         T5CAS3
|    C                     Z-ADD0         T5QTY1
|    C                     Z-ADD0         T5QTY2
|    C                     Z-ADD0         T5QTY3
|    C                     Z-ADD0         T5QTY4
     C                     END
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     3029
|    C*                    SETOF                     21
      *
07===C                     ENDSR
