      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR053                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/04/25                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :應應系統                                     *
      * REMARK       :收款明細表                                   *
      ****************************************************************
     FSOSIPF  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FREWF76  O   E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*通路型態
     I                                      601 601 DSI03S
     I                                      602 602 DSI03E
     I                                      603 604 DSI04S
     I                                      605 606 DSI04E
     I*客戶代號
     I                                      613 621 CSI23S
     I                                      622 630 CSI23E
     I*(YY/MM/DD)
     I                                      650 6550YSI06S
     I                                      656 6610YSI06E
     I*公司
     I                                      674 675 DSI01S
     I                                      676 677 DSI01E
     I                                      678 678 DSEL
     I                                      690 695 DSI31S
     I                                      696 701 DSI31E
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           SI12
     C                     KFLD           SI13
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C  N10                EXSR RTN010
     C*JUDGE SALESMAN
     C           DSEL      IFEQ 'A'
     C                     EXSR RTN020
     C                     ELSE
     C                     EXSR RTN030
     C                     END
     C*
     C           WF7602    IFGE DSI31S
     C           WF7602    ANDLEDSI31E
     C                     EXSR RTN100
     C                     END
     C*
     CLR                   SETON                     LR
      *==============================================================*
      *          RTN010....INITIAL
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     10
|    C                     Z-ADD0         WF7608
|    C                     MOVEL*BLANK    WF7601
|    C                     MOVEL*BLANK    WF7602
|    C                     MOVEL*BLANK    WF7603
|    C                     MOVEL*BLANK    WF7604
B2000C                     MOVEL*BLANK    WF7605
B2000C                     MOVEL*BLANK    WF7606
|    C                     MOVEL*BLANK    WF7607
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN020....CURRENT SALESMAN
      *==============================================================*
01===C           RTN020    BEGSR
|    C*
|   C                     MOVEL*BLANKS   SI13
|   C           KEYME     CHAINME0                  42
| 02-C           *IN42     IFEQ '0'
|   C                     MOVELME15      WF7602
| 02*C                     ELSE
|   C                     MOVEL*BLANKS   WF7602
| 02-C                     END
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN030....ACTUAL  SALESMAN
      *==============================================================*
01===C           RTN030    BEGSR
|    C*
|   C                     MOVELSI31      WF7602
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....JUDGE SALEMAM
      *==============================================================*
02===C           RTN100    BEGSR
      *
|    C                     MOVELSI01      WF7601
|    C                     MOVELSI12      WF7603
|    C                     MOVELSI13      WF7604
B2000C                     MOVELSI29      WF7605
B2000C                     MOVELSI06      WF7606
|    C                     MOVELSI02      WF7607
|    C                     Z-ADDSI30      WF7608
|    C                     WRITEWF760
|    C*
02===C                     ENDSR
