      ****************************************************************
      * PROGRAM NAME : SOR071                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/04/17                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :普銷銷售系統                                 *
      * REMARK       :普銷訂單／送貨單明細表                       *
      ****************************************************************
     FSOR071D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*送貨日期(MM/DD/YY)
     I                                      621 6260DSC08S
     I                                      627 6320DSC08E
     I*(YY/MM/DD)
     I                                      640 6450DDATES
     I                                      646 6510DDATEE
     I*訂單日期(MM/DD/YY)
     I                                      601 6060DSC07S
     I                                      607 6120DSC07E
     I                                      613 613 IN20
     I*物流點
     I                                      652 656 DSC11S
     I                                      652 652 WSC11S
     I                                      657 661 DSC11E
     I                                      657 657 WSC11E
     I*增加辦事處的挑選
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I                                      673 673 COMP
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
      *
  02-C                     END
  01-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         DSC07S
|    C                     Z-ADD0         DSC07E
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC11S
|    C                     MOVE *BLANK    DSC11E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*送貨日期或確認日期只輸入一項
| 13-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 14-C           DSC07S    IFNE 0
|   C                     SETON                     668999
| 14-C                     END
| 15-C           DSC07E    IFNE 0
|   C                     SETON                     678999
| 15-C                     END
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 16-C           DSC08S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 17-C           P0901O    IFEQ 'N'
|   C                     SETON                     649399
| 17-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 18-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 18-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08S    S001I2  60
|   C           DDATES    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08E    S001I2  60
|   C           DDATEE    PARM           S001O1  60
|   C**
| 19-C           DDATES    IFGT DDATEE
|   C                     SETON                     6465
|   C                     SETON                     9299
| 19-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 16*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC07S    P0901I  60
|   C                     PARM           P0901O  1
| 20-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 20-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC07E    P0901I  60
|   C                     PARM           P0901O  1
| 21-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 21-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC07S    S001I2  60
|   C           DDATES    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC07E    S001I2  60
|   C           DDATEE    PARM           S001O1  60
|   C**
| 22-C           DDATES    IFGT DDATEE
|   C                     SETON                     6667
|   C                     SETON                     9299
| 22-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 16-C                     END
|    C*物流點
| 01-C           DSC11S    IFEQ *BLANK
|   C                     MOVEL'V0001'   DSC11S
| 01-C                     END
|    C*
| 02-C           DSC11E    IFEQ *BLANK
|   C                     MOVE 'V9999'   DSC11E
| 02-C                     END
|    C*
     C           WSC11S    IFNE 'V'
     C           WSC11E    ANDNE'V'
     C                     SETON                     6263
     C                     SETON                     91
  03-C                     END
     C*
|    C   99                GOTO END100
| 03-C           DSC11S    IFGT DSC11E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 03-C                     END
|    C   99                GOTO END100
|    C***********
|    C* CHK公司
|    C***********
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
|   C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE37
|   C           D#COL     ANDLE38
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
