      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR045                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/10                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售系統                                     *
      * REMARK       :待核准單據彙總表                             *
      ****************************************************************
     FSOR045D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*(MM/DD/YY)
     I                                      601 6060DDATES
     I                                      607 6120DDATEE
     I*(YY/MM/DD)
     I                                      640 6450YDATES
     I                                      646 6510YDATEE
     I                                      621 621 COMP
     I                                      625 625 DPATHS
     I                                      626 626 DPATHE
     I                                      671 671 COMPS
     I                                      672 672 COMPE
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*          *NAMVAR   DEFN *LDA      LDA
     C                     IN   LDA
     C                     MOVE *BLANK    COMP
     C                     MOVE *BLANK    COMPS
     C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DPATHS
|    C                     MOVE *BLANK    DPATHE
|    C                     Z-ADD0         DDATES
|    C                     Z-ADD0         DDATEE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
     C*********
     C*公司別
     C*********
     C*
     C           COMP      IFEQ *BLANK
     C                     MOVE *LOVAL    COMPS
     C                     MOVE *HIVAL    COMPE
     C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
     C                     END
     C*
|    C*
     C*******
     C*通路
     C*******
     C*
     C           DPATHS    IFEQ *BLANK
     C                     MOVE *LOVAL    DPATHS
     C                     END
     C*
     C           DPATHE    IFEQ *BLANK
     C                     MOVE *HIVAL    DPATHE
     C                     END
|    C*
| 05-C           DPATHS    IFGT DPATHE
|   C                     SETON                     6263
|   C                     SETON                     9399
| 05-C                     END
|    C   99                GOTO END100
     C*******
     C*日期
     C*******
|    C*
| 01-C           DDATES    IFEQ 0
M001DC*                    Z-ADD010101    DDATES
M001AC                     Z-ADD010192    DDATES
| 01-C                     END
|    C*
| 02-C           DDATEE    IFEQ 0
M001DC*                    Z-ADD123199    DDATEE
M001AC                     Z-ADD123129    DDATEE
| 02-C                     END
|    C*
|    C*(CHECK START DATE)
|    C                     CALL 'P09'
|    C                     PARM DDATES    P0901I  60
|    C                     PARM           P0911O  1
| 03-C           P0911O    IFEQ 'N'
|   C                     SETON                     649499
| 03-C                     END
|    C   99                GOTO END100
|    C*(CHECK END DATE)
|    C                     CALL 'P09'
|    C                     PARM DDATEE    P0901I  60
|    C                     PARM           P0911O  1
| 04-C           P0911O    IFEQ 'N'
|   C                     SETON                     659499
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHENK STRART <= END DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DDATES    S001I2  60
|    C           YDATES    PARM           S001OI  60
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DDATEE    S001I2  60
|    C           YDATEE    PARM           S001OI  60
M001AC                     MOVE YDATES    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
M001AC                     MOVE YDATEE    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          YDATES    IFGT YDATEE
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 05-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     IFEQ 39
|   C                     CALL 'WDS018'
|   C           DPATHS    PARM DPATHS    PPATH   1
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFEQ 50
|   C                     CALL 'WDS018'
|   C           DPATHE    PARM DPATHE    PPATH
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE39
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
