      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR085 1                                      *
      * AUTHER       :                                               *
      * CREATE DATE  : 82/02/18                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :月報表　                                     *
      * REMARK       :專櫃部門銷售金額報表                         *
      ****************************************************************
     FSOSTPF  IF  E           K        DISK
     FREWFC2  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYST     KLIST
     C                     KFLD           ST01
     C                     KFLD           ST14
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010
     C                     EXSR RTN100
     C                     SETON                     LR
      *==============================================================*
     C*          RTN010....INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C                     MOVEL*BLANKS   WFC201
|    C                     MOVEL*BLANKS   WFC202
|    C                     Z-ADD0         WFC203
|    C                     Z-ADD0         WFC204
01===C                     ENDSR
      *==============================================================*
     C*          RTN100....ST0
     C*==============================================================*
02===C           RTN100    BEGSR
|    C                     READ ST0                      45
| 01-C           *IN45     DOWEQ'0'
|   C*
|   C           KEYST     CHAINWFC20                47
| 02-C           *IN47     IFEQ '0'
     C                     EXSR RTN110
|   C                     ADD  WORK8     WFC203
|   C                     ADD  WORK9     WFC204
|   C                     UPDATWFC20
| 02*C                     ELSE
|   C                     MOVELST01      WFC201
|   C                     MOVELST14      WFC202
     C                     EXSR RTN110
|   C                     Z-ADDWORK8     WFC203
|   C                     Z-ADDWORK9     WFC204
| 03-C           WFC203    IFNE 0
|   C                     WRITEWFC20
| 03-C                     END
| 02-C                     END
|   C*
|   C                     READ ST0                      45
| 01-C                     END
|    C*
02===C                     ENDSR
     C*
      *==============================================================*
     C*          RTN110....AMOUNT
     C*==============================================================*
01===C           RTN110    BEGSR
     C*
|   C           ST06      MULT ST6$      WORK1   70
|   C           ST07      MULT ST7$      WORK2   70
|   C           ST08      MULT ST8$      WORK3   70
|   C           ST09      MULT ST9$      WORK4   70
|   C           ST10      MULT ST0$      WORK5   70
|   C           ST11      MULT ST1$      WORK6   70
|   C           WORK1     ADD  WORK2     WORK8   70
|   C                     ADD  WORK3     WORK8
|   C                     ADD  WORK4     WORK8
|   C                     ADD  WORK5     WORK8
|   C                     ADD  WORK6     WORK8
     C*
|   C           ST06      ADD  ST07      WORK9   70
|   C                     ADD  ST08      WORK9
|   C                     ADD  ST09      WORK9
|   C                     ADD  ST10      WORK9
|   C                     ADD  ST11      WORK9
     C*
01===C                     ENDSR
