      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0451                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/10                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售系統                                     *
      * REMARK       :待核准單據彙總表                             *
      ****************************************************************
     FSOSMLF01IF  E           K        DISK
     F                                              KINFDS SMRCDN
     FSOSDPF  IF  E           K        DISK
     FSOSFPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR045P O   E             39     PRINTER
     ISMRCDN      DS
     I                                     *RECORD  RCDN
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      128 1280$PRTID
     I*(MM/DD/YY)
     I                                      601 6060DDATES
     I                                      607 6120DDATEE
     I*(YY/MM/DD)
B2MODI*                                     640 6470YDATES
B2MODI*                                     648 6550YDATEE
M001AI                                      640 6450YDATES
M001AI                                      646 6510YDATEE
     I*
     I                                      621 621 COMP
     I                                      625 625 DPATHS
     I                                      626 626 DPATHE
B2MODI*                                     675 675 COMPS
B2MODI*                                     676 676 COMPE
M001AI                                      671 671 COMPS
M001AI                                      672 672 COMPE
     I*
     I*(YYYY/MM/DD)
     I                                      850 8570YMD8S
     I                                      858 8650YMD8E
     I            DS
     I                                        1   5 SM04
     I                                        1   1 SM041
     I                                        6   7 SM01
     I                                        7   7 SM011
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYSM     KLIST
     C                     KFLD           SM04
     C                     KFLD           SM05
      *==============================================================*
      *                    DEFN PDATEE  & PDATES
      *==============================================================*
     C           *LIKE     DEFN DDATEE    PDATEE
     C           *LIKE     DEFN DDATES    PDATES
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN100
     C                     READ SOSMLF01                 46
  01-C           *IN46     DOWEQ'0'
M001DC*          SM06      IFLE YDATEE
M001DC*          SM06      ANDGEYDATES
M001AC           SM06      IFLE YMD8E
M001AC           SM06      ANDGEYMD8S
    C           SM011     ANDGECOMPS
    C           SM011     ANDLECOMPE
    C           SM041     ANDGEDPATHS
    C           SM041     ANDLEDPATHE
    C   39                EXSR RTN900                     *OVRFLW
    C   10                WRITEPE3
    C                     EXSR RTN400                     該筆
    C                     EXSR RTN500                     明細
  02-C                     END
    C                     READ SOSMLF01                 46
  01-C                     END
     C  N11                WRITEPE9
     C                     WRITEPE2
     C*
     C                     SETON                         LR
      *==============================================================*
      *          RTN100....CHECK HEADING
      *==============================================================*
01===C           RTN100    BEGSR
|    C                     WRITEPH1
     C                     SETON                         10
01===C                     ENDSR
      *==============================================================*
      *          RTN300....DATA OF ONE
      *==============================================================*
02===C           RTN300    BEGSR
|    C*業務員名稱
|    C           SM16      CHAINMC0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MC02
| 01-C                     END
|    C*客戶簡稱
|    C           KEYSM     CHAINME0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    ME04
| 02-C                     END
|    C*日期轉換
M001AC                     Z-ADDSM06      DSM06   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SM06      S001I2  80
M001AC                     PARM DSM06     S001I2  60
|    C           PSM06     PARM           S001O1  60
02===C                     ENDSR
      *==============================================================*
      *          RTN400....CHECK RECORD NAME (ONE)
      *==============================================================*
03===C           RTN400    BEGSR
| 01-C           RCDN      IFEQ 'SC0'
|   C                     MOVE *BLANK    SM13
| 01*C                     ELSE
|   C                     MOVE *BLANK    SM12
| 01-C                     END
|    C                     EXSR RTN300
|    C                     WRITEPD1
    C                     SETON                     1011
03===C                     ENDSR
      *==============================================================*
      *          RTN500....CHECK RECORD NAME (DETAIL)
      *==============================================================*
04===C           RTN500    BEGSR
| 01-C           RCDN      IFEQ 'SC0'
|   C                     EXSR RTN600
| 01*C                     ELSE
|   C                     EXSR RTN700
| 01-C                     END
04===C                     ENDSR
      *==============================================================*
      *          RTN600....CHECK SD0 ------- (DETAIL)
      *==============================================================*
05===C           RTN600    BEGSR
|    C           SM02      SETLLSD0
|    C           SM02      READESD0                      47
| 01-C           *IN47     DOWEQ'0'
| 02-C           SD17      IFEQ '*'
|   C           SD18      OREQ '*'
|   C           SM09      OREQ '*'
|   C           SM10      OREQ '*'
|   C           SM12      OREQ '*'
|   C                     EXSR RTN10
| 02-C                     END
|   C           SM02      READESD0                      47
| 01-C                     END
05===C                     ENDSR
      *==============================================================*
      *          RTN700....CHECK SF0 ------- (DETAIL)
      *==============================================================*
06===C           RTN700    BEGSR
|    C           SM02      SETLLSF0
|    C           SM02      READESF0                      47
| 01-C           *IN47     DOWEQ'0'
| 02-C           SF17      IFEQ '*'
|   C           SF18      OREQ '*'
|   C           SM09      OREQ '*'
|   C           SM10      OREQ '*'
|   C           SM13      OREQ '*'
|   C                     EXSR RTN20
| 02-C                     END
|   C           SM02      READESF0                      47
| 01-C                     END
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     10
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTN10 ....MOVE FIELD TO SD0
      *==============================================================*
08===C           RTN10     BEGSR
|    C                     MOVE SD03      PSD03
|    C*產品名稱
|    C           PSD03     CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA03
|   C                     MOVE *BLANK    MA13
| 01-C                     END
|    C                     MOVE SD04      PSD04
|    C                     MOVE SD06      PSD06
|    C                     MOVE SD07      PSD07
|    C                     MOVE SD05      PSD05
|    C                     MOVE SD17      PSD17
|    C                     MOVE SD18      PSD18
|    C                     WRITEPD2
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN20 ....MOVE FIELD TO SF0
      *==============================================================*
09===C           RTN20     BEGSR
|    C                     MOVE SF03      PSD03
|    C*產品名稱
|    C           PSD03     CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MA03
|   C                     MOVE *BLANK    MA13
| 01-C                     END
|    C                     MOVE SF04      PSD04
|    C                     MOVE SF06      PSD06
|    C                     MOVE SF07      PSD07
|    C                     MOVE SF05      PSD05
|    C                     MOVE SF17      PSD17
|    C                     MOVE SF18      PSD18
|    C                     WRITEPD2
|    C*
09===C                     ENDSR
