      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR0802                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 12/31/18                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :專櫃銷售系統                                 *
      * REMARK       :專櫃結帳表                                   *
      ****************************************************************
     FREWFA1  IP  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR080P O   E             39     PRINTER
     E*: FUNCTION DATA :
     E                    WFA4       10  3 0
     E                    MFA4       10  3 0
     E                    WFA5       10 11 2
     E                    TOT5       10 11 2
     E                    T1T5       10 11 2
     E                    T2T5       10 11 2
     E                    T3T5       10 11 2
     IWFA10
     I                                              WFA106L2
     I                                              WFA101L2
     I                                              WFA102L2
     I                                              WFA103L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I                                      601 6040DST02
     I                                      601 6020DST02M
     I                                      603 6040DST02Y
     I*
     I                                      605 6080ST02E
     I                                      605 6060ST02EY
     I                                      607 6080ST02EM
     I*
     I                                      620 628 DST04S
     I                                      630 638 DST04E
     I            DS
     I                                        1  300WFA4
     I                                        1   30WFA41
     I                                        4   60WFA42
     I                                        7   90WFA43
     I                                       10  120WFA44
     I                                       13  150WFA45
     I                                       16  180WFA46
     I                                       19  210WFA47
     I                                       22  240WFA48
     I                                       25  270WFA49
     I                                       28  300WFA410
     I            DS
     I                                        1  300MFA4
     I                                        1   30MFA41
     I                                        4   60MFA42
     I                                        7   90MFA43
     I                                       10  120MFA44
     I                                       13  150MFA45
     I                                       16  180MFA46
     I                                       19  210MFA47
     I                                       22  240MFA48
     I                                       25  270MFA49
     I                                       28  300MFA410
     I            DS
     I                                        1 1102WFA5
     I                                        1  112WFA51
     I                                       12  222WFA52
     I                                       23  332WFA53
     I                                       34  442WFA54
     I                                       45  552WFA55
     I                                       56  662WFA56
     I                                       67  772WFA57
     I                                       78  882WFA58
     I                                       89  992WFA59
     I                                      100 1102WFA510
     I            DS
     I                                        1 1102TOT5
     I                                        1  112TOT51
     I                                       12  222TOT52
     I                                       23  332TOT53
     I                                       34  442TOT54
     I                                       45  552TOT55
     I                                       56  662TOT56
     I                                       67  772TOT57
     I                                       78  882TOT58
     I                                       89  992TOT59
     I                                      100 1102TOT510
     I            DS
     I                                        1 1102T1T5
     I                                        1  112T1T51
     I                                       12  222T1T52
     I                                       23  332T1T53
     I                                       34  442T1T54
     I                                       45  552T1T55
     I                                       56  662T1T56
     I                                       67  772T1T57
     I                                       78  882T1T58
     I                                       89  992T1T59
     I                                      100 1102T1T510
     I            DS
     I                                        1 1102T2T5
     I                                        1  112T2T51
     I                                       12  222T2T52
     I                                       23  332T2T53
     I                                       34  442T2T54
     I                                       45  552T2T55
     I                                       56  662T2T56
     I                                       67  772T2T57
     I                                       78  882T2T58
     I                                       89  992T2T59
     I                                      100 1102T2T510
     I            DS
     I                                        1 1102T3T5
     I                                        1  112T3T51
     I                                       12  222T3T52
     I                                       23  332T3T53
     I                                       34  442T3T54
     I                                       45  552T3T55
     I                                       56  662T3T56
     I                                       67  772T3T57
     I                                       78  882T3T58
     I                                       89  992T3T59
     I                                      100 1102T3T510
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         WFA4
|    C                     Z-ADD0         MFA4
|    C                     Z-ADD0         WFA5
|    C                     Z-ADD0         TOT5
|    C                     Z-ADD0         T1T5
|    C                     Z-ADD0         T2T5
|    C                     Z-ADD0         T3T5
|    C                     Z-ADD0         TOT11
|    C                     Z-ADD0         T1T11
|    C                     Z-ADD0         T2T11
|    C                     Z-ADD0         T3T11
|    C*
|    C                     Z-ADD0         I       20
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
| 01-C           I         IFLT 10
|   C                     ADD  1         I
|   C                     Z-ADDWFA104    WFA4,I
|   C                     ADD  WFA105    WFA5,I
|   C                     ADD  WFA105    TOT5,I
| 01-C                     END
|    C*
|    C                     ADD  WFA105    TOT01
|    C*
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PD1
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
| 01-C           *IN11     IFEQ '0'
| 02-C           *IN12     IFEQ '1'
|   C                     WRITEPE1
| 02-C                     END
|   C*專櫃名稱
|   C           WFA101    CHAINME0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   ME03
| 03-C                     END
|   C                     WRITEPH1
|   C                     SETON                     1112
| 01-C                     END
|    C*
|    C                     WRITEPD1
|    C*
|    C                     Z-ADD0         I
|    C                     ADD  TOT01     TOT11
|    C                     Z-ADD0         WFA5
|    C                     Z-ADD0         TOT01
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....跳頁
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     EXSR RTN310                     *HEADING
|    C                     WRITEPT1
|    C                     EXSR RTN010                     *HEADING
|    C                     SETOF                     11
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN310....計算抽成金額，淨付金額
      *==============================================================*
05===C           RTN310    BEGSR
|    C*
|    C                     Z-ADD0         J       20
| 01-C                     DO   10        J
|   C*
     C           WFA4,J    IFEQ 100
     C                     Z-ADD0         MF104   52
     C                     ELSE
|    C           WFA4,J    DIV  100       MF104   52
|    C           1         SUB  MF104     MF104
     C                     END
     C           100       SUB  WFA4,J    MFA4,J
     C*
     C           WFA4,J    IFEQ 0
     C                     Z-ADD0         MFA4,J
     C                     ELSE
     C           TOT5,J    DIV  1.05      T1T5,J
     C                     END
     C*
     C                     ADD  T1T5,J    T1T11
|   C           T1T5,J    MULT MF104     T2T5,J
|   C                     ADD  T2T5,J    T2T11
|   C           T1T5,J    SUB  T2T5,J    T3T5,J
|   C                     ADD  T3T5,J    T3T11
|   C*
| 01-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     3930
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN999
      *==============================================================*
07===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010                     *HEADING
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C                     WRITEPE2
|    C*
07===C                     ENDSR
