      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0732                                       *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 82/09/22                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品銷售分析週報表                           *
      ****************************************************************
     FSOSGPF  IP  E           K        DISK
     FSOSHPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
B2CHKFSOR087P O   E             39     PRINTER
B2INF *CVR3009 sev.30 PRINTER file SOR087P must be converted, because
B2INF *   field SG26 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert SOR087P, enlarging SG26
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*公司
     I                                      600 601 DSG01S
     I                                      602 603 DSG01E
     I*SELECT折讓日期
     I                                      604 6090DSG26S
     I                                      610 6150DSG26E
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     WRITEPH1                        *HEADING
    C                     SETON                     10
    C                     Z-ADD1         X       10
  01-C                     END
     C*
     C                     EXSR RTN100                     *READE DETAIL
     C   39                EXSR RTN900                     *OVERFLOW
     C*
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*          SG01      IFGE DSG01S                     SELET DATA +
B2OLDC*          SG01      ANDLEDSG01E                     (SOSGPF)
B2OLDC*          SG26      ANDGEDSG26S
B2OLDC*          SG26      ANDLEDSG26E
B2NEWC                     MOVE DSG26S    HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    H@8N01  80
B2NEWC                     MOVE DSG26E    HB2@F6  6
B2NEWC                     EXSR HB@68L                     + CENTURY 6->8 LEFT
B2NEWC                     MOVE HB2@T8    H@8N02  80
B2NEWC           SG01      IFGE DSG01S                     SELET DATA +
B2NEWC           SG01      ANDLEDSG01E                     (SOSGPF)
B2NEWC           SG26      ANDGEH@8N01
B2NEWC           SG26      ANDLEH@8N02
B2INF *CVR0001 sev.00 Field SG01 is not a date or year
B2INF *CVR0001 sev.00 Field DSG01S is not a date or year
B2INF *CVR0001 sev.00 Field DSG01E is not a date or year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|   C*
|   C           SG02      SETLLSH0                  41
|   C           SG02      READESH0                      44
| B3-C           *IN44     DOWEQ'0'
|   C*
     C           SH03      CHAINMA0                  40
| B4-C           SH06      IFNE 0
|   C           SH08      DIV  SH06      TEMP1   82
|   C           TEMP1     MULT SH06      PS01
|   C           SH08      SUB  PS01      PS02
|   C                     ADD  PS02      PS03    52
| B5-C           PS02      IFNE 0
|   C                     Z-ADDSG26      DSG26
|   C                     WRITEPD1
| E5-C                     ENDIF
|   C                     Z-ADD0         PS01
|   C                     Z-ADD0         PS02
| E4-C                     ENDIF
|   C*
|   C           SG02      READESH0                      44
| E3-C                     ENDDO
| E2-C                     ENDIF
01===C                     ENDSR
      *==============================================================*
      *          RTNLR  ...WRITE PT3   SUBTOTAL
      *==============================================================*
02===C           RTNLR     BEGSR
|   C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01*C                     ELSE
|   C                     WRITEPE2
| 01-C                     END
|   C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
      *
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
      *
03===C                     ENDSR
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2NEWC/COPY HBP2CVTR
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
