      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR051                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :通路產品銷售彙總表                           *
      ****************************************************************
     FSOR051D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I                                      601 601 COMPS
     I                                      602 602 COMPE
     I                                      603 603 DSC33S
     I                                      604 604 DSC33E
     I                                      605 606 DSC31S
     I                                      607 608 DSC31E
     I*(MM/DD/YY)
     I                                      621 6260DSC39S
     I                                      627 6320DSC39E
     I*(YY/MM/DD)
     I                                      640 6450YSC39S
     I                                      646 6510YSC39E
     I                                      660 668 DSD03S
     I                                      669 677 DSD03E
     I                                      680 681 DSC34S
     I                                      682 683 DSC34E
     I                                      684 687 DSC28S
     I                                      688 691 DSC28E
     I*
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      713 721 DSC45S
     I                                      722 730 DSC45E
     I                                      750 750 IN20
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC31S
|    C                     MOVE *BLANK    DSC31E
|    C                     MOVE *BLANK    DSC45S
|    C                     MOVE *BLANK    DSC45E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC28S
|    C                     MOVE *BLANK    DSC28E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         YSC39S
|    C                     Z-ADD0         YSC39E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C*通路代號
| 02-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 02-C                     END
|    C*
| 03-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 03-C                     END
|    C*
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6162
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*型態代號
| 05-C           DSC34S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC34S
| 05-C                     END
|    C*
| 06-C           DSC34E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC34E
| 06-C                     END
|    C*
| 07-C           DSC34S    IFGT DSC34E
|   C                     SETON                     7071
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*業務組別
| 08-C           DSC28S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC28S
| 08-C                     END
|    C*
| 09-C           DSC28E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC28E
| 09-C                     END
|    C*
| 10-C           DSC28S    IFGT DSC28E
|   C                     SETON                     7273
|   C                     SETON                     9299
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C*地區代號
| 11-C           DSC31S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC31S
| 11-C                     END
|    C*
| 12-C           DSC31E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC31E
| 12-C                     END
|    C*
| 13-C           DSC31S    IFGT DSC31E
|   C                     SETON                     6364
|   C                     SETON                     9299
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶代號
| 14-C           DSC45S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC45S
| 14-C                     END
|    C*
| 15-C           DSC45E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC45E
| 15-C                     END
|    C*
| 16-C           DSC45S    IFGT DSC45E
|   C                     SETON                     7475
|   C                     SETON                     9299
| 16-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 14-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 14-C                     END
|    C*
| 15-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 15-C                     END
|    C*
| 16-C           DSD03S    IFGT DSD03E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 16-C                     END
|    C   99                GOTO END100
|    C*
|    C*送貨日期或確認日期只輸入一項
| 17-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 18-C           DSC39S    IFNE 0
|   C                     SETON                     678999
| 18-C                     END
| 19-C           DSC39E    IFNE 0
|   C                     SETON                     688999
| 19-C                     END
| 17-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHK銷售日期
| 20-C           DSC08S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 21-C           P0901O    IFEQ 'N'
|   C                     SETON                     659399
| 21-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 22-C           P0901O    IFEQ 'N'
|   C                     SETON                     669399
| 22-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08S    S001I2  60
|   C           YSC39S    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08E    S001I2  60
|   C           YSC39E    PARM           S001O1  60
|   C**
| 23-C           YSC39S    IFGT YSC39E
|   C                     SETON                     6566
|   C                     SETON                     9299
| 23-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 20*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 24-C           P0901O    IFEQ 'N'
|   C                     SETON                     679399
| 24-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 25-C           P0901O    IFEQ 'N'
|   C                     SETON                     689399
| 25-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           YSC39S    PARM           S001O1  60
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           YSC39E    PARM           S001O1  60
|   C**
| 26-C           YSC39S    IFGT YSC39E
|   C                     SETON                     6768
|   C                     SETON                     9299
| 26-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 20-C                     END
|    C*
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*通路
| 05-C           D#ROW     IFEQ 6
| 06-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFEQ 50
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
     C*型態
| 08-C           D#ROW     IFEQ 7
| 09-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33S  1
|   C                     PARM           DSC34S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 50
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33E  1
|   C                     PARM           DSC34E
|   C                     GOTO ENDF4
| 10-C                     END
| 08-C                     END
|   C*業務組別
| 11-C           D#ROW     IFEQ 8
| 12-C           D#COL     IFGE 38
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28S
|   C                     GOTO ENDF4
| 12-C                     END
|   C*
| 13-C           D#COL     IFGE 50
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28E
|   C                     GOTO ENDF4
| 13-C                     END
|   C*
| 11-C                     END
|   C*地區
| 02-C           D#ROW     IFEQ 9
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 50
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*客戶代號
| 14-C           D#ROW     IFEQ 10
| 15-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45S
|   C                     GOTO ENDF4
| 15-C                     END
|   C*
| 16-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45E
|   C                     GOTO ENDF4
| 16-C                     END
|   C*
| 14-C                     END
|   C*產品代號
| 14-C           D#ROW     IFEQ 11
| 15-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 15-C                     END
|   C*
| 16-C           D#COL     IFGE 50
|   C           D#COL     ANDLE58
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 16-C                     END
|   C*
| 14-C                     END
|   C*
| 17-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 17-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
