     A****************************************************************
     A*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : SOR0411                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/02/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :繷皑蹲狥                                *
     A*    SUBSYSTEM    :綪扳璹虫╰参                              *
     A*    PROCEDURE    :                                            *
     A*    REMARK       :め玻珇厨基                            *
     A*                                                              *
      *==============================================================*
      * MODI CODE | AUTHOR |  DATE  | DESCRIPTION
      *--------------------------------------------------------------
      *  M002     |MICHELLE|01.12.31|ネら讽Θ礟基耞ら
      *--------------------------------------------------------------
     A****************************************************************
     FREWF04  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMDPF  IF  E           K        DISK
     FSOSBPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FREWF03  IF  E           K        DISK
     I*
     I           UDS
     I                                      101 110 $USER
B2MODI*                                     119 1300$EGMDY
     I                                      119 1240$EGMDY
B2MODI*                                     168 1680$EVR
     I                                      162 1620$EVR
B2MODI*                                     131 1330$CPY
     I                                      125 1270$CPY
B2MODI*                                     604 6050$PRTID
     I                                      598 5990$PRTID
B2MODI*                                     607 607 DMD07S
B2MODI*                                     608 608 DMD07E
B2MODI*                                     609 610 DMD08S
B2MODI*                                     611 612 DMD08E
B2MODI*                                     613 617 DMD01S
B2MODI*                                     618 622 DMD01E
     I                                      601 601 DMD07S
     I                                      602 602 DMD07E
     I                                      603 604 DMD08S
     I                                      605 606 DMD08E
     I                                      607 611 DMD01S
     I                                      612 616 DMD01E
B2MODI                                      617 6220DATES
B2MODI                                      623 6280DATEE
     I            DS
     I                                        1   9 SA01
     I                                        1   4 SA01L
     I                                        5   9 SA01R
     I            DS
     I                                        1   9 SB02
     I                                        1   4 SB02L
     I                                        5   9 SB02R
     I            DS
     I                                        1   9 MA01
     I                                        1   4 MA01L
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C*          *LIKE     DEFN WF0405    WF01
     C*          *LIKE     DEFN WF0409    WF02                         OM
     C           *LIKE     DEFN SA01      KSA01                        OM
     C           *LIKE     DEFN SB02      KSB02                        OM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSB     KLIST
     C                     KFLD           MD01
     C           KWF040    KLIST
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           MD01
     C                     KFLD           SB02
     C           KEYMAB    KLIST
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           MD01
     C                     KFLD           MA01
     C           KEYWF3    KLIST
     C                     KFLD           MD07
     C                     KFLD           MD08
     C           KEYWF4    KLIST
     C                     KFLD           SA02
     C                     KFLD           SA03
     C                     KFLD           MD01
     C                     KFLD           SA01
     C           KEYMAA    KLIST
     C                     KFLD           SA02
     C                     KFLD           SA03
     C                     KFLD           MD01
     C                     KFLD           MA01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
M001DC*                    PARM $EGMDY    S001I2  80
M001DC*                    PARM           S001O1  80
M001AC                     PARM $EGMDY    S001I2  60
M001AC                     PARM           S001O1  60
|   C*
     C                     READ MD0                      46*READ DATA  AGE
     C*
  01-C           *IN46     DOWEQ'0'
    C*
    C                     EXSR RTN200                     *DATA->FILE
    C                     EXSR RTN100                     *DATA->FILE
    C                     MOVEA*ALL'0'   *IN,60
    C                     READ MD0                      46*READ DATA  AGE
    C*
  01-C                     END
     C*
     C                     SETON                     LR
      *=========================================================*
      *          RTN100....DATA(SOSBPF) TO WORKFILE
      *=========================================================*
01===C           RTN100    BEGSR
|    C*
|    C           KEYSB     SETLLSB0
|    C           KEYSB     READESB0                      44
| 02-C           *IN44     DOWEQ'0'
|   C*玻珇玡絏
| 03-C           SB02R     IFEQ *BLANKS
|   C                     EXSR RTN110
| 03*C                     ELSE
|   C*
|   C           KWF040    CHAINWF040                40
|   C   40                EXSR RTN150                     *INITIAL
|   C                     EXSR RTN120                     *WRITE->FILE
| 03-C                     END
|   C*
|   C           KEYSB     READESB0                      44
| 02-C                     END
|    C*
01===C                     ENDSR
      *=========================================================*
      *          RTN110....DATA(SOSBPF) TO WORKFILE
      *=========================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVELSB02L     KSB02
|    C           KSB02     SETLLMA0
|    C                     READ MA0                      41
| 01-C           *IN41     DOWEQ'0'
|   C           SB02L     ANDEQMA01L
      *
|   C           KEYMAB    CHAINWF040                40
|   C   40                EXSR RTN150                     *INITIAL
|   C**タ盽чΙ
| 02-C           SB04      IFEQ 'N'
|   C                     Z-ADDSB06      WF0405
B2000C                     Z-ADDSB05      WF0407
B2000C                     Z-ADDSB13      WF0408
|   C* GETчΙ基タ盽
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           1         SUB  WF0405    WF01    54
|   C           MA41      MULT WF01      WF0406    H
| 03*C                     ELSE
|   C           1         SUB  WF0405    WF01
|   C           MA46      MULT WF01      WF0406    H
| 03-C                     END
|   C* GETчΙ基疭
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02    54
|   C           MA41      MULT WF02      WF0410    H
| 04*C                     ELSE
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0410    H
| 04-C                     END
|   C*
| 02-C                     END
|   C* GETчΙ基疭
| 05-C           SB04      IFEQ 'S'
|   C**疭чΙ
|   C                     Z-ADDSB06      WF0409
B2000C                     Z-ADDSB05      WF0411
B2000C                     Z-ADDSB13      WF0412
|   C* GETчΙ基
|   C*
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA41      MULT WF02      WF0410    H
| 06*C                     ELSE
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0410    H
| 06-C                     END
|   C*
| 05-C                     END
|   C**穎秘
| 07-C           SB04      IFEQ 'A'
|   C                     Z-ADDSB07      WF0413
|   C                     Z-ADDSB08      WF0414
|   C                     Z-ADDSB09      WF0415
|   C                     Z-ADDSB10      WF0416
|   C                     Z-ADDSB11      WF0417
|   C                     Z-ADDSB12      WF0418
B2000C                     Z-ADDSB05      WF0419
B2000C                     Z-ADDSB13      WF0420
| 07-C                     END
      *
| 08-C           *IN40     IFEQ '1'
|   C                     MOVELMD07      WF0401
|   C                     MOVELMD08      WF0402
|   C                     MOVELMD01      WF0403
|   C                     MOVELMA01      WF0404
|   C                     WRITEWF040
| 08*C                     ELSE
|   C                     UPDATWF040
| 08-C                     END
      *
|   C                     READ MA0                      41
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN120....UPDAT DATA TO WORKFILE
      *==============================================================*
03===CSR         RTN120    BEGSR
|    C           SB02      CHAINMA0                  41
|    C**タ盽чΙ
| 01-C           SB04      IFEQ 'N'
|   C                     Z-ADDSB06      WF0405
B2000C                     Z-ADDSB05      WF0407
B2000C                     Z-ADDSB13      WF0408
|   C* GETчΙ基タ盽
|   C*
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           1         SUB  WF0405    WF01
|   C           MA41      MULT WF01      WF0406    H
| 02*C                     ELSE
|   C           1         SUB  WF0405    WF01
|   C           MA46      MULT WF01      WF0406    H
| 02-C                     END
|   C* GETчΙ基疭
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA41      MULT WF02      WF0410    H
| 03*C                     ELSE
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0410    H
| 03-C                     END
| 01-C                     END
|    C* GETчΙ基疭
| 04-C           SB04      IFEQ 'S'
|   C**疭чΙ
|   C                     Z-ADDSB06      WF0409
B2000C                     Z-ADDSB05      WF0411
B2000C                     Z-ADDSB13      WF0412
|   C*
|   C* GETчΙ基
|   C*
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA41      MULT WF02      WF0410    H
| 05*C                     ELSE
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0410    H
| 05-C                     END
|   C*
| 04-C                     END
|    C**穎秘
| 06-C           SB04      IFEQ 'A'
|   C                     Z-ADDSB07      WF0413
|   C                     Z-ADDSB08      WF0414
|   C                     Z-ADDSB09      WF0415
|   C                     Z-ADDSB10      WF0416
|   C                     Z-ADDSB11      WF0417
|   C                     Z-ADDSB12      WF0418
B2000C                     Z-ADDSB05      WF0419
B2000C                     Z-ADDSB13      WF0420
| 06-C                     END
      *
| 07-C           *IN40     IFEQ '1'
|   C                     MOVELMD07      WF0401
|   C                     MOVELMD08      WF0402
|   C                     MOVELMD01      WF0403
|   C                     MOVELSB02      WF0404
|   C                     WRITEWF040
| 07*C                     ELSE
|   C                     UPDATWF040
| 07-C                     END
|    C*
|    C*
03===CSR                   ENDSR
      *=========================================================*
      *          RTN150....INITIAL                              *
      *=========================================================*
04===C           RTN150    BEGSR
|    C*
|    C                     MOVE *BLANKS   WF0401
|    C                     MOVE *BLANKS   WF0402
|    C                     MOVE *BLANKS   WF0403
|    C                     MOVE *BLANKS   WF0404
|    C**タ盽чΙ
|    C                     Z-ADD0         WF0405
|    C                     Z-ADD0         WF0406
|    C                     Z-ADD0         WF0407
|    C                     Z-ADD0         WF0408
|    C**疭чΙ
|    C                     Z-ADD0         WF0409
|    C                     Z-ADD0         WF0410
|    C                     Z-ADD0         WF0411
|    C                     Z-ADD0         WF0412
|    C**穎秘
|    C                     Z-ADD0         WF0413
|    C                     Z-ADD0         WF0414
|    C                     Z-ADD0         WF0415
|    C                     Z-ADD0         WF0416
|    C                     Z-ADD0         WF0417
|    C                     Z-ADD0         WF0418
|    C                     Z-ADD0         WF0419
|    C                     Z-ADD0         WF0420
|    C*
04===C                     ENDSR
      *=========================================================*
      *          RTN200 .. DATA(REWF03) TO WORKFILE
      *=========================================================*
05===C           RTN200    BEGSR
|    C*
|    C           KEYWF3    SETLLSA0
|    C           KEYWF3    READESA0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*玻珇玡絏
| 02-C           SA01R     IFEQ *BLANKS
|   C                     EXSR RTN210
| 02*C                     ELSE
|   C*
|   C           KEYWF4    CHAINWF040                40
|   C   40                EXSR RTN150                     *INITIAL
|   C                     EXSR RTN220                     *WRITE->FILE
| 02-C                     END
|   C*
|   C           KEYWF3    READESA0                      44
| 01-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN210....硄隔玻珇醚
      *==============================================================*
06===CSR         RTN210    BEGSR
|    C*
|    C                     MOVELSA01L     KSA01
|    C           KSA01     SETLLMA0
|    C                     READ MA0                      41
| 01-C           *IN41     DOWEQ'0'
|   C           SA01L     ANDEQMA01L
      *
|   C           KEYMAA    CHAINWF040                40
|   C   40                EXSR RTN150                     *INITIAL
|   C**タ盽чΙ
| 02-C           SA04      IFEQ 'N'
|   C                     Z-ADDSA06      WF0405
B2000C                     Z-ADDSA05      WF0407
B2000C                     Z-ADDSA13      WF0408
|   C* GETчΙ基タ盽
|   C*
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           1         SUB  WF0405    WF01
|   C           MA41      MULT WF01      WF0406    H
| 03*C                     ELSE
|   C           1         SUB  WF0405    WF01
|   C           MA46      MULT WF01      WF0406    H
| 03-C                     END
|   C* GETчΙ基疭
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA41      MULT WF02      WF0410    H
| 04*C                     ELSE
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0410    H
| 04-C                     END
| 02-C                     END
|   C* GETчΙ基疭
| 05-C           SA04      IFEQ 'S'
|   C**疭чΙ
|   C                     Z-ADDSA06      WF0409
B2000C                     Z-ADDSA05      WF0411
B2000C                     Z-ADDSA13      WF0412
|   C*
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA41      MULT WF02      WF0410    H
| 06*C                     ELSE
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0410    H
| 06-C                     END
|   C*
|   C* GETчΙ基
|   C*
| 05-C                     END
|   C**穎秘
| 07-C           SA04      IFEQ 'A'
|   C                     Z-ADDSA07      WF0413
|   C                     Z-ADDSA08      WF0414
|   C                     Z-ADDSA09      WF0415
|   C                     Z-ADDSA10      WF0416
|   C                     Z-ADDSA11      WF0417
|   C                     Z-ADDSA12      WF0418
B2000C                     Z-ADDSA05      WF0419
B2000C                     Z-ADDSA13      WF0420
| 07-C                     END
      *
| 08-C           *IN40     IFEQ '1'
|   C                     MOVELSA02      WF0401
|   C                     MOVELSA03      WF0402
|   C                     MOVELMD01      WF0403
|   C                     MOVELMA01      WF0404
|   C                     WRITEWF040
| 08*C                     ELSE
|   C                     UPDATWF040
| 08-C                     END
      *
|   C                     READ MA0                      41
| 01-C                     END
|    C*
06===CSR                   ENDSR
      *==============================================================*
      *          RTN220....UPDAT DATA TO WORKFILE
      *==============================================================*
07===CSR         RTN220    BEGSR
|    C           SA01      CHAINMA0                  41
|    C**タ盽чΙ
| 01-C           SA04      IFEQ 'N'
|   C                     Z-ADDSA06      WF0405
B2000C                     Z-ADDSA05      WF0407
B2000C                     Z-ADDSA13      WF0408
|   C* GETчΙ基タ盽
|   C*
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           1         SUB  WF0405    WF01
|   C           MA41      MULT WF01      WF0406    H
| 02*C                     ELSE
|   C           1         SUB  WF0405    WF01
|   C           MA46      MULT WF01      WF0406    H
| 02-C                     END
|   C* GETчΙ基疭
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA41      MULT WF02      WF0410    H
| 03*C                     ELSE
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0410    H
| 03-C                     END
|   C*
| 01-C                     END
|    C* GETчΙ基疭
| 04-C           SA04      IFEQ 'S'
|   C*
|   C**疭чΙ
|   C                     Z-ADDSA06      WF0409
B2000C                     Z-ADDSA05      WF0411
B2000C                     Z-ADDSA13      WF0412
|   C* GETчΙ基
|   C*
M001AC                     MOVE S001O1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8    80
M001DC*          S001O1    IFLT MA39
M002AC           YMD8      IFLE SB05
M002AC                     Z-ADDSB05      WYMD8   80
M002AC                     ELSE
M002AC                     Z-ADDYMD8      WYMD8
M002AC                     END
      *
M001AC*M002M     YMD8      IFLT MA39
M002MC           WYMD8     IFLT MA39
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA41      MULT WF02      WF0410    H
| 05*C                     ELSE
|   C           WF0405    ADD  WF0409    WF01
|   C           1         SUB  WF01      WF02
|   C           MA46      MULT WF02      WF0410    H
| 05-C                     END
|   C*
| 04-C                     END
|    C**穎秘
| 06-C           SA04      IFEQ 'A'
|   C                     Z-ADDSA07      WF0413
|   C                     Z-ADDSA08      WF0414
|   C                     Z-ADDSA09      WF0415
|   C                     Z-ADDSA10      WF0416
|   C                     Z-ADDSA11      WF0417
|   C                     Z-ADDSA12      WF0418
B2000C                     Z-ADDSA05      WF0419
B2000C                     Z-ADDSA13      WF0420
| 06-C                     END
      *
| 07-C           *IN40     IFEQ '1'
|   C                     MOVELSA02      WF0401
|   C                     MOVELSA03      WF0402
|   C                     MOVELMD01      WF0403
|   C                     MOVELSA01      WF0404
|   C                     WRITEWF040
| 07*C                     ELSE
|   C                     UPDATWF040
| 07-C                     END
|    C*
|    C*
07===CSR                   ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
08===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
09===C           ERRSR     BEGSR
|    C*
|    C*                    CALL 'P50'
|    C*          DMSG      PARM           P5001O 78
|    C*                    SETON                     8099
|    C*
09===C*                    ENDSR'*DETC'
*ERR*C                     ENDSR
     C/COPY HBP2CVTR
