      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0481                                       *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/15                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :預定送貨明細表                               *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.14  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     FREWF31  IP  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FSOR048P O   E             39     PRINTER
     IWF310
     I                                              WF3108L4
     I                                              WF3101L3
     I                                              WF3103L2
     I                                              WF3104L2
     I                                              WF3102L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*(MM/DD/YY)
     I                                      621 6260DSC08S
     I                                      627 6320DSC08E
     I*(YY/MM/DD)
     I                                      640 6450YSC08S
     I                                      646 6510YSC08E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           WF3103
     C                     KFLD           WF3104
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *IN10     IFEQ '0'
     C                     EXSR RTN010
|    C                     SETON                         10
     C                     ELSE
     C           *INL4     IFEQ '1'
     C                     SETOF                     29
     C                     WRITEPE1
     C                     EXSR RTN010
     C                     END
     C                     END
     C*
     C*
     C                     EXSR RTN100                     *SALSE
     C*
     CL1 10                SETOF                     32
     CL2 10                SETOF                     31
     CL3 10                EXSR RTN200
     CL4 10                EXSR RTN300
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
     C           WF3108    CHAINMC0                  40
     C           *IN40     IFEQ '1'
     C                     MOVEL*BLANKS   MC02
     C                     END
     C                     WRITEPH1
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....JUDGE SALSES  NUMBER
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
M001AC                     Z-ADDWF3101    W6      60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM WF3101    S001I2  80
M001MC                     PARM W6        S001I2  60
|    C           PWF311    PARM           S001O1  60
|    C*
| 01-C           KEYME     CHAINME0                  40
     C           *IN40     IFEQ '1'
     C                     MOVEL*BLANKS   ME04
     C                     END
      *
|   C           WF3105    CHAINMA0                  40
     C           *IN40     IFEQ '1'
     C                     MOVEL*BLANKS   MA03
     C                     MOVEL*BLANKS   MA13
     C                     END
     C                     Z-ADDWF3106    QTY1
     C                     ADD  WF3107    QTY1
     C   39                EXSR RTN900                     *OVRFLW-THE SAME SALE
     C                     WRITEPD1
     C                     SETON                     303132
     C                     SETOF                     29
     C                     ADD  QTY1      T1QTY1
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....READE DETAIL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
     C                     WRITEPT1
     C                     ADD  T1QTY1    T2QTY1
     C                     Z-ADD0         T1QTY1
|    C*
     C                     SETOF                     30
|    C                     SETON                     29
03===C                     ENDSR
      *==============================================================*
      *          RTN300....READE DETAIL
      *==============================================================*
03===C           RTN300    BEGSR
|    C*
     C                     WRITEPT2
     C                     ADD  T2QTY1    T3QTY1
     C                     Z-ADD0         T2QTY1
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW --同一業務員
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
     C                     SETOF                     39
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTNLR ....END
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|    C                     WRITEPH1
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPT3
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
