      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : IMR082                                        *
      * AUTHER       : SAM                                           *
      * CREATE DATE  : 85/07/22                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :                                               *
      ****************************************************************
     FSOR087D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     E                    ARE         6  4 0
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*公司
     I                                      600 601 DSG01S
     I                                      602 603 DSG01E
     I*SELECT折讓日期
     I                                      604 6090DSG26S
     I                                      610 6150DSG26E
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     IAS          DS
     I                                      701 7040YYMM
     I                                      701 7020YY
     I                                      703 7040MM
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
| 04-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 04-C                     END
|    C                     MOVE *BLANK    DSG01S
|    C                     MOVE *BLANK    DSG01E
|    C                     MOVE *BLANK    DSG26S
|    C                     MOVE *BLANK    DSG26E
|    C                     MOVEL'SOR087'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*起始公司
| 01-C           DSG01S    IFEQ *BLANK
|   C           DSG01S    ORLT 'R1'
|   C                     MOVEL'R1'      DSG01S
|   C                     ENDIF
| 02-C           DSG01S    IFGT 'W3'
|   C                     SETON                     6199
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     ENDIF
|   C*
| 03-C           DSG01E    IFEQ *BLANK
|   C           DSG01E    ORGT 'W9'
|   C                     MOVEL'W3'      DSG01E
| 03*C                     ELSE
| 04-C           DSG01E    IFLT 'R '
|   C                     SETON                     6199
|   C                     MOVEL'UPT2010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     ENDIF
| 04-C                     END
|   C   99                GOTO END100
|   C*
| 05-C           DSG01S    IFGT DSG01E
|   C                     SETON                     616299
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 05-C                     END
|   C   99                GOTO END100
|   C*
|   C*折讓日期 '
| 06-C           DSG26S    IFEQ 0
|   C                     SETON                     6299
|   C                     MOVEL'UPT1001' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     ENDIF
|   C*
| 07-C           DSG26E    IFEQ 0
|   C                     SETON                     6399
|   C                     MOVEL'UPT1001' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     ENDIF
|   C   99                GOTO END100
|   C*
M001AC                     MOVE DSG26S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
M001AC                     MOVE DSG26E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
M001DC*          DSG26S    IFGT DSG26E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     626399
|   C                     MOVEL'UPT1011' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 08-C                     END
|   C   99                GOTO END100
|   C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|   C*
|   C                     SETON                     99
|   C********************
|   C*  GET ROW,COL     *
|   C********************
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
|   C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C**
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C*
| 01-C                     END
|   C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|   C*
|   C                     OUT  *NAMVAR
|   C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
