      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR046                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/02/21                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :核准簽章明細表                               *
      ****************************************************************
     FSOR046D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
     I                                      603 604 DSC31S
     I                                      605 606 DSC31E
     I                                      607 607 DSCR01
     I                                      608 608 DSCR02
     I                                      609 609 DSCR03
     I                                      610 610 DSCR04
     I                                      615 615 DSCR05
     I                                      611 611 COMP
     I                                      621 6260DSC08T
     I                                      627 6320YMDS
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I*普銷否
     I                                      673 673 DSEL
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANKS   COMP
|    C                     MOVE *BLANKS   COMPS
|    C                     MOVE *BLANKS   COMPE
|    C                     MOVE *BLANKS   DSEL
|    C                     MOVE *BLANKS   DSC33S
|    C                     MOVE *BLANKS   DSC33E
|    C                     MOVE *BLANKS   DSC31S
|    C                     MOVE *BLANKS   DSC31E
|    C                     MOVE *BLANKS   DSCR01
|    C                     MOVE *BLANKS   DSCR02
|    C                     MOVE *BLANKS   DSCR03
|    C                     MOVE *BLANKS   DSCR04
|    C                     MOVE *BLANKS   DSCR05
|    C                     Z-ADD0         DSC08T
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
|   C*
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK通路
| 02-C           DSC33S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC33S
| 02-C                     END
|    C*
| 03-C           DSC33E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC33E
| 03-C                     END
|    C*
| 04-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C* CHK地區
| 05-C           DSC31S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC31S
| 05-C                     END
|    C*
| 06-C           DSC31E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC31E
| 06-C                     END
|    C*
| 07-C           DSC31S    IFGT DSC31E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK START DATE)-送貨日期
|    C                     CALL 'P09'
|    C                     PARM DSC08T    P0901I  60
|    C                     PARM           P0911O  1
| 08-C           P0911O    IFEQ 'N'
|   C                     SETON                     689499
| 08-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHENK STRART <= END DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSC08T    S001I2  60
|    C           YMDS      PARM           S001OI  60
|    C*
| 09-C           DSEL      IFEQ *BLANKS
|   C                     SETON                     69
|   C                     SETON                     9599
|   C   99                GOTO END100
| 09-C                     END
|    C*
| 10-C           DSCR01    IFEQ *BLANKS
|   C           DSCR02    ANDEQ*BLANKS
|   C           DSCR03    ANDEQ*BLANKS
|   C           DSCR04    ANDEQ*BLANKS
|   C           DSCR05    ANDEQ*BLANKS
|   C                     SETON                     6465
|   C                     SETON                     6667
|   C                     SETON                     68
|   C                     SETON                     9599
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C           DSC33S    PARM DSC33S    SSC33S  1
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 43
|   C                     CALL 'WDS018'
|   C           DSC33E    PARM DSC33E    SSC33E  1
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 8
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS007'
|   C           DSC31S    PARM DSC31S    SSC31S  2
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 43
|   C           D#COL     ANDLE44
|   C                     CALL 'WDS007'
|   C           DSC31E    PARM DSC31E    SSC31E  2
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*
| 08-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 08-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
