      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR042                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/02/11                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :產品客戶報價表                               *
      ****************************************************************
     FSOR042D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 609 DMA01S
     I                                      610 618 DMA01E
     I                                      621 621 DMD07S
     I                                      622 622 DMD07E
     I                                      623 624 DMD08S
     I                                      625 626 DMD08E
     I                                      627 628 DME07S
     I                                      629 630 DME07E
     I                                      633 6380CDATE
     I                                      640 6450DATE
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
     I*
      *產品組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DMA01S
|    C                     MOVE *BLANK    DMA01E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     Z-ADD$EGMDY    DATE
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
     C*
|    C* CHK 通路代號
| 01-C           DMD07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMD07S
| 01-C                     END
|    C*
| 02-C           DMD07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMD07E
| 02-C                     END
|    C*
| 03-C           DMD07S    IFGT DMD07E
|   C                     SETON                     6263
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
     C*
|    C* CHK 型態代號
| 01-C           DMD08S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMD08S
| 01-C                     END
|    C*
| 02-C           DMD08E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMD08E
| 02-C                     END
|    C*
| 03-C           DMD08S    IFGT DMD08E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
     C*
|    C* CHK 地區代號
| 01-C           DME07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DME07S
| 01-C                     END
|    C*
| 02-C           DME07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DME07E
| 02-C                     END
|    C*
     C*
|    C* CHK組別
| 01-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
     C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 01-C                     END
|    C* CHK 產品代號
| 01-C           DMA01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA01S
| 01-C                     END
|    C*
| 02-C           DMA01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMA01E
| 02-C                     END
|    C*
| 03-C           DMA01S    IFGT DMA01E
|   C                     SETON                     6061
|   C                     SETON                     9399
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C* CHG 日期
|    C                     CALL 'P09'
|    C                     PARM DATE      P0901I  60
|    C                     PARM           P0901O  1
| 13-C           P0901O    IFEQ 'N'
|   C                     SETON                     689499
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATE      S001I2  60
|    C           CDATE     PARM           S001O1  60
M001AC                     MOVE CDATE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 5
|   C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C           DMD07S    PARM DMD07S    PMD07   1
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFEQ 50
|   C                     CALL 'WDS018'
|   C           DMD07E    PARM DMD07E    PMD07
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DMD07S    PMD07
|   C           DMD08S    PARM DMD08S    PMD08   2
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 50
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS009'
|   C                     PARM DMD07E    PMD07
|   C           DMD08E    PARM DMD08E    PMD08
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS007'
|   C           DME07S    PARM DME07S    PME07   2
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 50
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS007'
|   C           DME07E    PARM DME07E    PME07
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
