      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SAR0481                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/04                                      *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      *  REMARK      :產品銷售分佈明細表                           *
      ****************************************************************
     FSOSCPF  IF  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FREWF29  UF  E           K        DISK                      A
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *型態
     I                                      603 604 DSC34S
     I                                      605 606 DSC34E
      *地區
     I                                      607 608 DSC31S
     I                                      609 610 DSC31E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      611 6160YMDS
     I                                      617 6220YMDE
     I                                      623 6280DSC39S
     I                                      629 6340DSC39E
     I                                      646 654 DSD03S
     I                                      655 663 DSD03E
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF2908    WORK08
     C           *LIKE     DEFN WF2909    WORK09
     C           *LIKE     DEFN WF2910    WORK10
     C           *LIKE     DEFN WF2911    WORK11
     C           *LIKE     DEFN WF2914    WORK14
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WF2901
     C                     KFLD           WF2902
     C                     KFLD           WF2903
     C                     KFLD           WF2904
     C                     KFLD           WF2905
     C                     KFLD           WF2951
     C                     KFLD           WF2907
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C                     READ SC0                      45
  01-C           *IN45     DOWEQ'0'
    C                     MOVELSC33      WF2902
    C                     MOVELSC34      WF2903
    C                     MOVELSC31      WF2904
    C                     MOVELSC04      WF2905
    C                     MOVELSC05      WF2951
    C                     MOVELSC02      WF2907
    C           SC02      SETLLSD0
    C           SC02      READESD0                      46
  02-C           *IN46     DOWEQ'0'
    C*
  03-C           SD03      IFGE DSD03S
    C           SD03      ANDLEDSD03E
    C*
    C                     MOVELSD03      WF2901
    C           KEYWF     CHAINWF290                40
    C                     EXSR RTN300
  03-C                     END
    C*
    C           SC02      READESD0                      46
  02-C                     END
    C*
    C                     READ SC0                      45
  01-C                     END
     C*
     C                     SETON                     LR
      *==============================================================*
      *          RTN300....WRITE OR UPDATE REWF29
      *==============================================================*
01===C           RTN300    BEGSR
|    C*
|    C                     Z-ADD0         WORK08
|    C                     Z-ADD0         WORK09
|    C                     Z-ADD0         WORK10
|    C                     Z-ADD0         WORK11
|    C                     Z-ADD0         WORK14
|    C*
| 04-C           SC03      IFEQ 'S4'
|   C                     Z-ADDSD04      WORK14
| 04*C                     ELSE
|   C                     Z-ADDSD04      WORK08
| 04-C                     END
|    C                     Z-ADDSD05      WORK09
|    C                     Z-ADDSD06      WORK10
|    C                     Z-ADDSD07      WORK11
|    C*
B2000C                     Z-ADDSC07      WF2906
B2000C                     Z-ADDSC39      WF2913
|    C                     MOVELSC27      WF2912
|    C*
| 05-C           *IN40     IFEQ '0'
|   C                     ADD  WORK08    WF2908
|   C                     ADD  WORK09    WF2909
|   C                     ADD  WORK10    WF2910
|   C                     ADD  WORK11    WF2911
|   C                     ADD  WORK14    WF2914
|   C*
|   C                     UPDATWF290
| 05*C                     ELSE
|   C                     Z-ADDWORK08    WF2908
|   C                     Z-ADDWORK09    WF2909
|   C                     Z-ADDWORK10    WF2910
|   C                     Z-ADDWORK11    WF2911
|   C                     Z-ADDWORK14    WF2914
|   C                     WRITEWF290
| 05-C                     END
|    C*
01===C                     ENDSR
