      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR041                                        *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/02/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售訂單系統                                 *
      * REMARK       :客戶產品報價表                               *
      ****************************************************************
     FSOR041D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 601 DMD07S
     I                                      602 602 DMD07E
     I                                      603 604 DMD08S
     I                                      605 606 DMD08E
     I                                      607 611 DMD01S
     I                                      612 616 DMD01E
     I                                      617 6220DATE
     I                                      629 630 DME07S
     I                                      631 632 DME07E
     I                                      641 649 DSA01S
     I                                      651 659 DSA01E
     I                                      633 6380CDATE
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DMD07S
|    C                     MOVE *BLANK    DMD07E
|    C                     MOVE *BLANK    DMD08S
|    C                     MOVE *BLANK    DMD08E
|    C                     MOVE *BLANK    DMD01S
|    C                     MOVE *BLANK    DMD01E
|    C                     Z-ADD$EGMDY    DATE
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C* CHK 地區
| 01-C           DME07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DME07S
| 01-C                     END
|    C*
| 02-C           DME07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DME07E
| 02-C                     END
|    C*
|    C* CHK 通路
| 04-C           DMD07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMD07S
| 04-C                     END
|    C*
| 05-C           DMD07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMD07E
| 05-C                     END
|    C*
| 06-C*          DMD07S    IFGT DMD07E
|   C*                    SETON                     6263
|   C*                    SETON                     9399
| 06-C*                    END
|    C*  99                GOTO END100
|    C* CHK 型態
| 07-C           DMD08S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMD08S
| 07-C                     END
|    C*
| 08-C           DMD08E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMD08E
| 08-C                     END
|    C*
| 09-C*          DMD08S    IFGT DMD08E
|   C*                    SETON                     6465
|   C*                    SETON                     9399
| 09-C*                    END
|    C*  99                GOTO END100
|    C* CHK 客戶代號
| 10-C           DMD01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMD01S
| 10-C                     END
|    C*
| 11-C           DMD01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DMD01E
| 11-C                     END
|    C*
| 12-C           DMD01S    IFGT DMD01E
|   C                     SETON                     6667
|   C                     SETON                     9399
| 12-C                     END
|    C   99                GOTO END100
|    C* CHK 產品代號
| 10-C           DSA01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSA01S
| 10-C                     END
|    C*
| 11-C           DSA01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSA01E
| 11-C                     END
|    C*
| 12-C           DSA01S    IFGT DSA01E
|   C                     SETON                     6970
|   C                     SETON                     9399
| 12-C                     END
|    C   99                GOTO END100
|    C* CHG 日期
|    C                     CALL 'P09'
|    C                     PARM DATE      P0901I  60
|    C                     PARM           P0901O  1
| 13-C           P0901O    IFEQ 'N'
|   C                     SETON                     689499
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DATE      S001I2  60
|    C           CDATE     PARM           S001O1  60
M001AC                     MOVE CDATE     HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 5
|   C           D#COL     IFGE 36
|   C           D#COL     ANDLE37
|   C                     CALL 'WDS007'
|   C                     PARM           DME07S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 48
|   C           D#COL     ANDLE49
|   C                     CALL 'WDS007'
|   C                     PARM           DME07E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 7
|   C           D#COL     IFEQ 36
|   C                     CALL 'WDS018'
|   C                     PARM           DMD07S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFEQ 48
|   C                     CALL 'WDS018'
|   C                     PARM           DMD07E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     IFGE 36
|   C           D#COL     ANDLE37
|   C                     CALL 'WDS009'
|   C                     PARM DMD07S    PMD07S  1
|   C                     PARM           DMD08S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 48
|   C           D#COL     ANDLE49
|   C                     CALL 'WDS009'
|   C                     PARM DMD07E    PMD07E  1
|   C                     PARM           DMD08E
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE36
|   C           D#COL     ANDLE37
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
