      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR0491                                       *
      * AUTHER       : A1087  JOYCE                                  *
      * CREATE DATE  : 81/02/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :組別業務員銷售明細表                         *
      ****************************************************************
     FSOSCPF  IP  E           K        DISK
     FSOSDPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
B2CHKFSOR049P O   E             39     PRINTER
B2INF *CVR3009 sev.30 PRINTER file SOR049P must be converted, because
B2INF *   field SC39 is shared by name with other database fields which
B2INF *   require to be expanded. Please convert SOR049P, enlarging SC39
B2INF *   prior to compilation, or manually insert in this source the
B2INF *   proper RENAME and MOVE statements to avoid name-sharing.
     ISC0
     I                                              SC28  L5
     I                                              SC27  L4
     I                                              SC04  L3
     I                                              SC39  L2
     I                                              SC02  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 604 DSC28S
     I                                      605 608 DSC28E
     I                                      609 6140DSC39S
     I                                      615 6200DSC39E
     I                                      621 6260YSC39S
     I                                      627 6320YSC39E
     I                                      633 641 DSD03S
     I                                      642 650 DSD03E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      750 750 IN20
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN SC05      CKSC05
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYMC     KLIST
     C                     KFLD           SC27
     C           KEYME     KLIST
     C                     KFLD           SC04
     C                     KFLD           SC05
     C           KEYSD     KLIST
     C                     KFLD           SC02
     C           KEYMA     KLIST
     C                     KFLD           SD03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                MOVELSC05      CKSC05
     C  N10                EXSR RTN010                     *INIT ENVIRM
     C  N10                EXSR RTN100                     *GET HEADING
     C*
     C   39N38             EXSR RTN900                     *OVERFLOW
     C   39 38             EXSR RTN910                     *換下頁
     C                     EXSR RTN200                     *FILE TO SCR
     C*
     CL1 10N38             SETON                     33
     CL2 10N38             EXSR RTN8L2
     CL3 10N38             EXSR RTN8L3
     CL4 10N38             EXSR RTN8L4
     CL5 10                SETON                     3938
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         SD04A
|    C                     Z-ADD0         SD04B
|    C                     Z-ADD0         DSALE
|    C                     Z-ADD0         DTOTAL
|    C* 日期小計
|    C                     Z-ADD0         DSD04A
|    C                     Z-ADD0         DSD05
|    C                     Z-ADD0         DSD04B
|    C                     Z-ADD0         DDSALE
|    C                     Z-ADD0         DDTOT
|    C* 客戶小計
|    C                     Z-ADD0         CSD04A
|    C                     Z-ADD0         CSD05
|    C                     Z-ADD0         CSD04B
|    C                     Z-ADD0         CDSALE
|    C                     Z-ADD0         CDTOT
|    C* 業務小計
|    C                     Z-ADD0         TSD04A
|    C                     Z-ADD0         TSD05
|    C                     Z-ADD0         TSD04B
|    C                     Z-ADD0         TDSALE
|    C                     Z-ADD0         TDTOT
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....GET HEADING
     C*==============================================================*
02===C           RTN100    BEGSR
      *
     C           IN20      IFEQ '0'
     C                     SETOF                     20
     C                     ELSE
     C                     SETON                     20
     C                     END
|    C* GET部門組別
|    C                     MOVEL'CENTER  '#A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVELSC28      #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 01*C                     ELSE
|   C                     MOVE *BLANKS   D#A03
| 01-C                     END
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     10
|    C                     SETON                     3031
|    C                     SETON                     3233
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....MOVE DATA TO SCREEN
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C* GET業務員
|    C           KEYMC     CHAINMC0                  40
|    C   40                MOVE *BLANKS   MC02
|    C*
|    C* GET客戶簡稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANKS   ME04
|    C*
     C           IN20      IFEQ '0'
|    C* GET轉換日期
M001AC                     Z-ADDSC08      DSC08   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SC08      S001I2  80
M001AC                     PARM DSC08     S001I2  60
M001DC*          SC39      PARM           S001O1  80
M001AC           DSC39     PARM           S001O1  60
     C                     ELSE
|    C*
|    C* GET轉換日期
M001AC                     Z-ADDSC39      DSC39   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM SC39      S001I2  80
M001AC                     PARM DSC39     S001I2  60
M001DC*          SC39      PARM           S001O1  80
M001AC           DSC39     PARM           S001O1  60
     C                     END
|    C*
|    C*** READ訂單明細檔
|    C           KEYSD     SETLLSD0
|    C           KEYSD     READESD0                      44
| 01-C           *IN44     DOWEQ'0'
|   C*
| 03-C           SD03      IFGE DSD03S
|   C           SD03      ANDLEDSD03E
|   C* GET產品簡稱／單位
|   C           KEYMA     CHAINMA0                  40
|   C   40                MOVE *BLANKS   MA03
|   C   40                MOVE *BLANKS   MA13
|   C*
|   C* GET銷售量／試飲
| 02-C           SC03      IFNE 'S4'
|   C                     Z-ADDSD04      SD04A
|   C                     Z-ADD0         SD04B
| 02-C                     END
| 03-C           SC03      IFEQ 'S4'
|   C                     Z-ADD0         SD04A
|   C                     Z-ADDSD04      SD04B
| 03-C                     END
|   C*
|   C* 折扣／淨金額
|   C           SD13      ADD  SD14      DSALE
|   C*          SD15      SUB  DSALE     DTOTAL
     C           SD04A     MULT SD06      DTOTAL    H
|   C**
|   C* 日期小計
|   C                     ADD  SD04A     DSD04A
|   C                     ADD  SD05      DSD05
|   C                     ADD  SD04B     DSD04B
|   C                     ADD  DSALE     DDSALE
|   C                     ADD  DTOTAL    DDTOT
|   C* 客戶小計
|   C                     ADD  SD04A     CSD04A
|   C                     ADD  SD05      CSD05
|   C                     ADD  SD04B     CSD04B
|   C                     ADD  DSALE     CDSALE
|   C                     ADD  DTOTAL    CDTOT
|   C* 業務小計
|   C                     ADD  SD04A     TSD04A
|   C                     ADD  SD05      TSD05
|   C                     ADD  SD04B     TSD04B
|   C                     ADD  DSALE     TDSALE
|   C                     ADD  DTOTAL    TDTOT
|   C**
     C   39                EXSR RTN900
     C           SC05      IFNE CKSC05
     C                     SETON                     313233
     C                     MOVELSC05      CKSC05
     C                     END
|   C                     WRITEPD1
|   C                     SETOF                     3031
|   C                     SETOF                     3233
     C                     END
     C*
|   C           KEYSD     READESD0                      44
| 01-C                     END                             *44 EOF
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETON                     3031
|    C                     SETON                     3233
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN910....換下頁
      *==============================================================*
05===C           RTN910    BEGSR
|    C*
|    C                     WRITEPE3
|    C* GET部門組別
|    C                     MOVEL'CENTER  '#A01
|    C                     MOVE *BLANKS   #A02
|    C                     MOVELSC28      #A02
|    C           KEY#A     CHAIN#A0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 01*C                     ELSE
|   C                     MOVE *BLANKS   D#A03
| 01-C                     END
|    C                     WRITEPH1
|    C                     EXSR RTN010
|    C*
|    C                     SETON                     3031
|    C                     SETON                     3233
|    C                     SETOF                     3938
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RTN8L2....L2 ON  ( PRINT 日期小計)
     C*==============================================================*
06===C           RTN8L2    BEGSR
|    C*
|    C                     SETON                     3233
| 01-C           *IN31     IFEQ '0'
|   C*
     C           DSD04A    IFNE 0
|   C                     WRITEPD2
|   C  NL3                WRITEPE4
|   C* 日期小計
|   C                     Z-ADD0         DSD04A
|   C                     Z-ADD0         DSD05
|   C                     Z-ADD0         DSD04B
|   C                     Z-ADD0         DDSALE
|   C                     Z-ADD0         DDTOT
     C                     END
| 01-C                     END
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          RTN8L3....L3 ON  ( PRINT 客戶小計)
     C*==============================================================*
07===C           RTN8L3    BEGSR
|    C*
|    C                     SETON                     313233
| 01-C           *IN30     IFEQ '0'
     C           CSD04A    IFNE 0
|   C                     WRITEPD3
|   C  NL4                WRITEPE4
|   C* 客戶小計
|   C                     Z-ADD0         CSD04A
|   C                     Z-ADD0         CSD05
|   C                     Z-ADD0         CSD04B
|   C                     Z-ADD0         CDSALE
|   C                     Z-ADD0         CDTOT
| 01-C                     END
| 01-C                     END
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          RTN8L4....L4 ON  ( PRINT 業務小計)
     C*==============================================================*
08===C           RTN8L4    BEGSR
|    C*
|    C                     SETON                     3031
|    C                     SETON                     3233
     C           TSD04A    IFNE 0
|    C                     WRITEPD4
|    C  NL5                WRITEPE4
|    C* 業務小計
|    C                     Z-ADD0         TSD04A
|    C                     Z-ADD0         TSD05
|    C                     Z-ADD0         TSD04B
|    C                     Z-ADD0         TDSALE
|    C                     Z-ADD0         TDTOT
     C                     END
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
09===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN100
|    C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
|    C*
09===C                     ENDSR
