      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR0732                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 05/24/93                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :組別產品銷售週報表                           *
      ****************************************************************
     FREWF74  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FSOR073P O   E             39     PRINTER
     E*
     IWF740
     I                                              WF7401L3
     I                                              WF742$L2
     I                                              WF7402L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I                                      601 604 DSC28S
     I                                      605 608 DSC28E
     I                                      609 6140DSC39S
     I                                      615 6200DSC39E
     I                                      633 641 DSD03S
     I                                      642 650 DSD03E
     I                                      651 656 DSC27S
     I                                      657 662 DSC27E
     I                                      671 671 COMP
      *客戶
     I                                      675 679 DSC04S
     I                                      680 684 DSC04E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      750 750 IN20
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C           *LIKE     DEFN WF7406    T17406
     C           *LIKE     DEFN WF7407    T17407
     C           *LIKE     DEFN WF7406    T27406
     C           *LIKE     DEFN WF7407    T27407
     C           *LIKE     DEFN WF7406    T37406
     C           *LIKE     DEFN WF7407    T37407
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL3     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010
  02-C                     END
  01-C                     END
     C*
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200                                 L
     CL2 10                EXSR RTN250                                 L
     CL3 10                EXSR RTN300                                 L
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
     C*
| 03-C           IN20      IFEQ '0'
|   C                     SETOF                     20
| 03*C                     ELSE
|   C                     SETON                     20
| 03-C                     END
| 03-C           COMP      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 03*C                     ELSE
| 04-C           COMP      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 04*C                     ELSE
| 05-C           COMP      IFEQ '3'
|   C                     MOVEL'高雄'  COMPC
| 05*C                     ELSE
|   C                     MOVEL'全部'  COMPC
| 05-C                     END
| 04-C                     END
| 03-C                     END
     C*
|    C                     MOVEL'CENTER'  #A01
|    C                     MOVELWF7401    #A02
|    C           KEY#A     CHAIN#A0                  41
| 06-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    #A03
| 06-C                     END
|    C*
|    C                     WRITEPH1
     C                     SETOF                     21
     C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           WF7403    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 01-C                     END
|    C*
|    C           WF7404    SUB  WF7405    WFTOT
|    C                     ADD  WF7404    T17404
|    C                     ADD  WF7405    T17405
|    C           WF7406    SUB  WF7407    WFTOT1
|    C                     ADD  WF7406    T17406
|    C                     ADD  WF7407    T17407
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     21
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....SUBTOT
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C           T17404    SUB  T17405    T1TOT
|    C           T17406    SUB  T17407    T1TOT1
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     ADD  T17404    T27404
|    C                     ADD  T17405    T27405
|    C                     ADD  T17406    T27406
|    C                     ADD  T17407    T27407
|    C                     Z-ADD0         T17404
|    C                     Z-ADD0         T17405
|    C                     Z-ADD0         T17406
|    C                     Z-ADD0         T17407
|    C                     SETON                     21
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN250....SUBTOT
      *==============================================================*
03===C           RTN250    BEGSR
|    C*
|    C           T27404    SUB  T27405    T2TOT
|    C           T27406    SUB  T27407    T2TOT1
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     ADD  T27404    T37404
|    C                     ADD  T27405    T37405
|    C                     ADD  T27406    T37406
|    C                     ADD  T27407    T37407
|    C                     Z-ADD0         T27404
|    C                     Z-ADD0         T27405
|    C                     Z-ADD0         T27406
|    C                     Z-ADD0         T27407
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....SUBTOT
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C           T37404    SUB  T37405    T3TOT
|    C           T37406    SUB  T37407    T3TOT1
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
|    C                     Z-ADD0         T37404
|    C                     Z-ADD0         T37405
|    C                     Z-ADD0         T37406
|    C                     Z-ADD0         T37407
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
     C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     3921
     C*
05===C                     ENDSR
      *==============================================================*
      *          RTN999 ...
      *==============================================================*
07===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPE2
|    C*
07===C                     ENDSR
