      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      * PROGRAM NAME : SOR0542                                       *
      * AUTHER       : A1084  CHARLES                                *
      * CREATE DATE  : 81/05/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品成長率分析表                             *
      ****************************************************************
     FREWF29  IP  E           K        DISK
     F*PA#APF  IF  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FSOR054P O   E             39     PRINTER
     E*
     IWF290
     I                                              WF2901L5
     I                                              WF2902L4
     I                                              WF2903L4
     I                                              WF2904L3
     I                                              WF2905L2
     I                                              WF2951L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *型態
     I                                      603 604 DSC34S
     I                                      605 606 DSC34E
      *地區
     I                                      607 608 DSC31S
     I                                      609 610 DSC31E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      611 6160YMDS
     I                                      617 6220YMDE
     I                                      623 6280DSC39S
     I                                      629 6340DSC39E
     I                                      646 654 DSD03S
     I                                      655 663 DSD03E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      750 750 IN20
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*          KEY#A     KLIST
     C*                    KFLD           #A01
     C*                    KFLD           #A02
     C           KEY#C     KLIST
     C                     KFLD           #C01
     C                     KFLD           #C02
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01*C                     ELSE
  02-C           *INL5     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010                     *HEADING
    C                     SETOF                     303132
  02-C                     END
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                SETOF                     32
     CL2 10                EXSR RTN200
     CL3 10                EXSR RTN300
     CL4 10                EXSR RTN400
     CL5 10                EXSR RTN500
     CLR                   EXSR RTNLR
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
| 03-C           IN20      IFEQ '0'
|   C                     SETOF                     20
| 03*C                     ELSE
|   C                     SETON                     20
| 03-C                     END
|    C*產品
|    C           WF2901    CHAINMA0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 04-C                     END
|    C                     WRITEPH1
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*通路
|    C*                    MOVEL'DISTRUBT'#A01
|    C*                    MOVELWF2902    #A02
|    C*          KEY#A     CHAIN#A0                  40
| 01-C*          *IN40     IFEQ '1'
|   C*                    MOVEL*BLANKS   #A03
| 01-C*                    END
|    C*
|    C*型態
|    C                     MOVELWF2902    #C01
|    C                     MOVELWF2903    #C02
|    C           KEY#C     CHAIN#C0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   #C02
| 02-C                     END
|    C*
|    C*地區
|    C           WF2904    CHAIN#D0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   #D02
| 03-C                     END
|    C*
|    C*客戶
|    C                     MOVELWF2905    ME01
|    C                     MOVELWF2951    ME02
|    C           KEYME     CHAINME0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   ME04
| 04-C                     END
|    C*
|    C           WF2912    CHAINMC0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANKS   MC02
| 05-C                     END
|    C*日期轉換
M001AC                     Z-ADDWF2906    XF2906  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF2906    S001I2  80
M001AC                     PARM XF2906    S001I2  60
|    C           PSC07     PARM           S001O1  60
|    C*
M001AC                     Z-ADDWF2913    XF2913  60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
M001DC*                    PARM WF2913    S001I2  80
M001AC                     PARM XF2913    S001I2  60
|    C           PSC39     PARM           S001O1  60
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     21
|    C                     SETON                     303132
|    C                     ADD  WF2908    T12908
|    C                     ADD  WF2909    T12909
|    C                     ADD  WF2910    T12910
|    C                     ADD  WF2911    T12911
|    C                     ADD  WF2914    T12914
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETOF                     32
|    C                     SETON                     21
|    C                     ADD  T12908    T22908
|    C                     ADD  T12909    T22909
|    C                     ADD  T12910    T22910
|    C                     ADD  T12911    T22911
|    C                     ADD  T12914    T22914
|    C                     Z-ADD0         T12908
|    C                     Z-ADD0         T12909
|    C                     Z-ADD0         T12910
|    C                     Z-ADD0         T12911
|    C                     Z-ADD0         T12914
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   SUBTOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     SETOF                     31
|    C                     ADD  T22908    T32908
|    C                     ADD  T22909    T32909
|    C                     ADD  T22910    T32910
|    C                     ADD  T22911    T32911
|    C                     ADD  T22914    T32914
|    C                     Z-ADD0         T22908
|    C                     Z-ADD0         T22909
|    C                     Z-ADD0         T22910
|    C                     Z-ADD0         T22911
|    C                     Z-ADD0         T22914
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT3   SUBTOTAL
      *==============================================================*
05===C           RTN400    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
|    C                     SETOF                     30
|    C                     ADD  T32908    T42908
|    C                     ADD  T32909    T42909
|    C                     ADD  T32910    T42910
|    C                     ADD  T32911    T42911
|    C                     ADD  T32914    T42914
|    C                     Z-ADD0         T32908
|    C                     Z-ADD0         T32909
|    C                     Z-ADD0         T32910
|    C                     Z-ADD0         T32911
|    C                     Z-ADD0         T32914
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN500....WRITE PT4   TOTAL
      *==============================================================*
06===C           RTN500    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT4
|    C                     Z-ADD0         T42908
|    C                     Z-ADD0         T42909
|    C                     Z-ADD0         T42910
|    C                     Z-ADD0         T42911
|    C                     Z-ADD0         T42914
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     303132
|    C                     SETOF                     21
|    C*
07===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
08===C           RTNLR     BEGSR
|    C*
|    C                     MOVE '1'       *INLR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01-C                     END
|    C                     WRITEPE2
08===C                     ENDSR
