      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR084                                        *
      * AUTHER       : TINA                                          *
      * CREATE DATE  : 81/02/10                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售系統                                     *
      * REMARK       :已核准單據明細　                             *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   99.01.14  Y2K MODIFY                    */
     /*=============================================================*/
      ****************************************************************
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*(MM/DD/YY)
     I                                      601 6060DDATES
     I                                      607 6120DDATEE
     I*(YY/MM/DD)
     I                                      640 6450YDATES
     I                                      646 6510YDATEE
M001AI                                      850 8570YMD8S
M001AI                                      858 8650YMD8E
     I                                      621 621 COMP
     I                                      625 625 DPATHS
     I                                      626 626 DPATHE
     I                                      671 671 COMPS
     I                                      672 672 COMPE
     I* FOR F4 HELP -- GET CURSOR POSITION
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     .INIT SCREEN
    C                     EXSR RTN100                     .CHECK      ?
     C*
     C                     EXSR OUTLDA
     C*
     C                     SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*          *NAMVAR   DEFN *LDA      LDA
     C                     IN   LDA
|    C                     Z-ADD1         $CPY
|    C                     MOVEL'01'      $PRTID
     C                     MOVE '1'       COMPS
     C                     MOVE '3'       COMPE
|    C                     MOVE *LOVAL    DPATHS
|    C                     MOVE *HIVAL    DPATHE
|    C                     Z-ADD$EGMDY    DDATES
|    C                     Z-ADD$EGMDY    DDATEE
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*(CHENK STRART <= END DATE)
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DDATES    S001I2  60
|    C           YDATES    PARM           S001OI  60
M001AC                     MOVE YDATES    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DDATEE    S001I2  60
|    C           YDATEE    PARM           S001OI  60
M001AC                     MOVE YDATEE    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
M001AC/COPY HBP2CVTR
