      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : SOR0502                                       *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 82/02/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :銷售分析系統                                 *
      * REMARK       :產品辦事處通路彙總表                         *
      ****************************************************************
     FREWFA3  IP  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FSOR050P O   E             39     PRINTER
     E*
     IWFA30
     I                                              WFA317L1
     I                                              WFA320L2
     I                                              WFA312L3
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*
     I                                      601 604 DSC28S
     I                                      605 608 DSC28E
     I                                      609 614 DSC27S
     I                                      615 620 DSC27E
     I*(MM/DD/YY)
     I                                      621 6260DSC39S
     I                                      627 6320DSC39E
     I*(YY/MM/DD)
     I                                      640 6450YSC39S
     I                                      646 6510YSC39E
     I*通路，型態，客戶代號
     I                                      652 652 DSC33S
     I                                      653 653 DSC33E
     I                                      654 655 DSC34S
     I                                      656 657 DSC34E
     I                                      658 662 DSC04S
     I                                      663 667 DSC04E
      *辦事處
     I                                      671 671 COMPS
     I                                      672 672 COMPE
      *產品代號
     I                                      673 681 DSD03S
     I                                      682 690 DSD03E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      750 750 IN20
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
  01*C                     ELSE
    C   39                EXSR RTN900
  02-C           *INL3     IFEQ '1'
    C                     WRITEPE1
    C                     EXSR RTN010
  02-C                     END
  01-C                     END
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                EXSR RTN200
     CL2 10                EXSR RTN300
     CL3 10                EXSR RTN400
     CLR                   EXSR RTN999
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     Z-ADD0         T0A301
|    C                     Z-ADD0         T0A302
|    C                     Z-ADD0         T0A303
|    C                     Z-ADD0         T0A304
|    C                     Z-ADD0         T0A30A
|    C                     Z-ADD0         T0A305
|    C                     Z-ADD0         T0A306
|    C                     Z-ADD0         T0A307
|    C                     Z-ADD0         T0A308
|    C*
|    C                     Z-ADD0         T1A301
|    C                     Z-ADD0         T1A302
|    C                     Z-ADD0         T1A303
|    C                     Z-ADD0         T1A304
|    C                     Z-ADD0         T1A30A
|    C                     Z-ADD0         T1A305
|    C                     Z-ADD0         T1A306
|    C                     Z-ADD0         T1A307
|    C                     Z-ADD0         T1A308
|    C*
|    C                     Z-ADD0         T2A301
|    C                     Z-ADD0         T2A302
|    C                     Z-ADD0         T2A303
|    C                     Z-ADD0         T2A304
|    C                     Z-ADD0         T2A30A
|    C                     Z-ADD0         T2A305
|    C                     Z-ADD0         T2A306
|    C                     Z-ADD0         T2A307
|    C                     Z-ADD0         T2A308
|    C*種類
     C                     MOVEL*BLANKS   GROUP
| 02-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'GROUP
| 02*C                     ELSE
| 03-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'GROUP
| 03*C                     ELSE
| 04-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'GROUP
| 04*C                     ELSE
|   C                     MOVEL'全部'  GROUP
| 04-C                     END
| 03-C                     END
| 02-C                     END
|    C*
| 03-C           IN20      IFEQ '0'
|   C                     SETOF                     20
| 03*C                     ELSE
|   C                     SETON                     20
| 03-C                     END
|    C*
|    C*組別
|    C                     MOVEL'CENTER'  #A01
|    C                     MOVELWFA311    #A02
|    C           KEY#A     CHAIN#A0                  45
| 04-C           *IN45     IFEQ '1'
|   C                     MOVE *BLANK    #A03
| 04-C                     END
|    C*業務員名稱
|    C           WFA312    CHAINMC0                  41
| 05-C           *IN41     IFEQ '1'
|   C                     MOVE *BLANK    MC02
| 05-C                     END
|    C*
|    C                     WRITEPH1
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*試飲
| 01-C           WFA305    IFEQ 'S4'
|   C                     ADD  WFA321    T0A303
|   C                     ADD  WFA322    T0A303
| 01*C                     ELSE
|   C*銷貨退回
| 02-C           WFA305    IFEQ 'R1'
|   C                     ADD  WFA321    T0A305
|   C                     ADD  WFA322    T0A306
|   C                     SUB  WFA323    T0A308
|   C                     SUB  WFA324    T0A308
|   C                     ADD  WFA325    T0A308
| 02*C                     ELSE
|   C*試飲退回
| 03-C           WFA305    IFEQ 'R3'
|   C                     ADD  WFA321    T0A307
|   C                     ADD  WFA322    T0A307
| 03*C                     ELSE
|   C*其他訂單
|   C                     ADD  WFA321    T0A301
|   C                     ADD  WFA322    T0A302
|   C                     ADD  WFA325    T0A304
| 03-C                     END
| 02-C                     END
| 01-C                     END
|    C                     ADD  WFA323    T0A30A
|    C                     ADD  WFA324    T0A30A
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PD1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C           T0A301    SUB  T0A305    T0A309
|    C           T0A302    SUB  T0A306    T0A310
|    C           T0A303    SUB  T0A307    T0A311
|    C           T0A304    SUB  T0A308    T0A312
|    C*產品簡稱
|    C           WFA317    CHAINMA0                  43
| 01-C           *IN43     IFEQ '1'
|   C                     MOVE *BLANK    MA03
|   C                     MOVE *BLANK    MA13
| 01-C                     END
|    C*
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     3021
|    C                     ADD  T0A301    T1A301
|    C                     ADD  T0A302    T1A302
|    C                     ADD  T0A303    T1A303
|    C                     ADD  T0A304    T1A304
|    C                     ADD  T0A30A    T1A30A
|    C                     ADD  T0A305    T1A305
|    C                     ADD  T0A306    T1A306
|    C                     ADD  T0A307    T1A307
|    C                     ADD  T0A308    T1A308
|    C                     Z-ADD0         T0A301
|    C                     Z-ADD0         T0A302
|    C                     Z-ADD0         T0A303
|    C                     Z-ADD0         T0A304
|    C                     Z-ADD0         T0A30A
|    C                     Z-ADD0         T0A305
|    C                     Z-ADD0         T0A306
|    C                     Z-ADD0         T0A307
|    C                     Z-ADD0         T0A308
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT1   SUBTOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C           T1A301    SUB  T1A305    T1A309
|    C           T1A302    SUB  T1A306    T1A310
|    C           T1A303    SUB  T1A307    T1A311
|    C           T1A304    SUB  T1A308    T1A312
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETOF                     30
|    C                     SETON                     21
|    C                     ADD  T1A301    T2A301
|    C                     ADD  T1A302    T2A302
|    C                     ADD  T1A303    T2A303
|    C                     ADD  T1A304    T2A304
|    C                     ADD  T1A30A    T2A30A
|    C                     ADD  T1A305    T2A305
|    C                     ADD  T1A306    T2A306
|    C                     ADD  T1A307    T2A307
|    C                     ADD  T1A308    T2A308
|    C                     Z-ADD0         T1A301
|    C                     Z-ADD0         T1A302
|    C                     Z-ADD0         T1A303
|    C                     Z-ADD0         T1A304
|    C                     Z-ADD0         T1A30A
|    C                     Z-ADD0         T1A305
|    C                     Z-ADD0         T1A306
|    C                     Z-ADD0         T1A307
|    C                     Z-ADD0         T1A308
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT2   SUBTOTAL
      *==============================================================*
05===C           RTN400    BEGSR
|    C*
|    C           T2A301    SUB  T2A305    T2A309
|    C           T2A302    SUB  T2A306    T2A310
|    C           T2A303    SUB  T2A307    T2A311
|    C           T2A304    SUB  T2A308    T2A312
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     SETOF                     3121
|    C                     Z-ADD0         T2A301
|    C                     Z-ADD0         T2A302
|    C                     Z-ADD0         T2A303
|    C                     Z-ADD0         T2A304
|    C                     Z-ADD0         T2A30A
|    C                     Z-ADD0         T2A305
|    C                     Z-ADD0         T2A306
|    C                     Z-ADD0         T2A307
|    C                     Z-ADD0         T2A308
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
06===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     30
|    C                     SETOF                     21
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN999 ...
      *==============================================================*
07===C           RTN999    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE3
| 01-C                     END
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPE2
|    C*
07===C                     ENDSR
