      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR047                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/14                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :訂單系統                                     *
      * REMARK       :送貨未確認明細表                             *
     A*===============================================================
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A* M002 |MICHELLE|11.03.04|增加客戶代號選項
     A*---------------------------------------------------------------
      ****************************************************************
     FSOR047D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*
     I                                      601 605 DSE07S
     I                                      606 610 DSE07E
     I*(MM/DD/YY)
     I                                      611 6160DSE06S
     I                                      617 6220DSE06E
     I*(YY/MM/DD)
     I                                      630 6350YSE06S
     I                                      636 6410YSE06E
M002AI*客戶代號
  "  I                                      651 655 DSE04S
M002AI                                      656 660 DSE04E
M001AI*(YYYY/MM/DD)
M001AI                                      850 857 YMD8S
M001AI                                      858 865 YMD8E
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
     C                     ELSE
     C                     EXSR RTN100                     *CHK SCRN
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'SCR001'  APPSCR  6
|    C                     MOVEL*BLANK    DSE07S
|    C                     MOVEL*BLANK    DSE07E
M002AC                     MOVEL*BLANK    DSE04S
M002AC                     MOVEL*BLANK    DSE04E
|    C                     Z-ADD0         DSE06S
|    C                     Z-ADD0         DSE06E
|    C                     Z-ADD0         YSE06S
|    C                     Z-ADD0         YSE06E
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
     C           RTN100    BEGSR
     C*物流點
     C           DSE07S    IFEQ *BLANK
     C                     MOVE *LOVAL    DSE07S
     C                     END
     C*
     C           DSE07E    IFEQ *BLANK
     C                     MOVE *HIVAL    DSE07E
     C                     END
     C*
     C           DSE07S    IFGT DSE07E
     C                     SETON                     606199
     C                     SETON                     93
     C                     END
     C*
     C   99                GOTO END100
M002AC*客戶代號
 "   C           DSE04S    IFEQ *BLANK
 "   C                     MOVE *LOVAL    DSE04S
 "   C                     END
 "   C*
 "   C           DSE04E    IFEQ *BLANK
 "   C                     MOVE *HIVAL    DSE04E
 "   C                     END
 "   C*
 "   C           DSE04S    IFGT DSE04E
 "   C                     SETON                     6299
 "   C                     SETON                     93
 "   C                     END
 "   C*
M002AC   99                GOTO END100
|    C****
|    C*(CHECK DATE)-送貨日期
|    C****
| 07-C           DSE06S    IFEQ 0
M001DC*                    Z-ADD010101    DSE06S
M001AC                     Z-ADD010192    DSE06S
| 07-C                     END
|    C*
| 08-C           DSE06E    IFEQ 0
M001DC*                    Z-ADD123199    DSE06E
M001AC                     Z-ADD123129    DSE06E
| 08-C                     END
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSE06S    P0901I  60
|    C                     PARM           P0911O  1
| 09-C           P0911O    IFEQ 'N'
|   C                     SETON                     649499
| 09-C                     END
|    C   99                GOTO END100
|    C*
|    C                     CALL 'P09'
|    C                     PARM DSE06E    P0901I  60
|    C                     PARM           P0911O  1
| 10-C           P0911O    IFEQ 'N'
|   C                     SETON                     659499
| 10-C                     END
|    C   99                GOTO END100
|    C****
|    C*(CHANGE END-DATE TO CHINESE DATE)
|    C****
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSE06S    S001I2  60
|    C           YSE06S    PARM           S001O1  60
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DSE06E    S001I2  60
|    C           YSE06E    PARM           S001O1  60
M001AC                     MOVE YSE06S    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8S
|    C*
M001AC                     MOVE YSE06E    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    YMD8E
|    C*
M001DC*          YSE06S    IFGT YSE06E
M001AC           YMD8S     IFGT YMD8E
|   C                     SETON                     6465
|   C                     SETON                     9399
| 11-C                     END
|    C   99                GOTO END100
     C*
     C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
02===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C** GET客戶代號
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           S003O1  9
|   C                     MOVELS003O1    DSE04S
|   C                     GOTO ENDF4
| 02-C                     END
     C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C                     PARM           S003O1  9
|   C                     MOVELS003O1    DSE04E
|   C                     GOTO ENDF4
| 02-C                     END
| 01-C                     END
|    C*
02===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
