     F*================================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*----------------------------------------------------------------
     FS#SDPF  IF  E           K        DISK
     FSOR160D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      101 102 $AUT
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      611 6160YMDS
     I                                      617 6220YMDE
     I                                      623 6280DSC39S
     I                                      629 6340DSC39E
     I                                      646 647 DSD03S
     I                                      655 656 DSD03E
     I                                      664 664 COMP
      *辦事處
     I                                      671 671 COMPS
     I                                      672 672 COMPE
      *組別
     I                                      681 689 DSC45S
     I                                      690 698 DSC45E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
      *單瓶
     I                                      720 720 DSEL2
     I                                      721 721 DSEL3
     I                                      750 750 IN20
     I                                      760 768 DMA01S
     I                                      770 778 DMA01E
     I                                      780 781 DSC34S
     I                                      782 783 DSC34E
M001AI*
M001AI                                      850 8570YMDS8
M001AI                                      858 8650YMDE8
M001AI*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSD     KLIST
     C                     KFLD           $USER
     C                     KFLD           SD02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEA'00'      *IN,58
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
  04-C           *IN07     IFEQ '1'
    C*
  05-C           $AUT      IFNE 'RE'
    C           $AUT      ANDNE'CW'
    C*
    C                     MOVEL'SOR160C2'SD02
    C           KEYSD     CHAINSD0                  40
  06-C           *IN40     IFEQ '0'
    C           SD07      ANDEQ'Y'
    C                     CALL 'SOR160C2'
    C*
  06*C                     ELSE
    C                     SETON                     9988
    C*
  06-C                     ENDIF
  05*C                     ELSE
    C                     CALL 'SOR160C2'
  05-C                     ENDIF
  04-C                     ENDIF
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
     C*
     C           *IN08     IFEQ '1'
     C                     CALL 'SOR165C'
     C                     ENDIF
     C*
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD1         $EVR
|    C                     MOVEL$USER     AUT     3
|    C*          AUT       IFNE 'D91'
|    C*          AUT       ANDNE'REP'
|    C*                    SETON                     31
|    C*                    END
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC45S
|    C                     MOVE *BLANK    DSC45E
|    C                     MOVE *BLANK    DMA01S
|    C                     MOVE *BLANK    DMA01E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         YMDS8
|    C                     Z-ADD0         YMDE8
|    C                     MOVEL'SCR001'  APPSCR  6
|    C                     MOVE 'A'       DSEL2
|    C                     MOVE '1'       DSEL3
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C*產品
| 02-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 02-C                     END
|    C*
| 03-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 03-C                     END
|    C*產品
| 02-C           DMA01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DMA01S
| 02-C                     END
|    C*
| 03-C           DMA01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DMA01E
| 03-C                     END
|    C*
| 04-C           DSD03S    IFGT DSD03E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*
| 04-C           DMA01S    IFGT DMA01E
|   C                     SETON                     7677
|   C                     SETON                     9299
| 04-C                     END
|    C   99                GOTO END100
|    C*通路
| 05-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 05-C                     END
|     *
| 06-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 06-C                     END
|     *
| 07-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*型態
| 05-C           DSC34S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC34S
| 05-C                     END
|     *
| 06-C           DSC34E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC34E
| 06-C                     END
|     *
| 07-C           DSC34S    IFGT DSC34E
|   C                     SETON                     7879
|   C                     SETON                     9299
| 07-C                     END
|    C   99                GOTO END100
|    C*客戶代號
| 08-C           DSC45S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC45S
| 08-C                     END
|    C*
| 09-C           DSC45E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC45E
| 09-C                     END
|    C*
| 10-C           DSC45S    IFGT DSC45E
|   C                     SETON                     7475
|   C                     SETON                     9299
| 10-C                     END
|    C   99                GOTO END100
|    C*送貨日期或確認日期只輸入一項
| 11-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 12-C           DSC39S    IFNE 0
|   C                     SETON                     728999
| 12-C                     END
| 13-C           DSC39E    IFNE 0
|   C                     SETON                     738999
| 13-C                     END
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 14-C           DSC08S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 15-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 15-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 16-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
| 16-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08S    S001I2  60
|   C           YMDS      PARM           S001O1  60
|   C                     MOVE YMDS      HB2@F6  6
|   C                     EXSR HB@68L
|   C                     MOVE HB2@T8    H@8N01  80
|   C                     Z-ADDH@8N01    YMDS8
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08E    S001I2  60
|   C           YMDE      PARM           S001O1  60
|   C                     MOVE YMDE      HB2@F6  6
|   C                     EXSR HB@68L
|   C                     MOVE HB2@T8    H@8N01  80
|   C                     Z-ADDH@8N01    YMDE8
|   C**
|   C*M001M     YMDS      IFGT YMDE
| 17-C           YMDS8     IFGT YMDE8
|   C                     SETON                     7071
|   C                     SETON                     9299
| 17-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 14*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 18-C           P0901O    IFEQ 'N'
|   C                     SETON                     729399
| 18-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 19-C           P0901O    IFEQ 'N'
|   C                     SETON                     739399
| 19-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           YMDS      PARM           S001O1  60
|   C                     MOVE YMDS      HB2@F6  6
|   C                     EXSR HB@68L
|   C                     MOVE HB2@T8    H@8N01  80
|   C                     Z-ADDH@8N01    YMDS8
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           YMDE      PARM           S001O1  60
|   C                     MOVE YMDE      HB2@F6  6
|   C                     EXSR HB@68L
|   C                     MOVE HB2@T8    H@8N01  80
|   C                     Z-ADDH@8N01    YMDE8
|   C**
|   C*M001M     YMDS      IFGT YMDE
| 20-C           YMDS8     IFGT YMDE8
|   C                     SETON                     7273
|   C                     SETON                     9299
| 20-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 14-C                     END
|    C*單瓶
| 21-C           DSEL2     IFEQ *BLANK
|   C                     SETON                     659599
| 21-C                     END
|    C   99                GOTO END100
|     *
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE45
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*通路
| 04-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE45
|   C           D#COL     ANDLE45
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 05-C                     END
|   C*型態
| 08-C           D#ROW     IFEQ 7
| 09-C           D#COL     IFGE 40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33S  1
|   C                     PARM           DSC34S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 45
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33E  1
|   C                     PARM           DSC34E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*品牌
| 04-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS026'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE45
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS026'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 05-C                     END
|   C*客戶代號
| 06-C           D#ROW     IFEQ 10
| 07-C           D#COL     IFGE 40
|   C           D#COL     ANDLE49
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45S
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 08-C           D#COL     IFGE 52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45E
|   C                     GOTO ENDF4
| 08-C                     END
| 06-C                     END
|   C*
|   C*
| 09-C           D#ROW     IFEQ 20
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 09-C                     END
|    *
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
      /COPY HBP2CVTR
