      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SOR066                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 81/12/05                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      *    SUBSYSTEM    :訂單系統                                  *
      *    REMARK       :客戶銷售明細表                            *
     /*=============================================================*/
     /*  CODE       AUTHOR.     DATE    DESCRIPTION
     /*-------------------------------------------------------------
     /*  M001      MICHELLE   98.12.19  Y2K MODIFY
     F*----------------------------------------------------------------
     F*  M002     | MICHELLE  | 99.11.08 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     F*  M003     | 00.11.10 |增加大區域選項
     F*----------------------------------------------------------------
     /*=============================================================*/
      ****************************************************************
     FS#SDPF  IF  E           K        DISK
     FSOR161D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSOR161Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*處事處
     I                                      601 601 COMP
     I                                      602 602 COMPS
     I                                      603 603 COMPE
     I*通路
     I                                      604 604 DSC33S
     I                                      605 605 DSC33E
     I*型態
     I                                      606 607 DSC34S
     I                                      608 609 DSC34E
     I*客戶代號
     I                                      610 614 DSC04S
     I                                      620 624 DSC04E
     I*產品代號
     I                                      630 638 DSD03S
     I                                      640 648 DSD03E
     I*日期
     I                                      650 6550DSC39S
     I                                      656 6610DSC39E
     I                                      662 6670DSC08S
     I                                      668 6730DSC08E
M001MI*                                     680 6850YMDS
M001MI*                                     686 6910YMDE
M001MI                                      680 6870YMDS
M001MI                                      690 6970YMDE
     I                                      701 706 DSC27S
     I                                      707 712 DSC27E
M003A *大區域別
M003AI                                      730 731 D#L01S
M003AI                                      732 733 D#L01E
     I*
     I                                      750 750 IN20
      *產品組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
     I                                      800 800 DMA54
     I                                      801 801 DMA54S
     I                                      802 802 DMA54E
M002A *集團代號
M002AI                                      810 811 DMD06S
M002AI                                      812 813 DMD06E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSD     KLIST
     C                     KFLD           $USER
     C                     KFLD           SD02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEA'00'      *IN,58
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
     C           *IN07     IFEQ '1'
     C*
     C                     MOVEL'SOR161C2'SD02
     C           KEYSD     CHAINSD0                  40
     C           *IN40     IFEQ '0'
     C           SD07      ANDEQ'Y'
     C                     CALL 'SOR161C2'
     C*
     C                     ELSE
     C                     SETON                     9988
     C*
     C                     ENDIF
     C                     ENDIF
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
| 01-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 01-C                     END
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC04S
|    C                     MOVE *BLANK    DSC04E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DSC27S
|    C                     MOVE *BLANK    DSC27E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     MOVE 'A'       DMA54
|    C                     MOVE *BLANK    DMD06S
|    C                     MOVE *BLANK    DMD06E
|    C                     MOVE *BLANK    D#L01S
|    C                     MOVE *BLANK    D#L01E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*辦事處
| 01-C           COMP      IFEQ *BLANK
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK種類
| 02-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
| 02*C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 02-C                     END
|    C*大區域別
| 03-C           D#L01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    D#L01S
| 03-C                     END
|     *
| 04-C           D#L01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    D#L01E
| 04-C                     END
|     *
| 05-C           D#L01S    IFGT D#L01E
|   C                     SETON                     5859
|   C                     SETON                     9299
| 05-C                     END
|    C   99                GOTO END100
|    C*通路
| 06-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 06-C                     END
|    C*
| 07-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 07-C                     END
|    C*
| 08-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 08-C                     END
|    C   99                GOTO END100
|    C*
|    C*型態
| 09-C           DSC34S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC34S
| 09-C                     END
|    C*
| 10-C           DSC34E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC34E
| 10-C                     END
|    C*
| 11-C           DSC34S    IFGT DSC34E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C*客戶代號
| 12-C           DSC04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC04S
| 12-C                     END
|    C*
| 13-C           DSC04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC04E
| 13-C                     END
|    C*
| 14-C           DSC04S    IFGT DSC04E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 14-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 15-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 15-C                     END
|    C*
| 16-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 16-C                     END
|    C*
| 17-C           DSD03S    IFGT DSD03E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 17-C                     END
|    C   99                GOTO END100
|    C*
|    C*集團代號
| 18-C           DMD06S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DMD06S
| 18-C                     END
|    C*
| 19-C           DMD06E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DMD06E
| 19-C                     END
|    C*
| 20-C           DMD06S    IFGT DMD06E
|   C                     SETON                     7475
|   C                     SETON                     9299
| 20-C                     END
|    C   99                GOTO END100
|    C*
|    C*送貨日期或確認日期只輸入一項
| 21-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 22-C           DSC39S    IFNE 0
|   C                     SETON                     708999
| 22-C                     END
| 23-C           DSC39E    IFNE 0
|   C                     SETON                     718999
| 23-C                     END
| 21-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 24-C           DSC08S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 25-C           P0901O    IFEQ 'N'
|   C                     SETON                     689399
| 25-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 26-C           P0901O    IFEQ 'N'
|   C                     SETON                     699399
| 26-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08S    S001I2  60
|   C*M001M     YMDS      PARM           S001O1  60
|   C           W6        PARM           S001O1  60
|   C                     MOVE W6        HB2@F6  6
|   C                     EXSR HB@68L                     + CENTURY 6->8 LEFT
|   C                     MOVE HB2@T8    YMDS
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08E    S001I2  60
|   C*M001M     YMDE      PARM           S001O1  60
|   C           W6        PARM           S001O1  60
|   C                     MOVE W6        HB2@F6  6
|   C                     EXSR HB@68L                     + CENTURY 6->8 LEFT
|   C                     MOVE HB2@T8    YMDE
|   C**
| 27-C           YMDS      IFGT YMDE
|   C                     SETON                     6869
|   C                     SETON                     9299
| 27-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 24*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 28-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 28-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 29-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
| 29-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C*M001M     YMDS      PARM           S001O1  60
|   C           W6        PARM           S001O1  60
|   C                     MOVE W6        HB2@F6  6
|   C                     EXSR HB@68L                     + CENTURY 6->8 LEFT
|   C                     MOVE HB2@T8    YMDS
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C*M001M     YMDE      PARM           S001O1  60
|   C           W6        PARM           S001O1  60
|   C                     MOVE W6        HB2@F6  6
|   C                     EXSR HB@68L                     + CENTURY 6->8 LEFT
|   C                     MOVE HB2@T8    YMDE
|   C**
| 30-C           YMDS      IFGT YMDE
|   C                     SETON                     7071
|   C                     SETON                     9299
| 30-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 24-C                     END
|    C*
|    C*業務員
| 31-C           DSC27S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC27S
| 31-C                     END
|    C*
| 32-C           DSC27E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC27E
| 32-C                     END
|    C*
| 33-C           DSC27S    IFGT DSC27E
|   C                     SETON                     7273
|   C                     SETON                     9299
| 33-C                     END
|    C   99                GOTO END100
|    C*禮盒
| 34-C           DMA54     IFEQ 'A'
|   C                     MOVEL*LOVAL    DMA54S
|   C                     MOVEL*HIVAL    DMA54E
| 34*C                     ELSE
| 35-C           DMA54     IFEQ 'B'
|   C                     MOVEL' '       DMA54S
|   C                     MOVEL' '       DMA54E
| 35*C                     ELSE
|   C                     MOVEL'Y'       DMA54S
|   C                     MOVEL'Y'       DMA54E
| 35-C                     END
| 34-C                     END
|     *SCREEN LOG
|    C                     OPEN SOR161Z
|    C                     WRITEPH1
|    C                     CLOSESOR161Z
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*大區域別
| 02-C           D#ROW     IFEQ 7
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS037'
|   C                     PARM           D#L01S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 49
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS037'
|   C                     PARM           D#L01E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*通路
| 05-C           D#ROW     IFEQ 8
| 06-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFEQ 49
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*
| 05-C                     END
|   C*型態
| 08-C           D#ROW     IFEQ 9
| 09-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33S  1
|   C                     PARM           DSC34S
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 49
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33E  1
|   C                     PARM           DSC34E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*客戶代號
| 11-C           D#ROW     IFEQ 10
| 12-C           D#COL     IFGE 38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04S
|   C                     GOTO ENDF4
| 12-C                     END
|   C*
| 13-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS003'
|   C                     PARM           DSC04E
|   C                     GOTO ENDF4
| 13-C                     END
|   C*
| 11-C                     END
|   C*產品代號
| 14-C           D#ROW     IFEQ 11
| 15-C           D#COL     IFGE 38
|   C           D#COL     ANDLE46
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 15-C                     END
|   C*
| 16-C           D#COL     IFGE 49
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 16-C                     END
|   C*
| 14-C                     END
|   C*業務員
| 17-C           D#ROW     IFEQ 12
| 18-C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27S
|   C                     GOTO ENDF4
| 18-C                     END
|   C*
| 19-C           D#COL     IFGE 49
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS015'
|   C                     PARM           DSC27E
|   C                     GOTO ENDF4
| 19-C                     END
| 17-C                     END
|   C*
|   C*集團代號
| 20-C           D#ROW     IFEQ 13
| 21-C           D#COL     IFGE 38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS034'
|   C                     PARM           DMD06S
|   C                     GOTO ENDF4
| 21-C                     END
|   C*
| 22-C           D#COL     IFGE 49
|   C           D#COL     ANDLE50
|   C                     CALL 'WDS034'
|   C                     PARM           DMD06E
|   C                     GOTO ENDF4
| 22-C                     END
| 20-C                     END
|   C*列表機代號
| 23-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 23-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
