     F*================================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE
     F*----------------------------------------------------------------
     F*  M002     | 99.11.08 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     F*  M003     | 00.11.08 |增加大區域選項
     F*----------------------------------------------------------------
     FS#SDPF  IF  E           K        DISK
     FSOR162D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FSOR162Z O   E             39     PRINTER                        UC
     ILDA        UDS
     I                                      101 110 $USER
     I                                      101 102 $AUT
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *型態
     I                                      603 604 DSC34S
     I                                      605 606 DSC34E
      *地區
     I                                      607 608 DSC31S
     I                                      609 610 DSC31E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      611 6160YMDS
     I                                      617 6220YMDE
     I                                      623 6280DSC39S
     I                                      629 6340DSC39E
     I                                      646 654 DSD03S
     I                                      655 663 DSD03E
     I                                      664 664 COMP
      *辦事處
     I                                      671 671 COMPS
     I                                      672 672 COMPE
      *組別
     I                                      673 676 DSC28S
     I                                      677 680 DSC28E
     I                                      681 689 DSC45S
     I                                      690 698 DSC45E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
      *單瓶
     I                                      720 720 DSEL2
M003A *大區域別
M003AI                                      730 731 D#L01S
M003AI                                      732 733 D#L01E
     I                                      750 750 IN20
      *產品組別
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
M002A *集團代號
M002AI                                      800 801 DMD06S
M002AI                                      802 803 DMD06E
M001AI*
M001AI                                      850 8570YMDS8
M001AI                                      858 8650YMDE8
M001AI*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSD     KLIST
     C                     KFLD           $USER
     C                     KFLD           SD02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEA'00'      *IN,58
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
  04-C           *IN07     IFEQ '1'
    C*
  05-C           $AUT      IFNE 'RE'
    C           $AUT      ANDNE'CW'
    C*
    C                     MOVEL'SOR162C2'SD02
    C           KEYSD     CHAINSD0                  40
  06-C           *IN40     IFEQ '0'
    C           SD07      ANDEQ'Y'
    C                     CALL 'SOR162C2'
    C*
  06*C                     ELSE
    C                     SETON                     9988
    C*
  06-C                     ENDIF
  05*C                     ELSE
    C                     CALL 'SOR162C2'
  05-C                     END
  04-C                     END
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD1         $EVR
|    C                     MOVEL$USER     AUT     3
|    C*          AUT       IFNE 'D91'
|    C*          AUT       ANDNE'REP'
|    C*                    SETON                     31
|    C*                    END
|    C                     MOVE *BLANK    COMP
|    C                     MOVE *BLANK    COMPS
|    C                     MOVE *BLANK    COMPE
|    C                     MOVE *BLANK    DSC33S
|    C                     MOVE *BLANK    DSC33E
|    C                     MOVE *BLANK    DSC28S
|    C                     MOVE *BLANK    DSC28E
|    C                     MOVE *BLANK    DSC34S
|    C                     MOVE *BLANK    DSC34E
|    C                     MOVE *BLANK    DSC31S
|    C                     MOVE *BLANK    DSC31E
|    C                     MOVE *BLANK    DSC45S
|    C                     MOVE *BLANK    DSC45E
|    C                     MOVE *BLANK    DMD06S
|    C                     MOVE *BLANK    DMD06E
|    C                     Z-ADD0         DSC08S
|    C                     Z-ADD0         DSC08E
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     MOVE *BLANK    DSD03S
|    C                     MOVE *BLANK    DSD03E
|    C                     MOVE *BLANK    DMA11
|    C                     MOVE *BLANK    DMA11E
|    C                     MOVE *BLANK    DMA11S
|    C                     Z-ADD0         YMDS
|    C                     Z-ADD0         YMDE
|    C                     Z-ADD0         YMDS8
|    C                     Z-ADD0         YMDE8
|    C                     MOVEL'SCR001'  APPSCR  6
|    C                     MOVE 'A'       DSEL2
|    C                     MOVE *BLANK    D#L01S
|    C                     MOVE *BLANK    D#L01E
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C* CHK公司
| 01-C           COMP      IFEQ *BLANKS
|   C                     MOVE *LOVAL    COMPS
|   C                     MOVE *HIVAL    COMPE
| 01*C                     ELSE
|   C                     MOVE COMP      COMPS
|   C                     MOVE COMP      COMPE
| 01-C                     END
|    C*
|    C* CHK種類
| 02-C           DMA11     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DMA11S
|   C                     MOVE *HIVAL    DMA11E
| 02*C                     ELSE
|   C                     MOVE DMA11     DMA11S
|   C                     MOVE DMA11     DMA11E
| 02-C                     END
|    C*大區域別
| 03-C           D#L01S    IFEQ *BLANK
|   C                     MOVE *LOVAL    D#L01S
| 03-C                     END
| 04-C           D#L01E    IFEQ *BLANK
|   C                     MOVE *HIVAL    D#L01E
| 04-C                     END
|     *
| 05-C           D#L01S    IFGT D#L01E
|   C                     SETON                     5859
|   C                     SETON                     9299
| 05-C                     END
|    C   99                GOTO END100
|    C*產品
| 06-C           DSD03S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSD03S
| 06-C                     END
|    C*
| 07-C           DSD03E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSD03E
| 07-C                     END
|    C*
| 08-C           DSD03S    IFGT DSD03E
|   C                     SETON                     6061
|   C                     SETON                     9299
| 08-C                     END
|    C   99                GOTO END100
|    C*通路
| 09-C           DSC33S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC33S
| 09-C                     END
|     *
| 10-C           DSC33E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC33E
| 10-C                     END
|     *
| 11-C           DSC33S    IFGT DSC33E
|   C                     SETON                     6263
|   C                     SETON                     9299
| 11-C                     END
|    C   99                GOTO END100
|    C* CHK部門組別
| 12-C           DSC28S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DSC28S
| 12-C                     END
|    C*
| 13-C           DSC28E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DSC28E
| 13-C                     END
|    C*
| 14-C           DSC28S    IFGT DSC28E
|   C                     SETON                     6465
|   C                     SETON                     9299
| 14-C                     END
|    C   99                GOTO END100
|    C*型態
| 15-C           DSC34S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC34S
| 15-C                     END
|     *
| 16-C           DSC34E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC34E
| 16-C                     END
|    C*
| 17-C           DSC34S    IFGT DSC34E
|   C                     SETON                     6667
|   C                     SETON                     9299
| 17-C                     END
|    C   99                GOTO END100
|    C*地區
| 18-C           DSC31S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC31S
| 18-C                     END
|    C*
| 19-C           DSC31E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC31E
| 19-C                     END
|    C*
| 20-C           DSC31S    IFGT DSC31E
|   C                     SETON                     6869
|   C                     SETON                     9299
| 20-C                     END
|    C   99                GOTO END100
|    C*客戶代號
| 21-C           DSC45S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DSC45S
| 21-C                     END
|    C*
| 22-C           DSC45E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DSC45E
| 22-C                     END
|    C*
| 23-C           DSC45S    IFGT DSC45E
|   C                     SETON                     7475
|   C                     SETON                     9299
| 23-C                     END
|    C   99                GOTO END100
|    C*集團代號
| 24-C           DMD06S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DMD06S
| 24-C                     END
|    C*
| 25-C           DMD06E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DMD06E
| 25-C                     END
|    C*
| 26-C           DMD06S    IFGT DMD06E
|   C                     SETON                     7677
|   C                     SETON                     9299
| 26-C                     END
|    C   99                GOTO END100
|    C*送貨日期或確認日期只輸入一項
| 27-C           DSC08S    IFNE 0
|   C           DSC08E    ORNE 0
| 28-C           DSC39S    IFNE 0
|   C                     SETON                     728999
| 28-C                     END
| 29-C           DSC39E    IFNE 0
|   C                     SETON                     738999
| 29-C                     END
| 27-C                     END
|    C   99                GOTO END100
|    C*
|    C*(CHECK DATE)-日期
| 30-C           DSC08S    IFNE 0
|   C                     CALL 'P09'
|   C                     PARM DSC08S    P0901I  60
|   C                     PARM           P0901O  1
| 31-C           P0901O    IFEQ 'N'
|   C                     SETON                     709399
| 31-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC08E    P0901I  60
|   C                     PARM           P0901O  1
| 32-C           P0901O    IFEQ 'N'
|   C                     SETON                     719399
| 32-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08S    S001I2  60
|   C           YMDS      PARM           S001O1  60
|   C                     MOVE YMDS      HB2@F6  6
|   C                     EXSR HB@68L
|   C                     MOVE HB2@T8    H@8N01  80
|   C                     Z-ADDH@8N01    YMDS8
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC08E    S001I2  60
|   C           YMDE      PARM           S001O1  60
|   C                     MOVE YMDE      HB2@F6  6
|   C                     EXSR HB@68L
|   C                     MOVE HB2@T8    H@8N01  80
|   C                     Z-ADDH@8N01    YMDE8
|   C**
|   C*M001M     YMDS      IFGT YMDE
| 33-C           YMDS8     IFGT YMDE8
|   C                     SETON                     7071
|   C                     SETON                     9299
| 33-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'0'       IN20
| 30*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DSC39S    P0901I  60
|   C                     PARM           P0901O  1
| 34-C           P0901O    IFEQ 'N'
|   C                     SETON                     729399
| 34-C                     END
|   C   99                GOTO END100
|   C*
|   C                     CALL 'P09'
|   C                     PARM DSC39E    P0901I  60
|   C                     PARM           P0901O  1
| 35-C           P0901O    IFEQ 'N'
|   C                     SETON                     739399
| 35-C                     END
|   C   99                GOTO END100
|   C*日期轉換
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39S    S001I2  60
|   C           YMDS      PARM           S001O1  60
|   C                     MOVE YMDS      HB2@F6  6
|   C                     EXSR HB@68L
|   C                     MOVE HB2@T8    H@8N01  80
|   C                     Z-ADDH@8N01    YMDS8
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM DSC39E    S001I2  60
|   C           YMDE      PARM           S001O1  60
|   C                     MOVE YMDE      HB2@F6  6
|   C                     EXSR HB@68L
|   C                     MOVE HB2@T8    H@8N01  80
|   C                     Z-ADDH@8N01    YMDE8
|   C**
|   C*M001M     YMDS      IFGT YMDE
| 36-C           YMDS8     IFGT YMDE8
|   C                     SETON                     7273
|   C                     SETON                     9299
| 36-C                     END
|   C   99                GOTO END100
|   C                     MOVEL'1'       IN20
| 30-C                     END
|    C*單瓶
| 37-C           DSEL2     IFEQ *BLANK
|   C                     SETON                     659599
| 37-C                     END
|    C   99                GOTO END100
|     *SCREEN LOG
|    C                     OPEN SOR162Z
|    C                     WRITEPH1
|    C                     CLOSESOR162Z
|     *
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*大區域別
| 02-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS037'
|   C                     PARM           D#L01S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 6
|   C           D#COL     ANDGE52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS037'
|   C                     PARM           D#L01E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
|   C*產品
| 04-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03S
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 7
|   C           D#COL     ANDGE52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS001'
|   C                     PARM           DSD03E
|   C                     GOTO ENDF4
| 05-C                     END
|   C*通路
| 06-C           D#ROW     IFEQ 8
|   C           D#COL     ANDEQ40
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#ROW     IFEQ 8
|   C           D#COL     ANDEQ52
|   C                     CALL 'WDS018'
|   C                     PARM           DSC33E
|   C                     GOTO ENDF4
| 07-C                     END
|   C*型態
| 08-C           D#ROW     IFEQ 9
| 09-C           D#COL     IFGE 40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS009'
|   C                     PARM DSC33S    PSC33   1
|   C           DSC34S    PARM DSC34S    PSC34   2
|   C                     GOTO ENDF4
| 09-C                     END
|   C*
| 10-C           D#COL     IFGE 52
|   C           D#COL     ANDLE63
|   C                     CALL 'WDS009'
|   C                     PARM DSC33E    PSC33
|   C           DSC34E    PARM DSC34E    PSC34
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*地區
| 11-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31S
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 12-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE52
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS007'
|   C                     PARM           DSC31E
|   C                     GOTO ENDF4
| 12-C                     END
|   C*組別
| 13-C           D#ROW     IFEQ 11
| 14-C           D#COL     IFGE 40
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28S
|   C                     GOTO ENDF4
| 14-C                     END
|   C*
| 15-C           D#COL     IFGE 52
|   C           D#COL     ANDLE55
|   C                     CALL 'WDS016'
|   C                     PARM           DSC28E
|   C                     GOTO ENDF4
| 15-C                     END
|   C*
| 13-C                     END
|   C*客戶代號
| 16-C           D#ROW     IFEQ 12
| 17-C           D#COL     IFGE 40
|   C           D#COL     ANDLE49
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45S
|   C                     GOTO ENDF4
| 17-C                     END
|   C*
| 18-C           D#COL     IFGE 52
|   C           D#COL     ANDLE60
|   C                     CALL 'WDS003'
|   C                     PARM           DSC45E
|   C                     GOTO ENDF4
| 18-C                     END
| 16-C                     END
|   C*集團代號
| 19-C           D#ROW     IFEQ 13
| 20-C           D#COL     IFGE 40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS034'
|   C                     PARM           DMD06S
|   C                     GOTO ENDF4
| 20-C                     END
|   C*
| 21-C           D#COL     IFGE 52
|   C           D#COL     ANDLE53
|   C                     CALL 'WDS034'
|   C                     PARM           DMD06E
|   C                     GOTO ENDF4
| 21-C                     END
| 19-C                     END
|   C*
|   C*
| 22-C           D#ROW     IFEQ 20
|   C           D#COL     ANDGE41
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 22-C                     END
|    *
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
      /COPY HBP2CVTR
