     F*================================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE
     F*----------------------------------------------------------------
     F*  M002     | 99.11.08 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     F*  M003     | 00.11.08 |增加大區域選項
     F*----------------------------------------------------------------
     F*           |          |
     F*----------------------------------------------------------------
     FREWF3   IF  E           K        DISK
     F*
@@   FMTMELF  IF  E           K        DISK
@@   F            ME0                               KRENAMEME0L
     FMTMCLF  IF  E           K        DISK
     F            MC0                               KRENAMEMC0L
     FMTMEPF  IF  E           K        DISK
     F*
     FSOR165P O   E             39     PRINTER
     E*
     E                    DAY         5  4 0
     E*
     I*WF3
     I*                                              WF302 L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *組別
     I                                      646 647 DSD03S
     I                                      655 656 DSD03E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      611 6160YMDS
     I                                      617 6220YMDE
     I                                      623 6280DSC39S
     I                                      623 6260SC39S
     I                                      629 6340DSC39E
     I                                      629 6320SC39E
     I                                      681 689 DSC45S
     I                                      681 685 DSC451
     I                                      686 689 DSC452
     I                                      690 698 DSC45E
     I                                      701 7060DSC08S
     I                                      701 7040SC08S
     I                                      707 7120DSC08E
     I                                      707 7100SC08E
     I                                      750 750 IN20
     I                                      720 720 DSEL2
     I                                      664 664 COMP
     I            DS
     I                                        1   80WF303
     I                                        5   80WF303D
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C*          KEY#A     KLIST
     C*                    KFLD           #A01
     C*                    KFLD           #A02
     C*          KEY#H     KLIST
     C*                    KFLD           #H01
     C*                    KFLD           #H02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     *HEADING
     C*
     C                     EXSR RTN100                     *READE DETAIL
     C*
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*----------------------------------------------------------------
|     *
|    C                     MOVEL*BLANK    X301    2
|    C                     MOVEL*BLANK    X302    5
|     *
|    C                     SETON                     1031
|     *寫標題
|    C                     EXSR RTN3X
|     *
|     *清掉累加欄位，預防USER一直重複計算
|     *
|    C                     CLEARPT1
|    C                     CLEARPT2
|     *判斷第一次迴圈
|    C                     MOVEL'Y'       FIRST   1
|    C*清空資料
|    C                     EXSR RTN2X
|     *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|     *直接讀檔
|    C           *LOVAL    SETLLWF3
|    C                     READ WF3                      46
| 01-C           *IN46     DOWEQ'0'
|   C*
|   C*標題，判斷換頁
| 02-C           *IN39     IFEQ '1'
|   C                     SETON                     31
|   C                     EXSR RTN3X
|   C                     SETOF                     39
| 02-C                     ENDIF
|   C*先將第一個值存到變數裡
|    *
| 03-C           FIRST     IFEQ 'Y'
|   C                     MOVELWF301     X301
|   C                     MOVELWF302     X302
|   C                     MOVEL'N'       FIRST
| 03-C                     ENDIF
|   C*
|   C*累加到PT1
| 04-C           WF302     IFNE X302
|   C           WF301     ORNE X301
|   C                     EXSR RTN4X
| 04-C                     ENDIF
|    *
|   C*值一改變，便寫到畫面
| 05-C           WF301     IFNE X301
|   C           WF302     ORNE X302
|   C                     WRITEPD1
|   C                     SETOF                     31
|   C                     EXSR RTN2X
| 05-C                     ENDIF
|    *
|   C*當客戶更換時寫小計的部份
| 07-C           WF302     IFNE X302
|   C                     EXSR RTN200
|   C                     SETON                     31
| 07-C                     ENDIF
|   C*排放客戶名稱
|   C                     MOVELWF301     WF01
|   C                     MOVELWF302     WF02
|   C*客戶名稱
|   C           WF02      CHAINME0                  40
|   C   40                MOVEL*BLANK    WF02N
|   C  N40                MOVELME04      WF02N
|   C*
|   C*----------------------------------------------------------------
| 06-C                     SELEC
|   C*----------------------------------------------------------------
|   C*第一個工作天
|   C           WF303D    WHEQ DAY1
|   C                     Z-ADDWF304     WX01
|   C                     Z-ADDWF305     WX02
|   C                     Z-ADDWF306     WX03
|   C                     Z-ADDWF307     WX04
|   C                     Z-ADDWF310     WX05
|   C                     Z-ADDWF311     WX06
|   C                     Z-ADDWF312     WX07
|   C*第二個工作天
|   C           WF303D    WHEQ DAY2
|   C                     Z-ADDWF304     WX08
|   C                     Z-ADDWF305     WX09
|   C                     Z-ADDWF306     WX10
|   C                     Z-ADDWF307     WX11
|   C                     Z-ADDWF310     WX12
|   C                     Z-ADDWF311     WX13
|   C                     Z-ADDWF312     WX14
|   C*第三個工作天
|   C           WF303D    WHEQ DAY3
|   C                     Z-ADDWF304     WX15
|   C                     Z-ADDWF305     WX16
|   C                     Z-ADDWF306     WX17
|   C                     Z-ADDWF307     WX18
|   C                     Z-ADDWF310     WX19
|   C                     Z-ADDWF311     WX20
|   C                     Z-ADDWF312     WX21
|   C*第四個工作天
|   C           WF303D    WHEQ DAY4
|   C                     Z-ADDWF304     WX22
|   C                     Z-ADDWF305     WX23
|   C                     Z-ADDWF306     WX24
|   C                     Z-ADDWF307     WX25
|   C                     Z-ADDWF310     WX26
|   C                     Z-ADDWF311     WX27
|   C                     Z-ADDWF312     WX28
|   C*第五個工作天
|   C           WF303D    WHEQ DAY5
|   C                     Z-ADDWF304     WX29
|   C                     Z-ADDWF305     WX30
|   C                     Z-ADDWF306     WX31
|   C                     Z-ADDWF307     WX32
|   C                     Z-ADDWF310     WX33
|   C                     Z-ADDWF311     WX34
|   C                     Z-ADDWF312     WX35
|   C*
| 06-C                     ENDSL
|   C*
|   C                     MOVELWF301     X301
|   C                     MOVELWF302     X302
|    *
|   C                     READ WF3                      46
| 01-C                     ENDDO
|    C*
|     *寫最後一筆資料，有資料才會搬到X301
| 08-C           X301      IFNE *BLANK
|   C                     EXSR RTN4X
|   C                     SETON                     31
|   C                     WRITEPD1
|   C*                    WRITEPT1
|   C                     EXSR RTN200
|   C                     WRITEPT2
| 08-C                     ENDIF
|    C*
|    C                     SETON                     LR
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C                     WRITEPT1
|    C*
|    C                     ADD  WX01S     WX01T
|    C                     ADD  WX02S     WX02T
|    C                     ADD  WX03S     WX03T
|    C                     ADD  WX04S     WX04T
|    C                     ADD  WX05S     WX05T
|    C                     ADD  WX06S     WX06T
|    C                     ADD  WX07S     WX07T
|    C                     ADD  WX08S     WX08T
|    C                     ADD  WX09S     WX09T
|    C                     ADD  WX10S     WX10T
|    C                     ADD  WX11S     WX11T
|    C                     ADD  WX12S     WX12T
|    C                     ADD  WX13S     WX13T
|    C                     ADD  WX14S     WX14T
|    C                     ADD  WX15S     WX15T
|    C                     ADD  WX16S     WX16T
|    C                     ADD  WX17S     WX17T
|    C                     ADD  WX18S     WX18T
|    C                     ADD  WX19S     WX19T
|    C                     ADD  WX20S     WX20T
|    C                     ADD  WX21S     WX21T
|    C                     ADD  WX22S     WX22T
|    C                     ADD  WX23S     WX23T
|    C                     ADD  WX24S     WX24T
|    C                     ADD  WX25S     WX25T
|    C                     ADD  WX26S     WX26T
|    C                     ADD  WX27S     WX27T
|    C                     ADD  WX28S     WX28T
|    C                     ADD  WX29S     WX29T
|    C                     ADD  WX30S     WX30T
|    C                     ADD  WX31S     WX31T
|    C                     ADD  WX32S     WX32T
|    C                     ADD  WX33S     WX33T
|    C                     ADD  WX34S     WX34T
|    C                     ADD  WX35S     WX35T
|    C                     Z-ADD0         WX01S
|    C                     Z-ADD0         WX02S
|    C                     Z-ADD0         WX03S
|    C                     Z-ADD0         WX04S
|    C                     Z-ADD0         WX05S
|    C                     Z-ADD0         WX06S
|    C                     Z-ADD0         WX07S
|    C                     Z-ADD0         WX08S
|    C                     Z-ADD0         WX09S
|    C                     Z-ADD0         WX10S
|    C                     Z-ADD0         WX11S
|    C                     Z-ADD0         WX12S
|    C                     Z-ADD0         WX13S
|    C                     Z-ADD0         WX14S
|    C                     Z-ADD0         WX15S
|    C                     Z-ADD0         WX16S
|    C                     Z-ADD0         WX17S
|    C                     Z-ADD0         WX18S
|    C                     Z-ADD0         WX19S
|    C                     Z-ADD0         WX20S
|    C                     Z-ADD0         WX21S
|    C                     Z-ADD0         WX22S
|    C                     Z-ADD0         WX23S
|    C                     Z-ADD0         WX24S
|    C                     Z-ADD0         WX25S
|    C                     Z-ADD0         WX26S
|    C                     Z-ADD0         WX27S
|    C                     Z-ADD0         WX28S
|    C                     Z-ADD0         WX29S
|    C                     Z-ADD0         WX30S
|    C                     Z-ADD0         WX31S
|    C                     Z-ADD0         WX32S
|    C                     Z-ADD0         WX33S
|    C                     Z-ADD0         WX34S
|    C                     Z-ADD0         WX35S
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN1X....WRITE DAY
      *==============================================================*
04===C           RTN1X     BEGSR
|    C*
| 01-C           SC8S      DO   SC8E
| 02-C                     SELEC
|   C           DAY1      WHEQ 0
|   C                     Z-ADDSC8S      DAY1
|   C           DAY2      WHEQ 0
|   C                     Z-ADDSC8S      DAY2
|   C           DAY3      WHEQ 0
|   C                     Z-ADDSC8S      DAY3
|   C           DAY4      WHEQ 0
|   C                     Z-ADDSC8S      DAY4
|   C           DAY5      WHEQ 0
|   C                     Z-ADDSC8S      DAY5
| 02-C                     ENDSL
|   C                     ADD  1         SC8S
| 01-C                     ENDDO
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN2X....CLEAN WX1
      *==============================================================*
05===C           RTN2X     BEGSR
|    C*
|    C*
|    C                     Z-ADD0         WX01
|    C                     Z-ADD0         WX02
|    C                     Z-ADD0         WX03
|    C                     Z-ADD0         WX04
|    C                     Z-ADD0         WX05
|    C                     Z-ADD0         WX06
|    C                     Z-ADD0         WX07
|    C                     Z-ADD0         WX08
|    C                     Z-ADD0         WX09
|    C                     Z-ADD0         WX10
|    C                     Z-ADD0         WX11
|    C                     Z-ADD0         WX12
|    C                     Z-ADD0         WX13
|    C                     Z-ADD0         WX14
|    C                     Z-ADD0         WX15
|    C                     Z-ADD0         WX16
|    C                     Z-ADD0         WX17
|    C                     Z-ADD0         WX18
|    C                     Z-ADD0         WX19
|    C                     Z-ADD0         WX20
|    C                     Z-ADD0         WX21
|    C                     Z-ADD0         WX22
|    C                     Z-ADD0         WX23
|    C                     Z-ADD0         WX24
|    C                     Z-ADD0         WX25
|    C                     Z-ADD0         WX26
|    C                     Z-ADD0         WX27
|    C                     Z-ADD0         WX28
|    C                     Z-ADD0         WX29
|    C                     Z-ADD0         WX30
|    C                     Z-ADD0         WX31
|    C                     Z-ADD0         WX32
|    C                     Z-ADD0         WX33
|    C                     Z-ADD0         WX34
|    C                     Z-ADD0         WX35
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN3X....WRITE PH1
      *==============================================================*
06===C           RTN3X     BEGSR
|    C*
| 01-C           COMP      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 01*C                     ELSE
| 02-C           COMP      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 02*C                     ELSE
| 03-C           COMP      IFEQ '3'
|   C                     MOVEL'高雄'  COMPC
| 03*C                     ELSE
|   C                     MOVEL'全部'  COMPC
| 03-C                     END
| 02-C                     END
| 01-C                     END
| 04-C           IN20      IFEQ '0'
|   C                     SETOF                     20
| 04*C                     ELSE
|   C                     SETON                     20
| 04-C                     END
|    C*禮盒
|    C                     SETOF                     22
| 05-C           DSEL2     IFEQ 'A'
|   C                     SETOF                     22
| 05*C                     ELSE
|   C                     SETON                     22
| 05-C                     END
|    C                     MOVE DSC451    ME01
|    C                     MOVE DSC452    ME02
|    C           KEYME     CHAINME0L                 41
|    C  N41                MOVE ME04      DSC46S
|    C   41                MOVE *BLANK    DSC46S
|    C  N41      ME15      CHAINMC0L                 41
|    C  N41                MOVE MC02      DSC27S
|    C   41                MOVE *BLANK    DSC27S
|     *
|     *日期，一次擺5天
|    C*----------------------------------------------------------------
| 06-C           DSC08S    IFNE 0
|   C                     Z-ADDSC08S     SC8S    40
|   C                     Z-ADDSC08E     SC8E    40
|   C                     EXSR RTN1X
| 06-C                     ENDIF
|    C*----------------------------------------------------------------
| 07-C           DSC39S    IFNE 0
|   C                     Z-ADDSC39S     SC8S    40
|   C                     Z-ADDSC39E     SC8E    40
|   C                     EXSR RTN1X
| 07-C                     ENDIF
|    C*----------------------------------------------------------------
|     *
|    C                     WRITEPH1
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN4X....WRITE PT1
      *==============================================================*
07===C           RTN4X     BEGSR
|    C*
|    C                     ADD  WX01      WX01S
|    C                     ADD  WX02      WX02S
|    C                     ADD  WX03      WX03S
|    C                     ADD  WX04      WX04S
|    C                     ADD  WX05      WX05S
|    C                     ADD  WX06      WX06S
|    C                     ADD  WX07      WX07S
|    C                     ADD  WX08      WX08S
|    C                     ADD  WX09      WX09S
|    C                     ADD  WX10      WX10S
|    C                     ADD  WX11      WX11S
|    C                     ADD  WX12      WX12S
|    C                     ADD  WX13      WX13S
|    C                     ADD  WX14      WX14S
|    C                     ADD  WX15      WX15S
|    C                     ADD  WX16      WX16S
|    C                     ADD  WX17      WX17S
|    C                     ADD  WX18      WX18S
|    C                     ADD  WX19      WX19S
|    C                     ADD  WX20      WX20S
|    C                     ADD  WX21      WX21S
|    C                     ADD  WX22      WX22S
|    C                     ADD  WX23      WX23S
|    C                     ADD  WX24      WX24S
|    C                     ADD  WX25      WX25S
|    C                     ADD  WX26      WX26S
|    C                     ADD  WX27      WX27S
|    C                     ADD  WX28      WX28S
|    C                     ADD  WX29      WX29S
|    C                     ADD  WX30      WX30S
|    C                     ADD  WX31      WX31S
|    C                     ADD  WX32      WX32S
|    C                     ADD  WX33      WX33S
|    C                     ADD  WX34      WX34S
|    C                     ADD  WX35      WX35S
|    C*
07===C                     ENDSR
