     F*================================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE
     F*----------------------------------------------------------------
     F*  M002     | 99.11.08 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     F*  M003     | 00.11.08 |增加大區域選項
     F*----------------------------------------------------------------
     F*           |          |
     F*----------------------------------------------------------------
     FREWF37  IP  E           K        DISK
     FRWF371  UF  E           K        DISK                      A
     FPA#BPF  IF  E           K        DISK
M002AFPA#APF  IF  E           K        DISK
     FPA#HPF  IF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
M003AFPA#LPF  IF  E           K        DISK
@@   FMTMELF  IF  E           K        DISK
@@   F            ME0                               KRENAMEME0L
@@   FMTMCLF  IF  E           K        DISK
@@   F            MC0                               KRENAMEMC0L
     FSOR162P O   E             39     PRINTER
     E*
     IWF370
     I                                              WF3711L4
     I                                              WF3712L3
     I                                              WF3701L2
     I                                              WF3702L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
      *通路
     I                                      601 601 DSC33S
     I                                      602 602 DSC33E
      *型態
     I                                      603 604 DSC34S
     I                                      605 606 DSC34E
      *地區
     I                                      607 608 DSC31S
     I                                      609 610 DSC31E
      *組別
     I                                      673 676 DSC28S
     I                                      677 680 DSC28E
     I                                      646 654 DSD03S
     I                                      655 663 DSD03E
      *SELECT起迄日期
      *YY/MM/DD
     I                                      611 6160YMDS
     I                                      617 6220YMDE
     I                                      623 6280DSC39S
     I                                      629 6340DSC39E
     I                                      681 689 DSC45S
@@   I                                      681 685 DSC451
@@   I                                      686 689 DSC452
     I                                      690 698 DSC45E
     I                                      701 7060DSC08S
     I                                      707 7120DSC08E
     I                                      750 750 IN20
     I                                      720 720 DSEL2
     I                                      664 664 COMP
      *種類
     I                                      797 797 DMA11
     I                                      798 798 DMA11S
     I                                      799 799 DMA11E
M002A *集團代號
M002AI                                      800 801 DMD06S
M002AI                                      802 803 DMD06E
M003A *大區域別
M003AI                                      730 731 D#L01S
M003AI                                      732 733 D#L01E
     I            DS
     I                                        1   9 WF3701
     I                                        3   4 W3701L
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#H     KLIST
     C                     KFLD           #H01
     C                     KFLD           #H02
     C           KEYME     KLIST
     C                     KFLD           ME01
     C                     KFLD           ME02
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEYW3     KLIST
     C                     KFLD           WF301
     C                     KFLD           WF302
     C                     KFLD           WF304
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL2 10                EXSR RTN200
     CL3 10                EXSR RTN300
     CL4 10                EXSR RTN400
     CLR                   EXSR RTN500
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
| 01-C           COMP      IFEQ '1'
|   C                     MOVEL'台北'  COMPC
| 01*C                     ELSE
| 02-C           COMP      IFEQ '2'
|   C                     MOVEL'台中'  COMPC
| 02*C                     ELSE
| 03-C           COMP      IFEQ '3'
|   C                     MOVEL'高雄'  COMPC
| 03*C                     ELSE
|   C                     MOVEL'全部'  COMPC
| 03-C                     END
| 02-C                     END
| 01-C                     END
| 04-C           IN20      IFEQ '0'
|   C                     SETOF                     20
| 04*C                     ELSE
|   C                     SETON                     20
| 04-C                     END
|    C*種類
|    C                     MOVEL*BLANKS   GROUP
| 05-C           DMA11     IFEQ '1'
|   C                     MOVEL'白蘭地'GROUP
| 05*C                     ELSE
| 06-C           DMA11     IFEQ '2'
|   C                     MOVEL'威士忌'GROUP
| 06*C                     ELSE
| 07-C           DMA11     IFEQ '3'
|   C                     MOVEL'葡萄酒'GROUP
| 07*C                     ELSE
|   C                     MOVEL'全部'  GROUP
| 07-C                     END
| 06-C                     END
| 05-C                     END
|    C*禮盒
|    C                     SETOF                     22
| 08-C           DSEL2     IFEQ 'A'
|   C                     SETOF                     22
| 08*C                     ELSE
|   C                     SETON                     22
| 08-C                     END
|    C                     MOVE DSC451    ME01
|    C                     MOVE DSC452    ME02
|    C           KEYME     CHAINME0L                 41
|    C  N41                MOVE ME04      DSC46S
|    C   41                MOVE *BLANK    DSC46S
|    C  N41      ME15      CHAINMC0L                 41
|    C  N41                MOVE MC02      DSC27S
|    C   41                MOVE *BLANK    DSC27S
|    C                     MOVEL'CUSTGRP' #A01
|    C                     MOVELDMD06S    #A02
|    C           KEY#A     CHAIN#A0                  42
| 09-C           *IN42     IFEQ '0'
|   C                     MOVEL#A03      D#A03S
| 09*C                     ELSE
|   C                     MOVE *BLANKS   D#A03S
| 09-C                     END
|    C                     MOVEL'CUSTGRP' #A01
|    C                     MOVELDMD06E    #A02
|    C           KEY#A     CHAIN#A0                  42
| 10-C           *IN42     IFEQ '0'
|   C                     MOVEL#A03      D#A03E
| 10*C                     ELSE
|   C                     MOVE *BLANKS   D#A03E
| 10-C                     END
|    C*
|    C           D#L01S    CHAIN#L0                  50
| 11-C           *IN50     IFEQ '0'
|   C                     MOVEL#L02      D#L02S
| 11*C                     ELSE
|   C                     MOVE *BLANKS   D#L02S
| 11-C                     END
|    C*
|    C           D#L01E    CHAIN#L0                  51
| 12-C           *IN51     IFEQ '0'
|   C                     MOVEL#L02      D#L02E
| 12*C                     ELSE
|   C                     MOVE *BLANKS   D#L02E
| 12-C                     END
|    C                     WRITEPH1
     C*
     C                     Z-ADD0         WF306
     C                     Z-ADD0         WF307
     C                     Z-ADD0         WF308
     C                     Z-ADD0         WF309
     C                     Z-ADD0         WF310
     C                     Z-ADD0         WF311
     C                     Z-ADD0         WF312
     C                     Z-ADD0         WF313
     C                     Z-ADD0         WF314
     C                     Z-ADD0         WF315
     C                     Z-ADD0         WF316
     C                     Z-ADD0         WF316
     C                     Z-ADD0         WF317
|     *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     Z-ADD0         MA15C   63
|    C                     Z-ADD0         TQTY1   60
|    C                     Z-ADD0         TQTY2   60
|    C                     Z-ADD0         TQTY3   60
|    C*產品
|    C           WF3701    CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   MA03
| 01*C                     ELSE
|   C           MA15      MULT MA16      MA15C
| 01-C                     END
|     *
|    C*GET標準容積
|    C                     MOVEL'STANDARD'#H01
|    C                     MOVELW3701L    #H02
|    C           KEY#H     CHAIN#H0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     Z-ADD0         DCASE   52
| 02*C                     ELSE
|   C                     Z-ADD#H03      DCASE   52
| 02-C                     END
|    C*公司
|    C           WF3702    CHAIN#B0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANKS   #B03
| 03-C                     END
|     *
|    C           WF3701    CHAINMA0                  40
|    C*訂購實際及標準箱數之計算QTY1,ASE1
|    C           WF3703    SUB  WF3707    TQTY1   60
|    C                     Z-ADD0         TCASE1 153
|    C           TQTY1     MULT MA15      TCASE1
|    C*                    ADD  TCASE1    W1CAS1 173
|    C*                    ADD  TCASE1    W2CAS1 173
|    C*                    ADD  TCASE1    W3CAS1 173
|    C*                    ADD  TCASE1    W4CAS1 173
|    C*                    ADD  QTY1      T1QTY1
|    C*                    ADD  QTY1      T2QTY1
|    C*                    ADD  QTY1      T3QTY1
|    C*                    ADD  QTY1      T4QTY1
|    C*搭贈實際及標準箱數之計算QTY2,CASE2
|    C           WF3704    SUB  WF3708    TQTY2
|    C                     Z-ADD0         TCASE2 153
|    C           TQTY2     MULT MA15      TCASE2
|    C*                    ADD  TCASE2    W1CAS2 173
|    C*                    ADD  TCASE2    W2CAS2 173
|    C*                    ADD  TCASE2    W3CAS2 173
|    C*                    ADD  TCASE2    W4CAS2 173
|    C*                    ADD  QTY2      T1QTY2
|    C*                    ADD  QTY2      T2QTY2
|    C*                    ADD  QTY2      T3QTY2
|    C*                    ADD  QTY2      T4QTY2
|    C*試飲實際及標準箱數之計算QTY3,CASE3
|    C           WF3705    SUB  WF3709    TQTY3
|    C                     Z-ADD0         TCASE3 153
|    C           TQTY3     MULT MA15      TCASE3
|    C*                    ADD  TCASE3    W1CAS3 173
|    C*                    ADD  TCASE3    W2CAS3 173
|    C*                    ADD  TCASE3    W3CAS3 173
|    C*                    ADD  TCASE3    W4CAS3 173
|    C*                    ADD  QTY3      T1QTY3
|    C*                    ADD  QTY3      T2QTY3
|    C*                    ADD  QTY3      T3QTY3
|    C*                    ADD  QTY3      T4QTY3
|    C*
|    C*實際金額之計算QTY4
|    C           WF3706    SUB  WF3710    QTY4
|    C                     ADD  QTY4      T1QTY4
|    C                     ADD  QTY4      T2QTY4
|    C                     ADD  QTY4      T3QTY4
|    C                     ADD  QTY4      T4QTY4
|     *標準箱數
| 04-C           DCASE     IFNE 0
|   C           TCASE1    DIV  DCASE     CASE1     H
|   C           TCASE2    DIV  DCASE     CASE2     H
|   C           TCASE3    DIV  DCASE     CASE3     H
| 04-C                     END
|    C*
|     *實際箱數
| 05-C           DCASE     IFNE 0
|   C           TCASE1    DIV  MA15C     QTY1      H
|   C           TCASE2    DIV  MA15C     QTY2      H
|   C           TCASE3    DIV  MA15C     QTY3      H
| 05-C                     END
|    C*
     C                     CLEARWF30
     C                     MOVELW3701L    WF301
     C                     MOVELWF3701    WF302
     C                     MOVELMA03      WF303
     C                     MOVELWF3702    WF304
     C  N40                MOVEL#B03      WF305
     C           KEYW3     CHAINWF30                 44
     C                     Z-ADDWF3703    WF306
     C                     Z-ADDWF3704    WF307
     C                     Z-ADDWF3705    WF308
     C                     Z-ADDWF3706    WF309
     C                     Z-ADDWF3707    WF310
     C                     Z-ADDWF3708    WF311
     C                     Z-ADDWF3709    WF312
     C                     Z-ADDWF3710    WF313
     C                     Z-ADDQTY1      WF314
     C                     Z-ADDQTY2      WF315
     C                     Z-ADDQTY3      WF316
     C                     Z-ADDQTY4      WF317
|    C*
|    C   44                WRITEWF30
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPD1
|    C                     SETOF                     21
|    C                     SETON                     30
|    C                     ADD  WF3703    T13703
|    C                     ADD  WF3704    T13704
|    C                     ADD  WF3705    T13705
|    C                     ADD  WF3706    T13706
|    C                     ADD  WF3707    T13707
|    C                     ADD  WF3708    T13708
|    C                     ADD  WF3709    T13709
|    C                     ADD  WF3710    T13710
|    C                     ADD  CASE1     T1CAS1
|    C                     ADD  CASE2     T1CAS2
|    C                     ADD  CASE3     T1CAS3
|    C                     ADD  QTY1      T1QTY1
|    C                     ADD  QTY2      T1QTY2
|    C                     ADD  QTY3      T1QTY3
|    C                     Z-ADD0         CASE1
|    C                     Z-ADD0         CASE2
|    C                     Z-ADD0         CASE3
|    C                     Z-ADD0         QTY1
|    C                     Z-ADD0         QTY2
|    C                     Z-ADD0         QTY3
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN200....WRITE PT1   SUBTOTAL
      *==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT1
|    C                     SETOF                     30
|    C                     SETON                     21
|    C                     ADD  T13703    T23703
|    C                     ADD  T13704    T23704
|    C                     ADD  T13705    T23705
|    C                     ADD  T13706    T23706
|    C                     ADD  T13707    T23707
|    C                     ADD  T13708    T23708
|    C                     ADD  T13709    T23709
|    C                     ADD  T13710    T23710
|    C                     ADD  T1CAS1    T2CAS1
|    C                     ADD  T1CAS2    T2CAS2
|    C                     ADD  T1CAS3    T2CAS3
|    C                     ADD  T1QTY1    T2QTY1
|    C                     ADD  T1QTY2    T2QTY2
|    C                     ADD  T1QTY3    T2QTY3
|    C                     Z-ADD0         T13703
|    C                     Z-ADD0         T13704
|    C                     Z-ADD0         T13705
|    C                     Z-ADD0         T13706
|    C                     Z-ADD0         T13707
|    C                     Z-ADD0         T13708
|    C                     Z-ADD0         T13709
|    C                     Z-ADD0         T13710
|    C                     Z-ADD0         T1CAS1
|    C                     Z-ADD0         T1CAS2
|    C                     Z-ADD0         T1CAS3
|    C                     Z-ADD0         T1QTY1
|    C                     Z-ADD0         T1QTY2
|    C                     Z-ADD0         T1QTY3
|    C                     Z-ADD0         T1QTY4
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN300....WRITE PT2   SUBTOTAL
      *==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT2
|    C                     ADD  T23703    T33703
|    C                     ADD  T23704    T33704
|    C                     ADD  T23705    T33705
|    C                     ADD  T23706    T33706
|    C                     ADD  T23707    T33707
|    C                     ADD  T23708    T33708
|    C                     ADD  T23709    T33709
|    C                     ADD  T23710    T33710
|    C                     ADD  T2CAS1    T3CAS1
|    C                     ADD  T2CAS2    T3CAS2
|    C                     ADD  T2CAS3    T3CAS3
|    C                     ADD  T2QTY1    T3QTY1
|    C                     ADD  T2QTY2    T3QTY2
|    C                     ADD  T2QTY3    T3QTY3
|    C                     Z-ADD0         T23703
|    C                     Z-ADD0         T23704
|    C                     Z-ADD0         T23705
|    C                     Z-ADD0         T23706
|    C                     Z-ADD0         T23707
|    C                     Z-ADD0         T23708
|    C                     Z-ADD0         T23709
|    C                     Z-ADD0         T23710
|    C                     Z-ADD0         T2CAS1
|    C                     Z-ADD0         T2CAS2
|    C                     Z-ADD0         T2CAS3
|    C                     Z-ADD0         T2QTY1
|    C                     Z-ADD0         T2QTY2
|    C                     Z-ADD0         T2QTY3
|    C                     Z-ADD0         T2QTY4
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN400....WRITE PT3   SUBTOTAL
      *==============================================================*
05===C           RTN400    BEGSR
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT3
|    C                     ADD  T33703    T43703
|    C                     ADD  T33704    T43704
|    C                     ADD  T33705    T43705
|    C                     ADD  T33706    T43706
|    C                     ADD  T33707    T43707
|    C                     ADD  T33708    T43708
|    C                     ADD  T33709    T43709
|    C                     ADD  T33710    T43710
|    C                     ADD  T3CAS1    T4CAS1
|    C                     ADD  T3CAS2    T4CAS2
|    C                     ADD  T3CAS3    T4CAS3
|    C                     ADD  T3QTY1    T4QTY1
|    C                     ADD  T3QTY2    T4QTY2
|    C                     ADD  T3QTY3    T4QTY3
|    C                     Z-ADD0         T33703
|    C                     Z-ADD0         T33704
|    C                     Z-ADD0         T33705
|    C                     Z-ADD0         T33706
|    C                     Z-ADD0         T33707
|    C                     Z-ADD0         T33708
|    C                     Z-ADD0         T33709
|    C                     Z-ADD0         T33710
|    C                     Z-ADD0         T3CAS1
|    C                     Z-ADD0         T3CAS2
|    C                     Z-ADD0         T3CAS3
|    C                     Z-ADD0         T3QTY1
|    C                     Z-ADD0         T3QTY2
|    C                     Z-ADD0         T3QTY3
|    C                     Z-ADD0         T3QTY4
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN500....WRITE PT4   SUBTOTAL
      *==============================================================*
06===C           RTN500    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE9
| 01*C                     ELSE
|   C*
|   C   39                EXSR RTN900
|   C                     WRITEPT4
|   C                     SETOF                     31
|   C                     Z-ADD0         T43703
|   C                     Z-ADD0         T43704
|   C                     Z-ADD0         T43705
|   C                     Z-ADD0         T43706
|   C                     Z-ADD0         T43707
|   C                     Z-ADD0         T43708
|   C                     Z-ADD0         T43709
|   C                     Z-ADD0         T43710
|   C                     Z-ADD0         T4CAS1
|   C                     Z-ADD0         T4CAS2
|   C                     Z-ADD0         T4CAS3
|   C                     Z-ADD0         T4QTY1
|   C                     Z-ADD0         T4QTY2
|   C                     Z-ADD0         T4QTY3
|   C                     Z-ADD0         T4QTY4
| 01-C                     END
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
|     *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     30
|    C                     SETOF                     21
|     *
07===C                     ENDSR
