      * CALL PUBPF4 PARMETER
     C           F4PARM    PLIST
     C                     PARM           APPPGM 10
     C                     PARM           APPSCR  6
     C                     PARM           D#ROW
     C                     PARM           D#COL
     C                     PARM           N       30
     C                     PARM           APPDTA 20
