     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : TRANSOBA                                   *
     A*    AUTHOR       :                                            *
     A*    DATE WRITTEN :                                            *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :　　　　　　　                            *
     A*    SUBSYSTEM    :轉檔程式　　                              *
     A*    REMARK       :                                            *
     A****************************************************************
     FSOSBLF1 UP  E                    DISK
     FMTMAPF  IF  E           K        DISK
     I*
     I           UDS
     I                                      201 2080DATE
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYMA     KLIST
     C                     KFLD           SB02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           KEYMA     CHAINMA0                  40
     C*
  01-C           *IN40     IFEQ '0'
    C*
    C                     Z-ADD0         DMA41   90
    C                     Z-ADD0         SB06F
    C                     Z-ADD0         PRICE
    C*
  02-C           DATE      IFLE SB05
    C                     Z-ADDSB05      WDATE   80
  02*C                     ELSE
    C                     Z-ADDDATE      WDATE
  02-C                     END
    C*
  03-C           WDATE     IFLT MA39
    C                     MOVE MA41      DMA41
  03*C                     ELSE
    C                     MOVE MA46      DMA41
  03-C                     END
    C*
  04-C           SB04      IFEQ 'N'
    C           DMA41     ANDNE0
    C*(1-舊折扣率)*零售價=售價
    C           1         SUB  SB06      SB06F   44H
    C           DMA41     MULT SB06F     PRICE   90H
    C*售價/零售價= SB06A
    C* 1-SB06A =SB06(折扣率)
    C           PRICE     DIV  DMA41     SB06A   66H
    C           1         SUB  SB06A     SB06
  04-C                     END
    C*
    C                     UPDATSB0
  01-C                     END
