     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : TRANSOSA                                   *
     A*    AUTHOR       :                                            *
     A*    DATE WRITTEN :                                            *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :　　　　　　　                            *
     A*    SUBSYSTEM    :轉檔程式　　                              *
     A*    REMARK       :                                            *
     A****************************************************************
     FSOSAPF1 UP  E                    DISK
     FSOSAPF1@O   E                    DISK
     FMTMAPF  IF  E           K        DISK
     I*
     I           UDS
     I                                      201 2080DATE
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYMA     KLIST
     C                     KFLD           SA01
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           KEYMA     SETLLMA0
     C           KEYMA     CHAINMA0                  40
     C*
  01-C           *IN40     IFEQ '0'
    C*
    C                     Z-ADD0         DMA41   90
    C                     Z-ADD0         DMA42   90
    C                     Z-ADD0         SA06F
    C                     Z-ADD0         PRICE
    C                     Z-ADD0         SA06A
    C*
  02-C           DATE      IFLE SA05
    C                     Z-ADDSA05      WDATE   80
  02*C                     ELSE
    C                     Z-ADDDATE      WDATE
  02-C                     END
  03-C           WDATE     IFLT MA39
    C                     MOVE MA41      DMA41
  03*C                     ELSE
    C                     MOVE MA46      DMA41
  03-C                     END
    C*
  04-C           SA04      IFNE 'A'
    C           DMA41     ANDNE0
    C*(1-舊折扣率) *零售價=售價
    C           1         SUB  SA06      SA06F   66H
    C           DMA41     MULT SA06F     PRICE   90H
    C*售價/零售價= SA06A
    C* 1-SA06A =SA06(折扣率)
    C           PRICE     DIV  DMA41     SA06A   66H
    C           1         SUB  SA06A     SA06A
    C                     Z-ADDSA06A     SA06
  04-C                     END
    C*
    C                     MOVELMA01      SA01@
    C                     MOVELSA01      SA011@
    C                     Z-ADDSA06      SA06@
    C                     Z-ADDSA05      SA05@
    C                     Z-ADDMA39      MA39@
    C                     Z-ADDMA45      MA45@
    C                     Z-ADDMA40      MA40@
    C                     UPDATSA0
    C                     WRITESA@1
  01-C                     END
