     ******************************************************************
     **                                                              **
     ******************************************************************
      *
     FSOSCPF  IP  E           K        DISK
     FSOSDPF  UF  E           K        DISK
      *
      ****************************************************************
      *
     I            DS
     I                                        1   5 SC04
     I                                        1   1 DSC04
     I            DS
     I                                        1   9 SD03
     I                                        1   1 DSD03
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*          KEYIA     KLIST
     C*                    KFLD           DIA01   1
     C*                    KFLD           X103
     C*                    KFLD           X101
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C           SC01      IFEQ 'R1'
     C           SC03      ANDEQ'S2'
      *
     C           SC02      SETLLSD0
     C           SC02      READESD0                      46
     C           *IN46     DOWEQ'0'
      *
     C           SD04      IFNE 0
     C           SD07      DIV  SD04      SD06
     C           SD07      DIV  SD04      SD08
     C                     ELSE
     C                     Z-ADD0         SD06
     C                     Z-ADD0         SD08
     C                     ENDIF
     C                     UPDATSD0
      *
     C           SC02      READESD0                      46
     C                     ENDDO
     C                     ENDIF
      *
