     ******************************************************************
     **                                                              **
     ******************************************************************
      *
     FSOSDLF02UF  E           K        DISK
     FW2BBLF04UF  E           K        DISK
     FMTMAPF  IF  E           K        DISK
     FTRF008P O   E             39     PRINTER
      *
      ****************************************************************
     I*
     I            DS
     I                                        1   9 BB03
     I                                        1   1 BB03A
     I            DS
     I                                        1  12 SD02
     I                                        1   4 SD02A
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSD     KLIST
     C                     KFLD           SD01
     C                     KFLD           BB03
     C                     MOVEL'R1'      SD01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C                     MOVEL*BLANK    TBB03   9
     C                     Z-ADD0         TBB08   92
     C           *LOVAL    SETLLBB0
     C                     READ BB0                      45
     C           *IN45     DOWEQ'0'
     C*
     C           BB03A     IFNE 'S'
     C                     GOTO $NEXT
     C                     ENDIF
     C*
     C           BB03      IFNE TBB03
     C                     MOVELBB03      TBB03
     C                     Z-ADDBB08      TBB08
     C*
     C           KEYSD     SETLLSD0
     C           KEYSD     READESD0                      46
     C           *IN46     DOWEQ'0'
     C           SD02A     IFNE 'R1S2'
     C                     GOTO $NEXTS
     C                     ENDIF
     C                     Z-ADDTBB08     SD10
     C                     Z-ADDTBB08     SD22
     C                     UPDATSD0
     C           $NEXTS    TAG
     C           KEYSD     READESD0                      46
     C                     ENDDO
     C*
     C                     ENDIF
     C*
     C                     Z-ADDTBB08     BB08
     C                     UPDATBB0
     C*
     C           $NEXT     TAG
     C                     READ BB0                      45
     C                     ENDDO
     C*
     C                     MOVEL*BLANK    TBB03
     C           *LOVAL    SETLLBB0
     C                     READ BB0                      47
     C           *IN47     DOWEQ'0'
     C*
     C           BB03A     IFNE 'S'
     C                     GOTO $NEXTP
     C                     ENDIF
     C*
     C           BB03      IFNE TBB03
     C                     MOVELBB03      TBB03
     C                     ENDIF
     C*
     C           BB03      CHAINMA0                  40
     C           *IN40     IFEQ '1'
     C           *IN40     OREQ '0'
     C           BB08      ANDNEMA31
     C*
     C                     SUB  BB08A     BB08
     C                     SUB  BB08B     BB08
     C                     UPDATBB0
     C           KEYSD     SETLLSD0
     C           KEYSD     READESD0                      46
     C           *IN46     DOWEQ'0'
     C           SD02A     IFNE 'R1S2'
     C                     GOTO $NEXTO
     C                     ENDIF
     C                     Z-ADDBB08      SD10
     C                     Z-ADDBB08      SD22
     C                     UPDATSD0
     C           $NEXTO    TAG
     C           KEYSD     READESD0                      46
     C                     ENDDO
     C*
     C           BB08      IFNE MA31
     C                     MOVELBB03      PBB03
     C                     Z-ADDBB08      PBB08
     C                     WRITEPD1
     C                     ENDIF
     C                     ENDIF
     C*
     C           $NEXTP    TAG
     C                     READ BB0                      47
     C                     ENDDO
     C*
     C                     SETON                     LR
