     ******************************************************************
     **                                                              **
     ******************************************************************
      *
     FW2X3PF  UP  E           K        DISK
     FMTMAPF  UF  E           K        DISK
     FIMIAPF  UF  E           K        DISK                      A
     FMTMHPF  UF  E           K        DISK
     F            MA0                               KRENAMEMH0
     FSOSDLF03UF  E           K        DISK
      *
      ****************************************************************
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      201 2080DATE
     I            DS
     I                                        1   80PI05
     I            DS
     I                                        1   80SD19
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYIA     KLIST
     C                     KFLD           SIA01   1
     C                     KFLD           SIA02   5
     C                     KFLD           SIA03   9
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C  N10                EXSR R0100
      *
     C                     EXSR R1000
      *
      *==============================================================*
      *          R0100    初始資料
      *==============================================================*
01===C           R0100     BEGSR
|     *
|    C                     SETON                     10
|    C                     MOVEL'R'       SIA01
|     *
01===C                     ENDSR
      *==============================================================*
      *          R1000    先檢核產品檔
      *==============================================================*
02===C           R1000     BEGSR
|     *
|    C                     SETON                     979899
|     *
|     *先檢核產品檔
|     *
|    C           X201      CHAINMA0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVEL'@'       X206
|   C                     UPDATX20
| 01-C                     ENDIF
|     *
|    C           X201      CHAINMH0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'@'       X206
|   C                     UPDATX20
| 02-C                     ENDIF
|     *
|     *再檢核銷售檔，因為有關單位成本的計算
|     *
|    C           X201      SETLLSD0
|    C           X201      READESD0                      46
| 03-C           *IN46     IFEQ '0'
|   C                     MOVEL'#'       X206
|   C                     UPDATX20
| 03-C                     ENDIF
|     *
|     *更新MA0
|     *
|    C           X201      CHAINMA0                  40
| 04-C           *IN40     IFEQ '0'
|   C           MA07      ANDEQ'K'
|   C           X201      CHAINMH0                  41
|   C                     ADD  X204      MA30
|   C                     Z-ADDX203      MA31
|   C                     Z-ADDX203      MA34
|   C           MA30      MULT MA34      MA26      H
|   C                     UPDATMH0
| 04*C                     ELSE
|   C                     ADD  X204      MA30
|   C                     Z-ADDX203      MA31
|   C                     Z-ADDX203      MA34
|   C           MA30      MULT MA34      MA26      H
|   C                     UPDATMA0
| 04-C                     ENDIF
|     *
|     *更新SD0
|     *
|    C           X201      SETLLSD0
|    C           X201      READESD0                      46
| 05-C           *IN46     DOWEQ'0'
|   C                     Z-ADDX203      SD10
|   C                     Z-ADDX203      SD22
|   C                     UPDATSD0
|   C           X201      READESD0                      46
| 05-C                     ENDDO
|     *
|     *更新IA0
|     *
|    C                     MOVELX201      SIA03
|    C                     MOVELX202      SIA02
|    C           KEYIA     CHAINIA0                  42
| 06-C           *IN42     IFEQ '0'
|   C                     ADD  X204      IA06
|   C                     ADD  X204      IA07
|   C                     ADD  X204      IA10
|   C                     UPDATIA0
| 06*C                     ELSE
|   C                     MOVEL'R'       IA01
|   C                     MOVELX202      IA02
|   C                     MOVELX201      IA03
     C                     MOVELMA08      IA05
     C                     MOVELMA09      IA04
|   C                     Z-ADDX204      IA06
|   C                     Z-ADDX204      IA07
|   C                     Z-ADDX204      IA10
|   C                     WRITEIA0
| 06-C                     ENDIF
|     *
02===C                     ENDSR
