     ******************************************************************
     **                                                              **
     ******************************************************************
      *
     FPOPHLF01UF  E           K        DISK
     FPOPIPF  UF  E           K        DISK
     FPOPPPF  UF  E           K        DISK
      *
      ****************************************************************
     I*
     I            DS
     I                                        1   5 SC04
     I                                        1   1 DSC04
     I            DS
     I                                        1   9 SD03
     I                                        1   1 DSD03
     IDA02        DS
     I                                        1   43DUTY
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           DA02
     C                     IN   DA02
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*          KEYIA     KLIST
     C*                    KFLD           DIA01   1
     C*                    KFLD           X103
     C*                    KFLD           X101
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C                     MOVEL'R1'      DPH01   2
      *
     C           DPH01     SETLLPH0
     C           DPH01     READEPH0                      46
  01-C           *IN46     DOWEQ'0'
     *
    C                     Z-ADD0         DPH11   90
    C                     Z-ADD0         DPH12   90
     *
    C           PH02      SETLLPI0
    C           PH02      READEPI0                      47
  02-C           *IN47     DOWEQ'0'
    C           PI06      MULT PI07      DPI10   90H
    C                     Z-ADDDPI10     PI10
    C           DPI10     MULT DUTY      DPI09   90H
    C                     Z-ADDDPI09     PI09
    C                     ADD  PI10      DPH11
    C                     ADD  PI09      DPH12
    C                     UPDATPI0
    C           PH02      READEPI0                      47
  02-C                     ENDDO
     *
    C           PH02      SETLLPP0
    C           PH02      READEPP0                      47
  03-C           *IN47     DOWEQ'0'
    C           PP06      MULT PP07      DPI10   90H
    C                     Z-ADDDPI10     PP10
    C           DPI10     MULT DUTY      DPI09   90H
    C                     Z-ADDDPI09     PP09
    C                     UPDATPP0
    C           PH02      READEPP0                      47
  03-C                     ENDDO
     *
    C                     Z-ADDDPH11     PH11
    C                     Z-ADDDPH12     PH12
     *
    C                     UPDATPH0
     *
    C           DPH01     READEPH0                      46
  01-C                     ENDDO
      *
      *
     C                     SETON                     LR
