     ******************************************************************
     **                                                              **
     ******************************************************************
      *
     FSOSCPF  IP  E           K        DISK
     FSOSDPF  UF  E           K        DISK
     FMTMHPF  IF  E           K        DISK
      *
      ****************************************************************
      *
     I              '無此產品'          C         @A1
     I              '無各庫庫存'        C         @A2
     I              '已有單位成本'      C         @A3
     I*
     I            DS
     I                                        1   5 SC04
     I                                        1   1 DSC04
     I            DS
     I                                        1   9 SD03
     I                                        1   1 DSD03
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*          KEYIA     KLIST
     C*                    KFLD           DIA01   1
     C*                    KFLD           X103
     C*                    KFLD           X101
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
      *
     C           DSC04     IFEQ 'B'
     C           SC08      ANDLE20090501
     C           SC08      ANDGE20090401
     C           SC02      SETLLSD0
     C           SC02      READESD0                      46
     C           *IN46     DOWEQ'0'
     C           DSD03     IFNE 'S'
     C           SD03      CHAINMA0                  40
     C                     Z-ADDMA31      SD10
     C                     Z-ADDMA32      SD11
     C                     Z-ADDMA33      SD12
     C                     Z-ADDMA31      SD22
     C                     Z-ADDMA32      SD23
     C                     Z-ADDMA33      SD24
     C                     UPDATSD0
     C                     ENDIF
     C           SC02      READESD0                      46
     C                     ENDDO
     C                     ENDIF
      *
