     ******************************************************************
     **                                                              **
     ******************************************************************
      *
     FPOPHPF  UP  E           K        DISK
     FPOPIPF  UF  E           K        DISK
      *
      ****************************************************************
     I*
     I            DS
     I                                        1   5 SC04
     I                                        1   1 DSC04
     I            DS
     I                                        1   9 SD03
     I                                        1   1 DSD03
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*          KEYIA     KLIST
     C*                    KFLD           DIA01   1
     C*                    KFLD           X103
     C*                    KFLD           X101
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C           PH01      IFEQ 'R1'
     C           PH02      SETLLPI0
     C           PH02      READEPI0                      46
     C           *IN46     DOWEQ'0'
     C                     Z-ADDPIXX      PI05
     C                     UPDATPI0
     C           PH02      READEPI0                      46
     C                     ENDDO
      *
     C                     Z-ADDPHXX      PH04
     C                     UPDATPH0
     C                     ENDIF
      *
