     ******************************************************************
     **                                                              **
     ******************************************************************
      *
     FW2X1PF  IP  E           K        DISK
     FIMIAPF  UF  E           K        DISK                      A
     FMTMHPF  UF  E           K        DISK
     FTRF004P O   E             39     PRINTER
      *
      ****************************************************************
     IX10
     I                                              X101  L1
      *
     I              '無此產品'          C         @A1
     I              '無各庫庫存'        C         @A2
     I              '已有單位成本'      C         @A3
      *
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYIA     KLIST
     C                     KFLD           DIA01   1
     C                     KFLD           X103
     C                     KFLD           X101
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     MOVEL'R'       DIA01
      *判斷錯誤
     C           X101      CHAINMA0                  40
     C           *INL1     IFEQ '1'
     C   40                MOVEL@A1       XXXX
     C  N40                MOVEL*BLANK    XXXX
     C   40                WRITEPD1                    99
     C                     ENDIF
     C           MA34      IFNE 0
     C   40                MOVEL@A3       XXXX
     C  N40                MOVEL*BLANK    XXXX
     C   40                WRITEPD1                    99
     C                     ENDIF
      *有錯誤便不在繼續
     C           *IN99     IFEQ '0'
      *先寫主檔
     C                     ADD  X104      MA30
     C           X102      MULT X104      TEMP   112H
     C                     ADD  TEMP      MA26
     C           MA30      IFNE 0
     C           MA26      DIV  MA30      MA31      H
     C           MA26      DIV  MA30      MA34      H
     C                     ELSE
     C                     Z-ADDX102      MA31
     C                     Z-ADDX102      MA34
     C                     ENDIF
     C                     UPDATMA0
      *再寫各庫檔
     C           KEYIA     CHAINIA0                  40
     C           *IN40     IFEQ '0'
     C                     ADD  X104      IA06
     C                     ADD  X104      IA07
     C                     ADD  X104      IA10
     C                     UPDATIA0
     C                     ELSE
     C                     MOVEL'R'       IA01
     C                     MOVELX103      IA02
     C                     MOVELX101      IA03
     C                     MOVELMA09      IA04
     C                     MOVELMA08      IA05
     C                     Z-ADDX104      IA06
     C                     Z-ADDX104      IA07
     C                     Z-ADDX104      IA10
     C                     WRITEIA0
     C                     ENDIF
      *
     C                     ENDIF
      *
