     ******************************************************************
     **                                                              **
     ******************************************************************
      *
     FARACPF  UF  E           K        DISK
     FARADPF  UF  E           K        DISK
      *
      ****************************************************************
     I*
     I            DS
     I                                        1   5 SC04
     I                                        1   1 DSC04
     I            DS
     I                                        1  20 PI03X
     I                                        1  12 PI03D
     I                                       13  200PI05D
     I            DS
     I                                        1   80PI05
     I                                        5   60DMON1
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYAD     KLIST
     C                     KFLD           AC01
     C                     KFLD           AC02
     C                     KFLD           AC03
     C                     KFLD           AC04
     C                     KFLD           AC05
     C                     KFLD           AC06
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C                     MOVEL'K1'      DAC01   2
      *
     C           DAC01     SETLLAC0
     C           DAC01     READEAC0                      46
     C           *IN46     DOWEQ'0'
      *
     C           KEYAD     SETLLAD0
     C           KEYAD     READEAD0                      47
     C           *IN47     DOWEQ'0'
     C                     DELETAD0
     C           KEYAD     READEAD0                      47
     C                     ENDDO
      *
     C                     DELETAC0
      *
     C           DAC01     READEAC0                      46
     C                     ENDDO
      *
     C                     SETON                     LR
