      ****************************************************************
      ****************************************************************
      *
     FMTMILF01UF  E           K        DISK
     FMTMAPFX UF  E           K        DISK
     FMTMAPF  IP  E           K        DISK
      *
     ILDA        UDS
     I                                      101 110 $USER
     I*                                     119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*    ¡@¡@
  01-C           MA07      IFEQ 'K'
    C           MA01      CHAINMX0                  40
    C  N40                DELETMX0
    C           MA01      CHAINMI0                  40
    C  N40                DELETMI0
  01-C                     END
     C*
