     FWRK001  IF  E           K        DISK
     FSOSJPF  UF  E           K        DISK
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      140 140 $RMK02
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYSJ     KLIST
     C                     KFLD           SJ01
     C                     KFLD           SJ02
     C                     KFLD           SJ03
     C*==============================================================*
     C*                 MAIN ROUTINE
     C*==============================================================*
     C           *LOVAL    SETLLRWRK
     C                     READ RWRK                     50
      *
1----C           *IN50     DOWEQ'0'
      *
|2---C           KEYSJ     CHAINSJ0                  51
||3--C           *IN51     IFEQ '0'
|||  C                     Z-ADDTAG07     SJ09
|||  C                     Z-ADDTAG07     SJ091
|||  C                     Z-ADD$A8YMD    SJXX
B2000C                     TIME           SJYY
|    C                     MOVE $USER     SJZZ
     C                     UPDATSJ0
||3--C                     END
      *
|||| C                     READ RWRK                     50
|||| C                     END
|||| C*
     C                     SETON                     LR
