      ****************************************************************
      *                                                              *
      * PROGRAM NAME : VTR0501                                       *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 10/16/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :寰盛洋酒                                     *
      * SUBSYSTEM    :媒體申報                                     *
      * REMARK       :媒體申報轉檔列印- AP                         *
     A*===============================================================
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*      |        |        |
     A*---------------------------------------------------------------
      ****************************************************************
     FSOVQLF01IF  E           K        DISK
     FREWFD7  O   E                    DISK                      A
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080DATE
     I                                      203 2040$A8Y
     I                                      205 2060$A8M
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
      *公司別
     I                                      600 600 DVQ91
     I                                      601 601 DVQ92S
     I                                      602 602 DVQ92E
     I                                      603 603 DVQ92
     I                                      605 606 CMPS
     I                                      607 608 CMPE
     I                                      650 655 DVQ96
     I                                      660 665 DVQ96S
     I                                      670 675 DVQ96E
      *YYMM
     I                                      614 6170DVQ04S
     I                                      614 6150MMS
     I                                      616 6170YYS
     I                                      620 6230YYMMS
      *
     I                                      634 6370DVQ04E
     I                                      634 6350MME
     I                                      636 6370YYE
     I                                      640 6430YYMME
     I                                      800 8070YMD8S
     I                                      800 8050YMD6S
     I                                      810 8170YMD8E
     I                                      810 8150YMD6E
     I            DS
     I                                        1   2 VQ91
     I                                        1   1 VQ91L
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     READ VQ0                      45
     C*
  01-C           *IN45     DOWEQ'0'
     C           VQ91L     IFEQ DVQ91
    C           VQ20      ANDEQ'AP'
     C           VQ92      ANDGEDVQ92S
     C           VQ92      ANDLEDVQ92E
     C           VQ04      ANDGEYMD6S
     C           VQ04      ANDLEYMD6E
    C           VQ96      ANDGEDVQ96S
    C           VQ96      ANDLEDVQ96E
    C                     WRITEWFD0
  01-C                     END
     C*
     C                     READ VQ0                      45
     C                     END
     C                     SETON                     LR
      *===============================================================*
