     F*================================================================
     F* CODE | AUTHOR | DATE  |  DESCRIPTION
     F*================================================================
     F*      |        |       |
     F*----------------------------------------------------------------
     F*================================================================
     FREWFD7  IP  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FVTR050P1O   E             39     PRINTER
     IWFD0
     I                                              VQ19  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080DATE
     I                                      203 2040$A8Y
     I                                      205 2060$A8M
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
      *公司別
     I                                      600 600 DVQ91
     I                                      601 601 DVQ92S
     I                                      602 602 DVQ92E
     I                                      603 603 DVQ92
     I                                      605 606 CMPS
     I                                      607 608 CMPE
      *YYMM
     I                                      614 6170DVQ04S
     I                                      614 6150MMS
     I                                      616 6170YYS
     I                                      620 6230YYMMS
      *
     I                                      634 6370DVQ04E
     I                                      634 6350MME
     I                                      636 6370YYE
     I                                      640 6430YYMME
     I                                      650 655 DVQ96
     I                                      660 665 DVQ96S
     I                                      670 675 DVQ96E
     I                                      800 8070YMD8S
     I                                      800 8050YMD6S
     I                                      810 8170YMD8E
     I                                      810 8150YMD6E
     I*
     I#B01        DS
     I                                        1   1 #B011
     I                                        2   2 #B012
     I*
     I#B03        DS
     I                                        1   5 #B031
     I                                        8  12 #B032
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
  01-C           *IN10     IFEQ '0'
    C                     EXSR RTN010                     *HEADING
    C                     SETON                     10
  01-C                     END
     C*
     C   39                EXSR RTN900
     C                     EXSR RTN100                     *READE DETAIL
     C*
     CL1 10                SETOF                     31
     CLR                   EXSR RTN500
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
     C*
      *
| 03-C           DVQ96     CHAINMC0                  44
     C           *IN44     IFEQ '0'
|   C                     MOVELMC02      DMARK
| 03*C                     ELSE
     C                     MOVEL*BLANKS   DMARK
     C                     MOVELDVQ96     DMARK
| 03-C                     END
     C           DVQ96E    IFNE DVQ96
     C                     MOVEL*BLANKS   DMARK
     C                     MOVEL'全部'DMARK
     C                     END
|    C                     WRITEPH1
      *
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|    C   39                EXSR RTN900
      *
|    C                     WRITEPD1
|    C                     SETOF                     21
|    C                     SETON                     31
|    C                     ADD  VQ07      T4VQ07
|    C                     ADD  VQ09      T4VQ09
|    C                     ADD  VQ18      T4VQ18
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN500....WRITE PT4   SUBTOTAL
      *==============================================================*
06===C           RTN500    BEGSR
     C*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     WRITEPE9
     C                     ELSE
|    C*
|    C   39                EXSR RTN900
|    C                     WRITEPT4
|    C                     SETOF                     31
|    C                     Z-ADD0         T4VQ07
|    C                     Z-ADD0         T4VQ09
|    C                     Z-ADD0         T4VQ18
     C                     END
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
07===C           RTN900    BEGSR
      *
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETOF                     31
|    C                     SETOF                     21
      *
07===C                     ENDSR
      *==============================================================*
      *          INZSR .... INITIAL
      *==============================================================*
07===C           *INZSR    BEGSR
      *
     C                     MOVELDVQ91     #B011
     C                     MOVE DVQ92     #B012
     C           #B01      CHAINPA#BPF               40
     C  N40                MOVEL#B031     NAME
     C  N40                MOVE X'0F'     NAME
     C  N40                MOVELX'0E'     OFFICE
     C  N40                MOVE #B032     OFFICE
      *
07===C                     ENDSR
