      ****************************************************************
      *                                                              *
      * PROGRAM NAME : VTR020                                        *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 10/15/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :寰盛洋酒                                     *
      * SUBSYSTEM    :媒體申報                                     *
      * REMARK       :媒體申報人工輸入列印                         *
     A*===============================================================
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*      |        |        |
     A*---------------------------------------------------------------
      ****************************************************************
     FVTR020D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     FMTMCPF  IF  E           K        DISK
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080DATE
     I                                      203 2040$A8Y
     I                                      205 2060$A8M
     I                                      598 5990$PRTID
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
      *公司別
     I                                      600 600 DVR91
     I                                      601 601 DVR92S
     I                                      602 602 DVR92E
     I                                      603 603 DVR92
     I                                      604 604 DOPT
     I                                      605 606 CMPS
     I                                      607 608 CMPE
      *YYMM
     I                                      614 6170DVR04S
     I                                      614 6150MMS
     I                                      616 6170YYS
     I                                      620 6230YYMMS
      *
     I                                      634 6370DVR04E
     I                                      634 6350MME
     I                                      636 6370YYE
     I                                      640 6430YYMME
     I                                      650 655 DVR96
     I                                      660 6650DVR97
     I                                      670 675 DVR96S
     I                                      680 685 DVR96E
     I                                      800 8070YMD8S
     I                                      810 8170YMD8E
     I                                      830 8370YMD97S
     I                                      840 8470YMD97E
      *DATE
     I            DS
     I                                        1   80DATES
     I                                        1   60DATSYM
     I                                        7   80DDS
      *
     I            DS
     I                                        1   80DATEE
     I                                        1   60DATEYM
     I                                        7   80DDE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     *INIT ENVIRM
     C*
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C*
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C*
  02-C           *IN03     IFEQ '0'
     C           *IN04     IFEQ '1'
     C                     EXSR RTNF4
     C                     ELSE
     C           *IN05     IFEQ '1'
     C                     EXSR RTN200
     C                     ELSE
    C                     EXSR RTN100                     *CHECK SCR01?
     C                     END
     C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     MOVE 'W'       DVR91
|    C                     MOVE '1'       DVR92
|    C                     MOVE '1'       DOPT
|    C                     MOVE *BLANKS   DVR96
|    C                     MOVEL*BLANKS   EMPNAM
|    C*                    Z-ADD$EGMDY    DVR97
M001MC                     Z-ADD*ZERO     DVR97
|    C                     MOVE $A8Y      YYS
|    C                     MOVE $A8Y      YYE
|    C                     MOVE $A8M      MMS
|    C                     MOVE $A8M      MME
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*申報年月
|    C           MMS       IFGT 12
|    C           MMS       ORLT 1
|    C                     SETON                     639993
|    C                     END
|    C   99                GOTO END100
|    C                     Z-ADDMMS       YYMMS
|    C                     MOVELYYS       YYMMS
|    C*
|    C           MME       IFGT 12
|    C           MME       ORLT 1
|    C                     SETON                     649993
|    C                     END
|    C   99                GOTO END100
|    C                     Z-ADDMME       YYMME
|    C                     MOVELYYE       YYMME
|     *
|    C                     MOVE '004N7'   HB2@FA
|    C                     MOVE YYMMS     HB2@F
|    C                     MOVE '006N7'   HB2@TA
     C                     EXSR HB@ADD                     ADD CENTURY
     C                     MOVE HB2@T     YMD6S   60
|    C*
     C                     MOVE '004N7'   HB2@FA
     C                     MOVE YYMME     HB2@F
     C                     MOVE '006N7'   HB2@TA
     C                     EXSR HB@ADD                     ADD CENTURY
     C                     MOVE HB2@T     YMD6E   60
|    C*
     C           YMD6S     IFGT YMD6E
|    C                     SETON                     636491
|    C                     SETON                     99
|    C                     END
|    C   99                GOTO END100
|    C*
     C                     Z-ADDYMD6S     DATSYM
     C                     Z-ADDYMD6E     DATEYM
     C                     Z-ADD01        DDS
     C                     CALL 'P34'
     C                     PARM DATEYM    P3401I  60
     C                     PARM '2'       P3402I  1
     C                     PARM '1'       P3403I  1
     C                     PARM           P3401O  1
     C           DDE       PARM           P3402O  20
     C*
     C                     Z-ADDDATES     YMD8S
     C                     Z-ADDDATEE     YMD8E
      *
     C                     MOVELDVR91     CMPS
     C                     MOVELDVR91     CMPE
M001MC                     MOVE DVR92     CMPS
M001MC                     MOVE DVR92     CMPE
M001MC                     MOVE DVR92     DVR92S
M001MC                     MOVE DVR92     DVR92E
M001AC           DVR92     IFEQ ' '
"    C                     MOVE '1'       CMPS
"    C                     MOVE '9'       CMPE
"    C                     MOVE '1'       DVR92S
"    C                     MOVE '9'       DVR92E
"    C                     END
      *
     C           DVR96     IFNE *BLANKS
     C           DVR96     CHAINMC0                  47
     C           *IN47     IFEQ '0'
     C                     MOVEL*BLANKS   EMPNAM
     C                     MOVELMC02      EMPNAM
     C                     ELSE
     C                     MOVEL*BLANKS   EMPNAM
     C                     SETON                     659499
     C                     END
     C                     ELSE
     C                     MOVEL*BLANKS   EMPNAM
     C                     END
     C           *LOVAL    SETLLMC0
     C   99                GOTO END100
     C*
     C           DVR96     IFEQ *BLANKS
     C                     MOVEL*LOVAL    DVR96S
     C                     MOVEL*HIVAL    DVR96E
     C                     ELSE
     C                     MOVEL*BLANKS   DVR96S
     C                     MOVEL*BLANKS   DVR96E
     C                     MOVELDVR96     DVR96S
     C                     MOVELDVR96     DVR96E
     C                     END
     C*
     C           DVR97     IFNE 0
     C                     CALL 'P09'
     C                     PARM DVR97     P0901I  60
     C                     PARM           P0901O  1
     C           P0901O    IFEQ 'N'
     C                     SETON                     669399
     C                     END
     C                     END
     C   99                GOTO END100
     C*
     C           DVR97     IFEQ 0
     C                     MOVEL'010199'  WVR97S  60
     C                     MOVEL'123129'  WVR97E  60
     C                     ELSE
     C                     Z-ADDDVR97     WVR97S
     C                     Z-ADDDVR97     WVR97E
     C                     END
|   C*日期轉換
     C                     Z-ADD0         YMDS    60
     C                     Z-ADD0         YMDE    60
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM WVR97S    S001I2  60
|   C           YMDS      PARM           S001O1  60
M001AC                     MOVE YMDS      HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    H@8N01  80
M001AC                     Z-ADDH@8N01    YMD97S
|   C*
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
|   C                     PARM WVR97E    S001I2  60
|   C           YMDE      PARM           S001O1  60
|    C                     MOVE YMDE      HB2@F6  6
|    C                     EXSR HB@68L
|    C                     MOVE HB2@T8    H@8N01  80
|    C                     Z-ADDH@8N01    YMD97E
      *
02===C           END100    ENDSR
      *===============================================================*
      *          RTN200....CHECK SCREEN
      *===============================================================*
02===C           RTN200    BEGSR
     C                     EXSR RTN100
| 01-C*          *IN99     IFEQ '0'
|   C*          #CSR      DIV  256       D#ROW            *ROW
|   C*                    MVR            D#COL            *COL
| 01-C*                    END
     C                     SETON                     99
     C                     ENDSR
|    C*
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*員工編號
| 02-C           D#ROW     IFEQ 14
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE45
|   C                     CALL 'WDS005'
|   C                     PARM           WVR96   6
     C                     MOVELWVR96     DVR96
| 02-C                     END
|   C*
| 17-C           D#ROW     IFEQ 20
|   C           D#COL     ANDGE40
|   C           D#COL     ANDLE41
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 17-C                     END
      *
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
     C*
     C/COPY HBP2CVTR
