      ****************************************************************
      *                                                              *
      * PROGRAM NAME : VTR0201                                       *
      * AUTHER       : MICHELLE                                      *
      * CREATE DATE  : 10/16/02                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :寰盛洋酒                                     *
      * SUBSYSTEM    :媒體申報                                     *
      * REMARK       :媒體申報人工輸入-進項資料WRITE WORK FILE   *
     A*===============================================================
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*      |        |        |
     A*---------------------------------------------------------------
      ****************************************************************
     FSOVRPF  IF  E           K        DISK
     FREWFD2  O   E                    DISK                      A
     FREWFD3  UF  E           K        DISK                      A
     F            WFD0                              KRENAMEWFD3
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080DATE
     I                                      203 2040$A8Y
     I                                      205 2060$A8M
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I                                      513 513 $WRHTY
      *公司別
     I                                      600 600 DVR91
     I                                      601 601 DVR92S
     I                                      602 602 DVR92E
     I                                      603 603 DVR92
     I                                      604 604 DOPT
     I                                      605 606 CMPS
     I                                      607 608 CMPE
      *YYMM
     I                                      614 6170DVR04S
     I                                      614 6150MMS
     I                                      616 6170YYS
     I                                      620 6230YYMMS
      *
     I                                      634 6370DVR04E
     I                                      634 6350MME
     I                                      636 6370YYE
     I                                      640 6430YYMME
     I                                      650 655 DVR96
     I                                      660 6650DVR97
     I                                      670 675 DVR96S
     I                                      680 685 DVR96E
     I                                      800 8070YMD8S
     I                                      800 8050YMD6S
     I                                      810 8170YMD8E
     I                                      810 8150YMD6E
     I                                      830 8370YMD97S
     I                                      840 8470YMD97E
     I            DS
     I                                        1   2 VR91
     I                                        1   1 VR91L
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           WFD91
     C                     KFLD           WFD92
     C                     KFLD           WFD04
     C                     KFLD           WFD01
     C                     KFLD           WFD08
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     READ VR0                      45
     C*
  01-C           *IN45     DOWEQ'0'
     C           VR91L     IFEQ DVR91
     C           VR92      ANDGEDVR92S
     C           VR92      ANDLEDVR92E
     C           VR04      ANDGEYMD6S
     C           VR04      ANDLEYMD6E
     C           VR96      ANDGEDVR96S
     C           VR96      ANDLEDVR96E
     C           VR97      ANDGEYMD97S
     C           VR97      ANDLEYMD97E
    C                     WRITEWFD0
     C                     MOVE VR91      WFD91
     C                     MOVE VR92      WFD92
     C                     Z-ADDVR04      WFD04
     C                     MOVE VR01      WFD01
     C                     MOVE VR08      WFD08
     C           KEYWF     CHAINWFD3                 46
     C           *IN46     IFEQ '0'
     C                     ADD  VR07      WFD07
     C                     ADD  VR09      WFD09
     C                     ADD  VR18      WFD18
     C                     UPDATWFD3
     C                     ELSE
     C                     Z-ADDVR07      WFD07
     C                     Z-ADDVR09      WFD09
     C                     Z-ADDVR18      WFD18
     C                     WRITEWFD3
     C                     END
  01-C                     END
     C*
     C                     READ VR0                      45
     C                     END
     C                     SETON                     LR
      *===============================================================*
