     FWDS000DYCF  E                    WORKSTN
     C           *ENTRY    PLIST
     C                     PARM           RETRN   1        ¥N½XÄæ¦ì
     C*
  01-C           *IN03     DOWEQ'0'
    C*
    C                     EXFMTSCR001
    C*
    C*
  04-C           *IN14     IFEQ '1'
    C                     MOVE 'Y'       RETRN
  04-C                     END
    C*
     C                     END
     C                     SETON                     LR
