     H****************************************************************
     H*    PROGRAM NAME : WDS017                                     *
     H*    AUTHOR       : ANDY                                       *
     H*    CREATE DATE  : 81/06/17                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人頭馬匯東洋酒股份有限公司                *
     H*    SUBSYSTEM    :                                            *
     H*    REMARK       :採購單號查詢(WINDOW)                      *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.10.27 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M002      | 98.11.25 | 123199 = 123129
     A*---------------------------------------------------------------
     F****************************************************************
     FPOPBLF9 IF  E           K        DISK
     FWDS017D CF  E                    WORKSTN
     F*
     E*OPT X(1)
     E                    WOP         8  1
     E*
     E*MM X(02) & '/' & DD X(02) & '/' & YY X(02) &FILLER X(01) & +
     E*PB02 X(12) & FILLER X(01) & PB01 X(02)
     E                    W01         8 24
     E*
     IWOP0        DS
     I                                        1   8 WOP
     I                                        1   1 OPT1
     I                                        2   2 OPT2
     I                                        3   3 OPT3
     I                                        4   4 OPT4
     I                                        5   5 OPT5
     I                                        6   6 OPT6
     I                                        7   7 OPT7
     I                                        8   8 OPT8
     I*
     IW01D        DS
     I                                        1 192 W01
     I                                        1  24 D01
     I                                       25  48 D02
     I                                       49  72 D03
     I                                       73  96 D04
     I                                       97 120 D05
     I                                      121 144 D06
     I                                      145 168 D07
     I                                      169 192 D08
     I*
     I            DS
     I                                        1  24 WT
     I                                        1   2 MM
     I                                        3   3 SLH1
     I                                        4   5 DD
     I                                        6   6 SLH2
     I                                        7   8 YY
     I                                       10  21 PB02
     I                                       23  24 PB01
     I*
     I            DS
     I                                        1  24 WCONT
     I                                       10  21 WCONT1
     I*
     I            DS
     I                                        1   60CDATE
     I                                        1   2 CYY
     I                                        3   4 CMM
     I                                        5   6 CDD
      *****************************************************************
      *          KLIST
      *****************************************************************
     C           *ENTRY    PLIST
     C                     PARM           VENDO   5
     C                     PARM           CUNTNO 12
     C*
     C           DBKEY     KLIST
     C                     KFLD           VENDO
     C                     KFLD           SBGN1
     C*
     C           PBTKEY    KLIST
     C                     KFLD           VENDO
     C                     KFLD           TBGN1
     C                     KFLD           OBGN2
     C*
     C           PBBKEY    KLIST
     C                     KFLD           VENDO
     C                     KFLD           UBGN1
     C                     KFLD           BBGN2
     C*
B2MODC*M001M     *LIKE     DEFN PB04      OBGN1 + 4
M001MC           *LIKE     DEFN PB04      OBGN1 - 2
     C           *LIKE     DEFN PB02      OBGN2
B2MODC*M001M     *LIKE     DEFN PB04      SBGN1 - 2
M001MC           *LIKE     DEFN PB04      SBGN1
B2MODC*M001M     *LIKE     DEFN PB04      BBGN1 + 4
M001MC           *LIKE     DEFN PB04      BBGN1 - 2
     C           *LIKE     DEFN PB02      BBGN2
B2000C           *LIKE     DEFN PB04      TBGN1
B2MODC*M001M     *LIKE     DEFN PB04      WBGN1 + 4
M001MC           *LIKE     DEFN PB04      WBGN1 - 2
B2000C           *LIKE     DEFN PB04      UBGN1
      *****************************************************************
      *          MAIN ROUTINE
      *****************************************************************
     C                     EXSR RTN000                     *SET INIT
     C                     EXSR RTN191                     *INIT DATA
     C                     EXSR RTN194                     *ADD DATA
     C*
     C                     EXFMTDSPC1
     C*
  01-C           *IN03     DOWEQ'0'
    C*
  02-C           *IN25     CASEQ'1'       RTN192           *ROLL UP
  02-C           *IN26     CASEQ'1'       RTN193           *ROLL DOWN
     C                     CAS            RTN170           *ENTER
  02-C                     ENDCS
    C*
  05-C           *IN03     IFEQ '0'
    C                     EXFMTDSPC1
  05-C                     END
    C                     SETOF                     98
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C                     RETRN
      *****************************************************************
      *          RTN000....SET INIT
      *****************************************************************
01===C           RTN000    BEGSR
|    C*
|    C                     MOVE *BLANK    WOP
B2000C                     MOVE *BLANK    W01
B2INF *CVR3013 sev.30 Field W01 contains a year, but has no standard date
B2INF *   type
     C                     MOVEA'11111111'*IN,60
     C                     MOVE VENDO     DVENDO
M002MC                     Z-ADD123129    DBGN1
B2INF *CVR3012 sev.30 Field DBGN1 contains more than one year
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M002MC                     Z-ADD123129    OBGN1
B2INF *CVR3012 sev.30 Field OBGN1 contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M002MC                     Z-ADD123129    BBGN1
B2INF *CVR3012 sev.30 Field BBGN1 contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
M002MC                     Z-ADD123129    WBGN1
B2INF *CVR3012 sev.30 Field WBGN1 contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
|    C                     Z-ADD0         NU      20
|    C*
01===C                     ENDSR
      *****************************************************************
      *          RTN170....ENTER
      *****************************************************************
02===C           RTN170    BEGSR
     C*
B2CHKC           DBGN1     IFEQ 0
B2INF *CVR3012 sev.30 Field DBGN1 contains more than one year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
B2CHKC                     MOVE 123129    DBGN1
B2INF *CVR3012 sev.30 Field DBGN1 contains more than one year
     C                     END
     C*
B2???C           DBGN1     IFNE WBGN1
B2INF *CVR3012 sev.30 Field DBGN1 contains more than one year
B2INF *CVR3012 sev.30 Field WBGN1 contains more than one year
     C                     MOVE *BLANK    WOP
B2000C                     MOVE *BLANK    W01
B2INF *CVR3013 sev.30 Field W01 contains a year, but has no standard date
B2INF *   type
     C                     MOVEA'11111111'*IN,60
B2???C                     Z-ADDDBGN1     BBGN1
B2INF *CVR3012 sev.30 Field DBGN1 contains more than one year
B2INF *CVR3012 sev.30 Field BBGN1 contains more than one year
     C                     MOVE *LOVAL    BBGN2
|   C                     EXSR RTN191                     *INIT KEY
|   C                     EXSR RTN194                     *ADD DATA
B2???C                     Z-ADDDBGN1     OBGN1
B2INF *CVR3012 sev.30 Field DBGN1 contains more than one year
B2INF *CVR3012 sev.30 Field OBGN1 contains more than one year
     C                     MOVE *LOVAL    OBGN2
B2???C                     Z-ADDDBGN1     WBGN1
B2INF *CVR3012 sev.30 Field DBGN1 contains more than one year
B2INF *CVR3012 sev.30 Field WBGN1 contains more than one year
     C                     ELSE
     C                     EXSR RTN300                     *GET CUNTNO
     C                     END
     C*
     C                     ENDSR
      *****************************************************************
      *          RTN191....INIT KEY
      *****************************************************************
02===C           RTN191    BEGSR
     C*
     C           *LOVAL    SETLLPB0
|    C*
M001AC                     Z-ADD0         WUBGN1  60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2MODC*M001M               PARM BBGN1     S001I2  80
M001MC                     PARM BBGN1     S001I2  60
B2MODC*M001M     UBGN1     PARM           S001O1  80
M001MC           WUBGN1    PARM           S001O1  60
M001AC                     MOVE WUBGN1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    UBGN1
|    C*
B2000C           PBBKEY    SETLLPB0
|    C*
06===C                     ENDSR
      *****************************************************************
      *          RTN192....ROLL UP
      *****************************************************************
03===C           RTN192    BEGSR
     C*
     C           *LOVAL    SETLLPB0
|    C*
M001AC                     Z-ADD0         WUBGN1  60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2MODC*M001M               PARM BBGN1     S001I2  80
M001MC                     PARM BBGN1     S001I2  60
B2MODC*M001M     UBGN1     PARM           S001O1  80
M001MC           WUBGN1    PARM           S001O1  60
M001AC                     MOVE WUBGN1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    UBGN1
B2000C           PBBKEY    SETGTPB0
     C                     EXSR RTN194                     *ADD DATA
     C*
     C                     ENDSR
      *****************************************************************
      *          RTN193....ROLL DOWN
      *****************************************************************
03===C           RTN193    BEGSR
|    C*
M001AC                     Z-ADD0         WTBGN1  60
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2MODC*M001M               PARM OBGN1     S001I2  80
M001MC                     PARM OBGN1     S001I2  60
B2MODC*M001M     TBGN1     PARM           S001O1  80
M001MC           WTBGN1    PARM           S001O1  60
M001AC                     MOVE WTBGN1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    TBGN1
|    C*
|    C                     Z-ADD0         NU1     10
B2000C           PBTKEY    SETLLPB0
|    C                     READPPB0                      41
|    C*
| 01-C           *IN41     IFEQ '1'
     C           PB05      ORNE VENDO
B2REM ***************************
B2REM ****  CONVERSION START  ***
B2REM ***************************
B2OLDC*                    Z-ADD123192    BBGN1
B2VFYC*M001M               Z-ADD20123192  BBGN1
M001MC                     Z-ADD123192    BBGN1
B2INF *CVR3012 sev.30 Field BBGN1 contains more than one year
B2REM ***************************
B2REM *****  CONVERSION END  ****
B2REM ***************************
     C                     MOVE *LOVAL    BBGN2
     C                     END
     C*
     C           *IN41     DOWEQ'0'
     C           PB05      ANDEQVENDO
|   C           NU1       ANDLE7
     C*
M001AC                     Z-ADDPB04      WPB04   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001D               PARM PB04      S001I2  80
M001MC                     PARM WPB04     S001I2  60
B2MODC*M001M     BBGN1     PARM           S001O1  80
M001MC           BBGN1     PARM           S001O1  60
     C*
     C                     MOVE PB02      BBGN2
|    C*
|   C                     READPPB0                      41
|   C                     ADD  1         NU1
| 02-C                     END
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2MODC*M001M               PARM BBGN1     S001I2  80
M001MC                     PARM BBGN1     S001I2  60
B2MODC*M001M     UBGN1     PARM           S001O1  80
M001MC           WUBGN1    PARM           S001O1  60
M001AC                     MOVE WUBGN1    HB2@F6  6
M001AC                     EXSR HB@68L
M001AC                     MOVE HB2@T8    UBGN1
|    C*
|    C                     SETOF                     41
B2000C           PBBKEY    SETLLPB0
|    C                     EXSR RTN194
|    C*
03===C           END193    ENDSR
      *****************************************************************
      *          RTN194....ADD  DATA
      *****************************************************************
02===C           RTN194    BEGSR
     C*
|    C                     Z-ADD0         NU      20
     C*
|    C                     READ PB0                      40
     C*
     C           *IN40     IFEQ '1'
     C           PB05      ORNE VENDO
     C                     GOTO END194
     C                     ELSE
     C*
M000AC                     Z-ADDPB04      WPB04   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM PB04      S001I2  80
M001MC                     PARM WPB04     S001I2  60
B2MODC*M001M     OBGN1     PARM           S001O1  80
M001MC           OBGN1     PARM           S001O1  60
     C*
     C                     MOVE PB02      OBGN2
|    C                     MOVE *BLANK    WOP
B2000C                     MOVE *BLANK    W01
B2INF *CVR3013 sev.30 Field W01 contains a year, but has no standard date
B2INF *   type
     C                     END
|    C*
| 01-C           *IN40     DOWEQ'0'
     C           PB05      ANDEQVENDO
|   C           NU        ANDLE7
|   C                     ADD  1         NU
B2000C                     Z-ADDPB04      CDATE
B2000C                     MOVE CYY       YY
     C                     MOVE CMM       MM
     C                     MOVE CDD       DD
     C                     MOVE '/'       SLH1
     C                     MOVE '/'       SLH2
B2???C                     MOVE WT        W01,NU
B2INF *CVR3013 sev.30 Field WT contains a year, but has no standard date
B2INF *   type
B2INF *CVR3013 sev.30 Field W01 contains a year, but has no standard date
B2INF *   type
     C                     MOVE PB02      BBGN2
     C*
M001MC                     Z-ADDPB04      WPB04   60
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC*M001M               PARM PB04      S001I2  80
M001MC                     PARM WPB04     S001I2  60
B2MODC*M001M     BBGN1     PARM           S001O1  80
M001MC           BBGN1     PARM           S001O1  60
|    C*
|   C                     READ PB0                      40
| 01-C                     END
|    C*
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
|    C           NU        ADD  60        NU
|    C*
| 02-C           NU        DOWLE67
|   C                     MOVE '1'       *IN,NU
|   C                     ADD  1         NU
| 02-C                     END
|    C*
02===C           END194    ENDSR
      *****************************************************************
      *          RTN300....GET CUNTNO
      *****************************************************************
04===C           RTN300    BEGSR
|    C*
|    C                     Z-ADD1         ND      10
|    C*
| 01-C           WOP,ND    DOWEQ*BLANK
|   C           ND        ANDLE7
|   C                     ADD  1         ND
| 01-C                     END
|    C*
| 02-C           WOP,ND    IFEQ '/'
B2???C                     MOVE W01,ND    WCONT
B2INF *CVR3013 sev.30 Field W01 contains a year, but has no standard date
B2INF *   type
B2INF *CVR3013 sev.30 Field WCONT contains a year, but has no standard
B2INF *   date type
     C                     MOVE WCONT1    CUNTNO
|   C                     SETON                     9803
| 02-C                     END
|    C*
04===C                     ENDSR
M001AC/COPY HBP2CVTR
