     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : WDS004                                     *
     H*    AUTHOR       : A1139  JANE                                *
     H*    CREATE DATE  : 81/02/12                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人頭馬匯東洋酒股份有限公司                *
     H*    SUBSYSTEM    :                                            *
     H*    REMARK       :客戶信用查詢(WINDOW)                      *
     F****************************************************************
     FMTMDPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FWDS004D CF  E                    WORKSTN
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           S004I1  5        客戶代號
     C*==============================================================*
     C*==============================================================*
     C*          MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT
     C*
     C                     EXSR RTN100                     *CHAIN
     C*
  01-C           *IN03     IFEQ '0'
    C                     EXFMTDSPC1
  01*C                     ELSE
    C                     SETON                     LR
  01-C                     END
     C*==============================================================*
     C*          RTN010....INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C                     MOVE *BLANK    DME04  15
|    C                     Z-ADD0         DMD29  100
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....READ NEXT
     C*==============================================================*
02===CSR         RTN100    BEGSR
|    C*
|    C           S004I1    CHAINMD0                  46
| 01-C           *IN46     IFEQ '0'
|   C                     EXSR RTN200
| 01-C                     END
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....READ PREVIOUS
     C*==============================================================*
03===CSR         RTN200    BEGSR
|    C           MD01      SETLLME0
|    C                     READ ME0                      47
| 01-C           *IN47     IFEQ '0'
|   C                     MOVELME04      DME04
|   C           MD22      SUB  MD31      DMD29
|   C           DMD29     SUB  MD32      DMD29
|   C           DMD29     SUB  MD30      DMD29
| 01-C                     END
03===C                     ENDSR
