     H****************************************************************
     H*    PROGRAM NAME : WDS025                                     *
     H*    AUTHOR       : ANDY                                       *
     H*    CREATE DATE  : 81/06/09                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :人頭馬匯東洋酒股份有限公司                *
     H*    SUBSYSTEM    :                                            *
     H*    REMARK       :送貨單號查詢(WINDOW)                      *
     F****************************************************************
     FIMIOLF03IF  E           K        DISK
     FWDS025D CF  E                    WORKSTN
     F*
     E*OPT X(1)
     E                    DOP         8  1
     E*
     E*FILLER X(01) & IO03 X(9)
     E                    W02         8  9
     E*
     IWOP0        DS
     I                                        1   8 DOP
     I                                        1   1 DOP1
     I                                        2   2 DOP2
     I                                        3   3 DOP3
     I                                        4   4 DOP4
     I                                        5   5 DOP5
     I                                        6   6 DOP6
     I                                        7   7 DOP7
     I                                        8   8 DOP8
     I*
     IWD0         DS
     I                                        1  72 W02
     I                                        1   9 D1
     I                                       10  18 D2
     I                                       19  27 D3
     I                                       28  36 D4
     I                                       37  45 D5
     I                                       46  54 D6
     I                                       55  63 D7
     I                                       64  72 D8
     I*
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           DIO02
     C                     PARM           S025O1  9        盤點單號
     C*==============================================================*
     C*                    KEY LIST FOR NMPF
     C*==============================================================*
     C           KEYIOT    KLIST                           *KEY TOP
     C                     KFLD           DIO02
     C                     KFLD           WIO03T
     C                     KFLD           WIO01T
     C                     KFLD           WIO04T
     C*
     C           KEYIOB    KLIST                           *KEY BOTTOM
     C                     KFLD           DIO02
     C                     KFLD           WIO03B
     C                     KFLD           WIO01B
     C                     KFLD           WIO04B
     C*
     C           KEYIO     KLIST                           *KEY TOP
     C                     KFLD           DIO02
      *
     C           *LIKE     DEFN IO01      WIO01T
     C           *LIKE     DEFN IO03      WIO03T
     C           *LIKE     DEFN IO04      WIO04T
     C           *LIKE     DEFN IO01      WIO01B
     C           *LIKE     DEFN IO03      WIO03B
     C           *LIKE     DEFN IO04      WIO04B
     C*==============================================================*
     C*          MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT
     C*
     C           KEYIOB    SETLLIO0                        *1 SETLL
     C                     EXSR RTN100                     *1 READ NEXT
     C*
  01-C           *IN03     DOWEQ'0'
    C*
    C                     EXFMTDSPC1
    C*
  02-C           *IN25     IFEQ '1'                        *ROLLUP
    C           *IN97     ANDEQ'0'                        *LAST PAGE
    C           KEYIOB    SETGTIO0                        *AFTER 1 SETLL
    C                     EXSR RTN100                     *READ NEXT
  02-C                     END
    C*
  03-C           *IN26     IFEQ '1'                        *ROLLDOWN
    C           *IN98     ANDEQ'0'                        *FIRST PAGE
    C           KEYIOT    SETLLIO0
    C                     EXSR RTN200                     *READ PREV
  03-C                     END
    C*
  04-C           *IN25     IFEQ '0'
    C           *IN26     ANDEQ'0'
    C                     EXSR RTN300
  04-C                     END
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C                     MOVE *BLANKS   WIO03T
|    C                     MOVE *BLANKS   WIO03B
|    C                     MOVE *LOVAL    WIO01T
|    C                     MOVEL*LOVAL    WIO01B
|    C                     MOVE *LOVAL    WIO04T
|    C                     MOVEL*LOVAL    WIO04B
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100....READ NEXT
     C*==============================================================*
02===CSR         RTN100    BEGSR
|    C*
|    C                     MOVEA*BLANKS   DOP
|    C                     MOVEA*BLANKS   W02
|    C                     Z-ADD0         WI      10
|    C   25                SETOF                     98
|    C*
|    C           DIO02     READEIO0                      97
|    C  N97                EXSR RTN810                     *GET KEY TOP
|    C*
| 01-C                     DO   8         WI
|   C*
| 02-C           *IN97     IFEQ '0'
|   C                     MOVELIO03      W02,WI
|   C                     EXSR RTN820                     *GET KEY BOT
| 02*C                     ELSE
|   C           WI        ADD  60        WO      20
|   C                     MOVEA*ALL'1'   *IN,WO
|   C                     SETOF                     9998
|   C                     Z-ADD8         WI
| 02-C                     END
|   C*
|   C           DIO02     READEIO0                      97
| 01-C                     END
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200....READ PREVIOUS
     C*==============================================================*
03===CSR         RTN200    BEGSR
|    C*
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     MOVEA*BLANKS   DOP
|    C                     MOVEA*BLANKS   W02
|    C                     Z-ADD9         WI
|    C*
|    C           DIO02     REDPEIO0                      98*READ EQ DIV
|    C                     EXSR RTN820                     *GET KEY BOTTOM
|    C*
| 01-C                     DO   8                          *SFL FULL
|   C*
| 02-C           *IN98     IFEQ '1'                        *READP EOF
|   C                     MOVE WIO01T    WIO01B           *KEY BOTTOM
|   C                     MOVE WIO03T    WIO03B           *KEY BOTTOM
|   C                     MOVE WIO04T    WIO04B           *KEY BOTTOM
|   C           KEYIOB    SETLLIO0
|   C                     EXSR RTN100                     *READ NEXT
|   C                     GOTO END200
| 02-C                     END
|   C*
|   C                     SUB  1         WI
|   C                     MOVELIO03      W02,WI
|   C                     EXSR RTN810                     *GET KEY TOP
|   C*
|   C           DIO02     REDPEIO0                      98*READ EQ DIV
| 01-C                     END
|    C*
03===C           END200    ENDSR
     C*==============================================================*
     C*          RTN300....
     C*==============================================================*
04===CSR         RTN300    BEGSR
|    C*
|    C                     Z-ADD1         WJ      10
|    C           '/'       LOKUPDOP,WJ                   30
| 01-C           *IN30     IFEQ '1'
|   C                     MOVE W02,WJ    S025O1
|   C                     SETON                     03
| 01*C                     ELSE
| 02-C           DIO02     IFEQ *BLANKS
|   C                     MOVE *LOVAL    DIO02
| 02-C                     END
|   C                     MOVE *BLANKS   WIO03B
|   C                     MOVE *BLANKS   WIO03T
|   C                     MOVEA*ALL'0'   *IN,60
|   C           KEYIOB    SETLLIO0                        *1 SETLL
|   C                     EXSR RTN100                     *1 READ NEXT
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN810....READ NEXT CLEAR & INIT
     C*==============================================================*
05===CSR         RTN810    BEGSR
|    C                     MOVE IO01      WIO01T           *KEY TOP
|    C                     MOVE IO03      WIO03T           *KEY TOP
|    C                     MOVE IO04      WIO04T           *KEY TOP
05===C                     ENDSR
     C*==============================================================*
     C*          RTN820....READ PREV CLEAR & INIT
     C*==============================================================*
06===CSR         RTN820    BEGSR
|    C                     MOVE IO01      WIO01B           *KEY BOTTOM
|    C                     MOVE IO03      WIO03B           *KEY
|    C                     MOVE IO04      WIO04B           *KEY
06===C                     ENDSR
