     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : WOA1001                                    *
     A*    AUTHOR       :                                            *
     A*    DATE WRITTEN : 81/02/10                                   *
     A*    UPDATE DATE  : 81/03/09                                   *
     A*    UPDATE DATE  : 81/03/11                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :                                            *
     A*    PROCEDURE    :客戶基本資料建立 (A/U/D/I)                *
     A****************************************************************
     FWOWEPF  UF  E           K        DISK                      A
     FWOWFPF  UF  E           K        DISK                      A
     FMTMCPF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FPA#APF  IF  E           K        DISK
     FPA#CPF  IF  E           K        DISK
     FPA#DPF  IF  E           K        DISK
     FWOA1001DCF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     IPTDA01      DS
     I                                        1   1 $FMT
     I                                        2   2 $TYPE
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      201 2080$A8YMD
     I            DS
     I                                        1  20 WF08
     I                                        1   1 DWF08A
     I                                        2   2 DWF08B
     I                                        3   3 DWF08C
     I                                        4   4 DWF08D
     I                                        5   5 DWF08E
     I                                        6   6 DWF08F
     I            DS
     I                                        1   5 WE01
     I                                        1   50WE01WK
     I            DS
     I                                        1   5 WF01
     I                                        1   50WF01WK
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01           TRAN DATE
|    C                     IN   PTDA01
|    C*
     C*
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*==============================================================*
     C*                    *ENTRY PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           PWE01   5          CUST ID
     C                     PARM           FUNID   10         FUN  ID
     C                     PARM           RTNID   2          RETURN ID
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#C     KLIST
     C                     KFLD           #C01
     C                     KFLD           #C02
     C           KEYME     KLIST
     C                     KFLD           DWF06
     C                     KFLD           DWF07
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT FIELD ENT
     C*
  01-C           FUNID     IFNE 1
    C                     EXSR RTN011                     *FILE->SCRN
  01-C                     END
     C*
     C                     EXSR RTN200                     *MAIN RTN
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'SC02'    SCID    4
|    C                     MOVELWFUN,FUNIDDFUN
|    C*
|    C                     SETON                     3031
|    C*
| 02-C           FUNID     IFEQ 1
|   C                     MOVE '1'       DWE20
| 02-C                     END
|    C*
| 03-C           FUNID     IFEQ 2
|   C                     SETOF                     30
| 03-C                     END
|    C*
| 04-C           FUNID     IFEQ 4
|   C           FUNID     OREQ 5
|   C                     SETOF                     3031
| 04-C                     END
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
02===C           RTN200    BEGSR
|    C*
| 01-C           SCID      DOWEQ'SC02'
|   C*
|   C                     EXFMTDSPD1
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '1'
|   C                     MOVEL'EXIT'    SCID
|   C                     MOVEL'03'      RTNID
|   C                     GOTO E200
| 02-C                     END
|   C*
| 03-C           *IN12     IFEQ '1'
|   C                     MOVEL'EXIT'    SCID
|   C                     MOVEL'12'      RTNID
|   C                     GOTO E200
| 03-C                     END
|   C*
| 04-C           *IN04     IFEQ '1'
|   C                     EXSR RTNF4
|   C                     GOTO E200
| 04-C                     END
|   C*
| 05-C           FUNID     IFNE 5
|   C                     EXSR RTN280                     *CHECK SCRN
| 05-C                     END
|   C*
| 06-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
| 07-C           FUNID     IFNE 4
|   C           FUNID     ANDNE5
|   C                     EXSR RTN253                     *SCRN-->FILE
| 07-C                     END
|   C*
|   C                     EXSR RTN254                     *ADD UPD DEL
|   C                     MOVEL'EXIT'    SCID
|   C                     MOVEL'00'      RTNID
| 06-C                     END
|   C*
|   C           E200      TAG
| 01-C                     END
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN011....MOVE DATA TO SCREEN
      *==============================================================*
03===CSR         RTN011    BEGSR
|    C*
|    C           PWE01     CHAINWE0                  40
| 01-C           *IN40     IFEQ '0'
|   C*
|   C                     MOVELWE01      DWE01
|   C                     MOVELWE02      DWE02
|   C                     MOVELWE03      DWE03
|   C                     MOVELWE04      DWE04
|   C                     MOVELWE041     DWE041
|   C                     MOVELWE05      DWE05
|   C                     MOVELWE07      DWE07
|   C                     MOVELWE08      DWE08
|   C                     MOVELWE09      DWE09
|   C                     MOVELWE10      DWE10
|   C                     MOVELWE11      DWE11
|   C                     MOVELWE12      DWE12
|   C                     MOVELWE13      DWE13
|   C                     MOVELWE15      DWE15
|   C                     MOVELWE17      DWE17
|   C                     MOVELWE18      DWE18
|   C                     MOVELWE19      DWE19
|   C                     MOVELWE20      DWE20
|   C*通路名稱
|   C                     MOVEL*BLANK    #A01
|   C                     MOVEL*BLANK    #A02
|   C                     MOVEL'DISTRUBT'#A01
|   C                     MOVELWE07      #A02
|   C           KEY#A     CHAIN#A0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#A03      D#A03
| 02*C                     ELSE
|   C                     MOVEL*BLANK    D#A03
| 02-C                     END
|   C*通路型態名稱
|   C                     MOVE *BLANK    #C01
|   C                     MOVE *BLANK    #C02
|   C                     MOVELWE07      #C01
|   C                     MOVELWE08      #C02
|   C           KEY#C     CHAIN#C0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     MOVE #C03      D#C03
| 03*C                     ELSE
|   C                     MOVE *BLANK    D#C03
| 03-C                     END
|   C*業務員代號
|   C           DWE18     CHAINMC0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVELMC02      DMC02
| 04-C                     END
|   C*區域
|   C           DWE11     CHAIN#D0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVEL#D02      D#D02
| 04-C                     ELSE
|   C                     MOVEL*BLANK    D#D02
| 04-C                     END
|    C*
| 01-C                     END
|    C*
|    C           PWE01     CHAINWF0                  41
| 05-C           *IN41     IFEQ '0'
|   C                     MOVELWF02      DWF02
|   C                     MOVELWF03      DWF03
|   C                     MOVELWF04      DWF04
|   C                     MOVELWF05      DWF05
|   C                     MOVELWF06      DWF06
|   C                     MOVELWF07      DWF07
|   C                     MOVELWF09      DWF09
|   C                     MOVELWF10      DWF10
|   C                     MOVELWF11      DWF11
|   C                     MOVELWF12      DWF12
|   C                     MOVELWF13      DWF13
|   C                     MOVELMC02      DMC02
| 05-C                     END
|    C*
|    C*供應商簡稱
|    C           DWF02     CHAINWE0                  40
|    C           *IN40     IFEQ '0'
|    C                     MOVELWE03      DWE02A
|    C                     END
     C*
|    C           DWF03     CHAINWE0                  40
|    C           *IN40     IFEQ '0'
|    C                     MOVELWE03      DWE03A
|    C                     END
     C*
|    C           DWF04     CHAINWE0                  40
|    C           *IN40     IFEQ '0'
|    C                     MOVELWE03      DWE04A
|    C                     END
     C*
|    C           DWF05     CHAINWE0                  40
|    C           *IN40     IFEQ '0'
|    C                     MOVELWE03      DWE05A
|    C                     END
     C*
|    C                     Z-ADDWF14      FDATE   80
|    C                     EXSR R9200
|    C                     Z-ADDP3111O    WF14WK  80
|    C                     Z-ADDWF14WK    DWF14
      *
|    C*
03===CSR                   ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
04===CSR         RTN253    BEGSR
| 01-C           FUNID     IFEQ 1
|   C           *HIVAL    SETLLWE0
|   C                     READPWE0                      41
| 02-C           *IN41     IFEQ '0'
|   C                     ADD  1         WE01WK
|   C                     MOVELWE01      WF01
| 02*C                     ELSE
|   C                     Z-ADD1         WE01WK
|   C                     Z-ADD1         WF01WK
| 02-C                     END
| 01-C                     END
|    C*客戶主檔
|    C           PWE01     CHAINWE0                  40
|    C                     MOVELDWE02     WE02
|    C                     MOVELDWE03     WE03
|    C                     MOVELDWE04     WE04
|    C                     MOVELDWE041    WE041
|    C                     MOVELDWE05     WE05
|    C                     MOVELDWE07     WE07
|    C                     MOVELDWE08     WE08
|    C                     MOVELDWE09     WE09
|    C                     MOVELDWE10     WE10
|    C                     MOVELDWE11     WE11
|    C                     MOVELDWE12     WE12
|    C                     MOVELDWE13     WE13
|    C                     MOVELDWE15     WE15
|    C                     MOVELDWE17     WE17
|    C                     MOVELDWE18     WE18
|    C                     MOVELDWE19     WE19
|    C                     MOVELDWE20     WE20
B2000C                     TIME           WEYY
|    C                     MOVEL$USER     WEZZ
|    C*客戶主延伸檔
|   C                     MOVELDWF02     WF02
|   C                     MOVELDWF03     WF03
|   C                     MOVELDWF04     WF04
|   C                     MOVELDWF05     WF05
|   C                     MOVELDWF06     WF06
|   C                     MOVELDWF07     WF07
|   C                     MOVELDWF09     WF09
|   C                     MOVELDWF10     WF10
|   C                     MOVELDWF11     WF11
|   C                     MOVELDWF12     WF12
|   C                     MOVELDWF13     WF13
|   C*
|   C                     Z-ADDDWF14     DATE    60
|   C                     EXSR R9100
|   C                     Z-ADDP3111O    WF14WK  80
|   C                     Z-ADDWF14WK    WF14
      *
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM $EGMDY    S001I2  80
B2INF *CVR3012 sev.30 Field $EGMDY contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
|   C           WEXX      PARM           S001O1  60
      *
04===CSR                   ENDSR
      *==============================================================*
      *          RTN254....ADD UPDATE DELETE . . .
      *==============================================================*
05===CSR         RTN254    BEGSR
      *
| 01-C           FUNID     IFEQ 1
|   C                     WRITEWE0
|   C                     WRITEWF0
|   C                     MOVELWE01      PWE01
|   C*
| 01-C                     END
      *
| 02-C           FUNID     IFEQ 2
|   C                     UPDATWE0
|   C                     UPDATWF0
| 02-C                     END
      *
| 03-C           FUNID     IFEQ 4
|    C           PWE01     CHAINWE0                  40
|   C                     DELETWE0
|    C           PWE01     CHAINWF0                  40
|   C                     DELETWF0
| 03-C                     END
      *
05===CSR                   ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' SCREEN
     C*==============================================================*
06===CSR         RTN280    BEGSR
|    C*
|    C*客戶全稱檢查
| 01-C           DWE02     IFEQ *BLANK
|   C                     MOVEL'UPT1001' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C   99                GOTO END280
|    C*客戶簡稱檢查
| 02-C           DWE03     IFEQ *BLANKS
|   C                     CALL 'P65'
|   C                     PARM DWE02     P6501I 80
|   C                     PARM 18        P6502I  30
|   C           DWE03     PARM           P6501O 80
|   C                     PARM           P6502O 80
| 02-C                     END
|    C*
| 03-C           DWE03     IFEQ *BLANK
|   C                     MOVEL'UPT1001' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6299
| 03-C                     END
|    C   99                GOTO END280
|    C*客戶代號檢查& GET 通路
| 04-C           DWE07     IFEQ *BLANK
|   C                     MOVEL'UPT1001' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 04*C                     ELSE
|   C                     MOVEL*BLANK    #A01
|   C                     MOVEL*BLANK    #A02
|   C                     MOVEL'DISTRUBT'#A01
|   C                     MOVELDWE07     #A02
|   C           KEY#A     CHAIN#A0                  41
| 05-C           *IN41     IFEQ '1'
|   C                     MOVEL'CPF5223' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6499
| 05*C                     ELSE
|   C                     MOVEL#A03      D#A03
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END280
|    C*型態檢查
| 06-C           DWE08     IFEQ *BLANK
|   C                     MOVEL'UPT1001' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 06*C                     ELSE
|   C                     MOVE *BLANK    #A01
|   C                     MOVE *BLANK    #A02
|   C                     MOVELDWE07     #C01
|   C                     MOVELDWE08     #C02
|   C           KEY#C     CHAIN#C0                  42
| 07-C           *IN42     IFEQ '1'
|   C                     MOVEL'CPF5223' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 07*C                     ELSE
|   C                     MOVEL#C03      D#C03
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END280
|    C*區域代號檢查
|   C           DWE11     CHAIN#D0                  41
| 09-C           *IN41     IFEQ '1'
|   C                     MOVEL*BLANK    D#D02
|   C                     MOVEL'UPT1003' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7499
| 06*C                     ELSE
|   C                     MOVEL#D02      D#D02
| 09-C                     END
|    C*
|    C*業務員代號檢查
| 08-C           DWE18     IFNE *BLANK
|   C           DWE18     CHAINMC0                  41
| 09-C           *IN41     IFEQ '1'
|   C                     MOVEL*BLANK    DMC02
|   C                     MOVEL'UPT1003' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6399
| 06*C                     ELSE
|   C                     MOVELMC02      DMC02
| 09-C                     END
| 08-C                     END
|    C*
|    C*開幕日期檢查
|    C*
| 10-C           DWF14     IFNE 0
|   C                     CALL 'P30'
|   C                     PARM DWF14     P3001I  80
|   C                     PARM $FMT      P3002I  1
|   C                     PARM $TYPE     P3003I  1
|   C                     PARM           P3011O  1
| 11-C           P3011O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6799
| 11-C                     END
|   C   99                GOTO END280
| 10-C                     END
|    C*
|    C*供應商編號檢查--->編號不得重複
| 12-C           DWF02     IFNE *BLANK
|   C           DWF02     CHAINWE0                  40
| 13-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7099
|   C   99                GOTO END280
    C                     ELSE
    C                     MOVELWE03      DWE02A
| 13-C                     END
     C                     ELSE
     C                     MOVE *BLANK    DWE02A
| 12-C                     END
|    C*
| 15-C           DWF03     IFNE *BLANK
|   C           DWF03     CHAINWE0                  40
| 16-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
|   C   99                GOTO END280
    C                     ELSE
    C                     MOVELWE03      DWE03A
| 16-C                     END
     C                     ELSE
     C                     MOVE *BLANK    DWE03A
| 15-C                     END
|    C*
| 18-C           DWF04     IFNE *BLANK
|   C           DWF04     CHAINWE0                  40
| 19-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
|   C   99                GOTO END280
    C                     ELSE
    C                     MOVELWE03      DWE04A
| 19-C                     END
     C                     ELSE
     C                     MOVE *BLANK    DWE04A
| 18-C                     END
|    C*
| 18-C           DWF05     IFNE *BLANK
|   C           DWF05     CHAINWE0                  40
| 19-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7199
    C                     ELSE
    C                     MOVELWE03      DWE05A
| 19-C                     END
     C                     ELSE
     C                     MOVE *BLANK    DWE05A
| 18-C                     END
|    C   99                GOTO END280
|    C*
|    C*客戶代號重複檢查
| 18-C           DWF02     IFNE *BLANK
| 18-C           DWF02     IFEQ DWF03
| 18-C           DWF02     OREQ DWF04
| 18-C           DWF02     OREQ DWF05
|   C                     MOVEL'UPT0140' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     7099
| 18-C                     END
| 18-C                     END
|    C   99                GOTO END280
|    C*
| 18-C           DWF03     IFNE *BLANK
| 18-C           DWF03     IFEQ DWF04
| 18-C           DWF03     OREQ DWF05
|   C                     MOVEL'UPT0140' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6899
| 18-C                     END
| 18-C                     END
|    C   99                GOTO END280
|    C*
| 18-C           DWF04     IFNE *BLANK
| 18-C           DWF04     IFEQ DWF05
|   C                     MOVEL'UPT0140' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6999
| 18-C                     END
| 18-C                     END
|    C   99                GOTO END280
|    C*
|    C*客戶原始代號檢查
| 21-C           DWE20     IFEQ '1'
|   C           DWF06     ANDEQ*BLANK
|   C                     MOVEL'UPT1001' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     727399
|   C   99                GOTO END280
| 21-C                     END
|    C*
| 22-C           DWE20     IFEQ '1'
|   C           DWF06     ANDNE*BLANK
|   C           KEYME     CHAINME0                  40
| 23-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT3001' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     727399
| 23-C                     END
| 22-C                     END
|    C*
| 24-C           DWE20     IFNE '1'
|   C                     MOVEL*BLANK    DWF06
|   C                     MOVEL*BLANK    DWF07
| 24-C                     END
|    C   99                GOTO END280
|    C*
06===CSR         END280    ENDSR
     C*==============================================================*
     C*          R9100 ....DATE TYPE CHANGE 2.(SCREEN TO FILE)
     C*==============================================================*
07===C           R9100     BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM DATE      P3101I  80
|    C                     PARM $FMT      P3102I  1
|    C                     PARM $TYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R9200 ....DATE TYPE CHANGE 2.(FILE TO SCREEN)
     C*==============================================================*
08===C           R9200     BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM FDATE     P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $FMT      P3104I  1
|    C                     PARM $TYPE     P3105I  1
|    C                     PARM           P3111O  80
|    C*
08===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
09===C           RTNF4     BEGSR
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C*
|    C** 游標位置即為(D#ROW,D#COL)
|    C**
|    C*業務員代號查詢
| 01-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE56
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS007'
|   C           DWE11     PARM DWE11     S002O1  2
|   C           DWE11     CHAIN#D0                  40
|   C                     MOVEL#D02      D#D02
|   C                     GOTO ENDF4
| 01-C                     END
|    C*
|    C*業務員代號查詢
| 01-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE62
|   C           D#COL     ANDLE67
|   C                     CALL 'WDS005'
|   C           DWE18     PARM DWE18     S005O1  6
|   C                     GOTO ENDF4
| 01-C                     END
|    C*
|    C*客戶原始代號查詢
| 02-C           D#ROW     IFEQ 20
|   C           D#COL     ANDGE68
|   C           D#COL     ANDLE77
|   C                     CALL 'WDS003'
|   C                     PARM           S003O1  9
|   C                     MOVE S003O1    DWF07
|   C                     MOVELS003O1    DWF06
|   C                     GOTO ENDF4
| 02-C                     END
|    C*
|    C*客戶代號型態查詢
| 03-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE56
|   C           D#COL     ANDLE57
|   C                     CALL 'WDS009'
|   C                     PARM DWE07     PARMI1
|   C           DWE08     PARM DWE08     PARMO1
|   C                     GOTO ENDF4
| 03-C                     END
|    C*
|    C*客戶代號查詢
| 03-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE18
|   C           D#COL     ANDLE22
|   C                     CALL 'WDS031'
|   C           DWF02     PARM *BLANK    S031O1  5
|   C                     GOTO ENDF4
| 03-C                     END
|    C*
| 03-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE32
|   C           D#COL     ANDLE36
|   C                     CALL 'WDS031'
|   C           DWF03     PARM *BLANK    S031O1  5
|   C                     GOTO ENDF4
| 03-C                     END
|    C*
| 03-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE44
|   C           D#COL     ANDLE48
|   C                     CALL 'WDS031'
|   C           DWF04     PARM *BLANK    S031O1  5
|   C                     GOTO ENDF4
| 03-C                     END
|    C*
| 03-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE57
|   C           D#COL     ANDLE61
|   C                     CALL 'WDS031'
|   C           DWF05     PARM *BLANK    S031O1  5
|   C                     GOTO ENDF4
| 03-C                     END
|    C*
09===C           ENDF4     ENDSR
     C*==============================================================*
**
新增修改拷備刪除查詢
