      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : WOB001                                        *
      * AUTHER       : AN MING HSIA                                  *
      * CREATE DATE  : 01/10/94                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :經銷商簡易系統                               *
      * REMARK       :經銷商訂單轉進貨批次                         *
      ****************************************************************
     FWOB001D CF  E                    WORKSTN
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      119 1240$EGMDY
     I*客戶
     I                                      605 609 DSC04
     I*銷退日期（期間）
     I                                      610 6150DSC39S
     I                                      616 6210DSC39E
B2MODI                                      622 6330YSC39S
B2MODI                                      634 6450YSC39E
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN98     PARM *IN98     IN98    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN14     OREQ '1'
    C           *IN99     ANDEQ'0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C                     EXSR RTN100                     .CHECK      ?
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE *BLANK    DSC04
|    C                     Z-ADD0         DSC39S
|    C                     Z-ADD0         DSC39E
|    C                     Z-ADD0         YSC39S
|    C                     Z-ADD0         YSC39E
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C*經銷商代號
| 01-C           DSC04     IFEQ *BLANK
|   C                     SETON                     619599
| 01-C                     END
|    C   99                GOTO END100
|    C*確認日期
|    C                     CALL 'P09'
B2???C                     PARM DSC39S    P0901I  80
B2INF *CVR3012 sev.30 Field DSC39S contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0901O  1
|    C*
| 04-C           P0901O    IFEQ 'N'
|   C                     SETON                     629399
| 04*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSC39S    S001I2  80
B2INF *CVR3012 sev.30 Field DSC39S contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           YSC39S    PARM           S001O1  80
| 04-C                     END
|    C*
|    C                     CALL 'P09'
B2???C                     PARM DSC39E    P0901I  80
B2INF *CVR3012 sev.30 Field DSC39E contains more than one year
B2INF *CVR3012 sev.30 Field P0901I contains more than one year
|    C                     PARM           P0901O  1
|    C*
| 05-C           P0901O    IFEQ 'N'
|   C                     SETON                     639399
| 05*C                     ELSE
|   C                     CALL 'RES001'
|   C                     PARM 'MDY'     S001I1  3
B2???C                     PARM DSC39E    S001I2  80
B2INF *CVR3012 sev.30 Field DSC39E contains more than one year
B2INF *CVR5011 sev.50 Field S001I2 is generic. Propagation engine found
B2INF *   relationships with seeded dates and non-dates. Therefore, the
B2INF *   tool cannot decide whether this is a date field or not. The
B2INF *   cause of the problem may be incorrect or insufficient seeding.
B2INF *   Please verify.
B2MODC           YSC39E    PARM           S001O1  80
| 05-C                     END
|    C*
B2000C           YSC39S    IFGT YSC39E
|   C                     SETON                     6269
|   C                     SETON                     9299
| 06-C                     END
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
03===C           OUTLDA    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     OUT  *NAMVAR
|    C*
03===C           ENDLDA    ENDSR
