      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : WOR120                                        *
      * AUTHER       :                                               *
      * CREATE DATE  : 85/08/20                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶清冊                                     *
      ****************************************************************
     FWOR120D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      598 5990$PRTID
     I                                      611 611 DWE07S
     I                                      612 612 DWE07E
     I                                      613 614 DWE15S
     I                                      615 616 DWE15E
     I                                      617 622 DWE18S
     I                                      623 628 DWE18E
     I                                      629 629 DWE1S
     I                                      630 630 DWE1E
     I                                      631 631 DWE2S
     I                                      632 632 DWE2E
     I                                      633 633 DWE3S
     I                                      634 634 DWE3E
     I                                      635 635 DWE4S
     I                                      636 636 DWE4E
     I                                      637 637 DWE5S
     I                                      638 638 DWE5E
     I                                      639 639 DWE6S
     I                                      640 640 DWE6E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C                     EXSR RTN011                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C*                    EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     MOVEL$USER     AUT     3
| 04-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 04-C                     END
|    C                     MOVE *BLANK    DWE07S
|    C                     MOVE *BLANK    DWE07E
|    C                     MOVE *BLANK    DWE15S
|    C                     MOVE *BLANK    DWE15E
|    C                     MOVE *BLANK    DWE18S
|    C                     MOVE *BLANK    DWE18E
|    C                     MOVE *BLANK    DWE1S
|    C                     MOVE *BLANK    DWE1E
|    C                     MOVE *BLANK    DWE2S
|    C                     MOVE *BLANK    DWE2E
|    C                     MOVE *BLANK    DWE3S
|    C                     MOVE *BLANK    DWE3E
|    C                     MOVE *BLANK    DWE4S
|    C                     MOVE *BLANK    DWE4E
|    C                     MOVE *BLANK    DWE5S
|    C                     MOVE *BLANK    DWE5E
|    C                     MOVE *BLANK    DWE6S
|    C                     MOVE *BLANK    DWE6E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN011....INIT MESSAGE
      *===============================================================*
02===C           RTN011    BEGSR
| 01-C           *IN97     IFEQ '1'
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           *IN98     IFEQ '1'
|   C                     MOVEL'UPT2070' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
02===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
03===C           RTN100    BEGSR
|    C**通路
| 01-C           DWE07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE07S
| 01-C                     END
|    C*
| 02-C           DWE07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE07E
| 02-C                     END
|    C*
| 03-C           DWE07S    IFGT DWE07E
|   C                     SETON                     666799
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO END100
|    C**地區
| 04-C           DWE18S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE18S
| 04-C                     END
|    C*
| 05-C           DWE18E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE18E
| 05-C                     END
|    C*
| 06-C           DWE07S    IFGT DWE07E
|   C                     SETON                     626399
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 06-C                     END
|    C   99                GOTO END100
|    C**業務員
| 07-C           DWE15S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE15S
| 07-C                     END
|    C*
| 08-C           DWE15E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE15E
| 08-C                     END
|    C*
| 09-C           DWE15S    IFGT DWE15E
|   C                     SETON                     646599
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 09-C                     END
|    C   99                GOTO END100
|    C**等級 (REMY)
| 10-C           DWE1S     IFEQ *BLANKS
|   C                     MOVE *BLANK    DWE1S
| 10-C                     END
|    C*
| 11-C           DWE1E     IFEQ *BLANKS
|   C                     MOVE 'Z'       DWE1E
| 11-C                     END
|    C*
| 12-C           DWE1S     IFGT DWE1E
|   C                     SETON                     686999
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 12-C                     END
|    C   99                GOTO END100
|    C**等級 (BRANDY)
| 13-C           DWE2S     IFEQ *BLANKS
|   C                     MOVE *BLANK    DWE2S
| 13-C                     END
|    C*
| 14-C           DWE2E     IFEQ *BLANKS
|   C                     MOVE 'Z'       DWE2E
| 14-C                     END
|    C*
| 15-C           DWE2S     IFGT DWE2E
|   C                     SETON                     707199
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 15-C                     END
|    C   99                GOTO END100
|    C**等級 (WHISKEY)
| 16-C           DWE3S     IFEQ *BLANKS
|   C                     MOVE *BLANK    DWE3S
| 16-C                     END
|    C*
| 17-C           DWE3E     IFEQ *BLANKS
|   C                     MOVE 'Z'       DWE3E
| 17-C                     END
|    C*
| 18-C           DWE3S     IFGT DWE3E
|   C                     SETON                     727399
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 18-C                     END
|    C   99                GOTO END100
|    C**等級 (LIQUPR)
| 19-C           DWE4S     IFEQ *BLANKS
|   C                     MOVE *BLANK    DWE4S
| 19-C                     END
|    C*
| 20-C           DWE4E     IFEQ *BLANKS
|   C                     MOVE 'Z'       DWE4E
| 20-C                     END
|    C*
| 21-C           DWE1S     IFGT DWE1E
|   C                     SETON                     747599
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 21-C                     END
|    C   99                GOTO END100
|    C**等級 (WINE)
| 22-C           DWE5S     IFEQ *BLANKS
|   C                     MOVE *BLANK    DWE5S
| 22-C                     END
|    C*
| 23-C           DWE5E     IFEQ *BLANKS
|   C                     MOVE 'Z'       DWE5E
| 23-C                     END
|    C*
| 24-C           DWE5S     IFGT DWE5E
|   C                     SETON                     767799
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 24-C                     END
|    C   99                GOTO END100
|    C**等級 (OTHER)
| 25-C           DWE6S     IFEQ *BLANKS
|   C                     MOVE *BLANK    DWE6S
| 25-C                     END
|    C*
| 26-C           DWE6E     IFEQ *BLANKS
|   C                     MOVE 'Z'       DWE6E
| 26-C                     END
|    C*
| 27-C           DWE6S     IFGT DWE6E
|   C                     SETON                     787999
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 27-C                     END
|    C   99                GOTO END100
|    C*
|    C*
03===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
04===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 9
| 03-C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C           DWE18S    PARM DWE18S    PWE15   6
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFGE 47
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS015'
|   C           DWE18E    PARM DWE18E    PWE15
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 05-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 01-C                     END
|    C*
|    C           ENDF4     TAG
04===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
05===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
05===C           ENDLDA    ENDSR
