      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : WOR1001  ---*USE WOR100AP                     *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶清冊                                     *
      ****************************************************************
     FREWF181 IP  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FMTMDPF  IF  E           K        DISK
     FWOR120P O   E             39     PRINTER
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      606 610 DWE01E
     I                                      611 611 DWE07S
     I                                      612 612 DWE07E
     I                                      613 614 DWE15S
     I                                      615 616 DWE15E
     I                                      617 622 DWE18S
     I                                      623 628 DWE18E
     I                                      629 629 DWE1S
     I                                      630 630 DWE1E
     I                                      631 631 DWE2S
     I                                      632 632 DWE2E
     I                                      633 633 DWE3S
     I                                      634 634 DWE3E
     I                                      635 635 DWE4S
     I                                      636 636 DWE4E
     I                                      637 637 DWE5S
     I                                      638 638 DWE5E
     I                                      639 639 DWE6S
     I                                      640 640 DWE6E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R100
     C*
     C                     EXSR R200                       .DETAIL
     C*
     CLR 10                EXSR R900
     CLRN10                EXSR R800
     C*==============================================================*
     C*          R100  ... INITIAL PROCESS
     C*==============================================================*
01===C           R100      BEGSR
|    C*
|    C                     SETON                     10
|    C*
|    C                     WRITEPH1
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R200  ... DETAIL
     C*==============================================================*
02===C           R200      BEGSR
|    C*
|    C                     MOVE *BLANK    PWE1    1
|    C                     MOVE *BLANK    PWE2    1
|    C                     MOVE *BLANK    PWE3    1
|    C                     MOVE *BLANK    PWE4    1
|    C                     MOVE *BLANK    PWE5    1
|    C                     MOVE *BLANK    PWE6    1
|    C*
|    C           WF06      CHAINMD0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MD22
     C                     ELSE
     C                     Z-ADDMD22      PMD22  100
| 01-C                     END
|    C           WE18      CHAINMC0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVE *BLANK    MC02
| 02-C                     END
|    C*
|    C           1         SUBSTWF08:1    PWE1
|    C           1         SUBSTWF08:2    PWE2
|    C           1         SUBSTWF08:3    PWE3
|    C           1         SUBSTWF08:4    PWE4
|    C           1         SUBSTWF08:5    PWE5
|    C           1         SUBSTWF08:6    PWE6
|    C*
|    C                     WRITEPD1
|    C*
| 03-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 03-C                     END
|    C*
02===C           E200      ENDSR
     C*==============================================================*
     C*          R900  ... LEVEL BREAK LR -- HAS DATA
     C*==============================================================*
03===C           R900      BEGSR
|    C*
|    C                     WRITEPE2
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R800  ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
04===C           R800      BEGSR
|    C*
|    C                     WRITEPH1
|    C*
|    C                     WRITEPE9
|    C*
04===C                     ENDSR
