      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : WOR1101  ---*USE WOR110AP                     *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶員工                                     *
      ****************************************************************
     FWOWIPF  IP  E           K        DISK
     FWOWEPF  IF  E           K        DISK
     FMTMCPF  IF  E           K        DISK
     FWOR110P O   E             39     PRINTER
     IPTDA01      DS
     I                                        1   1 $FMT
     I                                        2   2 $TYPE
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I                                      601 605 DWE01S
     I                                      606 610 DWE01E
     I                                      611 611 DWE07S
     I                                      612 612 DWE07E
     I                                      613 614 DWE15S
     I                                      615 616 DWE15E
     I                                      617 622 DWE18S
     I                                      623 628 DWE18E
     I                                      629 6300DWI05S
     I                                      631 6320DWI05E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R1000
     C*
     C                     EXSR R2000                      .DETAIL
     C*
     CLR 10                EXSR R8900
     CLRN10                EXSR R8999
     C*==============================================================*
     C*          R1000 ... INITIAL PROCESS
     C*==============================================================*
     C           R1000     BEGSR
     C*
     C           *NAMVAR   DEFN           PTDA01           TRAN DATE
|    C                     IN   PTDA01
     C*
     C                     SETON                     10
     C*
     C                     WRITEPH1
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R2000 ... DETAIL
     C*==============================================================*
     C           R2000     BEGSR
     C*
     C           WI01      CHAINWE0                  40
     C           *IN40     IFEQ '0'
     C*
     C           WE18      CHAINMC0                  41
     C           *IN41     IFEQ '1'
     C                     MOVE *BLANK    MC02
     C                     END
     C*
|    C                     Z-ADDWI05      FDATE   80
|    C                     EXSR R9200
|    C                     Z-ADDP3111O    WI05P
     C*
     C                     WRITEPD1
     C*
     C           *IN39     IFEQ '1'
     C                     WRITEPE1
     C                     WRITEPH1
     C                     SETOF                     39
     C                     END
     C*
     C                     END
     C*
     C           E2000     ENDSR
     C*==============================================================*
     C*          R8900 ... LEVEL BREAK LR -- HAS DATA
     C*==============================================================*
     C           R8900     BEGSR
     C*
     C                     WRITEPE2
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R8999 ... LEVEL BREAK LR -- NO DATA
     C*==============================================================*
     C           R8999     BEGSR
     C*
     C                     WRITEPH1
     C*
     C                     WRITEPE9
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R9100 ....DATE TYPE CHANGE 2.(SCREEN TO FILE)
     C*==============================================================*
07===C           R9100     BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM FDATE     P3101I  80
|    C                     PARM $FMT      P3102I  1
|    C                     PARM $TYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R9200 ....DATE TYPE CHANGE 2.(FILE TO SCREEN)
     C*==============================================================*
08===C           R9200     BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM FDATE     P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $FMT      P3104I  1
|    C                     PARM $TYPE     P3105I  1
|    C                     PARM           P3111O  80
|    C*
08===C                     ENDSR
