      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : WOR110                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶員工                                     *
      ****************************************************************
     FWOR110D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     IPTDA01      DS
     I                                        1   1 $FMT
     I                                        2   2 $TYPE
     I*
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      598 5990$PRTID
     I                                      601 605 DWE01S
     I                                      606 610 DWE01E
     I                                      611 611 DWE07S
     I                                      612 612 DWE07E
     I                                      613 614 DWE15S
     I                                      615 616 DWE15E
     I                                      617 622 DWE18S
     I                                      623 628 DWE18E
     I                                      629 6300DWI05S
     I                                      631 6320DWI05E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C                     EXSR RTN011                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C*                    EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
     C           *NAMVAR   DEFN           PTDA01           TRAN DATE
|    C                     IN   PTDA01
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     MOVEL$USER     AUT     3
|    C           AUT       IFNE 'D91'
|    C           AUT       ANDNE'REP'
|    C                     SETON                     31
|    C                     END
|    C                     MOVE *BLANK    DWE01S
|    C                     MOVE *BLANK    DWE01E
|    C                     MOVE *BLANK    DWE07S
|    C                     MOVE *BLANK    DWE07E
|    C                     MOVE *BLANK    DWE15S
|    C                     MOVE *BLANK    DWE15E
|    C                     MOVE *BLANK    DWE18S
|    C                     MOVE *BLANK    DWE18E
|    C                     Z-ADD0         DWI05S
|    C                     Z-ADD0         DWI05E
|    C                     Z-ADD0         FDATE   80
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN011....INIT MESSAGE
      *===============================================================*
01===C           RTN011    BEGSR
| 03-C           *IN97     IFEQ '1'
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
| 03-C           *IN98     IFEQ '1'
|   C                     MOVEL'UPT2070' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**通路
| 04-C           DWE07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE07S
| 04-C                     END
|    C*
| 05-C           DWE07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE07E
| 05-C                     END
|    C*
| 06-C           DWE07S    IFGT DWE07E
|   C                     SETON                     666799
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 06-C                     END
|    C   99                GOTO END100
|    C**業務員
| 04-C           DWE18S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE18S
| 04-C                     END
|    C*
| 05-C           DWE18E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE18E
| 05-C                     END
|    C*
| 06-C           DWE18S    IFGT DWE18E
|   C                     SETON                     626399
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 06-C                     END
|    C   99                GOTO END100
|    C**地區
| 04-C           DWE15S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE15S
| 04-C                     END
|    C*
| 05-C           DWE15E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE15E
| 05-C                     END
|    C*
| 06-C           DWE15S    IFGT DWE15E
|   C                     SETON                     646599
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 06-C                     END
|    C   99                GOTO END100
|    C**客戶代號
| 01-C           DWE01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE01S
| 01-C                     END
|    C*
| 02-C           DWE01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE01E
| 02-C                     END
|    C*
| 03-C           DWE01S    IFGT DWE01E
|   C                     SETON                     606199
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO END100
|    C* 生日
| 02-C*          DWI05S    IFEQ 0
|   C*                    Z-ADD1         DWI05S
| 02-C*                    END
|    C*
| 02-C           DWI05E    IFEQ 0
|   C                     Z-ADD12        DWI05E
| 02-C                     END
|    C*
|    C*
| 06-C           DWI05S    IFGT DWI05E
|   C                     SETON                     686999
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 06-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
| 02-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'WDS003'
|   C           DWE01S    PARM *BLANKS   W003    9
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 11
|   C           D#COL     ANDGE47
|   C           D#COL     ANDLE51
|   C                     CALL 'WDS003'
|   C           DWE01E    PARM *BLANKS   W003    9
|   C                     GOTO ENDF4
| 02-C                     END
     C*
|   C*
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     IFGE 38
|   C           D#COL     ANDLE43
|   C                     CALL 'WDS015'
|   C           DWE18S    PARM DWE18S    PWE15   6
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
|   C           D#COL     IFGE 47
|   C           D#COL     ANDLE52
|   C                     CALL 'WDS015'
|   C           DWE18E    PARM DWE18E    PWE15
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 02-C                     END
|   C*
| 02-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     TAG
03===C                     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  LDA
|    C*
04===C           ENDLDA    ENDSR
     C*==============================================================*
     C*          R9100 ....DATE TYPE CHANGE 2.(SCREEN TO FILE)
     C*==============================================================*
07===C           R9100     BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM FDATE     P3101I  80
|    C                     PARM $FMT      P3102I  1
|    C                     PARM $TYPE     P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C                     PARM           P3111O  80
|    C*
07===C                     ENDSR
     C*==============================================================*
     C*          R9200 ....DATE TYPE CHANGE 2.(FILE TO SCREEN)
     C*==============================================================*
08===C           R9200     BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM FDATE     P3101I  80
|    C                     PARM '2'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM $FMT      P3104I  1
|    C                     PARM $TYPE     P3105I  1
|    C                     PARM           P3111O  80
|    C*
08===C                     ENDSR
