      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : WOR100                                        *
      * AUTHER       : A1139  JANE                                   *
      * CREATE DATE  : 81/02/13                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :主檔                                         *
      * REMARK       :客戶清冊                                     *
      ****************************************************************
     FWOR100D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      598 5990$PRTID
     I                                      601 605 DWE01S
     I                                      606 610 DWE01E
     I                                      611 611 DWE07S
     I                                      612 612 DWE07E
     I                                      613 613 DWE10S
     I                                      615 615 DWE10E
     I                                      617 622 DWE18S
     I                                      623 628 DWE18E
     I                                      629 630 DWE08S
     I                                      631 632 DWE08E
     I                                      633 634 DWE11S
     I                                      635 636 DWE11E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C                     EXSR RTN011                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     Z-ADD0         D#ROW
    C                     Z-ADD0         D#COL
  02-C           *IN03     IFEQ '0'
  03-C           *IN04     IFEQ '1'
    C**********************
    C*  F4 PROMPT PROCESS *
    C**********************
    C                     EXSR RTNF4
  03*C                     ELSE
    C                     EXSR RTN100                     .CHECK      ?
  03-C                     END
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     MOVEL$USER     AUT     3
| 04-C           AUT       IFNE 'D91'
|   C           AUT       ANDNE'REP'
|   C                     SETON                     31
| 04-C                     END
|    C                     MOVE *BLANK    DWE01S
|    C                     MOVE *BLANK    DWE01E
|    C                     MOVE *BLANK    DWE07S
|    C                     MOVE *BLANK    DWE07E
|    C                     MOVE *BLANK    DWE10S
|    C                     MOVE *BLANK    DWE10E
|    C                     MOVE *BLANK    DWE18S
|    C                     MOVE *BLANK    DWE18E
|    C                     MOVE *BLANK    DWE08S
|    C                     MOVE *BLANK    DWE08E
|    C                     MOVE *BLANK    DWE11S
|    C                     MOVE *BLANK    DWE11E
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN011....INIT MESSAGE
      *===============================================================*
02===C           RTN011    BEGSR
| 01-C           *IN97     IFEQ '1'
|   C                     MOVEL'UPT2110' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 01-C                     END
|    C*
| 02-C           *IN98     IFEQ '1'
|   C                     MOVEL'UPT2070' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 02-C                     END
|    C*
02===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
03===C           RTN100    BEGSR
|    C**通路
| 01-C           DWE07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE07S
| 01-C                     END
|    C*
| 02-C           DWE07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE07E
| 02-C                     END
|    C*
| 03-C           DWE07S    IFGT DWE07E
|   C                     SETON                     666799
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 03-C                     END
|    C   99                GOTO END100
|    C**型態
| 04-C           DWE08S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE08S
| 04-C                     END
|    C*
| 05-C           DWE08E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE08E
| 05-C                     END
|    C*
| 06-C           DWE08S    IFGT DWE08E
|   C                     SETON                     717299
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 06-C                     END
|    C   99                GOTO END100
|    C**地區
| 07-C           DWE10S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE10S
| 07-C                     END
|    C*
| 08-C           DWE10E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE10E
| 08-C                     END
|    C*
| 09-C           DWE10S    IFGT DWE10E
|   C                     SETON                     646599
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 09-C                     END
|    C   99                GOTO END100
|    C**區域
| 10-C           DWE11S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE11S
| 10-C                     END
|    C*
| 11-C           DWE11E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE11E
| 11-C                     END
|    C*
| 12-C           DWE11S    IFGT DWE11E
|   C                     SETON                     737499
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 12-C                     END
|    C   99                GOTO END100
|    C**業務員
| 13-C           DWE18S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE18S
| 13-C                     END
|    C*
| 14-C           DWE18E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE18E
| 14-C                     END
|    C*
| 15-C           DWE18S    IFGT DWE18E
|   C                     SETON                     626399
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 15-C                     END
|    C   99                GOTO END100
|    C**客戶代號
| 16-C           DWE01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DWE01S
| 16-C                     END
|    C*
| 17-C           DWE01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DWE01E
| 17-C                     END
|    C*
| 18-C           DWE01S    IFGT DWE01E
|   C                     SETON                     606199
|   C                     MOVEL'UPT0042' ERRID
|   C                     MOVEL'PTMF'    ERRF
| 18-C                     END
|    C   99                GOTO END100
|    C*
|    C*
03===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
04===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*通路
| 02-C           D#ROW     IFEQ 5
| 03-C           D#COL     IFEQ 38
|   C                     CALL 'WDS018'
|   C                     PARM           DWE07S
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#COL     IFEQ 47
|   C                     CALL 'WDS018'
|   C                     PARM           DWE07E
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 02-C                     END
|   C*型態
| 05-C           D#ROW     IFEQ 6
| 06-C           D#COL     IFGE 38
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS009'
|   C                     PARM DWE07S    PWE07S  1
|   C                     PARM           DWE08S
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 07-C           D#COL     IFGE 47
|   C           D#COL     ANDLE49
|   C                     CALL 'WDS009'
|   C                     PARM DWE07E    PWE07E  1
|   C                     PARM           DWE08E
|   C                     GOTO ENDF4
| 07-C                     END
| 05-C                     END
|   C*區域查詢
| 08-C           D#ROW     IFEQ 9
| 09-C           D#COL     IFGE 38
|   C           D#COL     ANDLE40
|   C                     CALL 'WDS007'
|   C                     PARM           DWE11S
|   C                     GOTO ENDF4
| 09-C                     END
| 10-C           D#COL     IFGE 47
|   C           D#COL     ANDLE49
|   C                     CALL 'WDS007'
|   C                     PARM           DWE11E
|   C                     GOTO ENDF4
| 10-C                     END
|   C*
| 08-C                     END
|   C*印表機
| 11-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 11-C                     END
|   C*
| 01-C                     END
|    C*
04===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
05===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
05===C           ENDLDA    ENDSR
