     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : IMA001                                     *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    DATE WRITTEN : 81/03/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :送貨確認作業處理                          *
     A****************************************************************
     FSOSEPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSFPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSCPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSDPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSIPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FIMIAPF  UF  E           K        DISK                      A
     F                                              KINFSR ERRSR
     FMTMAPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FMTMDPF  UF  E           K        DISK
     F                                              KINFSR ERRSR
     FSOSELF03IF  E           K        DISK
     F            SE0                               KRENAMESE0L
     FPA#FLF  IF  E           K        DISK
     F                                              KINFDS #FRCDN
     F            #A0                               KRENAME#F0L
     F            MD0                               KRENAMEMD0L
     FPA#APF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPA#2PF  IF  E           K        DISK
     FMTMEPF  IF  E           K        DISK
     FIMIBPF  IF  E           K        DISK
     FSOSAPF  IF  E           K        DISK
     FSOSBPF  IF  E           K        DISK
     FIMA001D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     F                                        RRN3  KSFILE SFLSR3
     E*: FUNCTION DATA :
     E                    WFUN    6   6  6
     E*: FUNCTION DATA :
     E                    WTYPE   5   9 10
     E*: A/U/D/I AUT
     E                    WA01        6  1
     I*
     I*SDS        SDS
     I*                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
 @   I                                      135 135 $ADD
 @   I                                      136 136 $UPD
 @   I                                      137 137 $DLT
 @   I                                      138 138 $INQ
 @   I                                      139 139 $RMK01
 @   I*                                     140 140 $RMK02
 @   I*                                     141 141 $RMK03
     I*                                     162 1620$EVR
     I*                                     125 1270$CPY
     I*                                     598 5990$LPRT
     I                                      501 505 $WRHUS
     I*                                     506 506 $PURID
     I*                                     507 507 $TRNID
     I*                                     508 512 $APAU1
     I                                      513 513 $WRHTY
     I*                                     514 521 $#101
     I*                                     522 522 $APAU2
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I#FRCDN      DS
     I                                     *RECORD  RCDN
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
     C                     Z-ADD0         HRRN1   40
     C                     Z-ADD0         CHKNUM  60
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
      *  FOR SUBFILE (SYS+PGM CONTROL)
     C           *LIKE     DEFN DBGN1     BBGN1            *SUBFIL BUTTOM
     C*
     C           *LIKE     DEFN IA01      WIA01                        OM
     C           *LIKE     DEFN IA02      WIA02                        OM
     C           *LIKE     DEFN IA03      WIA03                        OM
     C*
     C           *LIKE     DEFN SD02      WSD02                        OM
     C           *LIKE     DEFN SD03      WSD03                        OM
     C*
     C           *LIKE     DEFN MA41      WMA41                        OM
     C           *LIKE     DEFN SD10      WSD10                        OM
     C           *LIKE     DEFN SD07      WSD07                        OM
     C*
     C           *LIKE     DEFN SE08      WSE08                        OM
     C           *LIKE     DEFN SE08      TSE08                        OM
     C           *LIKE     DEFN SE08      HSE08                        OM
     C*
     C           *LIKE     DEFN SF13      WSF13                        OM
     C           *LIKE     DEFN SF14      WSF14                        OM
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYSE1    KLIST
     C                     KFLD           DSE07
     C           KEYSE2    KLIST
     C                     KFLD           DSE07
     C                     KFLD           DBGN1
     C           KEYSE3    KLIST
     C                     KFLD           DSE07
     C                     KFLD           BBGN1
     C           KEYSE4    KLIST
     C                     KFLD           SE02
     C           KEYSF1    KLIST
     C                     KFLD           SE02
     C           KEYSF2    KLIST
     C                     KFLD           SE02
     C                     KFLD           SF03
     C           KEYIA     KLIST
     C                     KFLD           WIA01
     C                     KFLD           WIA02
     C                     KFLD           WIA03
     C           KEYSC     KLIST
     C                     KFLD           SE29
     C           KEYSD     KLIST
     C                     KFLD           WSD02
     C                     KFLD           WSD03
     C           KEYMA     KLIST
     C                     KFLD           SF03
     C           KEYME     KLIST
     C                     KFLD           SE04
     C                     KFLD           SE05
     C           KEY#2     KLIST
     C                     KFLD           #201
     C                     KFLD           #202
     C           KEY#A     KLIST
     C                     KFLD           #A01
     C                     KFLD           #A02
     C           KEY#B     KLIST
     C                     KFLD           SE01
     C           KEYIB     KLIST
     C                     KFLD           SF03
     C                     KFLD           SE06
     C           KEYSA1    KLIST
     C                     KFLD           SF03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
     C                     KFLD           SE06
     C           KEYSA2    KLIST
     C                     KFLD           SF03
     C                     KFLD           MD07
     C                     KFLD           MD08
     C                     KFLD           SA04
     C           KEYSB1    KLIST
     C                     KFLD           #B14
     C                     KFLD           SF03
     C                     KFLD           SB04
     C                     KFLD           SE06
     C           KEYSB2    KLIST
     C                     KFLD           #B14
     C                     KFLD           SF03
     C                     KFLD           SB04
     C           KEYSI     KLIST
     C                     KFLD           SE01
     C                     KFLD           SE30
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C*                    MOVE $ADD      WA01,1
|    C*                    MOVE $UPD      WA01,2
|    C*                    MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $RMK01    WA01,6
|    C*
|    C                     MOVE *BLANKS   DSE07
|    C                     MOVE *BLANKS   DSTOR
|    C*
|    C                     MOVE 'SCR001'  APPSCR
B2MODC                     Z-ADD0         DATE    80
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
B2???C                     PARM $EGMDY    S001I2  80
B2INF *CVR5008 sev.50 The converter tool cannot handle op-code PARM
B2INF *   involving not-expanded and expanded date fields requiring
B2INF *   add/remove century. Code must be adjusted manually
B2MODC           DATE      PARM           S001O1  80
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C**         RTN110    BEGSR
|    C*
|    C*
02===C**                   ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
03===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C                     Z-ADD0         HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVE DBGN1     OBGN1
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
04===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *57 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *57 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
|   C                     SETON                     95
| 05-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN180....CHECK 'SC01' SCREEN
     C*==============================================================*
05===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609699
| 01-C                     END
|    C   99                GOTO END180
|    C*
|    C           END180    TAG
|    C   99                Z-ADDRRN1      DRRN1
|    C*
05===C                     ENDSR
     C*=========================================================*
     C*          RTN191....INITIAL                              *
     C*=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
| 01-C           $WRHUS    IFEQ '*ALL'
|   C           KEYSE2    SETLLSE0L
| 01*C                     ELSE
| 02-C           $WRHUS    IFNE *BLANKS
|   C                     MOVE $WRHUS    DSE07
|   C           KEYSE2    SETLLSE0L
| 02*C                     ELSE
|   C                     MOVEL$WRHTY    DSE07
|   C           KEYSE2    SETLLSE0L
| 02-C                     END
| 01-C                     END
|    C                     MOVE DBGN1     BBGN1
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     98    *LST PAG
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
|   C                     MOVE SE02      BBGN1
|   C***        *LOVAL    SETLLSE0L
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     SETOF                     54
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
|    C***
| 01-C           RRN1      DOWLTDSPRC1
|   C*
| 02-C           $WRHUS    IFEQ '*ALL'
|   C                     READ SE0L                     46
| 02*C                     ELSE
| 03-C           $WRHUS    IFNE *BLANKS
|   C           KEYSE1    READESE0L                     46
| 03*C                     ELSE
|   C                     MOVE *BLANKS   DSE07
|   C                     MOVEL$WRHTY    DSE07
|   C                     READ SE0L                     46
| 04-C           *IN46     IFEQ '0'
|   C                     MOVELSE07      WQUERY  1
| 05-C           WQUERY    IFNE $WRHTY
|   C                     SETON                     46
| 05-C                     END
| 04-C                     END
| 03-C                     END
| 02-C                     END
|   C*
| 06-C           *IN46     IFEQ '0'
|   C* GET 單別
|   C                     MOVELSE03      #201
|   C                     MOVELSE03      #202
|   C           KEY#2     CHAIN#20                  40
| 07-C           *IN40     IFEQ '0'
|   C                     MOVEL#203      D#203
| 07*C                     ELSE
|   C                     MOVE *BLANK    D#203
| 07-C                     END
|   C* GET客戶簡稱
|   C           KEYME     CHAINME0                  40
|   C   40                MOVE *BLANK    ME04
|   C*
|   C* GET確認
B2CHKC           SE24      IFEQ 0
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C                     MOVE '*'       DTYPE
| 08*C                     ELSE
|   C                     MOVE *BLANKS   DTYPE
| 08-C                     END
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 06*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C                     SETON                     53
| 06-C                     END
|   C*
| 01-C                     END
|    C*
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
|   C                     SETON                     94    *NODATA
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C*
| 02-C           *IN50     IFEQ '1'
| 03-C           $WRHUS    IFEQ '*ALL'
|   C                     MOVEL$WRHUS    DSE07
|   C                     MOVEL'全部'  DSTOR
| 03*C                     ELSE
| 04-C           $WRHUS    IFNE *BLANKS
|   C                     MOVE $WRHUS    DSE07
|   C* GET送貨物流點
|   C           DSE07     CHAINPA#FLF               40
| 05-C           RCDN      IFEQ 'MD0L'
|   C           DSE07     CHAINME0                  40
|   C   40                MOVE *BLANKS   DSTOR
|   C  N40                MOVELME04      DSTOR
| 05*C                     ELSE
|   C                     MOVE *BLANKS   #A01
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELDSE07     #A02
|   C           KEY#A     CHAIN#A0                  40
|   C   40                MOVE *BLANKS   DSTOR
|   C  N40                MOVEL#A03      DSTOR
| 05-C                     END
|   C*
| 04*C                     ELSE
| 06-C           $WRHTY    IFEQ 'A'
|   C                     MOVEL$WRHTY    DSE07
|   C                     MOVELWTYPE,1   DSTOR
| 06-C                     END
| 07-C           $WRHTY    IFEQ 'B'
|   C                     MOVEL$WRHTY    DSE07
|   C                     MOVELWTYPE,2   DSTOR
| 07-C                     END
| 08-C           $WRHTY    IFEQ 'C'
|   C                     MOVEL$WRHTY    DSE07
|   C                     MOVELWTYPE,3   DSTOR
| 08-C                     END
| 09-C           $WRHTY    IFEQ 'D'
|   C                     MOVEL$WRHTY    DSE07
|   C                     MOVELWTYPE,4   DSTOR
| 09-C                     END
| 10-C           $WRHTY    IFEQ 'E'
|   C                     MOVEL$WRHTY    DSE07
|   C                     MOVELWTYPE,5   DSTOR
| 10-C                     END
| 11-C           $WRHTY    IFEQ 'F'
|   C                     MOVEL$WRHTY    DSE07
|   C                     MOVELWTYPE,6   DSTOR
| 11-C                     END
| 12-C           $WRHTY    IFEQ 'Z'
|   C                     MOVEL$WRHTY    DSE07
|   C                     MOVELWTYPE,7   DSTOR
| 12-C                     END
| 13-C           $WRHTY    IFEQ 'T'
|   C                     MOVEL$WRHTY    DSE07
|   C                     MOVELWTYPE,8   DSTOR
| 13-C                     END
| 14-C           $WRHTY    IFEQ 'W'
|   C                     MOVEL$WRHTY    DSE07
|   C                     MOVELWTYPE,9   DSTOR
| 14-C                     END
| 04-C                     END
| 03-C                     END
| 02*C                     ELSE
|   C                     MOVE *BLANKS   DSE07
|   C                     MOVE *BLANKS   DSTOR
| 02-C                     END
|    C*
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C*                    Z-ADD0         D#ROW
|    C*                    Z-ADD0         D#COL
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
|    C                     MOVE WFUN,WNUM DFUN
| 01-C           DOPT1     CASEQ'5'       RTN240           *INQ
|   C           DOPT1     CASEQ'6'       RTN250           *確認
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLSE0
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
11===C           RTN240    BEGSR
|    C*
|    C                     MOVE 'SCR003'  APPSCR
|    C           KEYSE4    CHAINSE0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C*
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR3
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN99     IFEQ '0'                         SAVE
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLSE0
|   C           *LOVAL    SETLLSF0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN250....UPD DATA
      *==============================================================*
12===C           RTN250    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C           KEYSE4    CHAINSE0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C*
|    C                     SETON                     31
|    C                     EXSR RTN291                     *INT SFLSR
|    C                     EXSR RTN298                     *READ DATA
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     WRITEDSPC2
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C*                    Z-ADD0         D#ROW
|   C*                    Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
|   C                     EXSR RTN280
|   C*
| 04-C           *IN99     IFEQ '0'                         SAVE
|   C           *IN14     ANDEQ'1'                         SAVE
|   C                     EXSR RTN29S                      ADD D
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLSE0
|   C           *LOVAL    SETLLSF0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
13===CSR         RTN252    BEGSR
|    C*
|    C* GET 公司代號
|    C           KEY#B     CHAIN#B0                  40
|    C   40                MOVE *BLANKS   #B03
|    C*
|    C* GET 單別
|    C                     MOVELSE03      #201
|    C                     MOVELSE03      #202
|    C           KEY#2     CHAIN#20                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVEL#203      D#203
| 01*C                     ELSE
|   C                     MOVE *BLANK    D#203
| 01-C                     END
|    C* GET客戶簡稱
|    C           KEYME     CHAINME0                  40
|    C   40                MOVE *BLANK    ME04
|    C* GET物流點起
|    C           SE07      CHAINPA#FLF               40
| 02-C           RCDN      IFEQ 'MD0L'
|   C           SE07      CHAINME0                  40
|   C   40                MOVE *BLANKS   DSTOR1
|   C  N40                MOVELME04      DSTOR1
| 02*C                     ELSE
|   C                     MOVE *BLANKS   #A01
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELSE07      #A02
|   C           KEY#A     CHAIN#A0                  40
|   C   40                MOVE *BLANKS   DSTOR1
|   C  N40                MOVEL#A03      DSTOR1
| 02-C                     END
|    C* GET物流點迄
|    C           SE26      CHAINPA#FLF               40
| 03-C           RCDN      IFEQ 'MD0L'
|   C           SE26      CHAINME0                  40
|   C   40                MOVE *BLANKS   DSTOR2
|   C  N40                MOVELME04      DSTOR2
| 03*C                     ELSE
|   C                     MOVE *BLANKS   #A01
|   C                     MOVEL'STORAGE '#A01
|   C                     MOVE *BLANKS   #A02
|   C                     MOVELSE26      #A02
|   C           KEY#A     CHAIN#A0                  40
|   C   40                MOVE *BLANKS   DSTOR2
|   C  N40                MOVEL#A03      DSTOR2
| 03-C                     END
|    C* GET日期轉換
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE06      S001I2  80
B2MODC           DSE06     PARM           S001O1  80
|    C                     CALL 'RES001'
|    C                     PARM 'YMD'     S001I1  3
B2MODC                     PARM SE24      S001I2  80
B2MODC           DSE24     PARM           S001O1  80
|    C** GET SE08確認後總金額
|    C                     Z-ADDSE08      HSE08
|    C*
13===CSR                   ENDSR
     C*==============================================================*
     C*          RTN291....INIT 'SC02' -- SFLSR2
     C*==============================================================*
14===C           RTN291    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD8         DSPRC2  40       *SFL SIZE
|    C                     Z-ADD8         WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C                     MOVE *BLANKS   CHGSTA  1
|    C                     Z-ADD0         WMA41
|    C                     Z-ADD0         WSD10
|    C                     Z-ADD0         WSE08
|    C                     Z-ADD0         TSE08
|    C                     Z-ADD0         WSF13
|    C                     Z-ADD0         WSF14
|    C                     Z-ADD0         WSD07
|    C*
|    C           KEYSF1    SETLLSF0
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN298....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
15===C           RTN298    BEGSR
|    C*
|    C           KEYSF1    READESF0                      44*NF/EOF
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C                     EXSR RTN29B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           KEYSF1    READESF0                      44*NF/EOF
| 01-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          RTN29B....FILE TO SCREEN --- MOVE
     C*==============================================================*
16===C           RTN29B    BEGSR
|    C*
|    C* GET 產品名稱／單位
|    C           KEYMA     CHAINMA0                  40
|    C   40                MOVE *BLANKS   MA03
|    C   40                MOVE *BLANKS   MA13
|    C*
|    C           SF04      ADD  SF05      DATA1
|    C           SF19      ADD  SF20      DATA2
|    C                     ADD  DATA2     CHKNUM
|    C                     Z-ADDDATA2     HDAT2
B2CHKC           DATA2     IFEQ 0
B2INF *CVR0001 sev.00 Field DATA2 is not a date or year
B2INF *CVR2001 sev.20 Converted code may contain conceptual errors. Please
B2INF *   verify
|   C           SE24      ANDEQ0
|   C                     Z-ADDDATA1     DATA2
| 01-C                     END
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' --- SFLSR
     C*==============================================================*
17===C           RTN280    BEGSR
|    C*
|    C*CHK SCREEN
|    C                     SETON                     54
|    C                     READCSFLSR2                 5757
|    C*
| 01-C           *IN57     DOWEQ'0'
|   C*
|   C                     SETOF                     60
|   C*                                  DATA ENTRY & *IN99 OFF ->CHECK
|   C*
|   C* CHK 確認數量
| 02-C           DATA2     IFGT DATA1
|   C                     SETON                     608899
| 02-C                     END
|   C   99                GOTO DSP
|   C* CHK(#218)可用量
|   C                     MOVELSE03      #201
|   C                     MOVELSE03      #202
|   C           KEY#2     CHAIN#20                  40
| 03-C           *IN40     IFEQ '0'
|   C           #218      ANDEQ'+'
|   C                     MOVE SE01      WIA01
|   C                     MOVELSF16      WIA01
|   C                     MOVE SE26      WIA02
|   C                     MOVE SF03      WIA03
|   C           KEYIA     CHAINIA0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     ADD  DATA2     IA10
|   C                     SUB  HDAT2     IA10
| 05-C           IA10      IFLT 0
|   C                     SETON                     608799
| 05-C                     END
| 04-C                     END
| 03-C                     END
|   C   99                GOTO DSP
|   C*
|   C           DSP       TAG
|   C   99                Z-ADDRRN2      DRRN2
|   C*
|   C           UPD       TAG
|   C                     UPDATSFLSR2
|   C                     READCSFLSR2                   57
|   C* READC DOW LOOP
| 01-C                     END
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 06-C*          *IN99     IFEQ '0'
|   C*          #CSR      DIV  256       D#ROW            *ROW
|   C*                    MVR            D#COL            *COL
| 06-C*                    END
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
17===C           END280    ENDSR
     C*==============================================================*
     C*          RTN391....INIT 'SC03' -- SFLSR3
     C*==============================================================*
18===C           RTN391    BEGSR
|    C*
|    C                     Z-ADD1         DRRN3
|    C                     Z-ADD0         WRRN3   40
|    C                     Z-ADD0         RRN3
|    C                     Z-ADD8         DSPRC3  40       *SFL SIZE
|    C                     Z-ADD8         WPRCD3  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM3  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR3
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYSF1    SETLLSF0
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          RTN398....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
19===C           RTN398    BEGSR
|    C*
|    C           KEYSF1    READESF0                      44*NF/EOF
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C                     EXSR RTN39B
|   C                     ADD  1         RRN3
|   C                     WRITESFLSR3
|   C           KEYSF1    READESF0                      44*NF/EOF
| 01-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN3      WRRN3      50
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          RTN39B....FILE TO SCREEN --- MOVE
     C*==============================================================*
20===C           RTN39B    BEGSR
|    C*
|    C* GET 產品名稱／單位
|    C           KEYMA     CHAINMA0                  40
|    C   40                MOVE *BLANKS   MA03
|    C   40                MOVE *BLANKS   MA13
|    C*
|    C           SF04      ADD  SF05      DATA1
|    C           SF19      ADD  SF20      DATA2
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN29C....SCREEN TO FILE --- HEADFILE
     C*==============================================================*
21===C           RTN29C    BEGSR
|    C*** SOSEPF
|    C                     MOVE 'V'       SE09
B2000C                     Z-ADDDATE      SE24
| 01-C           SE30      IFNE *ALL'*'
|   C           CHGSTA    ANDEQ'Y'
|   C                     MOVE '*'       SE31
| 01-C                     END
|    C                     Z-ADDTSE08     SE08
|    C**
B2000C                     Z-ADDDATE      SEXX
B2000C                     TIME           SEYY
|    C                     MOVE $USER     SEZZ
|    C*
21===C                     ENDSR
     C*==============================================================*
     C*          RTN29D....SCREEN TO FILE --- D
     C*==============================================================*
22===C           RTN29D    BEGSR
|    C*** SOSFPF
| 01-C           DATA2     IFGE SF04
|   C                     Z-ADDSF04      SF19
| 01*C                     ELSE
|   C                     Z-ADDDATA2     SF19
|   C                     MOVE 'Y'       CHGSTA
| 01-C                     END
| 02-C           DATA2     IFGE SF04
|   C           DATA2     SUB  SF19      SF20
| 02*C                     ELSE
|   C                     Z-ADD0         SF20
| 02-C                     END
|    C* GET 確認後金額
|    C*********  SF19      MULT SF06      WSE08
|    C           SF19      MULT SF06      WSE08     H
|    C                     ADD  WSE08     TSE08
|    C**
B2000C                     Z-ADDDATE      SFXX
B2000C                     TIME           SFYY
|    C                     MOVE $USER     SFZZ
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          RTN29S....SAVE D
     C*==============================================================*
23===C           RTN29S    BEGSR
|    C*****************
|    C* UPDATE SOSFPF *
|    C*****************
|    C                     READCSFLSR2                 5757
| 01-C           *IN57     DOWEQ'0'
|   C*
| 02-C           DOPT1     IFEQ '6'
|   C           KEYSF2    CHAINSF0                  40
|   C                     EXSR RTN29D
|   C                     EXSR RTN29G                     *SAV OTHER FILE
|   C                     UPDATSF0
| 02-C                     END
|   C*
|   C                     READCSFLSR2                 5757
| 01-C                     END
|    C*****************
|    C* UPDATE SOSEPF *
|    C*****************
| 03-C           DOPT1     IFEQ '6'
|   C           KEYSE4    CHAINSE0                  40
|   C                     EXSR RTN29C
|   C                     EXSR RTN29F                     *SAV OTHER FILE
|   C                     UPDATSE0
| 03-C                     END
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*          RTN29F....UPDATE  SOSIPF , SOSCPF , MTMDPF
     C*==============================================================*
24===C           RTN29F    BEGSR
|    C*****************
|    C* UPDATE SOSIPF *
|    C*****************
| 01-C           SE30      IFNE *ALL'*'
|   C           CHGSTA    ANDEQ'Y'
|   C           KEYSI     CHAINSI0                  40
B2000C                     Z-ADDDATE      SIXX
B2000C                     TIME           SIYY
|   C                     MOVE $USER     SIZZ
| 02-C           *IN40     IFEQ '0'
|   C                     MOVE '*'       SI18
|   C                     UPDATSI0
| 02-C                     END
| 01-C                     END
|    C*****************
|    C* UPDATE SOSCPF *
|    C*****************
|    C           KEYSC     CHAINSC0                  40
B2000C                     Z-ADDDATE      SCXX
B2000C                     TIME           SCYY
|    C                     MOVE $USER     SCZZ
| 03-C           *IN40     IFEQ '0'
|   C                     Z-ADDWSD07     SC12
|   C                     MOVE 'V'       SC13
|   C                     UPDATSC0
| 03-C                     END
|    C*****************
|    C* UPDATE MTMDPF *
|    C*****************
|    C           SE04      CHAINMD0                  40
|    C*                    Z-ADDDATE      MDXX
|    C*                    TIME           MDYY
|    C*                    MOVE $USER     MDZZ
| 04-C           *IN40     IFEQ '0'
|   C* GET(#220)轉應收
|   C                     MOVELSE03      #201
|   C                     MOVELSE03      #202
|   C           KEY#2     CHAIN#20                  40
| 05-C           #220      IFEQ 'Y'
|   C                     ADD  TSE08     MD29
|   C                     SUB  HSE08     MD29
|   C                     ADD  TSE08     MD31
|   C                     SUB  HSE08     MD31
| 06-C           CHKNUM    IFEQ 0
|   C                     SUB  SE37      MD30
| 06-C                     END
| 05-C                     END
| 07-C           #220      IFEQ 'N'
|   C                     SUB  SE37      MD30
|   C                     ADD  TSE08     MD30
| 07-C                     END
|   C                     UPDATMD0
| 04-C                     END
|    C*
24===C                     ENDSR
     C*==============================================================*
     C*          RTN29G....UPDATE  SOSDPF , IMIAPF , MTMAPF
     C*==============================================================*
25===C           RTN29G    BEGSR
|    C*****************
|    C* UPDATE SOSDPF *
|    C*****************
|    C                     MOVELSE29      WSD02
|    C                     MOVELSF03      WSD03
|    C           KEYSD     CHAINSD0                  40
| 01-C           *IN40     IFEQ '0'
B2000C                     Z-ADDDATE      SDXX
B2000C                     TIME           SDYY
|   C                     MOVE $USER     SDZZ
|   C*
|   C                     Z-ADDSF19      SD04
|   C                     Z-ADDSF20      SD05
|   C********** SD04      MULT SD06      SD07
|   C           SD04      MULT SD06      SD07      H
|   C                     ADD  SD07      WSD07
|   C*
|   C                     MOVELSE03      #201
|   C                     MOVELSE03      #202
|   C           KEY#2     CHAIN#20                  40
|   C*
| 02-C           *IN40     IFEQ '0'
|   C           #208      ANDEQ'N'
|   C           KEYSC     CHAINSC0                  40
|   C*
| 03-C           *IN40     IFEQ '0'
|   C                     MOVELSE01      WSE01   1
|   C*
| 04-C           SD16      IFEQ WSE01
|   C** ( SD16 = SE01第一碼)
B2???C           KEYIB     SETGTIB0
B2INF *CVR0001 sev.00 Field SF03 is not a date or year
B2INF *CVR0001 sev.00 Field IB01 is not a date or year
B2INF *CVR0001 sev.00 Field IB02 is not a date or year
|   C                     SETOF                     71
|   C                     READPIB0                      47
| 05-C           *IN47     DOWEQ'0'
| 06-C           IB13      IFNE 0
|   C                     SETON                     47
|   C                     SETON                     71
| 06-C                     END
|   C  N47                READPIB0                      47
| 07-C           IB01      IFNE SF03
|   C                     SETON                     47
|   C                     SETOF                     71
| 07-C                     END
| 05-C                     END
|   C*
| 08-C           *IN71     IFEQ '0'                        *NOT FOUNT
|   C           KEYMA     CHAINMA0                  40
|   C                     Z-ADDMA31      SD10
|   C                     Z-ADDMA32      SD11
|   C                     Z-ADDMA33      SD12
| 08*C                     ELSE
B2CHKC           IB04      ADD  IB09      SD10
B2INF *CVR0001 sev.00 Field IB09 is not a date or year
B2INF *CVR0001 sev.00 Field SD10 is not a date or year
|   C           IB05      ADD  IB10      SD11
|   C           IB06      ADD  IB11      SD12
| 08-C                     END
|   C*
| 04*C                     ELSE
|   C** ( SD16 != SE01第一碼)
|   C* GET 零售價
|   C           KEYMA     CHAINMA0                  40
B2000C           SE06      IFLE MA39
|   C                     Z-ADDMA41      WMA41
|   C                     Z-ADDMA41      WSD10
| 09*C                     ELSE
|   C                     Z-ADDMA46      WMA41
|   C                     Z-ADDMA46      WSD10
| 09-C                     END
|   C                     SETOF                     81
|   C           KEY#B     CHAIN#B0                  40
|   C           #B14      CHAINMD0                  40
|   C                     Z-ADD1         RATE    54
|   C                     MOVE 'N'       SA04
|   C                     MOVE 'N'       SB04
|   C                     EXSR RTN28C
|   C                     MOVE 'S'       SA04
|   C                     MOVE 'S'       SB04
|   C                     EXSR RTN28C
|   C           WMA41     MULT RATE      WSD10     H
| 04-C                     END
| 03-C                     END
| 02-C                     END
|   C                     UPDATSD0
| 01-C                     END
|    C*
|    C*****************
|    C* UPDATE IMIAPF *
|    C*****************
|    C*
|    C* GET(#219)送貨倉加減
|    C                     MOVELSE03      #201
|    C                     MOVELSE03      #202
|    C           KEY#2     CHAIN#20                  40
| 10-C           *IN40     IFEQ '0'
|   C           #219      ANDEQ'-'
|   C                     MOVE SE01      WIA01
|   C                     MOVELSF16      WIA01
|   C                     MOVE SE07      WIA02
|   C                     MOVE SF03      WIA03
|   C           KEYIA     CHAINIA0                  40
B2000C                     Z-ADDDATE      IAXX
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 11-C           *IN40     IFEQ '0'
|   C                     SUB  DATA2     IA06
|   C                     ADD  HDAT2     IA06
|   C                     SUB  DATA2     IA07
|   C                     ADD  HDAT2     IA07
|   C                     SUB  DATA2     IA09
|   C                     ADD  HDAT2     IA09
|   C                     UPDATIA0
| 11*C                     ELSE
|   C                     MOVE WIA01     IA01
|   C                     MOVE WIA02     IA02
|   C                     MOVE WIA03     IA03
|   C           IA03      CHAINMA0                  40
|   C                     MOVE MA09      IA04
|   C                     MOVE MA08      IA05
|   C                     Z-SUBDATA2     IA06
|   C                     Z-SUBDATA2     IA07
|   C                     Z-ADD0         IA08
|   C                     Z-SUBDATA2     IA09
|   C                     Z-ADD0         IA10
|   C                     WRITEIA0
| 11-C                     END
| 10-C                     END
|    C* GET(#218)進貨倉加減
|    C                     MOVELSE03      #201
|    C                     MOVELSE03      #202
|    C           KEY#2     CHAIN#20                  40
| 12-C           *IN40     IFEQ '0'
|   C           #218      ANDEQ'+'
|   C                     MOVE SE01      WIA01
|   C                     MOVELSF16      WIA01
|   C                     MOVE SE26      WIA02
|   C                     MOVE SF03      WIA03
|   C           KEYIA     CHAINIA0                  40
B2000C                     Z-ADDDATE      IAXX
B2000C                     TIME           IAYY
|   C                     MOVE $USER     IAZZ
| 13-C           *IN40     IFEQ '0'
|   C                     ADD  DATA2     IA06
|   C                     SUB  HDAT2     IA06
|   C                     ADD  DATA2     IA07
|   C                     SUB  HDAT2     IA07
|   C                     ADD  DATA2     IA10
|   C                     SUB  HDAT2     IA10
|   C                     UPDATIA0
| 13*C                     ELSE
|   C                     MOVE WIA01     IA01
|   C                     MOVE WIA02     IA02
|   C                     MOVE WIA03     IA03
|   C           IA03      CHAINMA0                  40
|   C                     MOVE MA09      IA04
|   C                     MOVE MA08      IA05
|   C                     Z-ADDDATA2     IA06
|   C                     Z-ADDDATA2     IA07
|   C                     Z-ADD0         IA08
|   C                     Z-ADD0         IA09
|   C                     Z-ADDDATA2     IA10
|   C                     WRITEIA0
| 13-C                     END
| 12-C                     END
|    C*****************
|    C* UPDATE MTMAPF *
|    C*****************
| 14-C           #219      IFEQ '-'
|   C           #218      ANDNE'+'
|   C           KEYMA     CHAINMA0                  40
B2000C                     Z-ADDDATE      MAXX
B2000C                     TIME           MAYY
|   C                     MOVE $USER     MAZZ
| 15-C           *IN40     IFEQ '0'
|   C*
|   C                     SUB  DATA2     MA30
|   C                     ADD  HDAT2     MA30
|   C*
|   C           MA29      ADD  MA30      MA26
|   C           MA26      MULT MA31      MA26      H
|   C*
|   C           MA29      ADD  MA30      MA27
|   C           MA27      MULT MA32      MA27      H
|   C*
|   C           MA29      MULT MA33      MA28      H
|   C                     UPDATMA0
| 15-C                     END
|   C*
| 14-C                     END
|    C*
25===C                     ENDSR
     C*==============================================================*
     C*          RTN28C....GET 單位成本
     C*==============================================================*
26===C           RTN28C    BEGSR
|    C*
|    C                     SETOF                     59
B2000C           KEYSB1    SETGTSB0
|    C           KEYSB2    REDPESB0                      48
| 01-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           SE06      IFGE SB05
|   C           SE06      ANDLESB13
|   C           SB14      ANDEQ*BLANKS
| 03-C           SB04      IFEQ 'N'
|   C           WMA41     MULT SB06      WSF13     H      *正常折扣
|   C                     SUB  SB06      RATE
| 03*C                     ELSE
|   C           WMA41     MULT SB06      WSF14     H      *特別折扣
|   C                     SUB  SB06      RATE
| 03-C                     END
|   C                     Z-ADDWSD10     SD10
|   C                     Z-ADD0         SD11
|   C                     Z-ADD0         SD12
|   C                     SETON                     59
| 02*C                     ELSE
|   C           KEYSB2    REDPESB0                      48
| 02-C                     END
| 01-C                     END
|    C*
| 04-C           *IN59     IFEQ '0'
B2000C           KEYSA1    SETGTSA0
|   C           KEYSA2    REDPESA0                      48
| 05-C           *IN48     DOWEQ'0'
|   C           *IN59     ANDEQ'0'
B2000C           SE06      IFGE SA05
|   C           SE06      ANDLESA13
|   C           SA14      ANDEQ*BLANKS
| 07-C           SA04      IFEQ 'N'
|   C           WMA41     MULT SA06      WSF13     H      *正常折扣
|   C                     SUB  SA06      RATE
| 07*C                     ELSE
|   C           WMA41     MULT SA06      WSF14     H      *特別折扣
|   C                     SUB  SA06      RATE
| 07-C                     END
|   C                     Z-ADDWSD10     SD10
|   C                     Z-ADD0         SD11
|   C                     Z-ADD0         SD12
|   C                     SETON                     59
| 06*C                     ELSE
|   C           KEYSA2    REDPESA0                      48
| 06-C                     END
| 05-C                     END
| 04-C                     END
|    C*
| 08-C*          *IN48     IFEQ '1'
|   C*  81                SETON                     618599
|   C*                    SETON                     81
| 08-C*                    END
|    C*
26===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
27===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9699
| 01-C                     END
|    C*
27===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
28===C**         RTNF4     BEGSR
|    C*
|    C*
28===C**         ENDF4     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
29===C           ERRSR     BEGSR
|    C*
|    C                     CALL 'P50'
|    C           DMSG      PARM           P5001O 78
|    C                     SETON                     9799
|    C*
29===C                     ENDSR'*DETC'
**
新增修改      刪除查詢確認
**
經銷商  專櫃    零售    試飲    酒店
公司行號員工    保稅倉  完稅倉
