     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : BCM003                                     *
     A*    AUTHOR       : DEREK                                      *
     A*    DATE WRITTEN : 105/05/20                                  *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                          *
     A*    SUBSYSTEM    :共用資料維護子系統                        *
     A*    PROCEDURE    :檢核訂貨單有效產品(不檢核有效日)        *
     A****************************************************************
     C*==============================================================*
     C*                    MAIN
     C*==============================================================*
     C                     CALL 'BCM003'
     C                     PARM 'S1'      M002I1  2        公司別
     C                     PARM 'C1'      M002I2  2        通路別
     C                     PARM 'C030'    M002I3  5        分店代號
     C                     PARM 20160914  M002I4  80       到分店日
     C                     PARM 'SPCH003' M002I5  9        產品代號
     C                     PARM *BLANK    M002O1  1        檢核值
     C*
     C                     SETON                     LR
