     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : CEP007                                     *
     A*    AUTHOR       : A1491  EASON                               *
     A*    DATE WRITTEN : 97/09/11                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :主檔資料維護子系統                        *
     A*    PROCEIURE    :通路產品對照維護                          *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
     A****************************************************************
     FPA#BPF  IF  E           K        DISK
     FMANDPF  IF  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FC#EGLF01IF  E           K        DISK
     F            EG0                               KRENAMEEG0L1
     FC#EGPF  UF  E           K        DISK                      A
     FC#EGLF  IF  E           K        DISK
     F            EG0                               KRENAMEEG0L
     F*                                             KINFSR ERRSR
     FCEP007D CF  E                    WORKSTN
     F                                        RRN   KSFILE SFLSR
     F                                              KINFDS DSPFDS
     E*: FUNBTION DATA :
     E                    WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        5  1
     I*
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      201 2080$EG8
     I                                      598 5990$LPRT
     I                                      501 505 $WRHUS
     I                                      506 506 $PURID
     I                                      507 508 $TRNID
     I                                      509 513 $APAUT
     I                                      514 521 $#101
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C                     Z-ADD0         HRRN    40
     C* FOR F4 PARM
     C                     MOVE *BLANKS   APPSCR  6
     C                     MOVE *BLANK    PARMI1 10
     C                     MOVE *BLANK    PARMO1 10
     C*
     C           *LIKE     DEFN EG04      TEG04
     C           *LIKE     DEFN EG05      TEG05
     C           *LIKE     DEFN EG04      KEG04
     C           *LIKE     DEFN EG04      BEG04
     C*
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C           *LIKE     DEFN DBGN3     OBGN3            *START KEY
     C*  FOR SUBFILE (SYS+PGM CONTROL)
     C                     MOVE *BLANK    WBOTOM  1
     C           *LIKE     DEFN RRN       WRRN
     C           *LIKE     DEFN RRN       WPRCD
     C           *LIKE     DEFN RRN       DSPRCD
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYEG     KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C                     KFLD           DBGN3
     C           KEYEG1    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C           KEYEG2    KLIST
     C                     KFLD           EG01
     C                     KFLD           EG02
     C                     KFLD           EG03
     C                     KFLD           EG04
     C           KEYE2X    KLIST
     C                     KFLD           EG01
     C                     KFLD           EG03
     C           KEYEG3    KLIST
     C                     KFLD           DEG01
     C                     KFLD           DEG02
     C           KEYEG4    KLIST
     C                     KFLD           DEG01
     C                     KFLD           DEG03
     C           KEYEG5    KLIST
     C                     KFLD           DEG01
     C                     KFLD           DEG02
     C                     KFLD           DEG03
     C           KEYEG6    KLIST
     C                     KFLD           DEG01
     C                     KFLD           DEG02
     C                     KFLD           DEG03
     C                     KFLD           KEG04
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
     C*
     C                     MOVE *ALL'0'   *IN,60
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
    C*          *IN04     CASEQ'1'       RTNF4
  02-C           *IN06     CASEQ'1'       RTN120
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR001'  APPSCR
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN120....F6(ADD)
      *==============================================================*
02===C           RTN120    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     9099
| 01-C                     END
|     *
|    C                     EXSR RTN11B
|     *
|    C  N99                EXSR RTN200
|     *
|     *該部分僅適用該種PATTEN (畫面一定要輸入才能新增的畫面)
|    C                     MOVE DBGN1     OBGN1
|    C                     MOVE DBGN2     OBGN2
|    C                     MOVE DBGN3     OBGN3
|     *
| 02-C           DRRN      IFGT 0
|   C           DRRN      SUB  1         HRRN
| 02-C                     END
|    C                     EXSR RTN191
|    C                     EXSR RTN192
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN11B....CHECK F6
      *==============================================================*
03===C           RTN11B    BEGSR
|     *
| 01-C           DBGN1     IFEQ *BLANK
|   C           DBGN2     OREQ *BLANK
|   C                     SETON                     99
|   C                     MOVEL'ERR0017' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 01-C                     END
|    C   99                GOTO END11B
|     *
| 02-C           DBGN1     IFNE *BLANK
|   C           DBGN1     CHAIN#B0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     SETON                     99
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 03-C                     END
| 02-C                     END
|    C   99                GOTO END11B
|     *
| 04-C           DBGN2     IFNE *BLANK
|   C           KEYEG1    CHAINND0                  40
| 05-C           *IN40     IFEQ '1'
|   C                     SETON                     99
|   C                     MOVEL'ERR0019' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 05-C                     END
| 04-C                     END
|    C   99                GOTO END11B
|     *
03===C           END11B    ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
04===C           RTN170    BEGSR
|     *
|    C*畫面上SETLL的值如果不等於輸入的值，重新做SETLL、READ
| 01-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C           DBGN3     ORNE OBGN3
|    *
|   C                     Z-ADD0         HRRN
|   C                     MOVEL*BLANK    S#B03
|   C                     MOVEL*BLANK    SND04
|    *新增畫面秀出文字功能
|   C                     EXSR RTN190
|    *
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|    *
|   C                     MOVE DBGN1     OBGN1
|   C                     MOVE DBGN2     OBGN2
|   C                     MOVE DBGN3     OBGN3
|    *
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN       HRRN
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     END
| 01-C                     END
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN171....READC SFL
      *==============================================================*
05===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR                  4040*NF
| 01-C           *IN40     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN       DRRN
|   C                     EXSR RTN200
|   C                     MOVE *BLANKS   DOPT1
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           UPD       TAG
|   C*
|   C                     UPDATSFLSR
|   C                     READCSFLSR                    40*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
| 05-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN180....CHECK 'SC01' SCREEN
      *==============================================================*
06===CSR         RTN180    BEGSR
|    C*
|    C* CHK AUT *
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     609099
| 01-C                     END
|    C   99                GOTO END180
|    C*
06===C           END180    ENDSR
      *==============================================================*
      *          RTN190....CHECK 'SC01' SCREEN
      *==============================================================*
07===CSR         RTN190    BEGSR
|    C*
|    C           DBGN1     CHAIN#B0                  40
|    C  N40                MOVEL#B03      S#B03
|    C   40                MOVEL*BLANK    S#B03
|    C           KEYEG1    CHAINND0                  40
|    C  N40                MOVELND04      SND04
|    C   40                MOVEL*BLANK    SND04
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN191....INITIAL                              *
      *=========================================================*
08===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN
|    C                     Z-ADD0         RRN
|    C                     Z-ADD0         WRRN
|    C                     Z-ADD10        WPRCD
|    C                     Z-ADD0         DSPRCD
|    C           HRRN      DIV  WPRCD     DSPRCD
|    C                     MULT WPRCD     DSPRCD
|    C                     MOVE 'N'       WBOTOM
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR
|    C                     SETOF                     52
|     *
|     *起點=> 開始用空值去SETLL
|     *
|    C           KEYEG     SETLLEG0L
|    C*
08===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
09===C           RTN192    BEGSR
|    C*
| 01-C           WBOTOM    IFEQ 'Y'
|   C                     SETON                     9799  *LST PAG
|   C                     Z-ADDRRN       DRRN
|   C*                    MOVEL'MSG0001' ERRID
|   C*                    MOVEL'SCMF'    ERRF
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
09===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
10===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANK    DOPT1
|    C                     SETOF                     54
|    C                     Z-ADDWRRN      RRN
|    C                     ADD  WPRCD     DSPRCD
| 01-C           RRN       DOWLTDSPRCD
|   C           KEYEG1    READEEG0L                     46
|   C*
| 02-C           *IN46     IFEQ '0'
|   C*
|   C                     CALL 'P31'
|   C                     PARM EG04      P31I1   80
|   C                     PARM '2'       P3112   1
|   C                     PARM '1'       P31I3   1
|   C                     PARM '3'       P31I4   1
|   C                     PARM '1'       P31I5   1
|   C           SEG04     PARM           P31IO   80
|   C*
|   C                     CALL 'P31'
|   C                     PARM EG05      P31I1   80
|   C                     PARM '2'       P3112   1
|   C                     PARM '1'       P31I3   1
|   C                     PARM '3'       P31I4   1
|   C                     PARM '1'       P31I5   1
|   C           SEG05     PARM           P31IO   80
|   C*
|   C           KEYE2X    CHAINNC0                  40
|   C  N40                MOVELNC05      SNC05
|   C   40                MOVEL*BLANK    SNC05
|   C*
|   C                     ADD  1         RRN
|   C                     WRITESFLSR
| 02*C                     ELSE
|   C                     Z-ADDRRN       DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 02-C                     END
|   C*
| 01-C                     ENDDO
|    C*再此多做預讀一筆的判斷，去判斷是否已到最後一筆
| 03-C           *IN46     IFEQ '0'
|   C           KEYEG1    READEEG0L                     46
|   C*在將KEY值帶回來
|   C           KEYEG2    SETLLEG0L
| 04-C           *IN46     IFEQ '1'
|   C                     Z-ADDRRN       DSPRCD
|   C                     MOVE 'Y'       WBOTOM
|   C                     SETON                     53
| 04-C                     END
| 03-C                     END
|    C*
|    C                     Z-ADDRRN       DRRN
|    C                     Z-ADDRRN       WRRN
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
11===C           RTN195    BEGSR
|    C*
| 01-C           RRN       IFGT *ZEROS
|   C                     SETON                     50    *SFLDSP
| 01*C                     ELSE
| 02-C           DBGN1     IFNE *BLANK
|   C                     SETON                     99    *NODATA
|   C                     MOVEL'MSG0003' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 02-C                     END
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
|    C                     Z-ADD1         DRRN
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
12===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
|    C                     Z-ADD0         BEG04
|     *
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C           *LOVAL    SETLLEG0
|    C                     MOVE 'SCR001'  APPSCR
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
13===C           RTN210    BEGSR
|    C*
|    C                     SETON                     3032  *ADD MSG
|    C                     EXSR RTN251                     *CLR FIELD
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     SETON                     71
|   C                     WRITEDSPC2
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
|   C*          *IN04     CASEQ'1'       RTNF4
| 03-C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C*          *IN04     ANDEQ'0'
|   C           *IN09     ANDEQ'1'
|   C                     EXSR RTN253
|   C                     WRITEEG0
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
14===C           RTN220    BEGSR
|    C*
|    C           KEYEG2    CHAINEG0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     3132
|   C                     SETON                     3071  *CAN INPUT
|   C                     WRITEDSPC2
|   C                     EXFMTDSPD2
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C                     MOVEA*ALL'0'   *IN,60
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
|   C*          *IN04     CASEQ'1'       RTNF4
| 03-C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           *IN05     ANDEQ'0'
|   C           *IN09     ANDEQ'1'
|   C*          *IN04     ANDEQ'0'
|   C                     EXSR RTN253
|   C                     UPDATEG0
|   C                     MOVE 'SCR001'  APPSCR
|   C                     SETOF                     1214
| 04-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
15===C           RTN230    BEGSR
|    C*
|    C           KEYEG2    CHAINEG0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     303171*NO INPUT
|    C                     SETOF                     32
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|    *
|   C****                 EXSR RTN280
|    *
| 03-C           *IN05     IFEQ '0'
|   C*          *IN04     ANDEQ'0'
|   C           *IN99     ANDEQ'0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 04-C           DLTFLG    IFEQ 'Y'
|   C                     DELETEG0
| 04-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
|   C*
| 02-C                     END
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
16===C           RTN240    BEGSR
|    C*
|    C           KEYEG2    CHAINEG0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     303171*NO INPUT
|    C                     SETOF                     32
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C           *IN05     ANDEQ'0'
|   C*          *IN04     ANDEQ'0'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     Z-ADDRRN       DRRN
| 02-C                     END
|   C*
| 01-C                     END
|    C*
16===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
17===CSR         RTN251    BEGSR
|    C*
|    C                     MOVELDBGN1     DEG01
|    C                     MOVEL*BLANK    D#B03
|    C                     MOVELDBGN2     DEG02
|    C                     MOVEL*BLANK    DND04
|     *
|    C           DEG01     CHAIN#B0                  40
|    C  N40                MOVEL#B03      D#B03
|    C   40                MOVEL*BLANK    D#B03
|     *
|    C           KEYEG3    CHAINND0                  40
|    C  N40                MOVELND04      DND04
|    C   40                MOVEL*BLANK    DND04
|     *
|    C                     MOVEL*BLANK    DEG03
|    C                     Z-ADD0         DEG04
|    C                     Z-ADD0         DEG05
|    C                     MOVEL*BLANK    DEG06
|    C                     MOVEL*BLANK    DNC05
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
18===CSR         RTN252    BEGSR
|    C*
|    C                     MOVELEG01      DEG01
|     *
|    C           DEG01     CHAIN#B0                  40
|    C  N40                MOVEL#B03      D#B03
|    C   40                MOVEL*BLANK    D#B03
|     *
|    C                     MOVELEG02      DEG02
|     *
|    C           KEYEG3    CHAINND0                  40
|    C  N40                MOVELND04      DND04
|    C   40                MOVEL*BLANK    DND04
|     *
|    C                     MOVELEG03      DEG03
|    C           KEYEG4    CHAINNC0                  40
|    C  N40                MOVELNC05      DNC05
|    C   40                MOVEL*BLANK    DNC05
|    C*
|    C                     Z-ADDEG04      BEG04            FOR RTN280
|    C*
|    C                     CALL 'P31'
|    C                     PARM EG04      P31I1   80
|    C                     PARM '2'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '3'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           DEG04     PARM           P31IO   80
|    C*
|    C                     CALL 'P31'
|    C                     PARM EG05      P31I1   80
|    C                     PARM '2'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '3'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           DEG05     PARM           P31IO   80
|     *
|    C                     MOVELEG06      DEG06
|     *
18===CSR                   ENDSR
      *==============================================================*
      *          RTN253....MOVE SCREEN DATA TO FILE
      *==============================================================*
19===CSR         RTN253    BEGSR
|     *
| 01-C           DOPT1     IFEQ '1'
|   C                     MOVELDEG01     EG01
|   C                     MOVELDEG02     EG02
|   C                     MOVELDEG03     EG03
|   C                     Z-ADD$EG8      EGVV
| 01-C                     ENDIF
|     *
|    C                     CALL 'P31'
|    C                     PARM DEG04     P31I1   80
|    C                     PARM '3'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '2'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           EG04      PARM           P31IO   80
|     *
|    C                     CALL 'P31'
|    C                     PARM DEG05     P31I1   80
|    C                     PARM '3'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '2'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           EG05      PARM           P31IO   80
|     *
|    C                     MOVELDEG06     EG06
|     *
|    C                     MOVEL'CEP007'  EGWW      P
|    C                     Z-ADD$EG8      EGXX
|    C                     TIME           EGYY
|    C                     MOVEL$USER     EGZZ
|    C*
19===CSR                   ENDSR
     C*==============================================================*
     C*          RTN280....CHECK 'SC02' SCREEN
     C*==============================================================*
20===CSR         RTN280    BEGSR
|    C*
| 01-C           DEG03     IFEQ *BLANK
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     9962
| 01-C                     END
|    C   99                GOTO END280
|    C*
|    C           KEYEG4    CHAINNC0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVELNC05      DNC05
| 02*C                     ELSE
|   C                     MOVEL*BLANK    DNC05
|   C                     MOVEL'ERR0029' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     9962
| 02-C                     ENDIF
|    C   99                GOTO END280
|    C*
| 03-C           DEG04     IFEQ *ZERO
|   C                     SETON                     6399
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 03-C                     ENDIF
|    C   99                GOTO END280
|     *
|    C                     CALL 'P30'
|    C                     PARM DEG04     P3001I  80
|    C                     PARM '3'       P3002I  1
|    C                     PARM '1'       P3003I  1
|    C                     PARM           P3011O  1
| 04-C           P3011O    IFEQ 'N'
|   C                     SETON                     6399
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 04-C                     ENDIF
|    C   99                GOTO END280
|     *
|    C                     CALL 'P31'
|    C                     PARM DEG04     P31I1   80
|    C                     PARM '3'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '2'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           TEG04     PARM           P31IO   80
|     *
|     * 比對前一筆
|    C                     Z-ADDTEG04     KEG04
|    C           KEYEG6    SETGTEG0L
|    C           KEYEG5    REDPEEG0L                     40
| 05-C           *IN40     IFEQ '0'
| 06-C           DOPT1     IFEQ '2'                        UPDATE MODE
|   C           EG04      ANDEQBEG04                      SELF
|   C           KEYEG5    REDPEEG0L                     40
| 06-C                     ENDIF
| 07-C           *IN40     IFEQ '0'
| 08-C           EG05      IFEQ 0
|   C                     SETON                     6399
|   C                     MOVEL'ERR0144' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 08-C                     ENDIF
|   C   99                GOTO END280
| 09-C           TEG04     IFLE EG05
|   C                     SETON                     6399
|   C                     MOVEL'ERR0145' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 09-C                     ENDIF
|   C   99                GOTO END280
| 10-C           DEG06     IFEQ *BLANK
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     9965
| 10-C                     END
|   C   99                GOTO END280
| 11-C           DEG06     IFEQ EG06
|   C                     MOVEL'ERR0093' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     9965
| 11-C                     ENDIF
|   C   99                GOTO END280
| 07-C                     ENDIF
| 05-C                     ENDIF
|     * 比對後一筆
|    C           KEYEG6    SETGTEG0L
|    C           KEYEG5    READEEG0L                     40
| 12-C           *IN40     IFEQ '0'
| 13-C           DOPT1     IFEQ '2'                        UPDATE MODE
|   C           EG04      ANDEQBEG04                      SELF
|   C           KEYEG5    READEEG0L                     40
| 13-C                     ENDIF
| 14-C           *IN40     IFEQ '0'
| 15-C           DEG05     IFEQ 0
|   C                     SETON                     6499
|   C                     MOVEL'ERR0146' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 15-C                     ENDIF
|   C   99                GOTO END280
|   C                     CALL 'P30'
|   C                     PARM DEG05     P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 16-C           P3011O    IFEQ 'N'
|   C                     SETON                     6499
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 16-C                     ENDIF
|   C   99                GOTO END280
|   C                     CALL 'P31'
|   C                     PARM DEG05     P31I1   80
|   C                     PARM '3'       P3112   1
|   C                     PARM '1'       P31I3   1
|   C                     PARM '2'       P31I4   1
|   C                     PARM '1'       P31I5   1
|   C           TEG05     PARM           P31IO   80
| 17-C           TEG05     IFGE EG04
|   C                     SETON                     6499
|   C                     MOVEL'ERR0147' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 17-C                     ENDIF
|   C   99                GOTO END280
| 18-C           DEG06     IFEQ EG06
|   C                     MOVEL'ERR0093' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     9965
| 18-C                     ENDIF
|   C   99                GOTO END280
|    *
| 14-C                     ENDIF
| 12-C                     ENDIF
|     *
| 19-C           DEG05     IFNE 0
|   C                     CALL 'P30'
|   C                     PARM DEG05     P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 20-C           P3011O    IFEQ 'N'
|   C                     SETON                     6499
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 20-C                     ENDIF
|   C   99                GOTO END280
| 19-C                     ENDIF
|     *
| 21-C           DEG04     IFNE 0
|   C           DEG05     ANDNE0
|    *
|   C                     CALL 'P31'
|   C                     PARM DEG05     P31I1   80
|   C                     PARM '3'       P3112   1
|   C                     PARM '1'       P31I3   1
|   C                     PARM '2'       P31I4   1
|   C                     PARM '1'       P31I5   1
|   C           TEG05     PARM           P31IO   80
|    *
| 22-C           TEG05     IFLT TEG04
|   C                     SETON                     6499
|   C                     MOVEL'ERR0108' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 22-C                     ENDIF
|   C   99                GOTO END280
|    *
| 21-C                     ENDIF
|     *
| 23-C           DEG06     IFEQ *BLANK
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     9965
| 23-C                     END
|    C   99                GOTO END280
|     *
|    C           DEG06     SETLLEG0L1
|    C           DEG06     READEEG0L1                    40
| 24-C           *IN40     DOWEQ'0'
| 25-C           DOPT1     IFEQ '1'
|   C           DOPT1     OREQ '2'
|   C           DEG03     ANDNEEG03
|   C                     MOVEL'ERR0093' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     9965
|   C                     LEAVE
| 25-C                     ENDIF
|   C           DEG06     READEEG0L1                    40
| 24-C                     ENDDO
|    C   99                GOTO END280
|    C*
20===CSR         END280    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
21===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C*
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C**
|   C*          D#ROW     IFEQ 8
|   C*          D#COL     ANDGE9
|   C*          D#COL     ANDLE13
|   C*                    CALL 'WDS002'
|   C*          DBGN1     PARM DBGN1     PARMI1
|   C*                    GOTO ENDF4
|   C*                    END
|   C*
| 01-C                     END
|    C*
|    C*          APPSCR    IFEQ 'SCR002'
|    C**
|    C*          D#ROW     IFEQ 17
|    C*          D#COL     ANDGE16
|    C*          D#COL     ANDLE18
|    C*                    CALL 'WDS012'
|    C*                    PARM 'CURRENBY'PARMI1
|    C*          DNB17     PARM DNB17     PARMO1
|    C*                    GOTO ENDF4
|    C*                    END
|    C*
|    C*          D#ROW     IFEQ 17
|    C*          D#COL     ANDGE56
|    C*          D#COL     ANDLE57
|    C*                    CALL 'WDS012'
|    C*                    PARM 'PAYMENT 'PARMI1
|    C*          DNB18     PARM DNB18     PARMO1
|    C*                    GOTO ENDF4
|    C*                    END
|    C*
|    C*          D#ROW     IFEQ 18
|    C*          D#COL     ANDGE16
|    C*          D#COL     ANDLE21
|    C*                    CALL 'WDS005'
|    C*          DNB19     PARM DNB19     PARMI1
|    C*                    GOTO ENDF4
|    C*                    END
|    C*
|    C*                    END
|    C*
21===C           ENDF4     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
22===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
     C*          ERRSR     BEGSR
     C*
     C*                    CALL 'P50'
     C*          DMSG      PARM           P5001O 78
     C*                    SETON                     2899
     C*
     C*                    ENDSR'*DETC'
     C/COPY HBP2CVTR
**
新增修改      刪除查詢
