     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   :                                            *
     H*    PROGRAM NAME :                                            *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  :                                            *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                          *
     H****************************************************************
     FMANCPF  IF  E           K        DISK
     FINTAPF  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYTA     KLIST
     C                     KFLD           NC01
     C                     KFLD           TYYMM
     C                     KFLD           NC02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      .MAIN
     C                     EXSR R0200                      .MAIN
     C                     EXSR R0300                      .MAIN
     C                     SETON                     LR
     C*==============================================================*
     C*                    R0100 ...
     C*==============================================================*
01===C           R0100     BEGSR
|     *
|    C                     Z-ADD200908    TYYMM   60
|     *
01===C                     ENDSR
     C*==============================================================*
     C*                    R0200 ...
     C*==============================================================*
02===C           R0200     BEGSR
|     *
|    C           *LOVAL    SETLLMANCPF
|    C                     READ MANCPF                   46
| 01-C           *IN46     DOWEQ'0'
|    *
|   C           KEYTA     CHAININTAPF               41
| 02-C           *IN41     IFEQ '1'
|   C                     CLEARTA0
|   C                     MOVELNC01      TA01
|   C                     Z-ADDTYYMM     TA02
|   C                     MOVELNC02      TA03
|   C                     WRITETA0
| 02-C                     ENDIF
|   C*
|   C                     READ MANCPF                   46
| 01-C                     ENDDO
|     *
02===C                     ENDSR
     C*==============================================================*
     C*                    R0300 ...
     C*==============================================================*
03===C           R0300     BEGSR
|     *
|     *
03===C                     ENDSR
     C*==============================================================*
