     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   :                                            *
     H*    PROGRAM NAME :                                            *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  :                                            *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                          *
     H****************************************************************
     FINTBLF02IF  E           K        DISK
     FINTAPF  UF  E           K        DISK
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYTA     KLIST
     C                     KFLD           TA01
     C                     KFLD           TA02
     C                     KFLD           TA03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      .MAIN
     C                     EXSR R0200                      .MAIN
     C                     EXSR R0300                      .MAIN
     C   99      ERR       DSPLY
     C                     SETON                     LR
     C*==============================================================*
     C*                    R0100 ...
     C*==============================================================*
01===C           R0100     BEGSR
|     *
|    C                     MOVEL*BLANK    TTA03   9
|    C                     Z-ADD0         TTA06   60
|    C                     MOVEL'ERROR'   ERR    10
|     *
01===C                     ENDSR
     C*==============================================================*
     C*                    R0200 ...
     C*==============================================================*
02===C           R0200     BEGSR
|     *
|     *
02===C                     ENDSR
     C*==============================================================*
     C*                    R0300 ...
     C*==============================================================*
03===C           R0300     BEGSR
|     *
|    C                     SETOF                     46
|    C           *LOVAL    SETLLINTBLF02
| 01-C           *IN46     DOWEQ'0'
|   C                     READ INTBLF02                 46
|   C   46                LEAVE
|    *
| 02-C           TTA03     IFEQ *BLANK
|   C                     MOVELTB05      TTA03
| 02-C                     ENDIF
|    *
| 03-C           TTA03     IFNE TB05
|   C                     MOVELTB01      TA01
|   C                     Z-ADDTB02      TA02
|   C                     MOVELTTA03     TA03
|   C           KEYTA     CHAININTAPF               40
| 04-C           *IN40     IFEQ '1'
|   C                     SETON                     99
| 04*C                     ELSE
|   C                     Z-ADDTTA06     TA06
|   C                     UPDATTA0
| 04-C                     ENDIF
|   C                     MOVELTB05      TTA03
|   C                     Z-ADD0         TTA06
| 03-C                     ENDIF
|    *
|   C                     ADD  TB06      TTA06
|    *
| 01-C                     ENDDO
|    C*
| 05-C           TTA03     IFEQ *BLANK
|   C                     MOVELTB01      TA01
|   C                     Z-ADDTB02      TA02
|   C                     MOVELTTA03     TA03
|   C           KEYTA     CHAININTAPF               40
| 06-C           *IN40     IFEQ '1'
|   C                     SETON                     99
| 06*C                     ELSE
|   C                     Z-ADDTTA06     TA06
|   C                     UPDATTA0
| 06-C                     ENDIF
| 05-C                     ENDIF
|     *
03===C                     ENDSR
     C*==============================================================*
