     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : DBR003                                     *
     A*    AUTHOR       : A1650  DEREK                               *
     A*    CREATE DATRE : 104/01/16                                  *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    DESCRIPTION  :分店帳列數量及金額統計表(FOR DBQT)        *
     A*--------------------------------------------------------------*
     A* MODI CODE |   DATE   | DESCRIPTION                           *
     A****************************************************************
     FDBAEPF  IP  E           K        DISK
     FINTAPF  IF  E           K        DISK
     FINTBLF01IF  E           K        DISK
     FDBAFPF  O   E           K        DISK
     E*---------------------------------------------------------------*
     E                    @A01       80  6 0             帳列庫存
     E                    @A02       80 13 2             庫存金額
     E*---------------------------------------------------------------*
     I           UDS
     I                                      601 6060PARM1
     I*帳列庫存
     I            DS
     I                                        1 4800@A01
     I                                        1   60AF001Q
     I                                        7  120AF002Q
     I                                       13  180AF003Q
     I                                       19  240AF004Q
     I                                       25  300AF005Q
     I                                       31  360AF006Q
     I                                       37  420AF007Q
     I                                       43  480AF008Q
     I                                       49  540AF009Q
     I                                       55  600AF010Q
     I                                       61  660AF011Q
     I                                       67  720AF012Q
     I                                       73  780AF013Q
     I                                       79  840AF014Q
     I                                       85  900AF015Q
     I                                       91  960AF016Q
     I                                       97 1020AF017Q
     I                                      103 1080AF018Q
     I                                      109 1140AF019Q
     I                                      115 1200AF020Q
     I                                      121 1260AF021Q
     I                                      127 1320AF022Q
     I                                      133 1380AF023Q
     I                                      139 1440AF024Q
     I                                      145 1500AF025Q
     I                                      151 1560AF026Q
     I                                      157 1620AF027Q
     I                                      163 1680AF028Q
     I                                      169 1740AF029Q
     I                                      175 1800AF030Q
     I                                      181 1860AF031Q
     I                                      187 1920AF032Q
     I                                      193 1980AF033Q
     I                                      199 2040AF034Q
     I                                      205 2100AF035Q
     I                                      211 2160AF036Q
     I                                      217 2220AF037Q
     I                                      223 2280AF038Q
     I                                      229 2340AF039Q
     I                                      235 2400AF040Q
     I                                      241 2460AF041Q
     I                                      247 2520AF042Q
     I                                      253 2580AF043Q
     I                                      259 2640AF044Q
     I                                      265 2700AF045Q
     I                                      271 2760AF046Q
     I                                      277 2820AF047Q
     I                                      283 2880AF048Q
     I                                      289 2940AF049Q
     I                                      295 3000AF050Q
     I                                      301 3060AF051Q
     I                                      307 3120AF052Q
     I                                      313 3180AF053Q
     I                                      319 3240AF054Q
     I                                      325 3300AF055Q
     I                                      331 3360AF056Q
     I                                      337 3420AF057Q
     I                                      343 3480AF058Q
     I                                      349 3540AF059Q
     I                                      355 3600AF060Q
     I                                      361 3660AF061Q
     I                                      367 3720AF062Q
     I                                      373 3780AF063Q
     I                                      379 3840AF064Q
     I                                      385 3900AF065Q
     I                                      391 3960AF066Q
     I                                      397 4020AF067Q
     I                                      403 4080AF068Q
     I                                      409 4140AF069Q
     I                                      415 4200AF070Q
     I                                      421 4260AF071Q
     I                                      427 4320AF072Q
     I                                      433 4380AF073Q
     I                                      439 4440AF074Q
     I                                      445 4500AF075Q
     I                                      451 4560AF076Q
     I                                      457 4620AF077Q
     I                                      463 4680AF078Q
     I                                      469 4740AF079Q
     I                                      475 4800AF080Q
     I*庫存金額
     I            DS
     I                                        110402@A02
     I                                        1  132AF001A
     I                                       14  262AF002A
     I                                       27  392AF003A
     I                                       40  522AF004A
     I                                       53  652AF005A
     I                                       66  782AF006A
     I                                       79  912AF007A
     I                                       92 1042AF008A
     I                                      105 1172AF009A
     I                                      118 1302AF010A
     I                                      131 1432AF011A
     I                                      144 1562AF012A
     I                                      157 1692AF013A
     I                                      170 1822AF014A
     I                                      183 1952AF015A
     I                                      196 2082AF016A
     I                                      209 2212AF017A
     I                                      222 2342AF018A
     I                                      235 2472AF019A
     I                                      248 2602AF020A
     I                                      261 2732AF021A
     I                                      274 2862AF022A
     I                                      287 2992AF023A
     I                                      300 3122AF024A
     I                                      313 3252AF025A
     I                                      326 3382AF026A
     I                                      339 3512AF027A
     I                                      352 3642AF028A
     I                                      365 3772AF029A
     I                                      378 3902AF030A
     I                                      391 4032AF031A
     I                                      404 4162AF032A
     I                                      417 4292AF033A
     I                                      430 4422AF034A
     I                                      443 4552AF035A
     I                                      456 4682AF036A
     I                                      469 4812AF037A
     I                                      482 4942AF038A
     I                                      495 5072AF039A
     I                                      508 5202AF040A
     I                                      521 5332AF041A
     I                                      534 5462AF042A
     I                                      547 5592AF043A
     I                                      560 5722AF044A
     I                                      573 5852AF045A
     I                                      586 5982AF046A
     I                                      599 6112AF047A
     I                                      612 6242AF048A
     I                                      625 6372AF049A
     I                                      638 6502AF050A
     I                                      651 6632AF051A
     I                                      664 6762AF052A
     I                                      677 6892AF053A
     I                                      690 7022AF054A
     I                                      703 7152AF055A
     I                                      716 7282AF056A
     I                                      729 7412AF057A
     I                                      742 7542AF058A
     I                                      755 7672AF059A
     I                                      768 7802AF060A
     I                                      781 7932AF061A
     I                                      794 8062AF062A
     I                                      807 8192AF063A
     I                                      820 8322AF064A
     I                                      833 8452AF065A
     I                                      846 8582AF066A
     I                                      859 8712AF067A
     I                                      872 8842AF068A
     I                                      885 8972AF069A
     I                                      898 9102AF070A
     I                                      911 9232AF071A
     I                                      924 9362AF072A
     I                                      937 9492AF073A
     I                                      950 9622AF074A
     I                                      963 9752AF075A
     I                                      976 9882AF076A
     I                                      98910012AF077A
     I                                     100210142AF078A
     I                                     101510272AF079A
     I                                     102810402AF080A
     I*分店代號
     I            DS
     I                                        1   5 TB04
     I                                        2   40X
     C*===============================================================*
     C*                    DEFINE                                     *
     C*===============================================================*
     C           *LIKE     DEFN TB01      KTB01            公司別
     C           *LIKE     DEFN TB02      KTB02            年月
     C           *LIKE     DEFN TB03      KTB03            通路代號
     C           *LIKE     DEFN TB04      KTB04            分店代號
     C           *LIKE     DEFN TB05      KTB05            產品代號
     C*===============================================================*
     C*                    KEY LIST                                   *
     C*===============================================================*
     C           KEYTA     KLIST
     C                     KFLD           KTB01            公司別
     C                     KFLD           KTB02            年月
     C                     KFLD           KTB05            產品代號
     C           KEYTB     KLIST
     C                     KFLD           KTB01            公司別
     C                     KFLD           KTB02            年月
     C                     KFLD           KTB03            通路代號
     C                     KFLD           KTB05            產品代號
     C                     KFLD           KTB04            分店代號
     C           KEYTB1    KLIST
     C                     KFLD           KTB01            公司別
     C                     KFLD           KTB02            年月
     C                     KFLD           KTB03            通路代號
     C                     KFLD           KTB05            產品代號
     C*===============================================================*
     C*                    MAIN                                       *
     C*===============================================================*
     C  N10                EXSR R0100
     C                     EXSR R2000                      .PROCESS
     C*===============================================================*
     C*          R0100 ... INIT                                       *
     C*===============================================================*
     C           R0100     BEGSR
     C*
     C                     MOVEL'S1'      KTB01     P      公司別
     C                     Z-ADDPARM1     KTB02            年月
     C                     MOVEL'C1'      KTB03     P      通路代號
     C                     MOVEL*LOVAL    KTB04            分店代號
     C                     Z-ADDPARM1     AF02             統計年月
     C*
     C                     SETON                     10
     C*
     C                     ENDSR
     C*===============================================================*
     C*          R2000 ... PROCESS                                    *
     C*===============================================================*
     C           R2000     BEGSR
     C*
     C                     Z-ADD0         @A01
     C                     Z-ADD0         @A02
     C                     MOVELAE01      KTB05     P      產品代號
     C                     MOVELAE01      AF01      P      產品代號
     C                     Z-ADD0         WK01   132       庫存金額
     C*讀取各店帳列庫存
     C           KEYTB     SETLLTB0
     C           KEYTB1    READETB0                      46
     C           *IN46     DOWEQ'0'
     C*大榮倉&壞品倉&總公司&愛買陳列　不計入
     C           TB04      IFLT 'C097'
     C                     ADD  TB07      @A01,X           帳列庫存
     C*讀取產品單位成本&計算庫存金額
     C           KEYTA     CHAINTA0                  40
     C           *IN40     IFEQ '0'
     C           TA07      MULT TB07      WK01      H
     C                     ELSE
     C                     Z-ADD0         WK01
     C                     END
     C                     ADD  WK01      @A02,X           庫存金額
     C                     END
     C           KEYTB1    READETB0                      46
     C                     ENDDO
     C*
     C                     XFOOT@A01      AF999Q           加總帳列庫存
     C                     XFOOT@A02      AF999A           加總庫存金額
     C*
     C                     WRITEAF0
     C*
     C                     ENDSR
