     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : DBR006                                     *
     A*    AUTHOR       : A1650  DEREK                               *
     A*    CREATE DATRE : 104/02/04                                  *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    DESCRIPTION  :供應商進貨進貨表(FOR DBQT)                *
     A*--------------------------------------------------------------*
     A* MODI CODE |   DATE   | DESCRIPTION                           *
     A****************************************************************
     FPOCMPF  IP  E           K        DISK
     FDBALPF  O   E           K        DISK
     E*---------------------------------------------------------------*
     C*===============================================================*
     C*                    DEFINE                                     *
     C*===============================================================*
     C*===============================================================*
     C*                    MAIN                                       *
     C*===============================================================*
     C  N10                EXSR R0100                      .INIT
     C                     EXSR R2000                      .PROCESS
     C*===============================================================*
     C*          R0100 ... INIT                                       *
     C*===============================================================*
     C           R0100     BEGSR
     C*
     C                     SETON                     10
     C*
     C                     ENDSR
     C*===============================================================*
     C*          R2000 ... PROCESS                                    *
     C*===============================================================*
     C           R2000     BEGSR
     C*
     C                     MOVELCM02      AL01      P      供應商代號
     C                     Z-ADD0         AL02             編號
     C                     MOVELCM03      AL03      P      產品代號
     C                     Z-ADDCM16      AL04             到貨運日
     C                     MOVELCM13      AL05      P      分店代號
     C                     Z-ADDCM06      AL06             進貨數量
     C                     Z-ADD0         AL07             退貨數量
     C                     Z-ADDCM07      AL08             未稅進價
     C                     Z-ADDCM08      AL09             未稅金額
     C           CM08      ADD  CM09      AL10             含稅金額
     C*
     C                     WRITEAL0
     C*
     C                     ENDSR
