     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : DBR006                                     *
     A*    AUTHOR       : A1650  DEREK                               *
     A*    CREATE DATRE : 104/02/04                                  *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    DESCRIPTION  :供應商進貨進貨表(FOR DBQT)                *
     A*--------------------------------------------------------------*
     A* MODI CODE |   DATE   | DESCRIPTION                           *
     A****************************************************************
     FINTHPF  IP  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FDBALPF  O   E           K        DISK
     E*---------------------------------------------------------------*
     IDA02        DS
     I                                        1   43DUTY
     C*===============================================================*
     C*                    DEFINE                                     *
     C*===============================================================*
     C           *NAMVAR   DEFN           DA02             稅率REFLIB
     C*===============================================================*
     C*                    KEY LIST                                   *
     C*===============================================================*
     C           KEYNC     KLIST                           .MANCPF
     C                     KFLD           TH06             公司別
     C                     KFLD           TH02             產品代號
     C*===============================================================*
     C*                    MAIN                                       *
     C*===============================================================*
     C  N10                EXSR R0100                      .INIT
     C                     EXSR R2000                      .PROCESS
     C*===============================================================*
     C*          R0100 ... INIT                                       *
     C*===============================================================*
     C           R0100     BEGSR
     C*
     C                     IN   DA02
     C                     SETON                     10
     C*
     C                     ENDSR
     C*===============================================================*
     C*          R2000 ... PROCESS                                    *
     C*===============================================================*
     C           R2000     BEGSR
     C*
     C*供應商代號
     C           KEYNC     CHAINNC0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELNC03      AL01      P      供應商代號
     C                     ELSE
     C                     MOVEL*BLANK    AL01             供應商代號
     C                     ENDIF
     C*
     C                     Z-ADD0         AL02             編號
     C                     MOVELTH02      AL03      P      產品代號
     C                     Z-ADDTH09      AL04             到貨運日
     C                     MOVELTH08      AL05      P      分店代號
     C                     Z-ADDTH03      AL06             進貨數量
     C                     Z-ADD0         AL07             退貨數量
     C                     Z-ADDTH04      AL08             未稅進價
     C           TH04      MULT TH03      AL09             未稅金額
     C           AL09      MULT DUTY      WTAX    90H      稅額
     C           AL09      ADD  WTAX      AL10             含稅金額
     C*
     C                     WRITEAL0
     C*
     C                     ENDSR
