     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : DBR005                                     *
     A*    AUTHOR       : A1650  DEREK                               *
     A*    CREATE DATRE : 104/02/04                                  *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    DESCRIPTION  :供應商進貨彙總表(FOR DBQT)                *
     A*--------------------------------------------------------------*
     A* MODI CODE |   DATE   | DESCRIPTION                           *
     A****************************************************************
     FDBAKPF  UP  E           K        DISK
     E*---------------------------------------------------------------*
     IAK0
     I                                              AK01  L2
     I                                              AK03  L1
     C*===============================================================*
     C*                    DEFINE                                     *
     C*===============================================================*
     C           *LIKE     DEFN AK02      WAK02            編號
     C*===============================================================*
     C*                    MAIN                                       *
     C*===============================================================*
     C  N10                EXSR R0100                      .INIT
     C   L2                EXSR R7200
     C   L1                EXSR R7100
     C                     EXSR R2000                      .PROCESS
     C*===============================================================*
     C*          R0100 ... INIT                                       *
     C*===============================================================*
     C           R0100     BEGSR
     C*
     C                     SETON                     10
     C*
     C                     ENDSR
     C*===============================================================*
     C*          R7100 ... L1 -- INIT                                 *
     C*===============================================================*
     C           R7100     BEGSR
     C*
     C                     ADD  1         WAK02            編號
     C*
     C                     ENDSR
     C*===============================================================*
     C*          R7200 ... L2 -- INIT                                 *
     C*===============================================================*
     C           R7200     BEGSR
     C*
     C                     Z-ADD0         WAK02            編號
     C*
     C                     ENDSR
     C*===============================================================*
     C*          R2000 ... PROCESS                                    *
     C*===============================================================*
     C           R2000     BEGSR
     C*
     C                     Z-ADDWAK02     AK02             編號
     C           AK04      SUB  AK05      AK06             淨進貨量
     C           AK07      SUB  AK08      AK09             進貨淨額
     C*
     C                     UPDATAK0
     C*
     C                     ENDSR
