     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : DBR006                                     *
     A*    AUTHOR       : A1650  DEREK                               *
     A*    CREATE DATRE : 104/02/04                                  *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    DESCRIPTION  :供應商進貨明細表(FOR DBQT)                *
     A*--------------------------------------------------------------*
     A* MODI CODE |   DATE   | DESCRIPTION                           *
     A****************************************************************
     FDBALPF  UP  E           K        DISK
     E*---------------------------------------------------------------*
     IAL0
     I                                              AL01  L2
     I                                              AL03  L1
     C*===============================================================*
     C*                    DEFINE                                     *
     C*===============================================================*
     C           *LIKE     DEFN AL02      WAL02            編號
     C*===============================================================*
     C*                    MAIN                                       *
     C*===============================================================*
     C  N10                EXSR R0100                      .INIT
     C   L2                EXSR R7200
     C   L1                EXSR R7100
     C                     EXSR R2000                      .PROCESS
     C*===============================================================*
     C*          R0100 ... INIT                                       *
     C*===============================================================*
     C           R0100     BEGSR
     C*
     C                     SETON                     10
     C*
     C                     ENDSR
     C*===============================================================*
     C*          R7100 ... L1 -- INIT                                 *
     C*===============================================================*
     C           R7100     BEGSR
     C*
     C                     ADD  1         WAL02            編號
     C*
     C                     ENDSR
     C*===============================================================*
     C*          R7200 ... L2 -- INIT                                 *
     C*===============================================================*
     C           R7200     BEGSR
     C*
     C                     Z-ADD0         WAL02            編號
     C*
     C                     ENDSR
     C*===============================================================*
     C*          R2000 ... PROCESS                                    *
     C*===============================================================*
     C           R2000     BEGSR
     C*
     C                     Z-ADDWAL02     AL02             編號
     C*
     C                     UPDATAL0
     C*
     C                     ENDSR
