     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : GET002                                     *
     A*    AUTHOR       : A1491  EASON                               *
     A*    DATE WRITTEN : 97/09/03                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                          *
     A*    SUBSYSTEM    :產品報價單號採番                          *
     A*    PROCEDURE    :產品報價單號採番                          *
     A****************************************************************
     FS@FBPF  UF  E           K        DISK                      A
     IS002O1      DS
     I                                        1   2 WI1
     I                                        3   60WI2
     I                                        7   8 WI3
     I                                        9  110FB04
     I*           DS
     I*                                       1   2 WI2
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WI1       PARM           S002I1  2
     C           WI2       PARM           S002I3  40
     C           WI3       PARM           S002I4  2
     C                     PARM           S002O1 11
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYFB     KLIST
     C                     KFLD           WI1
     C                     KFLD           WI2
     C                     KFLD           WI3
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           KEYFB     CHAINFB0                  40
  01-C           *IN40     IFEQ '0'
    C                     ADD  1         FB04
    C                     UPDATFB0
  01*C                     ELSE
    C                     MOVE WI1       FB01
    C                     Z-ADDWI2       FB02
    C                     MOVE WI3       FB03
    C                     Z-ADD1         FB04
    C                     WRITEFB0
  01-C                     END
     C*
     C                     SETON                     LR
