     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : GLS005                                     *
     H*    AUTHOR       : A1150                                      *
     H*    CREATE DATE  : 81/11/06                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                            *
     H*    REMARK       :                                            *
     F****************************************************************
     FGLACPF  IF  E           K        DISK
     FGLAKPF  IF  E           K        DISK
     FGLACLF01IF  E           K        DISK
     F                                              KINFDS WFLD
     E                    W01        13  1
     I*
     IWFLD        DS
     I                                     *RECORD  W02
     I            DS
     I                                        1   8 W03
     I                                        3   40WNUM
     I            DS
     I                                        1  13 W01
     I                                        1   1 AC03
     I                                        2   2 AC04
     I                                        3   3 AC05
     I                                        4   4 AC06
     I                                        5   5 AC07
     I                                        6   6 AC08
     I                                        7   7 AC09
     I                                        8   8 AC10
     I                                        9   9 AC11
     I                                       10  10 AC12
     I                                       11  11 AC13
     I                                       12  12 AC14
     I                                       13  13 AC15
     C*==============================================================*
     C*                    PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           P005I1  2
     C                     PARM           P005I2  80
     C                     PARM           P005I3  1
     C                     PARM           P005O1  40
     C                     PARM           P005O2  20
     C                     PARM           P005O3  1
     C                     PARM           P005O4  1
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYPC     KLIST                            PF
     C                     KFLD           AC01             *公司別
     C                     KFLD           AC02             *會計年度
     C           KEYLC     KLIST                            LF
     C                     KFLD           P005I1           *公司別
     C                     KFLD           W05              *傳票日期
     C           KEYAK     KLIST
     C                     KFLD           P005I1           *公司別
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C*轉換日期格式----- P005I2-->W05
     C*-----------------------------------------
  01-C           P005I3    IFEQ 'S'
    C                     Z-ADDP005I2    W04     80
    C           KEYAK     CHAINAK0                  40
    C*--------------------------------------------------
    C   40                GOTO @END
    C*--------------------------------------------------
    C                     CALL 'P31'
    C                     PARM W04       P3101I  80
    C                     PARM AK11      P3102I  1
    C                     PARM AK09      P3103I  1
    C                     PARM '2'       P3104I  1
    C                     PARM '1'       P3105I  1
    C           W05       PARM           P3101O  80
  01*C                     ELSE
    C                     Z-ADDP005I2    W05     80
  01-C                     END
     C*
     C                     MOVEL*BLANK    @FLG    1
     C           KEYLC     SETGTGLACLF01
     C           P005I1    REDPEGLACLF01                 44
  02-C           *IN44     DOWEQ'0'
    C           @FLG      ANDEQ*BLANK
    C*RECORD FORMAT NAME
    C                     MOVELW02       W03
    C*傳票日期----
  03-C           W05       IFGE AC03A
    C           W05       ANDLEAC03B
    C*會計年度-----
    C                     MOVELAC02      P005O1
    C*會計期間------
  04-C           W05       IFEQ AC03A
    C           WNUM      ANDNE1
    C           WNUM      SUB  1         P005O2
  04*C                     ELSE
    C                     Z-ADDWNUM      P005O2
  04-C                     END
    C*本期結帳----
    C                     MOVELAC03      P005O3
    C*至本期結帳-----
    C           KEYPC     CHAINAC0                  40
    C*
  05-C                     DO   P005O2    X       20
  06-C           W01,X     IFNE 'Y'
    C                     SETON                     99
  06-C                     END
  05-C                     END  1
    C*
  07-C           *IN99     IFEQ '0'
    C                     MOVEL'Y'       P005O4
  07*C                     ELSE
    C                     MOVEL*BLANK    P005O4
  07-C                     END
    C*
    C                     MOVEL'1'       @FLG
    C*
  03-C                     END
    C*
    C           P005I1    REDPEGLACLF01                 44
  02-C                     END
     C*
     C           @END      TAG
     C                     SETON                     LR
