      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR020                                        *
      * AUTHER       : A1388  WIND                                   *
      * CREATE DATE  : 2008/11/03                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :帳列產品庫存金額表－依產品                   *
      ****************************************************************
     FPA#BPF  IF  E           K        DISK
     FC#EHPF  IF  E           K        DISK
     FINR020D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     I*----------------------------------------------------------------
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DTO01
     I                                      603 604 DDOC
     I                                      605 606 DTO02S
     I                                      607 608 DTO02E
     I                                      609 613 DTO03S
     I                                      614 618 DTO03E
     I                                      619 6190DATA
     I                                      621 629 DTO04S
     I                                      631 639 DTO04E
     I                                      641 6460DTO05
     I                                      641 6420DTOMM
     I                                      643 6440DTODD
     I                                      645 6460DTOYY
     I                                      651 6580DATES
     I                                      657 6580DATED
     I                                      651 6560SYYMM
     I                                      661 6680DATEE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I            DS
     I                                        1   40DTO05S
     I                                        1   20DTO05M
     I                                        3   40DTO05Y
     I            DS
     I                                        1   60DTO05E
     I                                        1   20TO05M
     I                                        3   40TO05D
     I                                        5   60TO05Y
     I            DS
     I                                        1   60WDATE
     I                                        3   40WYY
     I                                        5   60WMM
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYTA     KLIST
     C                     KFLD           DTO01
     C                     KFLD           SYYMM
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C*
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEL*BLANK    DOWNL
  02-C           *IN03     IFEQ '0'
    C*
    C*  F4 PROMPT PROCESS *
    C           *IN04     IFEQ '1'
    C                     EXSR RTNF4
    C                     SETON                     99
    C                     ITER
  03-C                     ENDIF
    C*
    C                     EXSR RTN100                     .CHECK      ?
    C*  F7 DOWNLOAD*
  04-C           *IN99     IFEQ '0'
    C           *IN07     ANDEQ'1'
    C                     MOVEL'1'       DOWNL
    C                     SETON                     99
    C                     OUT  *NAMVAR
    C                     CALL 'INR020C1'
    C                     IN   LDA
  04-C                     ENDIF
    C*
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C*
|    C*          AUT       IFNE 'CWD'
|    C*                    SETON                     31
|    C*                    END
|    C*
|    C                     MOVE *BLANK    DTO01
|    C                     MOVE *BLANK    D#B03
|    C                     MOVE *BLANK    DTO02S
|    C                     MOVE *BLANK    DTO02E
|    C                     MOVE *BLANK    DTO03S
|    C                     MOVE *BLANK    DTO03E
|    C                     MOVE *BLANK    DTO04S
|    C                     MOVE *BLANK    DTO04E
|    C                     Z-ADD*ZERO     DTO05S
|    C                     Z-ADD*ZERO     DTO05E
|    C                     Z-ADD0         DATES   80
|    C                     MOVEL'00'      DDOC
|    C                     Z-ADD1         DATA
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DTO01     IFEQ *BLANKS
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO END100
|     *
|    C           DTO01     CHAINPA#BPF               40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 02*C                     ELSE
|   C                     MOVEL#B03      D#B03
| 02-C                     END
|    C   99                GOTO END100
|     *
|    C           DTO01     CHAINC#EHPF               40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL'ERR0049' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO END100
|    C**通路代號
| 02-C           DTO02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DTO02S
| 02-C                     END
|    C*
| 03-C           DTO02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DTO02E
| 03-C                     END
|    C*
| 04-C           DTO02S    IFGT DTO02E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     616299
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*分店代號
| 10-C           DTO03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DTO03S
| 10-C                     END
|    C*
| 11-C           DTO03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DTO03E
| 11-C                     END
|    C*
| 12-C           DTO03S    IFGT DTO03E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     636499
| 16-C                     END
|    C   99                GOTO END100
|    C*產品代號
| 10-C           DTO04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DTO04S
| 10-C                     END
|    C*
| 11-C           DTO04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DTO04E
| 11-C                     END
|    C*
| 12-C           DTO04S    IFGT DTO04E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     656699
| 19-C                     END
|    C   99                GOTO END100
|    C*截止日或已月結月份
| 07-C           DTO05S    IFNE *ZERO
|   C           DTO05E    ANDNE*ZERO
|   C                     MOVEL'ERR0103' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     676899
| 07-C                     END
|    C   99                GOTO END100
|    C*
|    C                     MOVEL'00'      DDOC
|    C                     Z-ADD*ZERO     DTO05
| 08-C                     SELEC
|   C           DTO05S    WHNE *ZERO
|   C                     Z-ADDDTO05M    DTOMM
|   C                     Z-ADDDTO05Y    DTOYY
|   C                     Z-ADD*ZERO     DTODD
|    C*
     C                     Z-ADD0         WDATE
     C                     Z-ADDDTO05Y    WYY
     C                     Z-ADDDTO05M    WMM
     C                     CALL 'P34'
     C                     PARM WDATE     P3401I  60
     C                     PARM '1'       P3402I  1
     C                     PARM '1'       P3403I  1
     C                     PARM           P3401O  1
     C                     PARM           P3402O  20
|   C                     Z-ADDP3402O    DTODD
|    C*
|   C                     MOVEL'01'      DDOC             已月結
|   C*
|   C           DTO05E    WHNE *ZERO
|   C                     Z-ADDDTO05E    DTO05
     C* 未改暫停用
|   C*                    MOVEL'02'      DDOC             未月結
|   C                     MOVEL'01'      DDOC             未月結
| 08-C                     ENDSL
|    C*
|   C                     CALL 'P30'
|   C                     PARM DTO05     P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 06-C           P3011O    IFEQ 'N'
|   C*
|   C                     SELEC
|   C           DDOC      WHEQ '01'
|   C                     MOVEL'ERR0004' ERRID
|   C                     SETON                     67  99
|   C           DDOC      WHEQ '02'
|   C                     MOVEL'ERR0004' ERRID
|   C                     SETON                     68  99
|   C                     OTHER
|   C                     MOVEL'ERR0001' ERRID
|   C                     SETON                     676899
|   C                     ENDSL
|   C                     MOVEL'SCMF'    ERRF
| 10-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'P31'
|    C                     PARM DTO05     P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DATES     PARM           P3101O  80
|    C                     Z-ADDDATES     DATEE
|    C*
| 11-C                     SELEC
|   C           DDOC      WHEQ '01'
| 12-C           SYYMM     IFGE EH02
|   C                     MOVEL'ERR0104' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     67  99
| 12-C                     ENDIF
|   C*
|   C           DDOC      WHEQ '02'
| 13-C           DATES     IFLT EH07
| 13-C           DATES     ORGT EH08
|   C                     MOVEL'ERR0105' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     68  99
| 13-C                     ENDIF
|   C*
| 11-C                     ENDSL
|    C   99                GOTO END100
|    C*
|    C                     Z-ADDDATES     DATEE
|    C                     Z-ADD01        DATED
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品
| 02-C           D#ROW     IFEQ 09
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'SWD005'
|   C                     PARM           DTO01
|   C                     PARM           DTO04S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 09
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE58
|   C                     CALL 'SWD005'
|   C                     PARM           DTO01
|   C                     PARM           DTO04E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
      *===============================================================*
     C/COPY HBP2CVTR
