      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0602                                       *
      * AUTHER       : VINCENT                                       *
      * CREATE DATE  : 97/12/17                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :陳列品轉進貨表                               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
      ****************************************************************
     FSCWK09  IP  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FINR060P O   E             39     PRINTER
      *
     IWK9
     I                                              W901  L3
     I                                              W902  L2
     I                                              W906  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DTH06
     I                                      603 604 DDOC
     I                                      605 606 DTH07S
     I                                      607 608 DTH07E
     I                                      609 613 DTH08S
     I                                      614 618 DTH08E
     I                                      619 6190DATA
     I                                      621 629 DTH02S
     I                                      631 639 DTH02E
     I                                      641 6460DTH09S
     I                                      651 6560DTH09E
     I                                      661 6680DATES
     I                                      671 6780DATEE
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900
      *
     C                     ADD  W910      Q1
     C                     ADD  W911      Q2
     C                     ADD  W910      Q3
     C                     ADD  W911      Q4
     C                     ADD  W910      Q5
     C                     ADD  W911      Q6
     C                     WRITEPD1
     C                     SETOF                     3031
      *
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     CL3 10                EXSR RTNL3
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|     *
|     * GET公司名稱
|    C           DTH06     CHAIN#B0                  40
|    C   40                MOVEL*BLANK    D#B03
|    C  N40                MOVEL#B03      D#B03
|     *
|    C                     WRITEPH1
|     *
|    C                     SETOF                     39
|    C                     SETON                     103031
|     *
|    C                     Z-ADD*ZERO     Q1
|    C                     Z-ADD*ZERO     Q2
|    C                     Z-ADD*ZERO     Q3
|    C                     Z-ADD*ZERO     Q4
|    C                     Z-ADD*ZERO     Q5
|    C                     Z-ADD*ZERO     Q6
|     *
01===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
03===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|     *
01===C                     ENDSR
      *==============================================================*
      *          RTNL1 ....分店合計
      *==============================================================*
03===C           RTNL1     BEGSR
|    C*
|    C                     SETON                     31
|    C                     WRITEPD2
|    C*
|    C                     Z-ADD*ZERO     Q1
|    C                     Z-ADD*ZERO     Q2
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL2 ....產品合計
      *==============================================================*
03===C           RTNL2     BEGSR
|    C*
|    C                     SETON                     3031
|    C                     WRITEPD3
|    C*
     C                     Z-ADD*ZERO     Q1
|    C                     Z-ADD*ZERO     Q2
     C                     Z-ADD*ZERO     Q3
|    C                     Z-ADD*ZERO     Q4
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL3 ....總計
      *==============================================================*
02===C           RTNL3     BEGSR
|    C*
|    C                     WRITEPD4
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
06===C           RTNLR     BEGSR
|     *
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
|     *
|    C                     WRITEPE2
|     *
06===C                     ENDSR
