      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0701                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 2008/12/18                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :陳列品退出表  (WRITE WORKFILE)               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
      ****************************************************************
     FINTLPF  IF  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FMANDPF  IF  E           K        DISK
     FMANEPF  IF  E           K        DISK
     FSCWK10  O   E           K        DISK
      *
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DTL05
     I                                      603 604 DDOC
     I                                      605 606 DTL06S
     I                                      607 608 DTL06E
     I                                      609 613 DTL07S
     I                                      614 618 DTL07E
     I                                      619 6190DATA
     I                                      621 629 DTL02S
     I                                      631 639 DTL02E
     I                                      641 6460DTL08S
     I                                      651 6560DTL08E
     I                                      661 6680DATES
     I                                      671 6780DATEE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYNC     KLIST
     C                     KFLD           TL05
     C                     KFLD           TL02
     C           KEYND     KLIST
     C                     KFLD           TL05
     C                     KFLD           TL06
     C           KEYNE     KLIST
     C                     KFLD           TL05
     C                     KFLD           TL06
     C                     KFLD           TL07
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
|    *
|    C           *LOVAL    SETLLTL0
|    C                     READ TL0                      40
| 01-C           *IN40     DOWEQ'0'
|   C*產品名稱
     C           TL02      IFNE W1002
|   C           KEYNC     CHAINNC0                  41
|   C  N41                MOVELNC05      W1003
|   C   41                MOVEL*BLANK    W1003
     C                     ENDIF
|   C*通路名稱
     C           TL06      IFNE W1004
|   C           KEYND     CHAINND0                  41
|   C  N41                MOVELND04      W1005
|   C   41                MOVEL*BLANK    W1005
     C                     ENDIF
|   C*分店名稱
     C           TL07      IFNE W1006
|   C           KEYNE     CHAINNE0                  41
|   C  N41                MOVELNE05      W1007
|   C   41                MOVEL*BLANK    W1007
     C                     ENDIF
|   C                     MOVELTL05      W1001
|   C                     MOVELTL02      W1002
|   C                     MOVELTL06      W1004
|   C                     MOVELTL07      W1006
     C                     Z-ADDTL08      W1008
     C                     Z-ADDTL03      W1009
     C                     MOVELTL04      W1010
     C                     MOVELTL01      W1011
     C*
     C*
|   C                     WRITEWK10
|   C*
|   C                     READ TL0                      40
| 01-C                     ENDDO
|     *
01===C                     SETON                     LR
