      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR070                                        *
      * AUTHER       : A1388  WIND                                   *
      * CREATE DATE  : 2008/12/18                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                             *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :陳列品退出表                                 *
      ****************************************************************
     FPA#BPF  IF  E           K        DISK
     FC#EHPF  IF  E           K        DISK
     FINR070D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DTL05
     I                                      603 604 DDOC
     I                                      605 606 DTL06S
     I                                      607 608 DTL06E
     I                                      609 613 DTL07S
     I                                      614 618 DTL07E
     I                                      619 6190DATA
     I                                      621 629 DTL02S
     I                                      631 639 DTL02E
     I                                      641 6460DTL08S
     I                                      651 6560DTL08E
     I                                      661 6680DATES
     I                                      671 6780DATEE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C*
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEL*BLANK    DOWNL
  02-C           *IN03     IFEQ '0'
    C*
    C*  F4 PROMPT PROCESS *
  03-C           *IN04     IFEQ '1'
    C                     EXSR RTNF4
    C                     SETON                     99
    C                     ITER
  03-C                     ENDIF
    C*
    C                     EXSR RTN100                     .CHECK      ?
    C*  F7 DOWNLOAD*
  04-C           *IN99     IFEQ '0'
    C           *IN07     ANDEQ'1'
    C                     MOVEL'1'       DOWNL
    C                     SETON                     99
    C                     OUT  *NAMVAR
    C                     CALL 'INR070C2'
    C                     IN   LDA
  04-C                     ENDIF
    C*
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C*
|    C*          AUT       IFNE 'CWD'
|    C*                    SETON                     31
|    C*                    END
|    C*
|    C                     MOVE *BLANK    DTL05
|    C                     MOVE *BLANK    D#B03
|    C                     MOVE *BLANK    DTL06S
|    C                     MOVE *BLANK    DTL06E
|    C                     MOVE *BLANK    DTL07S
|    C                     MOVE *BLANK    DTL07E
|    C                     MOVE *BLANK    DTL02S
|    C                     MOVE *BLANK    DTL02E
|    C                     Z-ADD0         DTL08S
|    C                     Z-ADD0         DTL08E
|    C                     Z-ADD0         DATES
|    C                     Z-ADD0         DATEE
|    C                     Z-ADD1         DATA
|    C                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DTL05     IFEQ *BLANKS
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO END100
|     *
|    C           DTL05     CHAINPA#BPF               40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 02*C                     ELSE
|   C                     MOVEL#B03      D#B03
| 02-C                     END
|    C   99                GOTO END100
|     *
|    C           DTL05     CHAINC#EHPF               40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL'ERR0049' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C* 通路代號
| 04-C           DTL06S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DTL06S
| 04-C                     END
|    C*
| 05-C           DTL06E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DTL06E
| 05-C                     END
|    C*
| 06-C           DTL06S    IFGT DTL06E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     616299
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*分店代號
| 07-C           DTL07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DTL07S
| 07-C                     END
|    C*
| 08-C           DTL07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DTL07E
| 08-C                     END
|    C*
| 09-C           DTL07S    IFGT DTL07E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     636499
| 09-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 10-C           DTL02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DTL02S
| 10-C                     END
|    C*
| 11-C           DTL02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DTL02E
| 11-C                     END
|    C*
| 12-C           DTL02S    IFGT DTL02E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     656699
| 12-C                     END
|    C   99                GOTO END100
|    C*
|    C*轉進貨日
| 13-C           DTL08S    IFEQ 0
|   C                     Z-ADD010192    DTL08S
| 13*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DTL08S    P0901I  60
|   C                     PARM           P0901O  1
| 14-C           P0901O    IFEQ 'N'
|   C                     SETON                     6799
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 14-C                     END
| 13-C                     END
|    C   99                GOTO END100
|    C*
| 15-C           DTL08E    IFEQ 0
|   C                     Z-ADD123129    DTL08E
| 15*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DTL08E    P0901I  60
|   C                     PARM           P0901O  1
| 16-C           P0901O    IFEQ 'N'
|   C                     SETON                     6899
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 16-C                     END
| 15-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DTL08S    S001I2  60
|    C           W6        PARM           S001O1  60
|    C                     MOVE W6        HB2@F6  6
|    C                     EXSR HB@68L
|    C                     MOVE HB2@T8    DATES
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DTL08E    S001I2  60
|    C           W6        PARM           S001O1  60
|    C                     MOVE W6        HB2@F6  6
|    C                     EXSR HB@68L
|    C                     MOVE HB2@T8    DATEE
|    C*
| 17-C           DATES     IFGT DATEE
|   C                     SETON                     676899
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 17-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品
| 02-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'SWD005'
|   C                     PARM           DTL05
|   C                     PARM           DTL02S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE58
|   C                     CALL 'SWD005'
|   C                     PARM           DTL05
|   C                     PARM           DTL02E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
      *===============================================================*
     C/COPY HBP2CVTR
