      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0502                                       *
      * AUTHER       : A1388  WIND                                   *
      * CREATE DATE  : 2008/11/03                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                             *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :月加權成本計算表(WRITE WORKFILE)             *
      ****************************************************************
     FINTOLF06IF  E           K        DISK
     F                                              KINFDS TORCDN
     FINTMLF04IF  E           K        DISK
     FINTAPF  IF  E           K        DISK
     FINTBLF02IF  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FUTL2PF  IF  E           K        DISK
     FPOCCLF02IF  E           K        DISK
     FSCWK085 UF  E           K        DISK                      A
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DTO01
     I                                      603 604 DDOC
     I                                      605 606 DTO02S
     I                                      607 608 DTO02E
     I                                      609 613 DTO03S
     I                                      614 618 DTO03E
     I                                      619 6190DATA
     I                                      621 629 DTO04S
     I                                      631 639 DTO04E
     I                                      641 6460DTO05
     I                                      641 6420DTOYY
     I                                      651 6580DATES
     I                                      651 6560SYYMM
     I                                      661 6680DATEE
     I                                      667 6680DATED
     I*
     I            DS
     I                                        1  32 L203
     I                                        1   1 L203F
     I            DS
     I                                        1   80KCC07
     I                                        1   40KCC07Y
     ITORCDN      DS
     I                                     *RECORD  RCDR
      *==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN CC09      WCC09
     C           *LIKE     DEFN TM05      WTM05
     C*==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYTA     KLIST
     C                     KFLD           DTO01
     C                     KFLD           SYYMM
     C           KEYTB     KLIST
     C                     KFLD           DTO01
     C                     KFLD           SYYMM
     C                     KFLD           TA03
     C           KEYTO1    KLIST
     C                     KFLD           TA01
     C                     KFLD           TB03
     C                     KFLD           TB04
     C                     KFLD           TB05
     C                     KFLD           DATES
     C           KEYTO2    KLIST
     C                     KFLD           TA01
     C                     KFLD           TB03
     C                     KFLD           TB04
     C                     KFLD           TB05
     C           KEYTM1    KLIST
     C                     KFLD           TA01
     C                     KFLD           TA03
     C                     KFLD           DATES
     C           KEYTM2    KLIST
     C                     KFLD           TA01
     C                     KFLD           TA03
     C           KEYNC     KLIST
     C                     KFLD           TA01
     C                     KFLD           W801
     C*
     C           KEYL2     KLIST
     C                     KFLD           L201
     C                     KFLD           L202
     C           KEYCC     KLIST
     C                     KFLD           KCC01   2
     C                     KFLD           KCC02   2
     C                     KFLD           KCC04   9
     C                     KFLD           KCC06   1
     C                     KFLD           KCC07
     C           KEYCC1    KLIST
     C                     KFLD           KCC01
     C                     KFLD           KCC02
     C                     KFLD           KCC04
     C                     KFLD           KCC06
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010
     C*
     C                     SETOF                     54
     C           KEYTA     SETLLINTAPF
  01-C           *IN54     DOUEQ'1'
    C           KEYTA     READEINTAPF                   54
    C   54                LEAVE
    C*產品範圍
  02-C           TA03      IFLT DTO04S
    C                     ITER
  02-C                     ENDIF
    C*
  03-C           TA03      IFGT DTO04E
    C                     ITER
  03-C                     ENDIF
    C*分庫資料
    C                     EXSR R1000
    C*成本調整金額
    C                     EXSR R1100
    C*
  01-C                     ENDDO
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INZ.
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
01===C                     ENDSR
      *==============================================================*
      *          R1000 ...分店庫存
      *===============================================================*
02===C           R1000     BEGSR
|    C*
|    C                     SETOF                     55
|    C           KEYTB     SETLLINTBLF02
| 01-C           *IN55     DOUEQ'1'
|   C           KEYTB     READEINTBLF02                 55
|   C   55                LEAVE
|   C*通路範圍
| 02-C           TB03      IFLT DTO02S
|   C                     ITER
| 02-C                     ENDIF
|   C*
| 03-C           TB03      IFGT DTO02E
|   C                     ITER
| 03-C                     ENDIF
|   C*
|   C                     EXSR R1A01                      期初值
|   C                     EXSR R1A00                      當月異動
|   C*
| 01-C                     ENDDO
|    C*
02===C                     ENDSR
      *===============================================================*
      *          R1100 ...成本調整金額
      *===============================================================*
03===C           R1100     BEGSR
|    C*
|    C                     Z-ADD0         WTM05
|    C           KEYTM1    SETLLINTMLF04
|    C           KEYTM2    READEINTMLF04                 56
| 01-C           *IN56     DOWEQ'0'
|   C           TM02      ANDLEDATEE
|   C                     ADD  TM05      WTM05
|   C           KEYTM2    READEINTMLF04                 56
| 01-C                     ENDDO
|    C*
|    C           TA03      CHAINSCWK085              40
| 02-C           *IN40     IFEQ '0'
|   C                     Z-ADDWTM05     W809
|   C                     ADD  WTM05     W811
|   C                     UPDATWK85
| 02-C                     ENDIF
|    C*
03===C                     ENDSR
      *===============================================================*
      *          R1A00 ...當月區間之產品異動
      *===============================================================*
04===C           R1A00     BEGSR
|    C*
|    C           KEYTO1    SETLLINTOLF06
|    C           KEYTO2    READEINTOLF06                 56
| 01-C           *IN56     DOWEQ'0'
|   C           TO05      ANDLEDATEE
|   C*數量及單價
|   C                     EXSR R1B00
|   C*
|   C           KEYTO2    READEINTOLF06                 56
| 01-C                     ENDDO
|    C*
04===C                     ENDSR
      *===============================================================*
      *          R1A01 ... 期初值 WRITE SCWK085
      *===============================================================*
05===C           R1A01     BEGSR
|    C*
|    C                     MOVELTB05      W801
|    C           W801      CHAINSCWK085              40
| 01-C           *IN40     IFEQ '1'
|   C*產品簡稱
|   C                     MOVEL*BLANK    W802
|   C           KEYNC     CHAINMANCPF               41
|   C  N41                MOVELNC05      W802
|   C*
|   C*期初庫存量及庫存金額
|   C                     Z-ADDTB06      W803             期初庫存量
|   C           TA04      MULT TB06      W804             期初庫存金額
|   C                     Z-ADD0         W805
|   C                     Z-ADD0         W806
|   C                     Z-ADD0         W807
|   C                     Z-ADD0         W808
|   C                     Z-ADD0         W809
|   C                     Z-ADDW803      W810             期末庫存量
|   C                     Z-ADDW804      W811             期末庫存金額
|   C                     WRITEWK85
| 01*C                     ELSE
|   C                     ADD  TB06      W803             期初庫存量
|   C           TA04      MULT TB06      WAMT   112
|   C                     ADD  WAMT      W804             期初庫存金額
|   C                     ADD  TB06      W810             期末庫存量
|   C                     ADD  WAMT      W811             期末庫存金額
|   C                     UPDATWK85
| 01-C                     ENDIF
|    C*
05===C                     ENDSR
      *===============================================================*
      *          R1B00 ...產品異動數量與金額處理INTOLF
      *===============================================================*
06===C           R1B00     BEGSR
|    C*
|    C* 數量
|    C                     Z-ADD0         WQTY    60
|    C                     Z-ADD0         WQ1     60
|    C                     Z-ADD0         WA1     90
|    C                     Z-ADD0         WQ2     60
|    C                     Z-ADD0         WA2     90
|    C                     MOVE *BLANK    L201
|    C                     MOVEL'INTOLF ' L201
|    C                     MOVELRCDR      L202
|    C           KEYL2     CHAINUTL2PF               40
| 01-C           *IN40     IFEQ '0'
| 02-C                     SELEC
|   C           L203F     WHEQ '-'
|   C           TO121     MULT -1        WQTY             異動數量
|   C                     OTHER
|   C                     Z-ADDTO121     WQTY
| 02-C                     ENDSL
| 01-C                     ENDIF
|    C* 單價
| 03-C                     SELEC
|   C           RCDR      WHEQ 'CM0'                      <驗收單
|   C                     Z-ADDWQTY      WQ1
|   C           TO101     MULT WQTY      WA1       H      當時進價
|   C*
|   C           RCDR      WHEQ 'TF0'                      <進貨退出單
|   C                     Z-ADDWQTY      WQ1
|   C                     MOVELTO01      KCC01            公司別
|   C                     MOVELTO14      KCC02            通路別
|   C                     MOVELTO04      KCC04            產品代號
|   C                     MOVEL'1'       KCC06            年度報價
|   C                     Z-ADDTO05      KCC07            退出日期
|   C                     EXSR R1B01                      取新年度報價
|   C           WCC09     MULT WQTY      WA1       H
|   C*
|   C           RCDR      WHEQ 'TH0'                      <陳列轉進貨單
|   C                     Z-ADDWQTY      WQ1
|   C           TO101     MULT WQTY      WA1       H      當時進價
|   C*
|   C           RCDR      WHEQ 'TJ0'                      <存貨調整單
|   C                     Z-ADDWQTY      WQ2
|   C           TA04      MULT WQTY      WA2       H      上月單位成本
| 03-C                     ENDSL
|    C* UPDATE SCWK085
|    C                     EXSR R1C00
|    C*
06===C                     ENDSR
     C*==============================================================*
     C*          R1B01 ....取得最新年度報價單價
     C*==============================================================*
07===C           R1B01     BEGSR
|     *
|   C                     Z-ADD0         WCC09
|     *
|    C           KEYCC     SETGTCC0
|    C           KEYCC1    REDPECC0                      47
| 01-C           *IN47     IFEQ '0'
|   C           KCC07Y    ANDEQCC05
|    *
| 02-C           CC08      IFNE 0
| 03-C           KCC07     IFLE CC08
|   C           KCC07     ANDGECC07
|   C                     Z-ADDCC09      WCC09
| 03-C                     ENDIF
| 02*C                     ELSE
| 04-C           KCC07     IFGE CC07
|   C                     Z-ADDCC09      WCC09
| 04-C                     ENDIF
| 02-C                     ENDIF
| 01-C                     ENDIF
|     *
07===C                     ENDSR
      *===============================================================*
      *          R1C00 ...UPDATE SCWK085 FROM INTOLF06
      *===============================================================*
08===C           R1C00     BEGSR
|    C*
|    C           TO04      CHAINSCWK085              40
| 01-C           *IN40     IFEQ '0'
| 02-C                     SELEC
|   C           RCDR      WHEQ 'CM0'                      <驗收單
|   C           RCDR      OREQ 'TF0'                      <進貨退出單
|   C           RCDR      OREQ 'TH0'                      <陳列轉進貨單
|   C                     ADD  WQ1       W805             本期進貨量
|   C                     ADD  WA1       W806             本期進貨金額
|   C                     ADD  WQ1       W810             期末庫存量
|   C                     ADD  WA1       W811             期末庫存金額
|   C           RCDR      WHEQ 'TJ0'                      <存貨調整單
|   C                     ADD  WQ2       W807             本期調整量
|   C                     ADD  WA2       W808             本期調整金額
|   C                     ADD  WQ2       W810             期末庫存量
|   C                     ADD  WA2       W811             期末庫存金額
| 02-C                     ENDSL
|   C                     UPDATWK85
| 01-C                     ENDIF
|    C*
08===C                     ENDSR
