      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0821                                       *
      * AUTHER       : A1492  TERRY                                  *
      * CREATE DATE  : 2011/06/02                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :陳列品使用明細表                             *
      ****************************************************************
     FSCWK241 IP  E           K        DISK
     FSCWK242 IF  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FMANEPF  IF  E           K        DISK
     FINR082P O   E             39     PRINTER
     I*----------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DTO01
     I                                      603 604 DDOC
     I                                      605 606 DTO02S
     I                                      607 608 DTO02E
     I                                      609 613 DTO03S
     I                                      614 618 DTO03E
     I                                      619 6190DATA
     I                                      621 629 DTO04S
     I                                      631 639 DTO04E
     I                                      641 6460DTO05
     I                                      641 6420DTOMM
     I*  截止日期
     I                                      651 6580Y0DATE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYNC     KLIST
     C                     KFLD           DTO01
     C                     KFLD           W24104
     C           KEYNE     KLIST
     C                     KFLD           DTO01
     C                     KFLD           W24102
     C                     KFLD           W24103
     C           KEYWK2    KLIST
     C                     KFLD           W24200
     C                     KFLD           W24206
     C                     KFLD           W24201
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     1030
|    C                     CLEARPE3
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....異動
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     SETON                     30
|    C*
|    C           KEYNE     CHAINMANEPF               40
|    C   40                MOVEL*BLANK    NE05
|    C           KEYNC     CHAINMANCPF               40
|    C   40                MOVEL*BLANK    NC05
|    C*
|    C                     Z-ADDW24107    P31I1
|    C                     EXSR RTN310
|    C                     Z-ADDP31IO     W2107D           到店日期
|    C*
|    C                     MOVELW24103    W24200
|    C                     MOVELW24104    W24206
|    C                     MOVELW24106    W24201
|    C*
|    C                     ADD  W24108    T24108
|    C                     ADD  W24109    T24109
|    C*
|    C           KEYWK2    SETLLSCWK242
|    C           KEYWK2    READESCWK242                  41
| 01-C           *IN41     DOWEQ*OFF
|   C*
|   C                     Z-ADDW24202    P31I1
|   C                     EXSR RTN310
|   C                     Z-ADDP31IO     W2202D           日期
|   C*
|   C                     ADD  W24205    T24205
|   C                     WRITEPD1
|   C                     CLEARPD1
|   C                     SETOF                     30
|   C*
|   C   39                EXSR RTN900
|   C*
|   C           KEYWK2    READESCWK242                  41
| 01-C                     ENDDO
|    C*無使用明細
|    C   39                EXSR RTN900
|    C   30                WRITEPD1
|    C*
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN310....日期轉換
      *==============================================================*
03===C           RTN310    BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM           P31I1   80
|    C                     PARM '2'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '3'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C                     PARM           P31IO   80
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C*
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
05===C           RTNLR     BEGSR
|    C*
|    C* GET公司名稱
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01*C                     ELSE
|   C                     WRITEPE3
| 01-C                     END
|     *
|    C                     WRITEPE2
|    C*
05===C                     ENDSR
