      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR082                                        *
      * AUTHER       : A1492  TERRY                                  *
      * CREATE DATE  : 2011/05/30                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                             *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :陳列品使用明細表                             *
      ****************************************************************
     FPA#BPF  IF  E           K        DISK
     FC#EHPF  IF  E           K        DISK
     FINR082D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      601 602 DTO01
     I                                      603 604 DDOC
     I                                      605 606 DTO02S
     I                                      607 608 DTO02E
     I                                      609 613 DTO03S
     I                                      614 618 DTO03E
     I                                      619 6190DATA
     I                                      621 629 DTO04S
     I                                      631 639 DTO04E
     I                                      641 6460DTO05
     I                                      641 6420DTOMM
     I                                      643 6440DTODD
     I                                      645 6460DTOYY
     I*
     I                                      651 6580Y0DATE
     I*  截止日期
     I            DS
     I                                        1   80W0DATE
     I                                        1   40W0YY
     I                                        5   60W0MM
     I                                        7   80W0DD
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*          KEYTA     KLIST
     C*                    KFLD           DTO01
     C*                    KFLD           SYYMM
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C*
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C*
    C*  F4 PROMPT PROCESS *
  03-C           *IN04     IFEQ '1'
    C                     EXSR RTNF4
    C                     SETON                     99
    C                     ITER
  03-C                     ENDIF
    C*
    C                     EXSR RTN100                     .CHECK      ?
    C*
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C*
|    C                     MOVE *BLANK    DTO01
|    C                     MOVE *BLANK    D#B03
|    C                     MOVE *BLANK    DTO02S
|    C                     MOVE *BLANK    DTO02E
|    C                     MOVE *BLANK    DTO03S
|    C                     MOVE *BLANK    DTO03E
|    C                     MOVE *BLANK    DTO04S
|    C                     MOVE *BLANK    DTO04E
|    C                     Z-ADD*ZERO     DTO05
|    C                     Z-ADD1         DATA
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DTO01     IFEQ *BLANKS
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO END100
|     *
|    C           DTO01     CHAINPA#BPF               40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 02*C                     ELSE
|   C                     MOVEL#B03      D#B03
| 02-C                     END
|    C   99                GOTO END100
|     *
|    C           DTO01     CHAINC#EHPF               40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL'ERR0049' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO END100
|     *
|    C**通路代號
| 04-C           DTO02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DTO02S
| 04-C                     END
|    C*
| 05-C           DTO02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DTO02E
| 05-C                     END
|    C*
| 06-C           DTO02S    IFGT DTO02E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     616299
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*分店代號
| 07-C           DTO03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DTO03S
| 07-C                     END
|    C*
| 08-C           DTO03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DTO03E
| 08-C                     END
|    C*
| 09-C           DTO03S    IFGT DTO03E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     636499
| 09-C                     END
|    C   99                GOTO END100
|    C*產品代號
| 10-C           DTO04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DTO04S
| 10-C                     END
|    C*
| 11-C           DTO04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DTO04E
| 11-C                     END
|    C*
| 12-C           DTO04S    IFGT DTO04E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     656699
| 12-C                     END
|    C   99                GOTO END100
|    C*截止日
|    C                     CALL 'P30'
|    C                     PARM DTO05     P3001I  80
|    C                     PARM '3'       P3002I  1
|    C                     PARM '1'       P3003I  1
|    C                     PARM           P3011O  1
| 13-C           P3011O    IFEQ 'N'
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     679499
| 13-C                     END
|    C   99                GOTO END100
|    C**截止日期
|    C                     CALL 'P31'
|    C                     PARM DTO05     P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           W0DATE    PARM           P3101O  80
|    C*
|    C                     Z-ADDW0DATE    Y0DATE
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品
| 02-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'SWD005'
|   C                     PARM           DTO01
|   C                     PARM           DTO04S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE58
|   C                     CALL 'SWD005'
|   C                     PARM           DTO01
|   C                     PARM           DTO04E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
      *===============================================================*
     C/COPY HBP2CVTR
