      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0803                                       *
      * AUTHER       : NANCY                                         *
      * CREATE DATE  : 100/03/24                                     *
      * UPDATE DATE  :                                               *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :陳列品餘額彙總表－依供應商(加總)           *
      ****************************************************************
     FSCRWK08 IP  E           K        DISK
     FSCRWK08AO   E           K        DISK                      A
     I*---------------------------------------------------------------*
     IWK08        01
     I*公司別+供應商+產品+進貨單價
     I                                              WCOMP L1
     I                                              WSUPL L1
     I                                              WPROD L1
     I                                              WINPR L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I*<供應商>
     I                                      603 607 DTN03S
     I                                      608 612 DTN03E
     I*<產品代號>
     I                                      613 621 DTN05S
     I                                      622 630 DTN05E
     I*<截止日:6碼>
     I                                      631 6360DTN08
     I                                      631 6320DTOMM
     I                                      633 6340DTODD
     I                                      635 6360DTOYY
     I*<截止日:8碼>
     I                                      641 6480PTN08
     I*---------------------------------------------------------------*
     I*                    KEY LIST
     C*---------------------------------------------------------------*
     C*                    MAIN ROUTINE
     C*---------------------------------------------------------------*
     C   01                EXSR $DTL
     C*
     CL1                   EXSR $TL1
     C*---------------------------------------------------------------*
     C* $DTL   :           PROCESS
     C*---------------------------------------------------------------*
     C           $DTL      BEGSR
     C*
     C*                    CLEARWK08A
     C*<算小計>
  1  C*                    ADD  WINPR     WINPR1
  2  C                     ADD  WINQT     WINQT1
  3  C                     ADD  WTURN     WTURN1
  4  C                     ADD  WOUQT     WOUQT1
  5  C                     ADD  WLAQT     WLAQT1
  5  C                     ADD  WXAQT     WXAQT1
  6  C                     ADD  WADJQ     WADJQ1
  7  C                     ADD  WLOSE     WLOSE1
  8  C                     ADD  WUSEQ     WUSEQ1
  9  C                     ADD  WUAMT     WUAMT1
  91 C                     ADD  WXAMT     WXAMT1
 10  C                     ADD  WFQTY     WFQTY1
     C*
     C                     ENDSR
     C*---------------------------------------------------------------*
     C* $TL1   :           PROCESS
     C*---------------------------------------------------------------*
     C           $TL1      BEGSR
     C*
     C                     MOVELWCOMP     WCOMP1           公司別
     C                     MOVELWSTOR     WSTOR1           分店
     C                     MOVELWSUPL     WSUPL1           供應商
     C                     MOVELWPROD     WPROD1           產品
     C                     Z-ADDWINPR     WINPR1           進貨單價
     C                     WRITEWK08A
     C*
     C                     CLEARWK08A
  1  C*                    Z-ADD*ZERO     WINPR1
  2  C*                    Z-ADD*ZERO     WINQT1
  3  C*                    Z-ADD*ZERO     WTURN1
  4  C*                    Z-ADD*ZERO     WOUQT1
  5  C*                    Z-ADD*ZERO     WLAQT1
  6  C*                    Z-ADD*ZERO     WADJQ1
  7  C*                    Z-ADD*ZERO     WLOSE1
  8  C*                    Z-ADD*ZERO     WUSEQ1
  9  C*                    Z-ADD*ZERO     WUAMT1
 10  C*                    Z-ADD*ZERO     WFQTY1
     C*
     C                     ENDSR
     C*----------------------------------------------------------------
