      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0802B                                      *
      * AUTHER       : NANCY                                         *
      * CREATE DATE  : 2011/03/18                                    *
      * UPDATE DATE  :                                               *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :陳列品餘額彙總表－依供應商(寫入工作檔)     *
      ****************************************************************
     FINTHPF  IP  E           K        DISK
     FSCRWK08 UF  E           K        DISK
     I*---------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*<截止日:8碼>
     I                                      641 6480PTN08
     C*---------------------------------------------------------------*
     C           KEY01     KLIST
     C                     KFLD           TH06             公司別
     C                     KFLD           TH02             產品代號
     C                     KFLD           TH04             進貨單價
     C*---------------------------------------------------------------*
     C*                    MAIN ROUTINE
     C*---------------------------------------------------------------*
     C                     EXSR $READ
     C*---------------------------------------------------------------*
     C*                    $READ
     C*---------------------------------------------------------------*
     C           $READ     BEGSR
     C*
     C           KEY01     CHAINSCRWK08              90
     C           *IN90     IFEQ *OFF
     C                     ADD  TH03      WTURN            轉進貨
     C                     UPDATWK08
     C                     END
     C*
     C                     ENDSR
     C*---------------------------------------------------------------*
