      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0802C                                      *
      * AUTHER       : NANCY                                         *
      * CREATE DATE  : 2011/03/18                                    *
      * UPDATE DATE  :                                               *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :陳列品餘額彙總表－依供應商(寫入工作檔)     *
      ****************************************************************
     FSCRWK08 UP  E           K        DISK
     I*---------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*<截止日:8碼>
     I                                      641 6480PTN08
     C*---------------------------------------------------------------*
     C*                    MAIN ROUTINE
     C*---------------------------------------------------------------*
     C                     EXSR $UPDF
     C*---------------------------------------------------------------*
     C*                    $UPDF
     C*---------------------------------------------------------------*
     C           $UPDF     BEGSR
     C*---------------------------------------------------------------*
     C*使用量=借貨量+調整量+盤虧量
     C*---------------------------------------------------------------*
     C           WADJQ     ADD  WLAQT     WUSEQ
     C                     ADD  WLOSE     WUSEQ
     C*
     C           WUSEQ     MULT WINPR     WUAMT            使用金額
     C           WXAQT     MULT WINPR     WXAMT            期初使用金額
     C*---------------------------------------------------------------*
     C*剩餘量=進貨量-轉進貨-退出量-借貨量-調整量-盤虧量
     C*---------------------------------------------------------------*
     C           WINQT     SUB  WTURN     WFQTY
     C                     SUB  WOUQT     WFQTY               退出量
     C                     SUB  WLAQT     WFQTY               借貨量
     C                     SUB  WXAQT     WFQTY               期初借貨
     C                     SUB  WADJQ     WFQTY               調整量
     C                     SUB  WLOSE     WFQTY               盤虧量
     C                     UPDATWK08
     C*
     C                     ENDSR
     C*---------------------------------------------------------------*
