      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR090                                        *
      * AUTHER       : A1491  EASON                                  *
      * CREATE DATE  : 2010/03/09                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                             *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :銷貨成本表                                   *
      *00A需求單號: 1080438
      *00A108/06/25 CAROL增加篩選條件：供應商、產品歸屬
      *00A               銷售日期改為月/年
      ****************************************************************
 00A-F*C#EKPF  IF  E           K        DISK
 00A+FUTL2PF  IF  E           K        DISK
 00A+FC#EHPF  IF  E           K        DISK
     FINR090D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I*
     I                                      601 602 DHA01S
     I                                      603 604 DHA01E
     I                                      605 606 DHA02S
     I                                      607 608 DHA02E
     I                                      611 615 DHA04S
     I                                      616 620 DHA04E
     I                                      621 629 DHA05S
     I                                      631 639 DHA05E
     I                                      641 6480WHA03S
     I                                      651 6580WHA03E
     I                                      661 661 DOPT1
     I                                      662 662 DOPT2
 00A-I*                                     671 6760DEK02
 00A+I                                      671 6760DEH02
 00A-I*                                     681 6860DHA03S
 00A-I*                                     691 6960DHA03E
 00A+I                                      681 6840DHA03S
 00A+I                                      686 6890DHA03E
 00A+I                                      701 705 DNB01S
 00A+I                                      706 710 DNB01E
 00A+I                                      711 712 DNC09
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
 00A+I*分割年月
 00A+I            DS
 00A+I                                        1   80TDATE
 00A+I                                        1   60TDYYMM
 00A+I                                        1   40TDYY
 00A+I                                        5   60TDMM
 00A+I                                        7   80TDDD
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*          KEYTA     KLIST
     C*                    KFLD           DTO01
     C*                    KFLD           SYYMM
 00A+C           KEYL2     KLIST
 00A+C                     KFLD           #L201   8
 00A+C                     KFLD           #L202  10
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C*
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
     *
  02-C           *IN03     IFEQ '0'
    C*  F4 PROMPT PROCESS *
  03-C           *IN04     IFEQ '1'
    C                     EXSR RTNF4
    C                     SETON                     99
    C                     ITER
  03-C                     ENDIF
    C*
    C                     EXSR RTN100                     .CHECK      ?
    C*
    C*  F7 DOWNLOAD*
  04-C*          *IN07     IFEQ '0'
    C*                    SETON                     99
    C*                    CALL 'INR090C1'
  04-C*                    ENDIF
    C*
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C*
|    C                     MOVEL*BLANK    DHA01S
|    C                     MOVEL*BLANK    DHA01E
|    C                     MOVEL*BLANK    DHA02S
|    C                     MOVEL*BLANK    DHA02E
|    C                     MOVEL*BLANK    DHA04S
|    C                     MOVEL*BLANK    DHA04E
|    C                     MOVEL*BLANK    DHA05S
|    C                     MOVEL*BLANK    DHA05E
|    C                     Z-ADD*ZERO     DHA03S
|    C                     Z-ADD*ZERO     DHA03E
 00A-C*                    Z-ADD*ZERO     DEK02
|00A+C                     Z-ADD*ZERO     DEH02
|    C                     MOVEL'1'       DOPT1
|    C                     MOVEL'1'       DOPT2
|    C                     MOVEL'SCR001'  APPSCR  6
 00A+C                     MOVEL*BLANK    DNB01S
 00A+C                     MOVEL*BLANK    DNB01E
 00A+C                     MOVEL*BLANK    DNC09
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|     *
|    C**公司代號
|     *
| 01-C           DHA01S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DHA01S
| 01-C                     END
|     *
| 02-C           DHA01E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DHA01E
| 02-C                     END
|    C*
| 03-C           DHA01S    IFGT DHA01E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
|    C   99                GOTO END100
|     *
|    C**通路代號
|     *
| 04-C           DHA02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DHA02S
| 04-C                     END
|    C*
| 05-C           DHA02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DHA02E
| 05-C                     END
|    C*
| 06-C           DHA02S    IFGT DHA02E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*分店代號
| 07-C           DHA04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DHA04S
| 07-C                     END
|    C*
| 08-C           DHA04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DHA04E
| 08-C                     END
|    C*
| 09-C           DHA04S    IFGT DHA04E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6399
| 09-C                     END
|    C   99                GOTO END100
|    C*產品代號
| 10-C           DHA05S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DHA05S
| 10-C                     END
|    C*
| 11-C           DHA05E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DHA05E
| 11-C                     END
|    C*
| 12-C           DHA05S    IFGT DHA05E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6499
| 12-C                     END
|    C   99                GOTO END100
|    C*截止日
 00A+C                     Z-ADD0         TDATE   80
|00A-C*                    Z-ADDDHA03S    WDATE   80
 00A+C                     Z-ADDDHA03S    WDATE   60
|00A-C*                    EXSR P30
 00A+C                     EXSR P38
 00A+C                     Z-ADDP3801O    TDYYMM
 00A+C           TDMM      IFEQ 01
 00A+C           TDYY      SUB  1         TDYY
 00A+C                     Z-ADD12        TDMM
 00A+C                     Z-ADD26        TDDD
 00A+C                     Z-ADDTDATE     WHA03S  80
 00A+C                     ELSE
 00A+C           TDMM      SUB  1         TDMM
 00A+C                     Z-ADD26        TDDD
 00A+C                     Z-ADDTDATE     WHA03S  80
 00A+C                     END
|     *
| 13-C*00A-      P3011O    IFEQ 'N'
 00A+C           P3811O    IFEQ 'N'
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6599
| 13-C                     END
|    C   99                GOTO END100
|    C*截止日
 00A+C                     Z-ADD0         TDATE   80
|00A-C*                    Z-ADDDHA03E    WDATE   80
 00A+C                     Z-ADDDHA03E    WDATE   60
|00A-C*                    EXSR P30
 00A+C                     EXSR P38
 00A+C                     Z-ADDP3801O    TDYYMM
 00A+ *CHECK 庫存年月
 00A+C           *LOVAL    SETLLEH0
 00A+C                     READ EH0                      46
 00A+C           *IN46     DOWEQ'0'
 00A+C           TDYYMM    IFGE EH02
 00A+C                     MOVEL'ERR0086' ERRID
 00A+C                     MOVEL'SCMF'    ERRF
 00A+C                     SETON                     656699
 00A+C                     END
 00A+C   99                GOTO END100
 00A+C                     Z-ADDEH02      DEH02
 00A+ *
 00A+C                     Z-ADD25        TDDD
 00A+C                     Z-ADDTDATE     WHA03E  80
|     *
| 14-C*00A-      P3011O    IFEQ 'N'
 00A+C           P3811O    IFEQ 'N'
| |  C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6699
| 14-C                     END
|    C   99                GOTO END100
|    C**
|00A-C*                    Z-ADD0         TDATE   80
|00A-C*                    Z-ADDDHA03S    WDATE
|00A-C*                    EXSR P31
|00A-C*                    Z-ADDTDATE     WHA03S  80
|    C**
|00A-C*                    Z-ADD0         TDATE   80
|00A-C*                    Z-ADDDHA03E    WDATE
|00A-C*                    EXSR P31
|    C                     Z-ADDTDATE     WHA03E  80
|    C**
|    C*
| 15-C           WHA03S    IFGT WHA03E
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     656699
| 15-C                     END
|    C   99                GOTO END100
|    C*
 00A+C                     READ EH0                      46
 00A+C                     ENDDO
 00A+C*
|00A-C*          *LOVAL    SETLLEK0
|00A-C*                    READ EK0                      46
|00A-C*          *IN46     DOWEQ'0'
|    *
|00A-C*          WHA03S    IFLE EK08
|00A-C*          WHA03S    ANDGEEK07
|    *
|00A-C*          WHA03E    IFGT EK08
|00A-C*                    MOVEL'ERR0086' ERRID
|00A-C*                    MOVEL'SCMF'    ERRF
|00A-C*                    SETON                     656699
|00A-C*                    ENDIF
|00A-C*  99                GOTO END100
|    *
 00A-C*                    Z-ADDEK02      DEK02
|    *
|00A-C*                    ENDIF
|    *
|00A-C*                    READ EK0                      46
|00A-C*                    ENDDO
|    C*
 00A+C*供應商代號
 00A+C           DNB01S    IFEQ *BLANKS
 00A+C                     MOVE *LOVAL    DNB01S
 00A+C                     END
 00A+C*
 00A+C           DNB01E    IFEQ *BLANKS
 00A+C                     MOVE *HIVAL    DNB01E
 00A+C                     END
 00A+C*
 00A+C           DNB01S    IFGT DNB01E
 00A+C                     MOVEL'ERR0005' ERRID
 00A+C                     MOVEL'SCMF'    ERRF
 00A+C                     SETON                     6799
 00A+C                     END
 00A+C   99                GOTO END100
 00A+C*產品歸屬
 00A+C           DNC09     IFNE *BLANK
 00A+C                     MOVEL'GUISHU  '#L201     P
 00A+C                     MOVELDNC09     #L202     P
 00A+C           KEYL2     CHAINL20                  40
 00A+C           *IN40     IFEQ '0'
 00A+C                     MOVELL203      NC09D
 00A+C                     ELSE
 00A+C                     SETON                     6899
 00A+C                     MOVEL'ERR0091' ERRID
 00A+C                     MOVEL'SCMF'    ERRF
 00A+C                     MOVEL*BLANK    NC09D
 00A+C                     ENDIF
 00A+C                     ELSE
 00A+C                     MOVEL*BLANK    NC09D
 00A+C                     ENDIF
 00A+C   99                GOTO END100
 00A+C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品
| 02-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'SWD005'
|   C                     PARM           DHA01S
|   C                     PARM           DHA05S
|   C                     GOTO ENDF4
| 02-C                     END
|    *
| 03-C           D#ROW     IFEQ 9
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE58
|   C                     CALL 'SWD005'
|   C                     PARM           DHA01S
|   C                     PARM           DHA05E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
      *===============================================================*
      *          P30       CHECK DATE
      *===============================================================*
000A-C           P30       BEGSR
|00A-C*
|00A-C                     CALL 'P30'
|00A-C                     PARM WDATE     P3001I  80
|00A-C                     PARM '3'       P3002I  1
|00A-C                     PARM '1'       P3003I  1
|00A-C                     PARM           P3011O  1
|00A-C*
000A-C                     ENDSR
      *===============================================================*
      *          P31       CHECK DATE
      *===============================================================*
000A-C           P31       BEGSR
|00A-C*
|00A-C                     CALL 'P31'
|00A-C                     PARM WDATE     P3101I  80
|00A-C                     PARM '3'       P3102I  1
|00A-C                     PARM '1'       P3103I  1
|00A-C                     PARM '2'       P3104I  1
|00A-C                     PARM '1'       P3105I  1
|00A-C           TDATE     PARM           P3101O  80
|00A-C*
000A-C                     ENDSR
      *===============================================================*
 00A+ *          P38       CHECK MONTH
 00A+ *===============================================================
 00A+ *
 00A+C           P38       BEGSR
 00A+C*
 00A+C                     CALL 'P38'
 00A+C                     PARM WDATE     P3801I  60
 00A+C                     PARM '3'       P3802I  1
 00A+C                     PARM '1'       P3803I  1
 00A+C                     PARM           P3801O  60
 00A+C                     PARM           P3811O  1
 00A+C                     ENDSR
 00A+ *===============================================================*
     C/COPY HBP2CVTR
