      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0461 (REF INR0451)                         *
      * AUTHER       : A1492  TERRY                                  *
      * CREATE DATE  : 2011/05/27                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :現場產品庫存表－依分店                       *
      ****************************************************************
     FSCWK185 IP  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FINR046P O   E             39     PRINTER
     I*----------------------------------------------------------------
     IW185
     I                                              W801  L2
     I                                              W803  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DTO01
     I                                      603 604 DDOC
     I                                      605 606 DTO02S
     I                                      607 608 DTO02E
     I                                      609 613 DTO03S
     I                                      614 618 DTO03E
     I                                      619 6190DATA
     I                                      621 629 DTO04S
     I                                      631 639 DTO04E
     I                                      641 6460DTO05
     I                                      641 6420DTOMM
     I*  截止日期
     I                                      651 6580Y0DATE
     I*  最後日結日期
     I                                      661 6680Y1DATE
     I*  最接近月結日期
     I                                      671 6780Y2DATE
     I                                      671 6760Y2YYMM
     I*  異動資料起始日期
     I                                      681 6880Y3DATE
     I*  最後日結日期 + 1
     I                                      691 6980Y4DATE
     I*
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#B     KLIST
     C                     KFLD           DTO01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900
     C*
     C                     ADD  W810      QT1
     C                     ADD  W809      QT2
     C                     ADD  W809A     QT3
     C                     ADD  W810      Q1
     C                     ADD  W809      Q2
     C                     ADD  W809A     Q3
     C*
     C                     WRITEPD1
     C   30                SETOF                     30
     C*
     CL1 10                EXSR RTNL2
     CL2 10                EXSR RTNL3
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C* GET公司名稱
|    C                     MOVEL*BLANK    D#B03
|    C           KEY#B     CHAINPA#BPF               40
|    C  N40                MOVEL#B03      D#B03
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     103031
|    C*
|    C                     Z-ADD*ZERO     Q1
|    C                     Z-ADD*ZERO     Q2
|    C                     Z-ADD*ZERO     Q3
|    C                     Z-ADD*ZERO     QT1
|    C                     Z-ADD*ZERO     QT2
|    C                     Z-ADD*ZERO     QT3
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTNL2 ....合計
      *==============================================================*
03===C           RTNL2     BEGSR
|    C*
|    C                     SETON                     30
|    C                     WRITEPD2
|    C*
|    C                     Z-ADD*ZERO     QT1
|    C                     Z-ADD*ZERO     QT2
|    C                     Z-ADD*ZERO     QT3
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTNL3 ....總計
      *==============================================================*
03===C           RTNL3     BEGSR
|    C*
|    C                     SETON                     30
|    C                     WRITEPD3
|    C*
|    C                     Z-ADD*ZERO     Q1
|    C                     Z-ADD*ZERO     Q2
|    C                     Z-ADD*ZERO     Q3
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C*
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
05===C           RTNLR     BEGSR
|    C*
|    C* GET公司名稱
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     END
|     *
|    C                     WRITEPE2
|    C*
05===C                     ENDSR
