      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0601                                       *
      * AUTHER       :                                               *
      * CREATE DATE  : 97/12/17                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :陳列品轉進貨表(WRITE WORKFILE)               *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
      ****************************************************************
     FINTHPF  IF  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FMANDPF  IF  E           K        DISK
     FMANEPF  IF  E           K        DISK
     FSCWK09  O   E           K        DISK
      *
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DTH06
     I                                      603 604 DDOC
     I                                      605 606 DTH07S
     I                                      607 608 DTH07E
     I                                      609 613 DTH08S
     I                                      614 618 DTH08E
     I                                      619 6190DATA
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYNC     KLIST
     C                     KFLD           TH06
     C                     KFLD           TH02
     C           KEYND     KLIST
     C                     KFLD           TH06
     C                     KFLD           TH07
     C           KEYNE     KLIST
     C                     KFLD           TH06
     C                     KFLD           TH07
     C                     KFLD           TH08
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
|    *
|    C           *LOVAL    SETLLTH0
|    C                     READ TH0                      40
| 01-C           *IN40     DOWEQ'0'
|   C*產品名稱
     C           TH02      IFNE W902
|   C           KEYNC     CHAINNC0                  41
|   C  N41                MOVELNC05      W903
|   C   41                MOVEL*BLANK    W903
     C                     ENDIF
|   C*通路名稱
     C           TH07      IFNE W904
|   C           KEYND     CHAINND0                  41
|   C  N41                MOVELND04      W905
|   C   41                MOVEL*BLANK    W905
     C                     ENDIF
|   C*分店名稱
     C           TH08      IFNE W906
|   C           KEYNE     CHAINNE0                  41
|   C  N41                MOVELNE05      W907
|   C   41                MOVEL*BLANK    W907
     C                     ENDIF
|   C                     MOVELTH06      W901
|   C                     MOVELTH02      W902
|   C                     MOVELTH07      W904
|   C                     MOVELTH08      W906
|   C                     MOVELTH09      W908
     C                     Z-ADDTH04      W909
     C                     Z-ADDTH03      W910
     C           TH04      MULT TH03      WAMT    90H
     C                     Z-ADDWAMT      W911
     C                     MOVELTH05      W912
     C                     MOVELTH01      W913
     C*
     C*
|   C                     WRITEWK9
|   C*
|   C                     READ TH0                      40
| 01-C                     ENDDO
|     *
01===C                     SETON                     LR
