      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INR0501                                       *
      * AUTHER       : A1388  WIND                                   *
      * CREATE DATE  : 2008/11/03                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :庫存系統                                     *
      * REMARK       :月加權成本計算表(PRINT REPORTS )             *
      ****************************************************************
     FSCWK085 IP  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FINR050P O   E             39     PRINTER
     I*----------------------------------------------------------------
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DTO01
     I                                      603 604 DDOC
     I                                      605 606 DTO02S
     I                                      607 608 DTO02E
     I                                      609 613 DTO03S
     I                                      614 618 DTO03E
     I                                      619 6190DATA
     I                                      621 629 DTO04S
     I                                      631 639 DTO04E
     I                                      641 6460DTO05
     I                                      641 6420DTOMM
     I                                      643 6440DTODD
     I                                      645 6460DTOYY
     I                                      651 6580DATES
     I                                      657 6580DATED
     I                                      651 6560SYYMM
     I                                      661 6680DATEE
     I            DS
     I                                        1   40DTO05S
     I                                        1   20DTO05M
     I                                        3   40DTO05Y
     I            DS
     I                                        1   60DTO05E
     I                                        1   20TO05M
     I                                        3   40TO05D
     I                                        5   60TO05Y
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEY#B     KLIST
     C                     KFLD           DTO01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900
     C*
     C                     ADD  W803      T03
     C                     ADD  W804      T04
     C                     ADD  W805      T05
     C                     ADD  W806      T06
     C                     ADD  W807      T07
     C                     ADD  W808      T08
     C                     ADD  W809      T09
     C                     ADD  W810      T10
     C                     ADD  W811      T11
     C                     WRITEPD1
     C*
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     Z-ADD*ZERO     DTO05S
|    C                     Z-ADD*ZERO     DTO05E
|    C*
|    C                     Z-ADDDTOMM     DTO05M
|    C                     Z-ADDDTOYY     DTO05Y
|    C* GET公司別
|    C                     MOVEL*BLANK    D#B03
|    C           KEY#B     CHAINPA#BPF               40
|    C  N40                MOVEL#B03      D#B03
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
05===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C*
 5===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
06===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '1'
|    C                     WRITEPD2
| 01-C                     ELSE
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01-C                     ENDIF
     C*
|    C                     WRITEPE2
|    C*
06===C                     ENDSR
