     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H* PROGRAM NAME : INR110                                        *
     H* AUTHER       : DEREK                                         *
     H* CREATE DATE  : 2013/09/12                                    *
     H* UPDATE DATE  :                                               *
     H* SYSTEM       :                                             *
     H* SUBSYSTEM    :庫存系統                                     *
     H* REMARK       :存貨調整明細表                               *
     H****************************************************************
     FPA#BPF  IF  E           K        DISK
     FC#EHPF  IF  E           K        DISK
     FINR110D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DTI01
     I                                      603 604 DTI02S
     I                                      605 606 DTI02E
     I                                      607 6120DTI03S
     I                                      613 6180DTI03E
     I                                      619 623 DTI04S
     I                                      624 628 DTI04E
     I                                      629 630 DTI06S
     I                                      631 632 DTI06E
     I                                      633 641 DTJ02S
     I                                      642 650 DTJ02E
     I                                      651 6580DDATES
     I                                      659 6660DDATEE
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C*
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEL*BLANK    DOWNL
  02-C           *IN03     IFEQ '0'
    C*
    C*  F4 PROMPT PROCESS *
  03-C           *IN04     IFEQ '1'
    C                     EXSR RTNF4
    C                     SETON                     99
    C                     ITER
  03-C                     ENDIF
    C*
    C                     EXSR RTN100                     .CHECK      ?
    C*  F7 DOWNLOAD*
  04-C***        *IN99     IFEQ '0'
    C***        *IN07     ANDEQ'1'
    C***                  MOVEL'1'       DOWNL
    C***                  SETON                     99
    C***                  OUT  *NAMVAR
    C***                  CALL 'INR110C2'
    C***                  IN   LDA
  04-C***                  ENDIF
    C*
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*===============================================================*
     C*          RTN010....INIT SCREEN
     C*===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C*
|    C*          AUT       IFNE 'CWD'
|    C*                    SETON                     31
|    C*                    END
|    C*
|    C                     MOVEL*BLANK    DTI01            公司代號
|    C                     MOVEL*BLANK    D#B03            公司名稱
|    C                     MOVEL*BLANK    DTI02S           通路代號
|    C                     MOVEL*BLANK    DTI02E           通路代號
|    C                     Z-ADD0         DTI03S           調整日期
|    C                     Z-ADD0         DTI03E           調整日期
|    C                     MOVEL*BLANK    DTI04S           分店代號
|    C                     MOVEL*BLANK    DTI04E           分店代號
|    C                     MOVEL*BLANK    DTI06S           原因代碼
|    C                     MOVEL*BLANK    DTI06E           原因代碼
|    C                     MOVEL*BLANK    DTJ02S           產品代號
|    C                     MOVEL*BLANK    DTJ02E           產品代號
|    C                     Z-ADD0         DDATES           調整日期
|    C                     Z-ADD0         DDATEE           調整日期
|    C                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
     C*===============================================================*
     C*          RTN100....CHECK SCREEN
     C*===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DTI01     IFEQ *BLANK
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C           DTI01     CHAINPA#BPF               40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 02*C                     ELSE
|   C                     MOVEL#B03      D#B03
| 02-C                     END
|    C   99                GOTO END100
|    C*
|    C           DTI01     CHAINC#EHPF               40
| 03-C           *IN40     IFEQ '1'
|   C                     MOVEL'ERR0049' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6099
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C* 通路代號
| 04-C           DTI02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DTI02S
| 04-C                     END
|    C*
| 05-C           DTI02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DTI02E
| 05-C                     END
|    C*
| 06-C           DTI02S    IFGT DTI02E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     616299
| 06-C                     END
|    C   99                GOTO END100
|    C*
|    C*分店代號
| 07-C           DTI04S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DTI04S
| 07-C                     END
|    C*
| 08-C           DTI04E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DTI04E
| 08-C                     END
|    C*
| 09-C           DTI04S    IFGT DTI04E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     636499
| 09-C                     END
|    C   99                GOTO END100
|    C*
|    C*調整日期
| 13-C           DTI03S    IFEQ 0
|   C                     Z-ADD010192    DTI03S
| 13*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DTI03S    P0901I  60
|   C                     PARM           P0901O  1
| 14-C           P0901O    IFEQ 'N'
|   C                     SETON                     6599
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 14-C                     END
| 13-C                     END
|    C   99                GOTO END100
|    C*
| 15-C           DTI03E    IFEQ 0
|   C                     Z-ADD123129    DTI03E
| 15*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DTI03E    P0901I  60
|   C                     PARM           P0901O  1
| 16-C           P0901O    IFEQ 'N'
|   C                     SETON                     6699
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 16-C                     END
| 15-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DTI03S    S001I2  60
|    C           W6        PARM           S001O1  60
|    C                     MOVE W6        HB2@F6  6
|    C                     EXSR HB@68L
|    C                     MOVE HB2@T8    DDATES
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DTI03E    S001I2  60
|    C           W6        PARM           S001O1  60
|    C                     MOVE W6        HB2@F6  6
|    C                     EXSR HB@68L
|    C                     MOVE HB2@T8    DDATEE
|    C*
| 17-C           DDATES    IFGT DDATEE
|   C                     SETON                     656699
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 17-C                     END
|    C   99                GOTO END100
|    C*
|    C*原因代碼
| 07-C           DTI06S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DTI06S
| 07-C                     END
|    C*
| 08-C           DTI06E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DTI06E
| 08-C                     END
|    C*
| 09-C           DTI06S    IFGT DTI06E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     676899
| 09-C                     END
|    C   99                GOTO END100
|    C*
|    C*產品代號
| 10-C           DTJ02S    IFEQ *BLANK
|   C                     MOVE *LOVAL    DTJ02S
| 10-C                     END
|    C*
| 11-C           DTJ02E    IFEQ *BLANK
|   C                     MOVE *HIVAL    DTJ02E
| 11-C                     END
|    C*
| 12-C           DTJ02S    IFGT DTJ02E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     697099
| 12-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
     C*===============================================================*
     C*          RTNF4 ....F4 HELP
     C*===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*產品
| 02-C           D#ROW     IFEQ 16
|   C           D#COL     ANDGE36
|   C           D#COL     ANDLE44
|   C                     CALL 'SWD005'
|   C                     PARM           DTI01
|   C                     PARM           DTJ02S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 16
|   C           D#COL     ANDGE48
|   C           D#COL     ANDLE56
|   C                     CALL 'SWD005'
|   C                     PARM           DTI01
|   C                     PARM           DTJ02E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C***        D#ROW     IFEQ 20
|   C***        D#COL     ANDGE36
|   C***        D#COL     ANDLE37
|   C***                  CALL 'WDS011'
|   C***        $PRTID    PARM $PRTID    S011O1  20
|   C***                  GOTO ENDF4
| 04-C***                  END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
     C*===============================================================*
     C*          OUTLDA....OUT LDA
     C*===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C*===============================================================*
     C/COPY HBP2CVTR
