     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H* PROGRAM NAME : INR1201                                       *
     H* AUTHER       : DAISY                                         *
     H* CREATE DATE  : 102/12/30                                     *
     H* UPDATE DATE  :                                               *
     H* SYSTEM       :                                               *
     H* SUBSYSTEM    :庫存系統                                     *
     H* REMARK       :盤盈銷售明細表                               *
     H*===============================================================
     H* MODI CODE |   DATE   | DESCRIPTION
     H*---------------------------------------------------------------
     H****************************************************************
     FINTQPF  IP  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FMANEPF  IF  E           K        DISK
     FINR120F O   E           K        DISK
     E*--------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DTQ01
     I                                      603 604 DTQ02S
     I                                      605 606 DTQ02E
     I                                      607 6120DTQ03S
     I                                      613 6180DTQ03E
     I                                      651 6580DDATES
     I                                      659 6660DDATEE
     I*銷售日期
     I            DS
     I                                        1   80TQ03
     I                                        1   60TQ03YM
     I                                        1   40TQ03YY
     I                                        5   60TQ03MM
     I                                        7   80TQ03DD
     I*年月
     I            DS
     I                                        1   60KTA02
     I                                        1   40KTA02Y
     I                                        5   60KTA02M
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYNC     KLIST
     C                     KFLD           TQ01             公司別
     C                     KFLD           TQ05             產品代號
     C           KEYNE     KLIST
     C                     KFLD           TQ01             公司別
     C                     KFLD           TQ02             通路代號
     C                     KFLD           TQ04             分店代號
     C*          KEYL2     KLIST
     C*                    KFLD           L201             代碼欄位
     C*                    KFLD           L202             代碼內容
     C*          KEYTA     KLIST
     C*                    KFLD           TI01             公司別
     C*                    KFLD           KTA02            年月
     C*                    KFLD           TJ02             產品代號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*          TQ05      SETLLTQ0
     C*          TQ05      READETQ0                      46
     C*          *IN46     DOWEQ'0'
     C                     EXSR R2000
     C                     SETON                     10
     C*                    END
     C*          TQ05      READETQ0                      46
     C*                    END
     C*
     CLRN10                EXSR R9900
     C*==============================================================*
     C*          R2000 ... WRITE DETAIL
     C*==============================================================*
     C           R2000     BEGSR
     C*
     C*銷售日期
     C                     Z-ADDTQ03      WF01             銷售日期
     C*
     C                     MOVELTQ04      WF02      P      分店代號
     C           KEYNE     CHAINNE0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELNE05      WF03      P      分店簡稱
     C                     ELSE
     C                     MOVEL*BLANK    WF03             分店簡稱
     C                     END
     C*
     C                     MOVELTQ05      WF04      P      產品代號
     C           KEYNC     CHAINNC0                  40
     C           *IN40     IFEQ '0'
     C                     MOVELNC05      WF05      P      產品簡稱
     C                     ELSE
     C                     MOVEL*BLANK    WF05      P      產品簡稱
     C                     END
     C*
     C                     MOVELTQ06      WF06      P      銷售數量
     C*
     C                     MOVELTQ07      WF07      P      單價
     C*
     C                     MOVELTQ08      WF08      P      未稅金額
     C*
     C                     MOVELTQ09      WF09      P      含稅金額
     C*
     C                     MOVELTQ10      WF10      P      銷售無庫單號
     C*
     C                     MOVELTQ11      WF11      P      銷售序號
     C*
     C                     MOVELTQ12      WF12      P      狀態碼
     C*
     C                     WRITEWF0
     C*
     C                     ENDSR
     C*==============================================================*
     C*          R9900 ... LR --- NO DATA
     C*==============================================================*
     C           R9900     BEGSR
     C*
     C                     MOVEL'NO DATA' WF03      P
     C                     WRITEWF0
     C*
     C                     ENDSR
