      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INT0201                                       *
      * AUTHER       : A1491  EASON                                  *
      * CREATE DATE  : 99/01/31                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :西祺進銷存                                   *
      * SUBSYSTEM    :庫存管理系統                                 *
      * REMARK       :庫存月結還原批次處理                         *
      ****************************************************************
     FPOCLPF  UF  E           K        DISK
     FPOCMPF  IF  E           K        DISK
     FINTCPF  UF  E           K        DISK
     FINTDPF  UF  E           K        DISK
     FINTEPF  UF  E           K        DISK
     FINTFPF  UF  E           K        DISK
     FINTGPF  UF  E           K        DISK
     FINTHPF  UF  E           K        DISK
     FINTKPF  UF  E           K        DISK
     FINTLPF  UF  E           K        DISK
     FINTIPF  UF  E           K        DISK
     FINTJPF  UF  E           K        DISK
     FINTMPF  UF  E           K        DISK
     FINTNPF  UF  E           K        DISK
     FINTAPF  UF  E           K        DISK
     FINTBPF  UF  E           K        DISK
     E*
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      201 2080A8YMD
     I                                      203 2080A6YMD
     I                                      601 601 MODE
     I                                      602 603 WEH01
     I                                      604 6110DATFM
     I                                      604 6070DSYY
     I                                      608 6090DSMM
     I                                      612 6190DATTO
     I                                      612 6150DEYY
     I                                      616 6170DEMM
     I                                      620 6250WEH02
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYTNH    KLIST
     C                     KFLD           TG01
     C                     KFLD           TG02
     C                     KFLD           TG06
     C                     KFLD           TG04
     C                     KFLD           TH02
     C                     KFLD           TH05
     C           KEYTNL    KLIST
     C                     KFLD           TK01
     C                     KFLD           TK02
     C                     KFLD           TK06
     C                     KFLD           TK04
     C                     KFLD           TL02
     C                     KFLD           TL04
     C           KEYTN     KLIST
     C                     KFLD           CM11
     C                     KFLD           CM12
     C                     KFLD           CM02
     C                     KFLD           CM13
     C                     KFLD           CM03
     C                     KFLD           CM01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN010
     C*
     C                     EXSR RTN100
     C                     EXSR RTN200
     C                     EXSR RTN300
     C                     EXSR RTN400
     C*
     C                     SETON                     LR
      *===============================================================*
     C*          RTN010....INITIAL VALUE
      *===============================================================*
01===C           RTN010    BEGSR
|     *
|    C                     MOVEL'INT0201' PGWW   10
|     *
01===C                     ENDSR
      *===============================================================*
     C*          RTN100....更新驗收單以及存貨調撥單
      *===============================================================*
02===C           RTN100    BEGSR
|     *
|    C           *LOVAL    SETLLCL0
|    C                     READ CL0                      46
| 01-C           *IN46     DOWEQ'0'
|    *
|   C           CL05      SETLLCM0
|   C           CL05      READECM0                      45
| 02-C           *IN45     DOWEQ'0'
|   C*                    MOVEL*BLANK    CM15
|   C*                    UPDATCM0
|   C           KEYTN     CHAINTN0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     DELETTN0
| 03-C                     ENDIF
|   C           CL05      READECM0                      45
| 02-C                     ENDDO
|    *
     C           CL14      IFEQ 'P'
|   C                     MOVEL'R'       CL14
|   C                     UPDATCL0
     C                     ENDIF
|   C                     READ CL0                      46
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLTC0
|    C                     READ TC0                      46
| 04-C           *IN46     DOWEQ'0'
|    *
|   C           TC05      SETLLTD0
|   C           TC05      READETD0                      45
| 05-C           *IN45     DOWEQ'0'
|   C                     MOVEL*BLANK    TD11
|   C                     UPDATTD0
|   C           TC05      READETD0                      45
| 05-C                     ENDDO
|    *
|    *
| 06-C           TC08      IFEQ 'F'
|   C           TC08      OREQ 'B'
| 07-C           TC09      IFEQ 'P'
|   C                     MOVEL'R'       TC09
|   C                     UPDATTC0
| 07-C                     ENDIF
| 06-C                     ENDIF
|    *
| 08-C           TC10      IFEQ 'T'
|   C           TC09      ANDEQ'O'
|   C                     MOVEL*BLANK    TC10
|   C                     UPDATTC0
| 08-C                     ENDIF
|    *
|   C                     READ TC0                      46
| 04-C                     ENDDO
|     *
02===C                     ENDSR
      *===============================================================*
     C*          RTN200....更新進貨退出以及存貨調整
      *===============================================================*
03===C           RTN200    BEGSR
|     *
|    C           *LOVAL    SETLLTE0
|    C                     READ TE0                      46
| 01-C           *IN46     DOWEQ'0'
|    *
|   C           TE05      SETLLTF0
|   C           TE05      READETF0                      45
| 02-C           *IN45     DOWEQ'0'
|   C                     MOVEL*BLANK    TF09
|   C                     UPDATTF0
|   C           TE05      READETF0                      45
| 02-C                     ENDDO
|    *
|   C                     MOVEL*BLANK    TE06
|   C                     UPDATTE0
|   C                     READ TE0                      46
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLTI0
|    C                     READ TI0                      46
| 03-C           *IN46     DOWEQ'0'
|    *
|   C           TI05      SETLLTJ0
|   C           TI05      READETJ0                      45
| 04-C           *IN45     DOWEQ'0'
|   C                     MOVEL*BLANK    TJ08
|   C                     UPDATTJ0
|   C           TI05      READETJ0                      45
| 04-C                     ENDDO
|    *
|   C                     MOVEL*BLANK    TI07
|   C                     UPDATTI0
|   C                     READ TI0                      46
| 03-C                     ENDDO
|     *
|    C           *LOVAL    SETLLTM0
|    C                     READ TM0                      46
| 05-C           *IN46     DOWEQ'0'
|   C                     MOVEL*BLANK    TM07
|   C                     UPDATTM0
|   C                     READ TM0                      46
| 05-C                     ENDDO
|     *
03===C                     ENDSR
      *===============================================================*
     C*          RTN300....更新陳列轉借貨、退出以及陳列檔
      *===============================================================*
04===C           RTN300    BEGSR
|     *
|    C           *LOVAL    SETLLTG0
|    C                     READ TG0                      46
| 01-C           *IN46     DOWEQ'0'
|    *
|   C           TG05      SETLLTH0
|   C           TG05      READETH0                      45
| 02-C           *IN45     DOWEQ'0'
|    *
|   C           KEYTNH    CHAINTN0                  40
| 03-C           *IN40     IFEQ '0'
|   C                     ADD  TH03      TN07
|   C                     ADD  TH03      TN11
|   C                     UPDATTN0
| 03-C                     ENDIF
|    *
|   C                     MOVEL*BLANK    TH10
|   C                     UPDATTH0
|    *
|   C           TG05      READETH0                      45
| 02-C                     ENDDO
|    *
|   C                     MOVEL*BLANK    TG07
|   C                     UPDATTG0
|    *
|   C                     READ TG0                      46
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLTK0
|    C                     READ TK0                      46
| 04-C           *IN46     DOWEQ'0'
|    *
|   C           TK05      SETLLTL0
|   C           TK05      READETL0                      45
| 05-C           *IN45     DOWEQ'0'
|    *
|   C           KEYTNL    CHAINTN0                  40
| 06-C           *IN40     IFEQ '0'
|   C                     ADD  TL03      TN07
|   C                     ADD  TL03      TN12
|   C                     UPDATTN0
| 06-C                     ENDIF
|    *
|   C                     MOVEL*BLANK    TL09
|   C                     UPDATTL0
|    *
|   C           TK05      READETL0                      45
| 05-C                     ENDDO
|    *
|   C                     MOVEL*BLANK    TK07
|   C                     UPDATTK0
|    *
|   C                     READ TK0                      46
| 04-C                     ENDDO
|     *
04===C                     ENDSR
      *===============================================================*
     C*          RTN400....更新總庫以及分庫檔
      *===============================================================*
05===C           RTN400    BEGSR
|     *
|    C           *LOVAL    SETLLTA0
|    C                     READ TA0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     Z-ADD0         TA08
|   C                     Z-ADD0         TA09
|   C                     Z-ADD0         TA11
|   C                     Z-ADD0         TA12
|   C                     Z-ADD0         TA13
|   C                     Z-ADD0         TA14
|   C                     Z-ADD0         TA17
|   C                     UPDATTA0
|   C                     READ TA0                      46
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLTB0
|    C                     READ TB0                      46
| 02-C           *IN46     DOWEQ'0'
|   C                     Z-ADD0         TB07
|   C                     Z-ADD0         TB08
|   C                     Z-ADD0         TB09
|   C                     Z-ADD0         TB10
|   C                     Z-ADD0         TB11
|   C                     Z-ADD0         TB14
|   C                     Z-ADD0         TB15
|   C                     Z-ADD0         TB16
|   C                     UPDATTB0
|   C                     READ TB0                      46
| 02-C                     ENDDO
|     *
05===C                     ENDSR
