     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H* PROGRAM NAME : INT0101                                       *
     H* AUTHER       : A1491  EASON                                  *
     H* CREATE DATE  : 99/01/31                                      *
     H* UPDATE DATE  :                                               *
     H* SYSTEM       :西祺進銷存                                   *
     H* SUBSYSTEM    :庫存管理系統                                 *
     H* REMARK       :庫存月結還原批次處理                         *
     H****************************************************************
     FC#EHPF  UF  E           K        DISK
     FMANDPF  UF  E           K        DISK
     E*--------------------------------------------------------------*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      201 2080A8YMD
     I                                      203 2080A6YMD
     I                                      601 601 MODE
     I                                      602 603 WEH01
     I                                      604 6110DATFM
     I                                      604 6070DSYY
     I                                      608 6090DSMM
     I                                      612 6190DATTO
     I                                      612 6150DEYY
     I                                      616 6170DEMM
     I                                      620 6270DS
     I                                      630 6370DE
     I            DS
     I                                        1   60EH02
     I                                        1   40EH02Y
     I                                        5   60EH02M
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     C                     SETON                     LR
     C*===============================================================*
     C*          RTN010....INITIAL VALUE
     C*===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'INT0101' PGWW   10
|    C*
01===C                     ENDSR
     C*===============================================================*
     C*          RTN100....修改公司參數檔以及通路商檔
     C*===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           WEH01     CHAINEH0                  40
| 01-C           *IN40     IFEQ '0'
| 02-C           EH02M     IFEQ 1
|   C                     SUB  1         EH02Y
|   C                     Z-ADD12        EH02M
| 02*C                     ELSE
|   C                     SUB  1         EH02M
| 02-C                     ENDIF
|   C*
|   C                     Z-ADDDATFM     EH07
|   C                     Z-ADDDATTO     EH08
|   C                     MOVELPGWW      EHWW
|   C                     Z-ADDA8YMD     EHXX
|   C                     TIME           EHYY
|   C                     MOVEL$USER     EHZZ
|   C*
|   C                     UPDATEH0
| 01-C                     ENDIF
|    C*
|    C           WEH01     SETLLND0
|    C           WEH01     READEND0                      45
| 03-C           *IN45     DOWEQ'0'
|   C                     MOVEL'R'       ND22             銷售確認
|   C                     MOVEL*BLANK    NDWW
|   C                     MOVELPGWW      NDWW
|   C                     Z-ADDA8YMD     NDXX
|   C                     TIME           NDYY
|   C                     MOVEL$USER     NDZZ
|   C                     UPDATND0
|   C           WEH01     READEND0                      45
| 03-C                     ENDDO
|    C*
02===C                     ENDSR
