     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : CT0001                                     *
     A*    AUTHOR       : A1010  JOHN                                *
     A*    CREATE DATE  : 2010/10/01                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :庫存管理系統                              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A****************************************************************
     FPOCCLF02IF  E           K        DISK
     I*----------------------------------------
      *==============================================================*
      *                    DEFINE ROUTINE
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           WCC01   2
     C                     PARM           WCC02   2
     C                     PARM           WCC04   9
     C                     PARM           WCC07   80
     C                     PARM           WCC09   82
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYCC     KLIST
     C                     KFLD           WCC01
     C                     KFLD           WCC02
     C                     KFLD           WCC04
     C                     KFLD           WCC06   1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     MOVEL'1'       WCC06
     C                     Z-ADD0         WCC09
     C           KEYCC     SETLLCC0
     C           KEYCC     READECC0                      40
  01-C           *IN40     DOWEQ'0'
    C*          CC07      ANDLTWCC07
    C           CC07      ANDLEWCC07
    C                     Z-ADDCC09      WCC09
    C           KEYCC     READECC0                      40
  01-C                     ENDDO
     C*
  02-C           WCC09     IFEQ 0
    C                     MOVEL'2'       WCC06
    C           KEYCC     SETLLCC0
    C           KEYCC     READECC0                      40
  03-C           *IN40     DOWEQ'0'
    C*          CC07      ANDLTWCC07
    C           CC07      ANDLEWCC07
    C                     Z-ADDCC09      WCC09
    C           KEYCC     READECC0                      40
  03-C                     ENDDO
    C*
  02-C                     ENDIF
     C*
     C                     SETON                     LR
