      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTC006                                        *
      * AUTHER       : A1010  JOHN CHIOU                             *
      * CREATE DATE  : 2010/11/01                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :西祺進銷存                                   *
      * SUBSYSTEM    :庫存管理系統                                 *
      * REMARK       :庫存數量重算                                 *
      ****************************************************************
     FC#EHPF  IF  E           K        DISK
     FINTQLF90UF  E           K        DISK
     FINTPLF90UF  E           K        DISK
     FINTNPF  UF  E           K        DISK
     E*===============================================================
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           INCOMP  2
     C*==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYEH     KLIST
     C                     KFLD           INCOMP
     C*
     C           KEYTP     KLIST
     C                     KFLD           EH01
     C                     KFLD           EH07
     C           KEYTP1    KLIST
     C                     KFLD           EH01
     C*
     C           KEYTQ     KLIST
     C                     KFLD           EH01
     C                     KFLD           EH07
     C           KEYTQ1    KLIST
     C                     KFLD           EH01
     C*
     C           KEYTN     KLIST
     C                     KFLD           EH01             公司別
     C                     KFLD           TP02             通路代號
     C                     KFLD           TP13             供應商
     C                     KFLD           TP04             分店代號
     C                     KFLD           TP05             產品代號
     C                     KFLD           TP12             陳列單號
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C  N10                EXSR RTN000                     GET DATE FROM C#EHPF
     C                     EXSR RTN100                     還原INTQPF
     C                     EXSR RTN200                     還原INTPPF
     C                     SETON                     LR
      *===============================================================*
     C*          RTN000....GET DATE FROM C#EHPF
      *===============================================================*
01===C           RTN000    BEGSR
|    C*
|    C                     SETON                     10
|    C*
|    C           KEYEH     CHAINEH0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     SETON                     LR
| 01-C                     ENDIF
|    C*
01===C                     ENDSR
      *===============================================================*
     C*          RTN100....還原INTQPF
      *===============================================================*
02===C           RTN100    BEGSR
|    C*
|    C           KEYTQ     SETLLTQ0
|    C           KEYTQ1    READETQ0                      40
| 01-C           *IN40     DOWEQ'0'
|   C*          TQ03      ANDLEEH08
|   C*
|   C                     DELETTQ0
|   C*
|   C           KEYTQ1    READETQ0                      40
| 01-C                     ENDDO
|    C*
02===C                     ENDSR
      *===============================================================*
     C*          RTN200....還原INTPPF
      *===============================================================*
03===C           RTN200    BEGSR
|    C*
|    C           KEYTP     SETLLTP0
|    C           KEYTP1    READETP0                      40
| 01-C           *IN40     DOWEQ'0'
|   C*          TP03      ANDLEEH08
|   C*----------------------------------------------------------------------*
|   C*  TP15 = 'A'  陳列調整  'I' : 期初建檔  P : 年度盤點
|   C*         'S'  銷售借貨  'J' : 負庫存自動調整
|   C*----------------------------------------------------------------------*
| 02-C           TP15      IFEQ 'S'
|   C           TP15      OREQ 'J'
|   C           KEYTN     CHAINTN0                  41
| 03-C           *IN41     IFEQ '0'
|   C                     ADD  TP06      TN07
|   C                     SUB  TP06      TN13
|   C                     UPDATTN0
| 03-C                     END
|   C*
|   C                     DELETTP0
| 02-C                     ENDIF
|   C*
|   C           KEYTP1    READETP0                      40
| 01-C                     ENDDO
|    C*
03===C                     ENDSR
      *===============================================================*
