      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : INT9002                                       *
      * AUTHER       : A1010  JOHN CHIOU                             *
      * CREATE DATE  : 97/10/14                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :西祺進銷存                                   *
      * SUBSYSTEM    :庫存管理系統                                 *
      * REMARK       :庫存調整數量重算                             *
      ****************************************************************
     FINTDLF91IF  E           K        DISK
     FC#EHPF  IF  E           K        DISK
     FINTBPF  UF  E           K        DISK
     E*
     E*: FUNCTION DATA :
     I*
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           INCOMP  2
     C*==============================================================*
      *                    KLIST
      *==============================================================*
     C*
     C           KEYTB0    KLIST
     C                     KFLD           INCOMP
     C                     KFLD           EH02
     C*
     C           KEYTB1    KLIST
     C                     KFLD           INCOMP
     C                     KFLD           EH02
     C                     KFLD           WTB03   2
     C                     KFLD           WTB04   5
     C                     KFLD           WTB05   9
     C           KEYEH     KLIST
     C                     KFLD           INCOMP
     C           KEYTD     KLIST
     C                     KFLD           INCOMP
     C                     KFLD           EH07
     C           KEYTD1    KLIST
     C                     KFLD           INCOMP
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     EXSR RTN100                     GET DATE RANGE BY YM
     C                     EXSR RTN300                     PROCESS INTDPF
     C*
     C                     SETON                     LR
      *===============================================================*
     C*          RTN100....GET DATE RANGE BY YM
      *===============================================================*
01===C           RTN100    BEGSR
|    C*
|    C           KEYEH     CHAINEH0                  40
| 01-C           *IN40     IFEQ '1'
|   C                     SETON                     LR
| 01-C                     ENDIF
01===C                     ENDSR
      *===============================================================*
     C*          RTN300....PROCESS INTDPF
      *===============================================================*
02===C           RTN300    BEGSR
|    C*
|    C           KEYTD     SETLLTD0
|    C           KEYTD1    READETD0                      42
| 01-C           *IN42     DOWEQ'0'
|   C*          TD09      ANDLEEH08
|   C*  更新調出
|   C                     MOVELTD02      WTB05
|   C                     MOVELTD07      WTB04
|   C                     MOVELTD06      WTB03
|   C*
|   C           KEYTB1    CHAINTB0                  43
| 02-C           *IN43     IFEQ '0'
|   C                     ADD  TD03      TB15
|   C                     UPDATTB0
| 02-C                     ENDIF
|   C*
|   C*  更新調入
|   C                     MOVELTD08      WTB04
|   C           KEYTB1    CHAINTB0                  43
| 03-C           *IN43     IFEQ '0'
|   C                     ADD  TD03      TB14
|   C                     UPDATTB0
| 03-C                     ENDIF
|   C*
|   C           KEYTD1    READETD0                      42
|   C*
| 01-C                     ENDDO
|    C*
02===C                     ENDSR
      *===============================================================*
