      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MCJ008                                        *
      * AUTHER       : A1010  JOHN CHIOU                             *
      * CREATE DATE  : 2010/10/29                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :西祺進銷存                                   *
      * SUBSYSTEM    :庫存管理系統                                 *
      * REMARK       :銷貨傳票產生                                 *
      * MODIFICATION :                                               *
      * 00A需求單號: 1040369                                       *
      * 00A 2015/04/20 DEREK修正BUG :無資料寫入GLAHWF,           *
      * 00A                            不應編列傳票號碼            *
      * 00B需求單號: 1100484                                       *
      * 00B 2021/07/16 RACHEL :新增710501盤存利益-家福惠康     *
      * 00B                    新增730501盤存損失-家福惠康     *
      ****************************************************************
     FINTXPF  UF  E           K        DISK
     FGLAHWF  UF  E           K        DISK                      A
     FGLAHWFL1UF  E           K        DISK
     F            WAH0                              KRENAMEWAHL1
     I*==============================================================
     I           UDS
     I                                      101 110 $USER
     I                                      201 2080$A8YMD
     I                                      209 2160$C8YMD
     I*FOR PRINTER
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$LPRT
     I*傳票日期
     I            DS
     I                                        1   80VDATE
     I                                        1   60VYYMM
     I                                        7   80VDD
     I            DS
     I                                        1   8 ACCT
     I                                        1   6 ACCT1
     I                                        7   8 ACCT2
     I            DS
     I                                        1   5 WTX12
 00B+I                                        1   1 WTX12A
     I                                        3   4 WTX121
     I            DS
     I                                        1   60WTX02
     I                                        3   60WTX021
     I            DS
     I                                        1   5 YAH09
     I                                        1   20YAH091
     I                                        3   3 YAH092
     I                                        4   50YAH093
     I            DS
     I                                        1   40ZAH09
     I                                        1   20ZAH091
     I                                        3   40ZAH093
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C*          *LIKE     DEFN TB18      XTB18
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           INCOMP  2
     C                     PARM           INYYMM  60
     C*==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYTX     KLIST
     C                     KFLD           INCOMP
     C                     KFLD           INYYMM
     C                     KFLD           TXCD    2
     C           KEYWAH    KLIST
     C                     KFLD           XAH01   2        公司別
     C                     KFLD           XAH20   1        資料別
     C                     KFLD           XAH19   1        借貸別
     C                     KFLD           XAH04   8        會計科目
     C                     KFLD           XAH05  20        成本中心
     C                     KFLD           XAH05A  2        欄位代碼
     C                     KFLD           XAH06  20        對象別
     C                     KFLD           XAH06A  2        欄位代碼
     C                     KFLD           XAH07  20        相關號碼1
     C                     KFLD           XAH07A  2        欄位代碼
     C                     KFLD           XAH08  20        相關號碼2
     C                     KFLD           XAH08A  2        欄位代碼
     C                     KFLD           XAH09   80       日期
     C                     KFLD           XAH09A  2        欄位代碼
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     MOVEL*BLANK    XAH02   9
     C                     EXSR RTN100                     PREPARE WAH  10~18
     C                     EXSR RTN300                     借貸方調整
 00A+C*有資料才取傳票號碼
 00A+C           RECORD    IFEQ 'Y'
     C                     EXSR RTN200                     PREPARE AH
 00A+C                     ENDIF
 00A+C*
     C                     SETON                     LR
      *===============================================================*
     C*          RTN100....PREPARE  AMT
      *===============================================================*
01===C           RTN100    BEGSR
|    C*
|00A+C                     MOVEL'N'       RECORD  1        設定無資料
|    C                     Z-ADDINYYMM    VYYMM
|    C                     Z-ADD25        VDD
|    C*
|    C                     MOVEL'A1'      TXCD
|    C*
|    C           KEYTX     SETLLTX0
|    C           KEYTX     READETX0                      40
| 01-C           *IN40     DOWEQ'0'
| 02-C           TX21      IFNE 0
| 04-C           TX26      IFEQ '07'
|   C           TX26      OREQ '08'
|   C                     EXSR RTN101                     存貨
|   C                     EXSR RTN103                     盤盈虧
|00A+C                     MOVEL'Y'       RECORD           有資料
| 04-C                     ENDIF
|   C                     Z-ADD$A8YMD    TX23
|   C                     Z-ADDINYYMM    TX24
|   C                     UPDATTX0
| 02-C                     ENDIF
|   C*
|    C           KEYTX     READETX0                      40
| 01-C                     ENDDO
|    C*
|    C                     MOVEL'A2'      TXCD
|    C*
|    C           KEYTX     SETLLTX0
|    C           KEYTX     READETX0                      40
| 01-C           *IN40     DOWEQ'0'
| 02-C           TX21      IFNE 0
| 04-C           TX26      IFEQ '07'
|   C           TX26      OREQ '08'
|   C                     EXSR RTN101                     存貨
|   C                     EXSR RTN103                     盤盈虧
|00A+C                     MOVEL'Y'       RECORD           有資料
| 04-C                     ENDIF
|   C                     Z-ADD$A8YMD    TX23
|   C                     Z-ADDINYYMM    TX24
|   C                     UPDATTX0
| 02-C                     ENDIF
|   C*
|    C           KEYTX     READETX0                      40
| 01-C                     ENDDO
|    C*
01===C                     ENDSR
      *===============================================================*
     C*          RTN101....PREPARE AH   存貨
      *===============================================================*
02===C           RTN101    BEGSR
|    C                     MOVE '1'       XAH19            借貸別
|    C                     MOVE '1'       XAH20            群組別
|    C                     Z-ADDTX21      WAMT1  112       借方金額
|    C                     Z-ADD0         WAMT2  112       貸方金額
|    C*
|    C*                    MOVEL'SC'      XAH01            公司別
|    C                     MOVEL'SD'      XAH01            公司別
|    C                     MOVEL*BLANK    XAH04            會計科目
|    C                     MOVEL'1141'    XAH04            會計科目
|    C                     MOVEL*BLANK    XAH05            成本中心
|    C                     MOVEL*BLANK    XAH05A           欄位代碼
|    C                     MOVEL*BLANK    XAH06            對象別
|    C                     MOVEL*BLANK    XAH06A           欄位代碼
|    C                     MOVEL*BLANK    XAH07            相關號碼1
|    C                     MOVEL*BLANK    XAH07A           欄位代碼
|    C                     MOVEL*BLANK    XAH08            相關號碼2
|    C                     MOVEL*BLANK    XAH08A           欄位代碼
|    C                     Z-ADD0         XAH09            日期
|    C                     MOVEL*BLANK    XAH09A           欄位代碼
|    C*
|    C           KEYWAH    CHAINWAH0                 41
| 01-C           *IN41     IFEQ '1'
|   C*                    CLEARWAH0
|   C*                    MOVEL'SC'      WAH01            公司別
|   C                     MOVEL'SD'      WAH01            公司別
|   C                     MOVELXAH02     WAH02            傳票號碼
|   C                     Z-ADD1         WAH03            傳票項次
|   C                     MOVEL*BLANK    WAH04            會計科目
|   C                     MOVEL'1141'    WAH04            會計科目
|   C                     MOVEL*BLANK    WAH05            成本中心
|   C                     MOVEL*BLANK    WAH05A           欄位代碼
|   C                     MOVEL*BLANK    WAH06            對象別
|   C                     MOVEL*BLANK    WAH06A           欄位代碼
|   C                     MOVEL*BLANK    WAH07            相關號碼1
|   C                     MOVEL*BLANK    WAH07A           欄位代碼
|   C                     MOVEL*BLANK    WAH08            相關號碼2
|   C                     MOVEL*BLANK    WAH08A           欄位代碼
|   C                     Z-ADD0         WAH09            日期
|   C                     MOVEL*BLANK    WAH09A           欄位代碼
|   C                     Z-ADDVDATE     WAH10            傳票日期
|   C                     Z-ADDWAMT1     WAH12            借方金額
|   C                     Z-ADDWAMT2     WAH13            貸方金額
|   C                     Z-ADD0         WAH14            數量
|   C                     MOVEL*BLANK    WAH14A           欄位代碼
|   C                     MOVEL*BLANK    WAH15            其它
|   C                     MOVEL*BLANK    WAH15A           欄位代碼
|   C                     MOVEL*BLANK    WAH16            摘要
|   C                     MOVEL'A2'      WAH17            傳票來源
|   C                     MOVEL*BLANK    WAH18            過帳註記
|   C                     MOVELXAH19     WAH19            核准註記
|   C                     MOVELXAH20     WAH20            作廢註記
|   C                     Z-ADD0         WAH21            迴轉日期
|   C                     MOVEL*BLANK    WAH22            資金代碼
|   C                     Z-ADD0         WAH23            資金金額
|   C                     MOVEL*BLANK    WAH24            沖帳傳票號
|   C                     Z-ADD$A8YMD    WAH25            製票日期
|   C                     MOVEL$USER     WAH26            製票人　
|   C                     TIME           WAH97            異動時間
|   C                     Z-ADD$A8YMD    WAH98            異動日期
|   C                     MOVEL$USER     WAH99            異動者
|   C                     WRITEWAH0
| 01*C                     ELSE
|   C                     ADD  WAMT1     WAH12            借方金額
|   C                     ADD  WAMT2     WAH13            貸方金額
|   C                     UPDATWAH0
| 01-C                     ENDIF
|    C*
02===C                     ENDSR
      *===============================================================*
     C*          RTN103....PREPARE AH   盤盈虧
      *===============================================================*
04===C           RTN103    BEGSR
|    C                     MOVE '2'       XAH19            借貸別
|    C                     MOVE '1'       XAH20            群組別
|    C                     Z-ADD0         WAMT1            借方金額
|    C                     Z-ADDTX21      WAMT2            貸方金額
|    C*
|    C                     MOVELTX12      WTX12
|00B+C           WTX12A    IFEQ 'C'
| 01-C           TX15      IFGT 0
|   C                     MOVEL'710506'  ACCT1
| 01*C                     ELSE
|   C                     MOVEL'730506'  ACCT1
| 01-C                     ENDIF
|    C                     MOVELWTX121    ACCT2
|00B+C                     END
|00B+C           WTX12A    IFEQ 'W'
|00B+C           TX15      IFGT 0
|00B+C                     MOVEL'710501'  ACCT1
|00B+C                     ELSE
|00B+C                     MOVEL'730501'  ACCT1
|00B+C                     ENDIF
|00B+C                     MOVEL*BLANK    ACCT2
|00B+C                     END
|    C*
|    C*                    MOVEL'SC'      XAH01            公司別
|    C                     MOVEL'SD'      XAH01            公司別
|    C                     MOVEL*BLANK    XAH04            會計科目
|    C                     MOVELACCT      XAH04            會計科目
|    C                     MOVEL*BLANK    XAH05            成本中心
|    C                     MOVEL*BLANK    XAH05A           欄位代碼
|    C                     MOVEL*BLANK    XAH06            對象別
|    C                     MOVEL*BLANK    XAH06A           欄位代碼
|    C                     MOVEL*BLANK    XAH07            相關號碼1
|    C                     MOVEL*BLANK    XAH07A           欄位代碼
|    C                     MOVEL*BLANK    XAH08            相關號碼2
|    C                     MOVEL*BLANK    XAH08A           欄位代碼
|    C                     Z-ADD0         XAH09            日期
|    C                     MOVEL*BLANK    XAH09A           欄位代碼
|    C*
|    C           KEYWAH    CHAINWAH0                 41
| 02-C           *IN41     IFEQ '1'
|   C*                    CLEARWAH0
|   C*                    MOVEL'SC'      WAH01            公司別
|   C                     MOVEL'SD'      WAH01            公司別
|   C                     MOVELXAH02     WAH02            傳票號碼
|   C                     Z-ADD1         WAH03            傳票項次
|   C                     MOVEL*BLANK    WAH04            會計科目
|   C                     MOVELACCT      WAH04            會計科目
|   C                     MOVEL*BLANK    WAH05            成本中心
|   C                     MOVEL*BLANK    WAH05A           欄位代碼
|   C                     MOVEL*BLANK    WAH06            對象別
|   C                     MOVEL*BLANK    WAH06A           欄位代碼
|   C                     MOVEL*BLANK    WAH07            相關號碼1
|   C                     MOVEL*BLANK    WAH07A           欄位代碼
|   C                     MOVEL*BLANK    WAH08            相關號碼2
|   C                     MOVEL*BLANK    WAH08A           欄位代碼
|   C                     Z-ADD0         WAH09            日期
|   C                     MOVEL*BLANK    WAH09A           欄位代碼
|   C                     Z-ADDVDATE     WAH10            傳票日期
|   C                     Z-ADDWAMT1     WAH12            借方金額
|   C                     Z-ADDWAMT2     WAH13            貸方金額
|   C                     Z-ADD0         WAH14            數量
|   C                     MOVEL*BLANK    WAH14A           欄位代碼
|   C                     MOVEL*BLANK    WAH15            其它
|   C                     MOVEL*BLANK    WAH15A           欄位代碼
|   C                     MOVEL*BLANK    WAH16            摘要
|   C                     MOVEL'A2'      WAH17            傳票來源
|   C                     MOVEL*BLANK    WAH18            過帳註記
|   C                     MOVELXAH19     WAH19            核准註記
|   C                     MOVELXAH20     WAH20            作廢註記
|   C                     Z-ADD0         WAH21            迴轉日期
|   C                     MOVEL*BLANK    WAH22            資金代碼
|   C                     Z-ADD0         WAH23            資金金額
|   C                     MOVEL*BLANK    WAH24            沖帳傳票號
|   C                     Z-ADD$A8YMD    WAH25            製票日期
|   C                     MOVEL$USER     WAH26            製票人　
|   C                     TIME           WAH97            異動時間
|   C                     Z-ADD$A8YMD    WAH98            異動日期
|   C                     MOVEL$USER     WAH99            異動者
|   C                     WRITEWAH0
| 02*C                     ELSE
|   C                     ADD  WAMT1     WAH12            借方金額
|   C                     ADD  WAMT2     WAH13            貸方金額
|   C                     UPDATWAH0
| 02-C                     ENDIF
|    C*
04===C                     ENDSR
      *===============================================================*
     C*          RTN200....PREPARE WAH
      *===============================================================*
05===C           RTN200    BEGSR
|    C*傳票號碼
|    C                     MOVEL*BLANKS   XAH02   9
|    C                     CALL 'GLS002'
|    C***                  PARM 'SC'      P002I1  2
|    C                     PARM 'SD'      P002I1  2
|    C                     PARM VDATE     P002I2  80
|    C                     PARM 'F'       P002I3  1
|    C           XAH02     PARM           P002O1  9
|    C*
|    C           *LOVAL    SETLLWAHL1
|    C                     READ WAHL1                    42
| 01-C           *IN42     DOWEQ'0'
|   C                     ADD  1         SEQNO   30
|   C                     MOVELXAH02     WAH02
|   C                     Z-ADDSEQNO     WAH03
|   C                     MOVEL*BLANK    WAH19
|   C                     MOVEL*BLANK    WAH20
|   C                     UPDATWAHL1
|   C*
|   C                     READ WAHL1                    42
|   C*
| 01-C                     ENDDO
|    C*
05===C                     ENDSR
     C*===============================================================*
     C*          RTN300....借貸方調整
     C*===============================================================*
06===C           RTN300    BEGSR
|    C*
|    C           *LOVAL    SETLLWAHL1
|    C                     READ WAHL1                    42
| 01-C           *IN42     DOWEQ'0'
|   C*
| 02-C           WAH12     IFLT 0
|   C           WAH12     MULT -1        WAH13
|   C                     Z-ADD0         WAH12
| 02-C                     ENDIF
|   C*
| 03-C           WAH13     IFLT 0
|   C           WAH13     MULT -1        WAH12
|   C                     Z-ADD0         WAH13
| 03-C                     ENDIF
|   C*
|   C                     UPDATWAHL1
|   C*
|   C                     READ WAHL1                    42
| 01-C                     ENDDO
|    C*
06===C                     ENDSR
      *===============================================================*
