     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     H*
     H*    PROGRAM ID   : MCJ601
     H*    PROGRAM NAME : 傳票批次
     H*    AUTHOR       : A1010 JOHNL
     H*    CREATE DATE  : 2010.12.09
     H*    UPDATE DATE  : 20090131 日期起訖抓 C#EHPF
     H*    SYSTEM       : 進銷存 TO 總帳
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     F****************************************************************
     FVHCTLPF UF  E           K        DISK                      A
     I****************************************************************
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      119 1240$ADMDY
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080A8YMD
     I                                      598 5990$PRTID
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      625 626 D01
     I                                      617 6200D02
     I                                      630 6350EK02
     I                                      640 640 VHS1
     I                                      641 641 VHS2
     I                                      642 642 VHS3
     I                                      643 643 VHS4
     I                                      650 650 VHR1
     I                                      651 651 VHR2
     I                                      652 652 VHR3
     I                                      660 660 VHA1
     I                                      661 661 VHA2
     I                                      662 662 VHA3
     I                                      663 663 VHA4
     I                                      665 665 VHA6
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYVC     KLIST
     C                     KFLD           D01              *公司別
     C                     KFLD           EK02             *年月 YYYYMM
     C                     KFLD           VC03X   2        *傳票類別
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*  S1  SA
  01-C           VHS1      IFEQ 'Y'
    C           VHS1      OREQ 'F'
    C                     MOVE 'SA'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*
     C*
     C*  S2  S2
  03-C           VHS2      IFEQ 'Y'
    C           VHS2      OREQ 'F'
    C                     MOVE 'S2'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  S3  S3
  03-C           VHS3      IFEQ 'Y'
    C           VHS3      OREQ 'F'
    C                     MOVE 'S3'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  S4  CT
  03-C           VHS4      IFEQ 'Y'
    C           VHS4      OREQ 'F'
    C                     MOVE 'CT'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  R1  RV
  03-C           VHR1      IFEQ 'Y'
    C           VHR1      OREQ 'F'
    C                     MOVE 'RV'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  R2  E1
  03-C           VHR2      IFEQ 'Y'
    C           VHR2      OREQ 'F'
    C                     MOVE 'E1'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  R3  B1
  03-C           VHR3      IFEQ 'Y'
    C           VHR3      OREQ 'F'
    C                     MOVE 'B1'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  A1  A1
  03-C           VHA1      IFEQ 'Y'
    C           VHA1      OREQ 'F'
    C                     MOVE 'A1'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  A2  A2
  03-C           VHA2      IFEQ 'Y'
    C           VHA2      OREQ 'F'
    C                     MOVE 'A2'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  A3  A3
  03-C           VHA3      IFEQ 'Y'
    C           VHA3      OREQ 'F'
    C                     MOVE 'A3'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  A4  A4
  03-C           VHA4      IFEQ 'Y'
    C           VHA4      OREQ 'F'
    C                     MOVE 'A4'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*  A6  A6
  03-C           VHA6      IFEQ 'Y'
    C           VHA6      OREQ 'F'
    C                     MOVE 'A6'      VC03X
    C                     EXSR RTN100
  01-C                     ENDIF
     C*
     C                     SETON                     LR
    C*==============================================================*
    C*          WRITE VHCTL NEW RECORD
    C*==============================================================*
01===C           RTN100    BEGSR
|    C*
|    C           KEYVC     CHAINVC0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     EXSR RTN200
| 01*C                     ELSE
|   C                     CLEARVC0
|   C                     MOVELD01       VC01             公司別
|   C                     Z-ADDEK02      VC02             年月 YYYYMM
|   C                     MOVELVC03X     VC03             傳票類別
|   C                     Z-ADDA8YMD     VCXX             異動日期
|   C                     TIME           VCYY             異動時間
|   C                     MOVE $USER     VCZZ             異動者　
|   C                     WRITEVC0
| 01-C                     ENDIF
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          UPFATE      NEW RECORD
     C*==============================================================*
02===C           RTN200    BEGSR
|    C                     Z-ADDA8YMD     VCXX             異動日期
|    C                     TIME           VCYY             異動時間
|    C                     MOVE $USER     VCZZ             異動者　
|    C                     UPDATVC0
02===C                     ENDSR
     C*==============================================================*
