     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     H*
     H*    PROGRAM ID   : MCJ600
     H*    PROGRAM NAME : 傳票批次
     H*    AUTHOR       : A1010 JOHNL
     H*    CREATE DATE  : 2010.12.09
     H*    UPDATE DATE  : 20090131 日期起訖抓 C#EHPF
     H*    SYSTEM       : 進銷存 TO 總帳
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     F****************************************************************
     FMCJ600D CF  E                    WORKSTN      KINFDS DSPFDS
     FC#EHPF  IF  E           K        DISK
     FC#EKPF  IF  E           K        DISK
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      111 1160$CHYMD
     I                                      119 1240$ADMDY
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      625 626 D01
     I                                      617 6200D02
     I                                      630 6350EK02
     I                                      640 640 VHS1
     I                                      641 641 VHS2
     I                                      642 642 VHS3
     I                                      643 643 VHS4
     I                                      650 650 VHR1
     I                                      651 651 VHR2
     I                                      652 652 VHR3
     I                                      660 660 VHA1
     I                                      661 661 VHA2
     I                                      662 662 VHA3
     I                                      663 663 VHA4
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C*          *ENTRY    PLIST
     C*          *IN03     PARM *IN03     IN03    1
     C*          *IN14     PARM *IN14     IN14    1
     C*          *IN16     PARM *IN16     IN16    1
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYEK     KLIST
     C                     KFLD           EK01             *公司別
     C                     KFLD           EK02             *年月份
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
  01-C           *IN03     DOUEQ'1'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C                     SETON                     10
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVE *BLANKS   D01
|    C                     Z-ADD*ZEROS    D02
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     SETON                       99  報表格式MESSAGE
|    C*
|    C                     Z-ADD0         W6      60
02===C                     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     ENDIF
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 02-C           *IN99     IFEQ *ZERO
|   C           *IN18     ANDEQ'1'
     C                     CALL 'MCJ602C'
     C                     ENDIF
| 02-C           *IN99     IFEQ *ZERO
|   C           *IN14     ANDEQ'1'
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C                     OUT  *NAMVAR
|   C                     CALL 'MCJ000C'
|   C                     PARM           EK01
|   C                     PARM           EK02
|   C                     PARM           RTNCD   1
| 03-C           RTNCD     IFEQ 'E'
|   C                     MOVEL'ERR0157' ERRID
|   C                     MOVEL'SCMF'    ERRF
     C                     SETON                     99
| 03*C                     ELSE
|   C                     MOVEL'UPT2142' ERRID
|   C                     MOVEL'PTMF'    ERRF
     C                     SETON                     99
| 03-C                     ENDIF
|   C*
| 04-C           *IN99     IFEQ *ZERO
|   C           *IN18     ANDEQ'1'
|   C                     CALL 'MCJ602C'
| 04-C                     ENDIF
|   C*
| 02-C                     ENDIF
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|     *公司別
| 01-C           D01       IFEQ *BLANKS
|   C                     MOVEL'UPT0010' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C           D01       CHAINEH0                  40
|    C*
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL'UPT0030' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6199
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
| 03-C           D02       IFEQ *ZEROS
|   C                     MOVEL'UPT0012' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 03*C                     ELSE
|   C*
|   C                     CALL 'P38'
|   C                     PARM D02       P3801I  60
|   C                     PARM '3'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C                     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 04-C           P3811O    IFEQ 'N'
|   C                     MOVEL'UPT0040' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 04*C                     ELSE
|   C*帳務區間抓 EK07 , EK08
|   C                     MOVE 'S1'      EK01
|   C                     Z-ADDP3801O    EK02
|   C           KEYEK     CHAINEK0                  42
| 05-C           *IN42     IFNE '0'
|   C                     MOVEL'UPT0016' ERRID
|   C                     MOVEL'PTMF'    ERRF
|   C                     SETON                     6599
| 05-C                     ENDIF
| 04-C                     END
| 03-C                     END
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
