      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : MTC005                                        *
      * AUTHER       : A1010  JOHN CHIOU                             *
      * CREATE DATE  : 2010/10/29                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :西祺進銷存                                   *
      * SUBSYSTEM    :庫存管理系統                                 *
      * REMARK       :庫存數量重算                                 *
      ****************************************************************
     FINTNPFZ IP  E           K        DISK
     FINTPPF  O   E           K        DISK
     E*===============================================================
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C           TN13      IFNE 0
     C                     MOVELTN01      TP01
     C                     MOVELTN02      TP02
     C                     Z-ADD20091225  TP03
     C                     MOVELTN04      TP04
     C                     MOVELTN05      TP05
     C                     MOVELTN13      TP06
     C                     Z-ADDTN06      TP07
     C                     Z-ADD0         TP08
     C                     Z-ADD0         TP09
     C                     MOVEL*BLANK    TP10
     C                     MOVEL*BLANK    TP11
     C                     MOVEL*BLANK    TP12
     C                     MOVELTN03      TP13
     C                     MOVEL'P'       TP14
     C                     MOVEL'I'       TP15
     C                     MOVELTN01      TPVV
     C                     MOVELTN01      TPWW
     C                     MOVELTN01      TPXX
     C                     MOVELTN01      TPYY
     C                     MOVELTN01      TPZZ
     C                     WRITETP0
     C                     ENDIF
      *===============================================================*
