      ****************************************************************
     FINTXPF  UP  E           K        DISK
     FMANCPF  IF  E           K        DISK
     E*===============================================================
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     I            DS
     I                                        1   5 XTX07
     I                                        1   2 XTX07A
     C*==============================================================*
      *                    KLIST
     C           KEYNC     KLIST
     C                     KFLD           TX01
     C                     KFLD           TX11
      *==============================================================*
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     MOVELTX07      XTX07
  01-C           TX03      IFEQ 'S2'
    C           XTX07A    ANDEQ'00'
    C           KEYNC     CHAINNC0                  40
    C                     MOVEL*BLANK    TX07
    C                     MOVELNC03      TX07
    C                     UPDATTX0
  01-C                     ENDIF
     C*
      *===============================================================*
