      ****************************************************************
     FINTPPF  UP  E           K        DISK
     FMANCPF  IF  E           K        DISK
     E*===============================================================
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     I            DS
     I                                        1   5 XTP13
     I                                        1   2 XTP13A
     C*==============================================================*
      *                    KLIST
     C           KEYNC     KLIST
     C                     KFLD           TP01
     C                     KFLD           TP05
      *==============================================================*
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     MOVELTP13      XTP13
  01-C           TP15      IFEQ 'I'
    C           XTP13A    OREQ '00'
    C           KEYNC     CHAINNC0                  40
    C                     MOVEL*BLANK    TP13
    C                     MOVELNC03      TP13
    C                     UPDATTP0
  01-C                     ENDIF
     C*
      *===============================================================*
