     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : PIA0096                                    *
     H*    PROGRAM NAME :計算12/25實際庫存量                   *
     H*    AUTHOR       : RACHEL                                     *
     H*    CREATE DATE  : 2022/10/19                                 *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :庫存系統作業                              *
     H*    SUBSYSTEM    :盤點系統　　                              *
     H*    REMARK       :計算12/25實際庫存量                     *
     H*                                                              *
     H****************************************************************
     FPIA9WF  UF  E           K        DISK
     E*---------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      201 2080$A8YMD
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DPI01
     I                                      503 504 DPI02
     I                                      505 5080DPI03
     I                                      509 5140DPI04S
     I                                      509 5100DPI4SM
     I                                      511 5120DPI4SD
     I                                      515 5200DPI04E
     I                                      515 5160DPI4EM
     I                                      517 5180DPI4ED
     I                                      521 5260DPIYM
     I                                      527 5340DZA03S
     I                                      535 5420DZA03E
     I           IDS
     I                                        1   80WZA03
     I                                        1   60WZA3YM
     I                                        1   40WZA03Y
     I                                        5   60WZA03M
     I                                        7   80WZA03D
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C*
     C                     SETOF                     40
     C*
     C           *LOVAL    SETLLPA9
     C                     READ PA9                      40
     C           *IN40     DOWEQ'0'
     C* P915 =實際庫存量
     C                     Z-ADDP909      P915             盤點量
     C                     ADD  P912      P915             銷售數量
     C                     ADD  P913      P915             進貨數量
     C                     ADD  P914      P915             系統異動調整
     C* P916 =12/25系統庫存量
|   C*計算某日庫存量
|    C                     Z-ADDP905      WZA03            盤點日期
|    C                     Z-ADD12        WZA03M
|    C                     Z-ADD25        WZA03D
|   C                     CALL 'MCC710'
|   C                     PARM P901      XTB01   2        公司別
|   C                     PARM P902      XTB03   2        通路代號
|   C                     PARM P903      XTB04   5        分店代號
|   C                     PARM P904      XTB05   9        產品代號
|   C                     PARM WZA03     XTX06   80       日期
|   C                     PARM 0         XTB07   90       庫存數量
|   C                     PARM 0         XTB17   90       陳列數量
|   C*
|   C           XTB07     ADD  XTB17     P916
|    C* P917 =12/25盤盈虧數量
|   C           P915      SUB  P916      P917
|    C* P918 =12/25盤盈虧金額
|   C           P917      MULT P907      P918      H      盤盈虧金額
     C*
     C                     MOVEL'TOT'     P9WW
     C                     Z-ADD$A8YMD    P9XX
     C                     TIME           P9YY
     C                     UPDATPA9
     C*
     C                     READ PA9                      40
     C                     ENDDO
     C*
     C                     SETON                     LR
     C*==============================================================*
