     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PIA0071                                    *
     H*    PROGRAM NAME :盤點資料上傳                              *
     H*    AUTHOR       : ROBIN                                      *
     H*    CREATE DATE  : 100/08/10                                  *
     H*    UPDATE DATE  :                                            *
     H****************************************************************
     FPA#BPF  IF  E           K        DISK
     FINPTWF  IF  E           K        DISK                           UC
     FMANELF03IF  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FINPTPF  UF  E           K        DISK                      A
     FPIA007D CF  E                    WORKSTN      KINFDS DSPFDS
     FPIA007P O   E             39     PRINTER                        UC
     E*---------------------------------------------------------------*
     E                    WCS      9999  5
     E                    WPD      9999  9
     E                    WER     1   2 42
     I*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*DATA AREA
     ISCDA01      DS
     I                                        1 100 DA0
     I                                       11  11 DA01
     ISCDA03      DS
     I                                        1   60DA03
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$DATE
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      201 2060$WWW
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DPI01
     I                                      503 5060DPI02
     I                                      507 5120DPIYM
     I                                      565 565 @A01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           SCDA01
     C           *NAMVAR   DEFN           SCDA03
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYNC     KLIST
     C                     KFLD           NC01
     C                     KFLD           NC02
     C           KEYNE     KLIST
     C                     KFLD           NE03
     C           KEYPW     KLIST
     C                     KFLD           PW01
     C                     KFLD           PW02
     C                     KFLD           PW03
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @GO     1
  01-C           *IN03     DOUEQ'1'
    C           @GO       OREQ 'Y'
    C                     EXSR R1000
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     10
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVEL*BLANK    DPI01
|    C                     Z-ADD*ZERO     DPI02
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL MESSAGE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     IN   LDA
|    C*
|    C**********           SETON                     99    報表格式MESSAGE
|    C*
02===C           E0200     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     SETOF                     99    報表格式MESSAGE
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
|    C                     EXSR R1B00                      SCREEN CHECKS
|    C*
| 03-C           *IN99     IFEQ *ZERO
|   C           *IN14     ANDEQ'1'
|   C*
|   C                     CALL 'PIA007C1'                 UPLOAD INPTWF
|   C                     OPEN INPTWF
|   C                     EXSR R2B00                      CK.對應代號
|   C                     CLOSEINPTWF
|   C   99                GOTO E1000                      ERROR
|   C*
|   C           @A01      IFEQ *BLANK
|   C                     OPEN INPTWF
|   C                     EXSR R3B00                      UPDATE INPTPF
|   C                     CLOSEINPTWF
|   C                     ENDIF
|   C*
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @GO              正式執行
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C* CHK ACTIVE
|    C                     IN   SCDA01
|    C                     IN   SCDA03
| 01-C           DA01      IFEQ '1'
|   C                     SETON                     99
|   C                     MOVEL'ERR0158' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 01-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
|    C*
|    C* << CHACK 公司別NOT *BLANK >>
| 03-C           DPI01     IFEQ *BLANK
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
|    C   99                GOTO E1B00
|     *
|    C           DPI01     CHAIN#B0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6199
| 04*C                     ELSE
|   C                     MOVEL#B03      D#B03
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
| 04-C           DPI02     IFEQ 0
|   C                     SETON                     6299
|   C                     MOVEL'ERR0006' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 04*C                     ELSE
|   C                     CALL 'P38'
|   C                     PARM DPI02     P3801I  60
|   C                     PARM '3'       P3802I  1
|   C                     PARM '1'       P3803I  1
|   C                     PARM           P3801O  60
|   C                     PARM           P3811O  1
| 05-C           P3811O    IFEQ 'N'
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 05*C                     ELSE
|   C                     Z-ADD0         DPIYM
|   C                     CALL 'P39'
|   C                     PARM DPI02     P3901I  60
|   C                     PARM '3'       P3902I  1
|   C                     PARM '1'       P3903I  1
|   C                     PARM '2'       P3904I  1
|   C                     PARM '1'       P3905I  1
|   C           DPIYM     PARM           P3911O  60
| 05-C                     ENDIF
| 04-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
| 06-C           DPIYM     IFLE DA03
|   C                     MOVEL'ERR0159' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 06-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*===============================================================*
     C*          R2B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
06===C           R2B00     BEGSR
|     *
|     * INPTWF HAS RECORDS ?
|    C           *LOVAL    SETLLINPTWF
|    C                     READ INPTWF                   46
| 01-C           *IN46     IFEQ '1'
|   C                     SETON                     99
|   C                     MOVEL'ERR0088' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 01-C                     ENDIF
|    C   99                GOTO E2B00
|     *
|    C                     OPEN PIA007P
|     * REPORT HEADING
|    C                     WRITEPH1
|    C                     Z-ADD0         I       30
|    C                     Z-ADD0         J       30
|     * 檢核分店代號與產品代號
|    C           *LOVAL    SETLLINPTWF
|    C                     READ INPTWF                   46
| 02-C           *IN46     DOWEQ'0'
|    *
| |  C           PW02      IFEQ *BLANK
| |  C           PW03      OREQ *BLANK
| |  C                     GOTO $NEXTB
| |  C                     ENDIF
|    * 檢核分店代號
|   C                     MOVELPW02      NE03      P
|   C           KEYNE     SETLLNE0                  40
|   C           KEYNE     READENE0                      40
| 03-C           *IN40     IFEQ '1'
|    *
|   C           PW02      LOKUPWCS                      43HAD PRINTED ?
| 04-C           *IN43     IFEQ '0'
|    * REPORT DETAIL
|   C                     MOVELWER,1     PERR
|   C                     MOVELPW02      PFD1      P
|   C                     EXSR R2B10                      PRINT
|   C                     ADD  1         I
|   C                     MOVELPW02      WCS,I     P
|   C                     SETON                     99
| 04-C                     ENDIF
| 03-C                     ENDIF
|    *
|    * 檢核產品代號
|   C                     MOVELPW01      NC01      P
|   C                     MOVELPW03      NC02      P
|   C           KEYNC     CHAINNC0                  40
| 08-C           *IN40     IFEQ '1'
|   C           PW03      LOKUPWPD                      43HAD PRINTED ?
| 09-C           *IN43     IFEQ '0'
|    * REPORT DETAIL
|   C                     MOVELWER,2     PERR
|   C                     MOVELPW03      PFD1      P
|   C                     EXSR R2B10                      PRINT
|   C                     ADD  1         J
|   C                     MOVELPW03      WPD,J     P
|   C                     SETON                     99
| 09-C                     ENDIF
| 08-C                     ENDIF
|    *
     C           $NEXTB    TAG
|    C                     READ INPTWF                   46
| 02-C                     ENDDO
|     * REPORT ENDING
| 10-C           *IN99     IFEQ '1'
|   C                     MOVEL'ERR0139' ERRID
|   C                     MOVEL'SCMF'    ERRF
|    *上傳資料有誤
|   C                     MOVEL'1'       @A01
| 10*C                     ELSE
|   C                     WRITEPE31
|    *上傳資料無誤
|   C                     MOVEL*BLANK    @A01
| 10-C                     ENDIF
|    C                     WRITEPE2
|     *
|    C                     CLOSEPIA007P
|     *
06===CSR         E2B00     ENDSR
      *===============================================================*
      *          R2B10 ....PRINT REPORT
      *===============================================================*
07===C           R2B10     BEGSR
|    C*
|    C                     WRITEPD1
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPE1
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     ENDIF
|    C*
07===C           E2B10     ENDSR
     C*===============================================================*
     C*          R3B00  ...UPDATE INPTPF FROM INPTWF
     C*===============================================================*
06===C           R3B00     BEGSR
|     *
|    C           *LOVAL    SETLLINPTWF
|    C                     READ INPTWF                   46
| 02-C           *IN46     DOWEQ'0'
| |   *
| |  C           KEYPW     CHAININPTPF               40
| |03C           *IN40     IFEQ '0'
| || C                     MOVELPW04      PT04
| || C                     Z-ADDPW05      PT05
| || C                     Z-ADD*DATE     PTXX
| || C                     TIME           PTYY
| || C                     MOVEL$USER     PTZZ
| || C                     UPDATPT0
| ||-C                     ELSE
| ||4C           PW05      IFGT 0
| || C                     MOVELPW01      PT01
| || C                     MOVELPW02      PT02
| || C                     MOVELPW03      PT03
| || C                     MOVELPW04      PT04
| || C                     Z-ADDPW05      PT05
| || C                     Z-ADD*DATE     PTXX
| || C                     TIME           PTYY
| || C                     MOVEL$USER     PTZZ
| || C                     WRITEPT0
| ||4C                     ENDIF
| |03C                     ENDIF
| |   *
| |  C                     READ INPTWF                   46
| 02-C                     ENDDO
|     *
06===CSR         E3B00     ENDSR
**
此分店代號不存在分店對照檔。
此產品代號不存在產品對照檔。
