      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PIA0022                                       *
      * AUTHER       : A1492  TERRY                                  *
      * CREATE DATE  : 100/01/28                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :                                               *
      * REMARK       :盤點更新                                     *
      ****************************************************************
     FINPIPF  IF  E           K        DISK
     FINPSPF  IF  E           K        DISK
     FINTAPF  UF  E           K        DISK
     FINTBPF  UF  E           K        DISK                      A
     FINTNPF  UF  E           K        DISK
     FINTPPF  O   E           K        DISK                      A
     FINTXPF  O   E           K        DISK                      A
      *==============================================================*
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      201 2080$A8YMD
     I                                      203 2080A6YMD
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DPI01
     I                                      503 5060DPI02
     I                                      507 5120DPIYM
     I                                      513 5140D25
     I                                      507 5140DPIYMD
     I                                      509 5140DPXYMD
     ISCDA03      DS
     I                                        1   60DA03
     I            DS
     I                                        1   5 PI03
     I                                        1   1 PI031
     I            DS
     I                                        1   5 PS02
     I                                        1   1 PS021
     I            DS
     I                                        1  13 DOCNO
     I                                        3   4 TRXCD
     IDA02        DS
     I                                        1   43DUTY
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*
     C           KEYPI     KLIST
     C                     KFLD           DPI01            公司別
     C                     KFLD           DPIYM            年月
     C           KEYPS     KLIST
     C                     KFLD           DPI01            公司別
     C                     KFLD           DPIYM            年月
     C           KEYTA     KLIST
     C                     KFLD           PI01             公司別
     C                     KFLD           PI02             年月
     C                     KFLD           PI04             產品代號
     C           KEYTB     KLIST
     C                     KFLD           PI01             公司別
     C                     KFLD           PI02             年月
     C                     KFLD           XTB03   2        通路
     C                     KFLD           PI03             分店代號
     C                     KFLD           PI04             產品代號
     C           KEYTN     KLIST
     C                     KFLD           PS01             公司別
     C                     KFLD           XTB03   2        通路
     C                     KFLD           PS09             供應商代號
     C                     KFLD           PS02             分店代號
     C                     KFLD           PS03             產品代號
     C                     KFLD           PS04             陳列驗收單號
      *==============================================================*
      *                    DEFN ROUTINE
      *==============================================================*
     C           *NAMVAR   DEFN           DA02             稅率REFLIB
     C           *NAMVAR   DEFN           SCDA03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C           KEYPI     SETLLPI0
     C           KEYPI     READEPI0                      40
     C*
  01-C           *IN40     DOWEQ'0'
  02-C           PI08      IFNE 0
    C           PI08A     ORNE 0
    C                     EXSR RTN100                     INTAPF
    C                     EXSR RTN200                     INTBPF
    C                     EXSR RTN300                     INTXPF.A6
  02-C                     ENDIF
    C           KEYPI     READEPI0                      40
  01-C                     ENDDO
     C*
     C           KEYPI     SETLLPS0
     C           KEYPI     READEPS0                      40
  03-C           *IN40     DOWEQ'0'
    C                     EXSR RTN400                     INTNPF
    C                     EXSR RTN500                     INTPPF
    C                     EXSR RTN600                     INTXPF.S2
    C           KEYPI     READEPS0                      40
  03-C                     ENDDO
     C*
     C           *LOCK     IN   SCDA03
     C                     Z-ADDDPIYM     DA03
     C                     OUT  SCDA03
     C*
     C                     SETON                     LR
     C*
      *==============================================================*
      *          RTN010....UPDATE INTAPF
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'C1'      XTB03
|    C                     Z-ADD25        D25
|    C                     MOVEL'N'       @WRT    1
|    C*取單號
|    C                     CALL 'GET001'
|    C                     PARM DPI01     T001I1  2        公司別
|    C                     PARM 'A6'      T001I2  2        單別
|    C                     PARM DPXYMD    T001I3  60       西元YYMMDD
|    C                     PARM           T001O1 13        單號
|    C*
|    C                     MOVELT001O1    A6NO   13        單號
|    C*
|    C                     CALL 'GET001'
|    C                     PARM DPI01     T001I1  2        公司別
|    C                     PARM 'S2'      T001I2  2        單別
|    C                     PARM DPXYMD    T001I3  60       西元YYMMDD
|    C                     PARM           T001O1 13        單號
|    C*
|    C                     MOVELT001O1    S2NO   13        單號
|    C*
|    C                     IN   DA02
|    C*
|    C                     IN   SCDA03
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....DETAIL  UPDATE INTAPF
      *==============================================================*
02===C           RTN100    BEGSR
|    C           KEYTA     CHAINTA0                  41
|    C                     ADD  PI08      TA10             帳列庫存量
|    C                     ADD  PI10      TA08             帳列庫存金額
| 01-C           PI08      IFGT 0
|   C                     ADD  PI08      TA13             調整入庫量
| 01*C                     ELSE
|   C                     SUB  PI08      TA14             調整出庫量
| 01-C                     END
|    C*
|    C                     ADD  PI08A     TA17             陳列異動量
|    C*
|    C                     UPDATTA0
|     *
02===C                     ENDSR
      *==============================================================*
      *          RTN200....DETAIL  UPDATE INTBPF
      *==============================================================*
03===C           RTN200    BEGSR
     C           PI031     IFEQ 'C'
     C                     MOVEL'C1'      XTB03
     C                     ENDIF
     C           PI031     IFEQ 'D'
     C                     MOVEL'D '      XTB03
     C                     ENDIF
     C*
|    C           KEYTB     CHAINTB0                  42
     C           *IN42     IFEQ '0'
|    C                     ADD  PI08      TB07             帳列庫存量
| 01-C           PI08      IFGT 0
|   C                     ADD  PI08      TB10             調整入庫量
| 01*C                     ELSE
|   C                     SUB  PI08      TB11             調整出庫量
| 01-C                     END
|    C                     ADD  PI08A     TB16             陳列異動量
|    C                     UPDATTB0
     C                     ELSE
     C                     CLEARTB0
     C                     MOVELPI01      TB01             公司
     C                     Z-ADDPI02      TB02             年月
     C                     MOVELXTB03     TB03             通路
     C                     MOVELPI03      TB04             分店
     C                     MOVELPI04      TB05             產品
|    C                     ADD  PI08      TB07             帳列庫存量
| 01-C           PI08      IFGT 0
|   C                     ADD  PI08      TB10             調整入庫量
| 01*C                     ELSE
|   C                     SUB  PI08      TB11             調整出庫量
| 01-C                     END
|    C                     ADD  PI08A     TB16             陳列異動量
|    C                     WRITETB0
     C                     ENDIF
|     *
03===C                     ENDSR
      *==============================================================*
      *          RTN300....DETAIL  WRITE INTXPF 'A6'
      *==============================================================*
04===C           RTN300    BEGSR
|    C                     MOVELA6NO      DOCNO
|    C                     CLEARTX0
|    C                     MOVELPI01      TX01             公司
|    C                     Z-ADDPI02      TX02             年月
|    C                     MOVELTRXCD     TX03             異動別
|    C                     Z-ADD9         TX04             加減別
|    C                     MOVELA6NO      TX05             單據號碼
|    C                     Z-ADDDPIYMD    TX06             單據日期
|    C                     Z-ADD0         TX06A            進貨到店日
|    C                     MOVEL*BLANK    TX07             對象別
|    C                     MOVEL*BLANK    TX08             對應單據 1
|    C                     MOVEL*BLANKS   TX09             對應單據 2
|    C                     MOVEL*BLANKS   TX10             對應單據 3
|    C                     MOVELPI04      TX11             產品代號
|    C                     MOVELPI03      TX12             分店
|    C                     MOVEL*BLANKS   TX13             分店對應碼
|    C                     Z-ADDPI08      TX14             原始數量
|    C                     ADD  PI08A     TX14             原始數量
|    C                     Z-ADDPI08      TX15             數量
|    C                     Z-ADDPI08A     TX16             借貨銷售數量
|    C                     Z-ADD0         TX17             盤盈銷售數量
|    C                     Z-ADD0         TX18             單價
|    C                     Z-ADDPI10A     TX19             金額(陳列)
|    C                     Z-ADD0         TX19A            稅額
|    C                     Z-ADDPI09      TX20             單位成本
|    C                     Z-ADDPI10      TX21             成本金額
|    C                     MOVEL'PI'      TX22             資料來源
|    C                     Z-ADD$A8YMD    TX23             月結日期
|    C                     Z-ADDDPIYM     TX24             月結年月
|    C                     Z-ADD0         TX25             產生傳票日期
|    C                     MOVEL*BLANK    TX26             原因代碼
     C           PI031     IFEQ 'C'
     C                     MOVEL'C1'      TX27
     C                     ENDIF
     C           PI031     IFEQ 'D'
     C                     MOVEL'D '      TX27
     C                     ENDIF
|    C*                    MOVEL'C1'      TX27             通路
|    C*
|    C                     WRITETX0
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN400....DETAIL  UPDATE INTNPF
      *==============================================================*
05===C           RTN400    BEGSR
     C           PS021     IFEQ 'C'
     C                     MOVEL'C1'      XTB03
     C                     ENDIF
     C           PS021     IFEQ 'D'
     C                     MOVEL'D '      XTB03
     C                     ENDIF
     C*
|    C           KEYTN     CHAINTN0                  44
| 01-C           *IN44     IFEQ '0'
|   C                     SUB  PS06      TN07             陳列餘量
|   C                     ADD  PS06      TN17             陳列調整
|   C                     UPDATTN0
| 01-C                     ENDIF
05===C                     ENDSR
      *==============================================================*
      *          RTN500....DETAIL  WRITE INTPPF
      *==============================================================*
06===C           RTN500    BEGSR
|    C*
|    C                     CLEARTP0
|    C                     MOVELPS01      TP01             公司別
|    C                     MOVEL'C1'      TP02             通路代號
|    C                     Z-ADDDPIYMD    TP03             銷售日期
|    C                     MOVELPS02      TP04             分店代號
|    C                     MOVELPS03      TP05             產品代號
|    C                     Z-ADDPS06      TP06             借貨數量
|    C                     Z-ADDPS05      TP07             陳列進價
|    C*
|    C*          TP06      MULT TP07      WTP08   90H
|    C*                    Z-ADDWTP08     TP08             未稅金額
|    C           TP06      MULT TP07      TP08             未稅金額
|    C           DUTY      ADD  1         WDUTY   43       含稅率
|    C           TP08      MULT WDUTY     WTP09   90H
|    C                     Z-ADDWTP09     TP09             含稅金額
|    C                     MOVELS2NO      TP10             借貨單號
|    C                     MOVEL*BLANK    TP11             銷售序號
|    C                     MOVELPS04      TP12             陳列驗收單號
|    C                     MOVELPS09      TP13             供應商代號
|    C                     MOVEL'P'       TP14             狀態碼
|    C                     MOVEL'P'       TP15             來源碼
|    C                     Z-ADD$A8YMD    TPVV             建檔日期
|    C                     MOVEL'PIA0022' TPWW             異動程式
|    C                     MOVEL$A8YMD    TPXX             異動日期
|    C                     TIME           TPYY             異動時間
|    C                     MOVEL$USER     TPZZ             異動者　
|    C                     WRITETP0
06===C                     ENDSR
      *==============================================================*
      *          RTN600....DETAIL  WRITE INTXPF(S2)
      *==============================================================*
07===C           RTN600    BEGSR
|    C                     MOVELS2NO      DOCNO
|    C                     CLEARTX0
|    C                     MOVELPS01      TX01             公司
|    C                     Z-ADDPS10      TX02             年月
|    C                     MOVELTRXCD     TX03             異動別
|    C                     Z-ADD-1        TX04             加減別
|    C                     MOVELS2NO      TX05             單據號碼
|    C                     Z-ADDDPIYMD    TX06             單據日期
|    C                     Z-ADD0         TX06A            進貨到店日
|    C                     MOVELPS09      TX07             對象別
|    C                     MOVEL*BLANK    TX08             對應單據 1
|    C                     MOVELPS04      TX09             對應單據 2
|    C                     MOVEL*BLANKS   TX10             對應單據 3
|    C                     MOVELPS03      TX11             產品代號
|    C                     MOVELPS02      TX12             分店
|    C                     MOVEL*BLANKS   TX13             分店對應碼
|    C                     Z-ADDPS06      TX14             原始數量
|    C                     Z-ADDPS06      TX15             數量
|    C                     Z-ADDPS06      TX16             借貨銷售數量
|    C                     Z-ADD0         TX17             盤盈銷售數量
|    C                     Z-ADDPS05      TX18             單價
|    C                     Z-ADDPS07      TX19             金額(陳列)
|    C                     Z-ADD0         TX19A            稅額
|    C                     Z-ADDPS05      TX20             單位成本
|    C                     Z-ADDPS07      TX21             成本金額
|    C                     MOVEL'PI'      TX22             資料來源
|    C                     Z-ADD$A8YMD    TX23             月結日期
|    C                     Z-ADDDPIYM     TX24             月結年月
|    C                     Z-ADD0         TX25             產生傳票日期
|    C                     MOVEL*BLANK    TX26             原因代碼
|    C*                    MOVEL'C1'      TX27             通路
     C           PS021     IFEQ 'C'
     C                     MOVEL'C1'      TX27
     C                     ENDIF
     C           PS021     IFEQ 'D'
     C                     MOVEL'D '      TX27
     C                     ENDIF
|    C*
|    C                     WRITETX0
|    C*
07===C                     ENDSR
      *==============================================================*
