     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : PII101                                     *
     A*    AUTHOR       : SHARON                                     *
     A*    DATE WRITTEN : 105/05/26                                  *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :西祺進銷存系統                            *
     A*    SUBSYSTEM    :                                          *
     A*    PROCEDURE    :每月盤點歷史查詢                          *
     A*    REMARK       :                                            *
     A*--------------------------------------------------------------*
     A****************************************************************
     FPII101D CF  E                    WORKSTN
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     FMANCPF  IF  E           K        DISK
     FMANDPF  IF  E           K        DISK
     FMANEPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
*****F*******PIZAPF  UF  E           K        DISK
     FPIZALF02IF  E           K        DISK
*****F************ZA0                               KRENAMEZAX
     FPIZBPF  IF  E           K        DISK
     A****************************************************************
     E*: FUNCTION DATA :
     E                    WFUN    6   6  6
     E*: A/U/D/I AUT
     E                    WA01        6  1
     A****************************************************************
     I*                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      140 140 $RMK02
     I                                      141 141 $RMK03
     I                                      173 174 $ZA01
     I                                      201 2080$EG8
     I                                      201 2040$WWW
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     C*==============================================================*
     C*                    DEFINE ROUTINE
     C*==============================================================*
     C*
     C                     Z-ADD0         HRRN1   40
     C                     MOVE *BLANKS   APPSCR  6
     C*
     C                     MOVE *BLANK    WQUERY  1
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C           *LIKE     DEFN DBGN3     OBGN3            *START KEY
     C           *LIKE     DEFN DBGN4     OBGN4            *START KEY
     C           *LIKE     DEFN DBGN5     OBGN5            *START KEY
     C*
     C           *LIKE     DEFN ZA03      KBGN3                        OM
     C*
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYZA     KLIST
     C                     KFLD           DBGN1            公司代號
     C                     KFLD           DBGN2            通路代號
     C*
     C           KEYZA1    KLIST
     C                     KFLD           DBGN1            公司代號
     C                     KFLD           DBGN2            通路代號
     C                     KFLD           KBGN3            盤點日期
     C                     KFLD           DBGN4            分店代號
     C                     KFLD           DBGN5            盤點單號
     C*
     C           KEYND     KLIST
     C                     KFLD           DZA01            公司代號
     C                     KFLD           DZA02            通路代號
     C*
     C           KEYZA0    KLIST
     C                     KFLD           DBGN1            公司代號
     C                     KFLD           DBGN2            通路代號
     C                     KFLD           ZA05             盤點單號
     C*
     C           KEYNE     KLIST
     C                     KFLD           DBGN1            公司代號
     C                     KFLD           DBGN2            通路代號
     C                     KFLD           ZA04             分店代號
     C*
     C           KEYNC     KLIST
     C                     KFLD           DBGN1            公司代號
     C                     KFLD           DZB05            產品代號
     C*
     C           KEYZA3    KLIST
     C                     KFLD           ZA01             公司代號
     C                     KFLD           ZA02             通路代號
     C                     KFLD           ZA03             盤點日期
     C                     KFLD           ZA04             分店代號
     C                     KFLD           ZA05             盤點單號
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRONMENT
     C                     EXSR RTN191                     *INIT SFL
     C*
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170           *ENTER CHK
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*將權限寫入，一開始呼叫程式便會將權限寫入LDA
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE $RMK01    WA01,6
|    C                     MOVE 'SCR001'  APPSCR
|    C*
|    C                     Z-ADD0         WDATE   80
|    C                     Z-ADD0         TDATE   80
|    C                     Z-ADD$EGMDY    OBGN3
|    C                     Z-ADD$EGMDY    DBGN3
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN170....ENTER
     C*==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C           DBGN3     ORNE OBGN3
|   C           DBGN4     ORNE OBGN4
|   C           DBGN5     ORNE OBGN5
|   C                     Z-ADD0         HRRN1
|   C*
|   C                     EXSR RTN190
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVELDBGN1     OBGN1
|   C                     MOVELDBGN2     OBGN2
|   C                     MOVELDBGN3     OBGN3
|   C                     MOVELDBGN4     OBGN4
|   C                     MOVELDBGN5     OBGN5
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     ENDIF
| 01-C                     ENDIF
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN171...讀取畫面上DOPT1是否有輸入
     C*==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                   57*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN300
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                   57*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
| 05-C                     END
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN180....第一層畫面的檢查
     C*==============================================================*
04===CSR         RTN180    BEGSR
|    C* CHK AUT *
|    C*權限判斷在主畫面呼叫時，便會去判斷權限，目前不放在程式裡
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                     6099
|   C                     MOVEL'ERR9999' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     Z-ADDRRN1      DRRN1
| 01-C                     END
|    C   99                GOTO END180
|    C*
04===C           END180    ENDSR
     C*==============================================================*
     C*          RTN190....CHECK 'SC01' SCREEN
     C*==============================================================*
05===CSR         RTN190    BEGSR
|    C*
|    C           DBGN1     CHAIN#B0                  40
|    C  N40                MOVEL#B03      S#B03
|    C   40                MOVEL*BLANK    S#B03
|    C           KEYZA     CHAINND0                  40
|    C  N40                MOVELND04      SND04
|    C   40                MOVEL*BLANK    SND04
|    C*
05===C                     ENDSR
     C*=========================================================*
     C*          RTN191...第一層SFL INITIAL                  *
     C*=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|    C*
|    C                     Z-ADDDBGN3     WDATE
|    C                     EXSR RTN31B
|    C                     Z-ADDTDATE     KBGN3
|    C*
|    C           KEYZA1    SETLLZA0
|    C*
06===C                     ENDSR
     C*=========================================================*
     C*          RTN192 .. ROLLUP MAIN ROUTINE
     C*=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
07===C                     ENDSR
     C*=========================================================*
     C*          RTN193 .. ADD SUBFILE DATA
     C*=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                     5354
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|   C*去判斷畫面上欄位如有沒有輸入，就將所有資料秀出
     C           KEYZA     READEZA0                      46
|   C*
| 02-C           *IN46     IFEQ '0'
||   C*
||   C           DBGN1     IFNE ZA01
||   C                     ITER
||   C                     ENDIF
||   C*
||   C***        ZA07      IFEQ 'V'
||   C***                  ITER
|    C***                  ENDIF
||   C*
|   C           KEYNE     CHAINNE0                  40
|   C  N40                MOVELNE05      SNE05
|   C   40                MOVEL*BLANK    SNE05
|   C*
|   C                     Z-ADDZA03      WDATE
|   C                     EXSR RTN31A
|   C                     Z-ADDTDATE     SZA03
|   C*
|   C                     Z-ADDZA08      WDATE
|   C                     EXSR RTN31A
|   C                     Z-ADDTDATE     SZA08
|   C*
|   C                     Z-ADDZA09      WDATE
|   C                     EXSR RTN31A
|   C                     Z-ADDTDATE     SZA09
|   C*
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|   C*資料結束
|   C                     SETON                     53
| 02-C                     ENDIF
|   C*
| 01-C                     ENDDO
|    C*在此做資料的預讀，再將KEY值帶回
|    C           KEYZA     READEZA0                      46
|    C           KEYZA3    SETLLZA0
|    C*
| 04-C           *IN46     IFEQ '1'
|   C                     SETON                     53
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
| 04-C                     ENDIF
|    C*將畫面上最後一筆資料KEEP住
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN195... EXFMT SFL                                 *
     C*==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
| 02-C           DBGN1     IFNE *BLANK
     C*          DBGN2     ORNE *BLANK
|   C                     SETON                     95    *LST PAG
|   C*                    MOVEL'MSG0003' ERRID
|   C*                    MOVEL'SCMF'    ERRF
| 02-C                     END
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
10===C           RTN300    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
|    C*
| 01-C***********DOPT1     CASEQ'6'       RTN320           *UPD
| 01-C           DOPT1     CASEQ'5'       RTN340           *INQ
| 01-C                     END
|    C           *LOVAL    SETLLZA0
|    C*
10===C                     ENDSR
     C*==============================================================*
     C***********RTN320....UPD DATA --- SFLSR
     C*==============================================================*
11===C*          RTN320    BEGSR
|    C*
|    C*                    EXSR RTN391                     *INT SFLSR
|    C*                    EXSR RTN398                     *READ DATA
|    C*
| 01-C*          *IN03     DOWEQ'0'                        *CTL LOOP
|   C*          APPSCR    ANDEQ'SCR002'
|   C*
|   C*                    SETON                     61
|   C*
|   C*                    EXSR RTN390
|   C*
|   C*                    WRITEDSPC3
|   C*                    EXFMTSFLCR2
|   C*
| 02-C*          *IN03     IFEQ '0'
| 03-C*          *IN12     IFEQ '0'
     C*
     C*          *IN09     IFEQ '1'                         SAVE
     C*          KEYZA0    CHAINZA0                  42
     C*          *IN42     IFEQ '0'
     C*                    MOVEL'V'       ZA07
     C*                    Z-ADD$EG8      ZA09
     C*                    MOVEL'PIA101'  ZAWW
     C*                    Z-ADD$EG8      ZAXX
     C*                    TIME           ZAYY
     C*                    MOVEL$USER     ZAZZ
     C*                    UPDATZA0
     C*                    SETON                     99
     C*                    MOVEL'MSG0002' ERRID
     C*                    MOVEL'SCMF'    ERRF
     C*                    END                             *IN42 ENDIF
     C*                    MOVEL'SCR001'  APPSCR
     C*                    END                             *IN09 ENDIF
|   C*
| 03*C*                    ELSE
|   C*          *LOVAL    SETLLZA0
|   C*                    MOVE 'SCR001'  APPSCR
| 03-C*                    END                             *IN03 ENDIF
| 02-C*                    END                             *IN12 ENDIF
|   C*
| 01-C*                    END                             *ENDDO
|    C*
|    C*
11===C*                    ENDSR
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR2
     C*==============================================================*
12===C           RTN340    BEGSR
|    C*
     C                     SETOF                     61
|    C*
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXSR RTN390
|   C*
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 06-C           *IN99     IFEQ '0'                         SAVE
|   C                     MOVE 'SCR001'  APPSCR
| 06-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLZA0
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
12===C                     ENDSR
     C*==============================================================*
     C*          RTN390....DATA TO SCREEN
     C*==============================================================*
13===C           RTN390    BEGSR
|    C*
|    C                     MOVELDBGN1     DZA01
|    C                     MOVELS#B03     D#B03
|    C*
|    C                     MOVELDBGN2     DZA02
|    C                     MOVELSND04     DND04
|    C*
|    C                     MOVELZA04      DZA04
|    C                     MOVELSNE05     DNE05
|    C*
|    C                     MOVELZA05      DZA05
|    C*
|    C                     Z-ADDSZA03     DZA03
|    C*
|    C                     Z-ADDSZA08     DZA08
|    C*
|    C                     Z-ADDSZA09     DZA09
|    C*
13===C                     ENDSR
     C*==============================================================*
     C*          RTN391....INIT 'SC03' -- SFLSR2
     C*==============================================================*
14===C           RTN391    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD200       DSPRC2  40
|    C                     Z-ADD10        WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYZA0    SETLLZB0
|    C*
14===C                     ENDSR
     C*==============================================================*
     C*          RTN398....FILE TO SCREEN ---- SFLSR2
     C*==============================================================*
16===C           RTN398    BEGSR
|    C*
|    C           KEYZA0    READEZB0                      44*NF/EOF
|    C*
| 02-C           *IN44     DOWEQ'0'
|   C                     EXSR RTN39B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           KEYZA0    READEZB0                      44
| 02-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          RTN39B....FILE TO SCREEN --- MOVE
     C*==============================================================*
18===C           RTN39B    BEGSR
|    C*
|    C                     MOVELZB05      DZB05
|    C           KEYNC     CHAINNC0                  40
|    C  N40                MOVELNC05      DNC05
|    C   40                MOVEL*BLANK    DNC05
|    C                     Z-ADDZB06      DZB06
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
20===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN31A....CALL P31
     C*==============================================================*
21===C           RTN31A    BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM WDATE     P31I1   80
|    C                     PARM '2'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '3'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           TDATE     PARM           P31IO   80
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          RTN31B....CALL P31
     C*==============================================================*
21===C           RTN31B    BEGSR
|    C*
|    C                     CALL 'P31'
|    C                     PARM WDATE     P31I1   80
|    C                     PARM '3'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '2'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           TDATE     PARM           P31IO   80
|    C*
22===C                     ENDSR
     C*==============================================================*
**
新增修改      刪除查詢結案
