     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PUC0212                                    *
     H*    PROGRAM NAME :採購單批次處理                            *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/09/24                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :採購管理                                  *
     A*00A需求單號: 1090200                                        *
     A*00A 2020/02/20 CAROL陳列增加運送方式，直走陳列              *
     A*00B需求單號: 1110803                                        *
     A*00B 2022/10/28 RACHEL陳列訂單打備註，轉出彙總表卻無顯示     *
     H****************************************************************
     FPOCDPF  UP  E           K        DISK
     FPOCEPF  IF  E           K        DISK
     FPOCFPF  IF  E           K        DISK
     FPOCGPF  IF  E           K        DISK
     FPOCHLF01UF  E           K        DISK
     FPOCJPF  UF  E           K        DISK                      A
     FPOCIPF  UF  E           K        DISK
     FPOCLPF  O   E           K        DISK                      A
     FPOCMPF  UF  E           K        DISK                      A
     FPOCNPF  UF  E           K        DISK                      A
     FPOCOPF  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      201 2080$EG8
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DCD01
     I                                      503 504 DCD02
     I                                      505 5100DCD03
     I                                      511 5180WCD03
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
      *
     C           KEYCH     KLIST
     C                     KFLD           CG02
     C                     KFLD           CD04
     C                     KFLD           CD07
     C                     KFLD           SCD06
     C                     KFLD           CD05
     C           KEYCH1    KLIST
     C                     KFLD           CE02
     C                     KFLD           CD04
     C                     KFLD           CD07
     C                     KFLD           SCD06
     C                     KFLD           CD05
     C           KEYCH2    KLIST
     C                     KFLD           CE02
     C                     KFLD           CD04
     C                     KFLD           CD08
     C                     KFLD           SCD06
     C                     KFLD           CD05
     C           KEYCH3    KLIST
     C                     KFLD           CG02
     C                     KFLD           CD04
     C                     KFLD           CD08
     C                     KFLD           SCD06
     C                     KFLD           CD05
     C           KEYCM     KLIST
     C                     KFLD           CM01
     C                     KFLD           CM02
     C                     KFLD           CM03
     C           KEYCI     KLIST
     C                     KFLD           CH04
     C                     KFLD           CM02
     C                     KFLD           CM03
     C           KEYCO     KLIST
     C                     KFLD           CO01
     C                     KFLD           CO02
     C           KEYCI1    KLIST
     C                     KFLD           CE02
     C                     KFLD           CD04
     C                     KFLD           CD07
     C                     KFLD           SCD06
     C           KEYCI2    KLIST
     C                     KFLD           CE02
     C                     KFLD           CD04
     C                     KFLD           CD07
     C                     KFLD           SCD06
     C                     KFLD           CD05
     C           KEYCI3    KLIST
     C                     KFLD           CE02
     C                     KFLD           CD04
     C                     KFLD           CD08
     C                     KFLD           SCD06
     C                     KFLD           CD05
      *
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CLR 10                EXSR RTN890
      *沒有資料
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|     *
|     *撰寫採購相關資料
|    C                     EXSR RTN200
|     *撰寫驗收相關資料
|    C                     EXSR RTN300
|     *
|    C                     MOVEL'P'       CD12
|    C                     UPDATCD0
|     *
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200...撰寫採購單相關資料
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
| 01-C                     SELEC
|   C           CD06      WHEQ 'R1'
|   C                     MOVEL'P1'      SCD06   2
|   C           CD06      WHEQ 'R2'
|   C                     MOVEL'P2'      SCD06
|   C           CD06      WHEQ 'R3'
|   C                     MOVEL'P3'      SCD06
| 01-C                     ENDSL
|     *一般單
| 02-C           CD06      IFEQ 'R1'
|   C           CD06      OREQ 'R2'
|00B+C           CD06      OREQ 'R3'
     C                     SETOF                     90
     C           CD06      IFEQ 'R2'
 00A+C           CD06      OREQ 'R3'
     C           CD11      IFEQ '2'
     C           CD11      OREQ '3'
     C                     SETON                     90
     C                     ENDIF
     C                     ENDIF
|   C           CD05      SETLLCG0
|   C           CD05      READECG0                      46
| 03-C           *IN46     DOWEQ'0'
|   C  N90      KEYCH     CHAINCH0                  41
|   C   90      KEYCH3    CHAINCH0                  41
|   C  N41                MOVELCG03      CH14
|   C  N41                MOVELCG04      CH15
|   C   41                MOVEL*BLANK    CH14
|   C   41                MOVEL*BLANK    CH15
|   C  N41                UPDATCH0
|   C           CD05      READECG0                      46
| 03-C                     ENDDO
| 02-C                     ENDIF
|     *客訂單
| 04-C           CD06      IFEQ 'R2'
| 05-C           CD11      IFEQ '1'
|   C           CD05      CHAINCF0                  42
| 06-C           *IN42     IFEQ '0'
|   C           CF01      SETLLCE0
|   C           CF01      READECE0                      45
| 07-C           *IN45     DOWEQ'0'
|   C           KEYCH1    CHAINCH0                  43
| 08-C           *IN43     IFEQ '0'
|   C                     MOVELCH04      CJ01
|   C           CJ01      CHAINCJ0                  44
|   C                     MOVELCF02      CJ02
|   C                     MOVELCF03      CJ03
|   C                     MOVELCF04      CJ04
|   C                     MOVELCF05      CJ05
|   C                     Z-ADD$EG8      CJVV
|   C                     MOVEL'PUC021'  CJWW
|   C                     Z-ADD$EG8      CJXX
|   C                     TIME           CJYY
|   C                     MOVEL$USER     CJZZ
|   C   44                WRITECJ0
|   C  N44                UPDATCJ0
| 08-C                     ENDIF
|   C           CF01      READECE0                      45
| 07-C                     ENDDO
| 06-C                     ENDIF
| 05-C                     ENDIF
|    *
| 09-C           CD11      IFEQ '2'
|   C           CD05      CHAINCF0                  42
| 10-C           *IN42     IFEQ '0'
|   C           CF01      SETLLCE0
|   C           CF01      READECE0                      45
| 11-C           *IN45     DOWEQ'0'
|   C           KEYCH2    CHAINCH0                  43
| 12-C           *IN43     IFEQ '0'
|   C                     MOVELCH04      CJ01
|   C           CJ01      CHAINCJ0                  44
|   C                     MOVELCF02      CJ02
|   C                     MOVELCF03      CJ03
|   C                     MOVELCF04      CJ04
|   C                     MOVELCF05      CJ05
|   C                     Z-ADD$EG8      CJVV
|   C                     MOVEL'PUC021'  CJWW
|   C                     Z-ADD$EG8      CJXX
|   C                     TIME           CJYY
|   C                     MOVEL$USER     CJZZ
|   C   44                WRITECJ0
|   C  N44                UPDATCJ0
| 12-C                     ENDIF
|   C           CF01      READECE0                      45
| 11-C                     ENDDO
| 10-C                     ENDIF
| 09-C                     ENDIF
| 04-C                     ENDIF
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN300...寫驗收相關資料
     C*==============================================================*
04===C           RTN300    BEGSR
|    C*
|    C                     EXSR RTN310
|    C                     EXSR RTN320
|    C                     EXSR RTN330
|    C                     EXSR RTN340
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN310...寫驗收單主檔
     C*==============================================================*
05===C           RTN310    BEGSR
|     *
|    C                     MOVELCD01      CL01
|    C                     MOVELCD02      CL02
|    C                     MOVELCD08      CL03
|    C                     MOVELCD04      CL04
| 01-C                     SELEC
|   C           CD06      WHEQ 'R1'
|   C                     MOVEL'C1'      CL06
|   C           CD06      WHEQ 'R2'
|   C                     MOVEL'C2'      CL06
|   C           CD06      WHEQ 'R3'
|   C                     MOVEL'C3'      CL06
| 01-C                     ENDSL
|     *
|    C                     CALL 'GET001'
|    C                     PARM CD01      T001I1  2
|    C                     PARM CL06      T001I2  2
|    C                     PARM DDATE     T001I3  60
|    C           CL05      PARM           T001O1 13
|     *
| 02-C           CD06      IFEQ 'R2'
|   C           CD11      ANDEQ'2'
|   C           CD06      OREQ 'R2'
|   C           CD11      ANDEQ'3'
|00A+C           CD06      OREQ 'R3'
|00A+C           CD11      ANDEQ'3'
|   C                     Z-ADDCD08      CL07
| 02*C                     ELSE
|   C                     Z-ADDCD07      CL07
| 02-C                     ENDIF
|     *
|    C                     MOVELCD09      CL08
|    C                     Z-ADDCD10      CL09
|    C                     MOVELCD11      CL10
|    C                     Z-ADDCL07      CL11
|     *
| 03-C                     SELEC
|   C           CD06      WHEQ 'R1'
|   C                     MOVEL'1'       CL12
|   C           CD06      WHEQ 'R2'
| 04-C           CD11      IFEQ '1'
|   C                     MOVEL'1'       CL12
| 04-C                     ENDIF
| 05-C           CD11      IFEQ '2'
|   C                     MOVEL'2'       CL12
| 05-C                     ENDIF
| 06-C           CD11      IFEQ '3'
|   C                     MOVEL'3'       CL12
| 06-C                     ENDIF
|   C           CD06      WHEQ 'R3'
|00A+C           CD11      IFEQ '1'
|   C                     MOVEL'1'       CL12
|00A+C                     ENDIF
|00A+C           CD11      IFEQ '3'
|00A+C                     MOVEL'3'       CL12
|00A+C                     ENDIF
| 03-C                     ENDSL
|     *
|    C                     MOVEL*BLANK    CL13
|    C                     MOVEL*BLANK    CL14
|    C                     MOVELCD05      CL15
|    C                     MOVEL*BLANK    CL16
|     *
|    C                     Z-ADD$EG8      CLVV
|    C                     MOVEL'PUC021'  CLWW
|    C                     Z-ADD$EG8      CLXX
|    C                     TIME           CLYY
|    C                     MOVEL$USER     CLZZ
|    C                     WRITECL0
|     *
05===C                     ENDSR
     C*==============================================================*
     C*          RTN320...寫驗收單明細
     C*==============================================================*
06===C           RTN320    BEGSR
|     *
|    C           CD05      SETLLCE0
|    C           CD05      READECE0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     MOVELCL05      CM01
|   C                     MOVELCE02      CM02
|   C                     MOVELCE03      CM03
|   C           KEYCM     CHAINCM0                  40
|   C                     Z-ADDCE05      CM04
|   C                     Z-ADD0         CM05
|   C                     Z-ADD0         CM06
|   C                     Z-ADD0         CM07
|   C                     Z-ADD0         CM08
|   C                     Z-ADD0         CM09
|   C                     MOVELCE06      CM10
|   C                     MOVELCD01      CM11
|   C                     MOVELCD02      CM12
|   C                     MOVELCD04      CM13
|   C                     Z-ADDCD08      CM14             到分店日
|   C                     MOVEL*BLANK    CM15
| 02-C           CD06      IFEQ 'R2'                       客訂單
|   C           CD11      ANDEQ'2'                        直送2,3
|   C           CD06      OREQ 'R2'
|   C           CD11      ANDEQ'3'
|00A+C           CD06      OREQ 'R3'
|00A+C           CD11      ANDEQ'3'
     C*  FOR成本計算，客訂直送單：到分店日->到貨運日
|   C                     Z-ADDCD08      CM16
     C                     ELSE
|   C                     Z-ADDCD07      CM16             到貨運日
     C                     ENDIF
|   C                     Z-ADD$EG8      CMVV
|   C                     MOVEL'PUC021'  CMWW
|   C                     Z-ADD$EG8      CMXX
|   C                     TIME           CMYY
|   C                     MOVEL$USER     CMZZ
|   C  N40                UPDATCM0
|   C   40                WRITECM0
|    *寫回採購明細檔
| 02-C           CD06      IFEQ 'R2'
|   C           CD11      ANDEQ'2'
|   C           CD06      OREQ 'R2'
|   C           CD11      ANDEQ'3'
|00A+C           CD06      OREQ 'R3'
|00A+C           CD11      ANDEQ'3'
|   C           KEYCI3    CHAINCH0                  40
| 03-C           *IN40     IFEQ '0'
|   C           KEYCI     CHAINCI0                  41
|   C                     MOVELCM01      CI05
|   C                     MOVEL'PUC021'  CIWW
|   C                     Z-ADD$EG8      CIXX
|   C                     TIME           CIYY
|   C                     MOVEL$USER     CIZZ
|   C  N41                UPDATCI0
| 03-C                     ENDIF
| 02-C                     ENDIF
|    *
| 04-C           CD06      IFEQ 'R2'
|   C           CD11      ANDEQ'1'
|   C           KEYCI2    CHAINCH0                  40
| 05-C           *IN40     IFEQ '0'
|   C           KEYCI     CHAINCI0                  41
|   C                     MOVELCM01      CI05
|   C                     MOVEL'PUC021'  CIWW
|   C                     Z-ADD$EG8      CIXX
|   C                     TIME           CIYY
|   C                     MOVEL$USER     CIZZ
|   C  N41                UPDATCI0
| 05-C                     ENDIF
| 04-C                     ENDIF
|    *
| 06-C           CD06      IFEQ 'R1'
|   C           CD06      OREQ 'R3'
|   C           KEYCI1    CHAINCH0                  40
| 07-C           *IN40     IFEQ '0'
|   C           KEYCI     CHAINCI0                  41
|   C                     MOVELCM01      CI05
|   C                     MOVEL'PUC021'  CIWW
|   C                     Z-ADD$EG8      CIXX
|   C                     TIME           CIYY
|   C                     MOVEL$USER     CIZZ
|   C  N41                UPDATCI0
| 07-C                     ENDIF
| 06-C                     ENDIF
|    *
|   C           CD05      READECE0                      46
| 01-C                     ENDDO
|     *
06===C                     ENDSR
     C*==============================================================*
     C*          RTN330...驗收單客戶資料檔
     C*==============================================================*
07===C           RTN330    BEGSR
|    C*
|    C           CD05      CHAINCF0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELCL05      CN01
|   C           CN01      CHAINCN0                  41
|   C                     MOVELCF02      CN02
|   C                     MOVELCF03      CN03
|   C                     MOVELCF04      CN04
|   C                     MOVELCF05      CN05
|   C                     Z-ADD$EG8      CNVV
|   C                     MOVEL'PUC021'  CNWW
|   C                     Z-ADD$EG8      CNXX
|   C                     TIME           CNYY
|   C                     MOVEL$USER     CNZZ
|   C  N41                UPDATCN0
|   C   41                WRITECN0
| 01-C                     ENDIF
|     *
07===C                     ENDSR
     C*==============================================================*
     C*          RTN340...驗收單供應商備註檔
     C*==============================================================*
08===C           RTN340    BEGSR
|    C*
|    C           CD05      SETLLCG0
|    C           CD05      READECG0                      46
| 01-C           *IN46     DOWEQ'0'
|   C                     MOVELCL05      CO01
|   C                     MOVELCG02      CO02
|   C           KEYCO     CHAINCO0                  40
|   C                     MOVELCG03      CO03
|   C                     MOVELCG04      CO04
|   C                     MOVEL'PUC021'  COWW
|   C                     Z-ADD$EG8      COXX
|   C                     TIME           COYY
|   C                     MOVEL$USER     COZZ
|   C  N40                UPDATCO0
|   C   40                WRITECO0
|   C           CD05      READECG0                      46
| 01-C                     ENDDO
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          RTN800... LEVEL BREAK L1
     C*==============================================================*
09===C           RTN800    BEGSR
|    C*
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
10===C           RTN890    BEGSR
|    C*
|    C*
10===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
11===C           RTN899    BEGSR
|    C*
|    C                     MOVEL'N'       $DATA
|    C*
11===C                     ENDSR
