     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PUC0411                                    *
     H*    PROGRAM NAME :運費月結處理                              *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/10/21                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :採購管理                                  *
     H****************************************************************
     FPA#BPF  IF  E           K        DISK
     FC#EJPF  IF  E           K        DISK
     FPUC041D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     ISCDA01      DS
     I                                        1 100 DA0
     I                                        4   4 DA01
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$DATE
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      201 2060$WWW
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DCK01
     I                                      505 5080DCK02
     I                                      510 5150WCK02
     I                                      520 520 @A01
     I                                      521 5280SEJ07
     I                                      531 5380SEJ08
     I            DS
     I                                        1   60WYM
     I                                        3   40WYY
     I                                        5   60WMM
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *NAMVAR   DEFN           SCDA01
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN10     PARM *IN10     IN10    1
     C           *IN14     PARM *IN14     IN14    1
     C           *IN96     PARM *IN96     IN96    1
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C                     SETON                     1027
|    C*
|    C                     MOVEL*BLANK    DCK01
|    C                     Z-ADD0         DCK02
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     IN   LDA
|     *
| 01-C           $DATA     IFEQ 'N'
|   C                     MOVEL'MSG0003' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     99
|   C                     GOTO E0200
| 01-C                     END
|     *
| 02-C           $DATA     IFEQ 'Y'
|   C           @A01      ANDEQ'1'
|   C                     MOVEL'MSG0002' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     99
|   C                     GOTO E0200
| 02-C                     END
|     *
| 03-C           $DATA     IFEQ 'Y'
|   C           @A01      ANDEQ'2'
|   C                     MOVEL'ERR0082' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     99
|   C                     GOTO E0200
| 03-C                     END
|     *
| 04-C           $DATA     IFEQ 'Y'
|   C           @A01      ANDEQ'3'
|   C           $DATA     OREQ 'Y'
|   C           @A01      ANDEQ'4'
|   C                     MOVEL'ERR0083' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     99
|   C                     GOTO E0200
| 04-C                     END
|     *
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
02===C           E0200     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ *ZERO
|   C           *IN14     ANDEQ'1'
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
     C*
|    C* CHK ACTIVE
     C                     IN   SCDA01
| 01-C           DA01      IFEQ '1'
|   C                     SETON                     99
|   C                     MOVEL'ERR0127' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 01-C                     ENDIF
|    C   99                GOTO E1B00
     C*
|    C* CHK FILES LOCK.
| 03-C           *IN96     IFEQ '1'
|   C                     SETON                     99
|   C                     SETOF                     96
|   C                     MOVEL'ERR0126' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 03-C                     ENDIF
|    C   99                GOTO E1B00
|    C*
|    C* CHK 公司別
| 01-C           DCK01     IFEQ *BLANK
|   C                     MOVEL*BLANK    CK01N
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 01-C                     END
|    C   99                GOTO E1B00
|     *
|    C           DCK01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    CK01N
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 02*C                     ELSE
|   C                     MOVEL#B03      CK01N
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C* CHK月結月份
|    C           DCK01     CHAINEJ0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    CK01N
|   C                     MOVEL'ERR0122' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 02-C                     END
|    C   99                GOTO E1B00
|     *
     C                     Z-ADDEJ02      WCK02
     C                     Z-ADDEJ02      WYM
     C           WMM       MULT 100       DCK02
     C           DCK02     ADD  WYY       DCK02
      *運費月結區間起迄
     C                     Z-ADDEJ07      SEJ07
     C                     Z-ADDEJ08      SEJ08
|     * CHK執行日期
| 06-C*          EJ02      IFGE $WWW
|   C*                    MOVEL'ERR0081' ERRID
|   C*                    MOVEL'SCMF'    ERRF
|   C*                    SETON                     6399
| 06-C*                    END
|    C*  99                GOTO E1B00
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
05===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*
|    C*          #LIN      IFEQ 7
|    C*          #COL      ANDGE46
|    C*          #COL      ANDLE52
|    C*                    CALL 'PYI512'
|    C*          DEM041    PARM DEM041    I512I1  7         部門代碼
|    C*                    PARM           @RTNC   2          FUN KEY
|    C*                    END
|    C*
05===C           E1E00     ENDSR
     C*==============================================================*
