     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : PUC0111                                    *
     H*    PROGRAM NAME :前台訂貨單轉後台處理                      *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/09/24                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :採購管理                                  *
     H****************************************************************
     FPOCDPF  UP  E           K        DISK
     FPOCEPF  UF  E           K        DISK
     E*---------------------------------------------------------------
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      201 2080$EG8
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I*
     I                                      501 502 DCD01
     I                                      503 504 DCD02
     I                                      505 5100DCD03
     I                                      511 5180WCD03
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
      *
     C           P1KEY     KLIST
     C                     KFLD           CD05
      *
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CLR 10                EXSR RTN890
     CLRN10                EXSR RTN899
     C*==============================================================*
     C*          RTN010... INITIAL
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     SETON                     1039
|    C                     MOVEL'Y'       $DATA
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100... DETAIL
     C*==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     IN   PTDA01
|    C                     MOVEL'O'       CD12
|    C                     MOVEL'PUC011'  CDWW
|    C                     Z-ADD$EG8      CDXX
|    C                     TIME           CDYY
|    C                     MOVEL$USER     CDZZ
|    C                     UPDATCD0
|    C*
|    C           P1KEY     SETLLCE0
|    C           P1KEY     READECE0                      45
| 01-C           *IN45     DOWEQ'0'
| 02-C           CE05      IFEQ 0
|   C                     Z-ADDCE04      CE05
|   C                     UPDATCE0
| 02-C                     ENDIF
|   C           P1KEY     READECE0                      45
| 01-C                     ENDDO
|    C*
02===C                     ENDSR
     C*==============================================================*
     C*          RTN890... LEVEL BREAK LR
     C*==============================================================*
03===C           RTN890    BEGSR
|    C*
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          RTN899... LEVEL BREAK LR --- NO DATA
     C*==============================================================*
04===C           RTN899    BEGSR
|    C*
|    C                     MOVEL'N'       $DATA
|    C*
04===C                     ENDSR
