     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : PUC026                                     *
     A*    AUTHOR       : EASON                                      *
     A*    DATE WRITTEN : 97/10/13                                   *
     A*    UPDATE DATE  : 108/08/13                                  *
     A*    SYSTEM       :西祺進銷存系統                            *
     A*    SUBSYSTEM    :                                          *
     A*    PROCEDURE    :採購單查詢-採購單號                     *
     A*    REMARK       :                                            *
     A*---------------------------------------------------------------
     A* 00A需求單號: 1080981
     A* 00A CAROL  2019/08/14查詢顯示驗收單號
     A*---------------------------------------------------------------
     A****************************************************************
 00A-F*PUC022D CF  E                    WORKSTN
     FPUC026D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     FMANAPF  IF  E           K        DISK
     FMANBPF  IF  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FMANDPF  IF  E           K        DISK
     FMANEPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FPOCJPF  IF  E           K        DISK
     FPOCIPF  IF  E           K        DISK
     FPOCCLF02IF  E           K        DISK
 00A-F*POCHLF02IF  E           K        DISK
 00A+FPOCHLF04IF  E           K        DISK
     A****************************************************************
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        5  1
     E*
     E                    CHK       999  9
     E                    DHK       999  5
     A****************************************************************
     I*
     I*SDS        SDS
     I*                                     *PROGRAM APPPGM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      140 140 $RMK02
     I                                      141 141 $RMK03
     I                                      173 174 $CD01
     I                                      201 2080$EG8
     I                                      201 2040$WWW
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I            DS
     I                                        1   80WCH08
     I                                        1   40WY
     I            DS
     I                                        1   40DCH11
     I                                        1   20DCH11A
     I                                        3   40DCH11B
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I**
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *
     C                     Z-ADD0         HRRN1   40
     C                     Z-ADD0         W6      60
     C                     Z-ADD0         DCH11A
     C                     Z-ADD0         DCH11B
     C*
     C                     MOVE *BLANKS   APPSCR  6
     C*
     C                     MOVE *BLANK    WQUERY  1
     C           *LIKE     DEFN DBGN1     OBGN1            *START KEY
     C           *LIKE     DEFN DBGN2     OBGN2            *START KEY
     C           *LIKE     DEFN DBGN3     OBGN3            *START KEY
     C           *LIKE     DEFN DBGN4     OBGN4            *START KEY
      *
     C           *LIKE     DEFN RRN2      @PRRN                        OM
     C*
     C*==============================================================*
     C*                    *ENTRY PLIST
     C*==============================================================*
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *
     C           KEYCH     KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
 00A-C*                    KFLD           WBGN3   80
     C                     KFLD           DBGN4
 00A+C                     KFLD           WBGN3   80
     C           KEYCH1    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C           KEYCH2    KLIST
     C                     KFLD           DCH01
     C                     KFLD           DCH02
     C                     KFLD           DCI03
     C                     KFLD           WCC06   1
     C                     KFLD           WCH08   80
     C           KEYCH3    KLIST
     C                     KFLD           DCH01
     C                     KFLD           DCH02
     C                     KFLD           DCI03
     C                     KFLD           WCC06
     C           KEYCH4    KLIST
     C                     KFLD           CH01
     C                     KFLD           CH02
     C                     KFLD           CH07
     C           KEYCH5    KLIST
     C                     KFLD           CH01
     C                     KFLD           CH02
 00A-C*                    KFLD           CH03
     C                     KFLD           CH04
 00A+C                     KFLD           CH03
     C           KEYCH6    KLIST
     C                     KFLD           DCH01
     C                     KFLD           DCH02
     C           KEYCH7    KLIST
     C                     KFLD           DCH01
     C                     KFLD           DCH02
     C                     KFLD           DCH07
     C           KEYCH8    KLIST
     C                     KFLD           DCH04
     C                     KFLD           DCH06
     C           KEYCH9    KLIST
     C                     KFLD           DCH01
     C                     KFLD           DCI03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*將權限寫入，一開始呼叫程式便會將權限寫入LDA
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR000'  APPSCR
|    C*
|    C                     Z-ADD0         WDATE   80
|    C                     Z-ADD0         TDATE   80
|00A-C*                    Z-ADD123129    OBGN3
|    C                     Z-ADD0         HCD03   80
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
02===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C           DBGN2     ORNE OBGN2
|   C           DBGN3     ORNE OBGN3
|   C           DBGN4     ORNE OBGN4
|   C                     Z-ADD0         HRRN1
|    *新增畫面秀出文字功能
|   C                     EXSR RTN190
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVELDBGN1     OBGN1
|   C                     MOVELDBGN2     OBGN2
|   C                     MOVELDBGN3     OBGN3
|   C                     MOVELDBGN4     OBGN4
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     ENDIF
| 01-C                     ENDIF
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN171...讀取畫面上DOPT1是否有輸入
      *==============================================================*
03===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
| 05-C                     END
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN180....第一層畫面的檢查
      *==============================================================*
04===CSR         RTN180    BEGSR
|    C* CHK AUT *
|    C*權限判斷在主畫面呼叫時，便會去判斷權限，目前不放在程式裡
|    C*          WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|    C*                    SETON                     609099
|    C*                    Z-ADDRRN1      DRRN1
|    C*                    END
|    C*  99                GOTO END180
|    C*
|     *
04===C           END180    ENDSR
      *==============================================================*
      *          RTN190....CHECK 'SC01' SCREEN
      *==============================================================*
05===CSR         RTN190    BEGSR
|    C*
|    C           DBGN1     CHAIN#B0                  40
|    C  N40                MOVEL#B03      S#B03
|    C   40                MOVEL*BLANK    S#B03
|    C           KEYCH1    CHAINND0                  40
|    C  N40                MOVELND04      SND04
|    C   40                MOVEL*BLANK    SND04
|    C*
05===C                     ENDSR
      *=========================================================*
      *          RTN191...第一層SFL INITIAL                  *
      *=========================================================*
06===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|     *
|00A-C*          DBGN3     IFEQ 0
|00A-C*                    Z-ADD123129    DBGN3
|00A-C*                    END
|     *
|    C                     Z-ADDDBGN3     WDATE
|    C                     EXSR RTN31B
|    C                     Z-ADDTDATE     WBGN3
|     *
|    C           KEYCH     SETLLCH0
|    C*
06===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
07===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     99    *LST PAG
|   C                     MOVEL'MSG0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
08===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                     5354
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|    *去判斷畫面上欄位如有沒有輸入，就將所有資料秀出
|   C           KEYCH1    READECH0                 N    46
|   C*
| 02-C           *IN46     IFEQ '0'
|    *
|   C                     Z-ADDCH03      WDATE
|   C                     EXSR RTN31A
|   C                     Z-ADDTDATE     SCH03
|    *
|   C           CH06      CHAINNB0                  40
|   C  N40                MOVELNB03      SNB03
|   C   40                MOVEL*BLANK    SNB03
|    *
|   C           KEYCH4    CHAINNE0                  40
|   C  N40                MOVELNE05      SNE05
|   C   40                MOVEL*BLANK    SNE05
|    *
|   C                     Z-ADDCH08      WDATE
|   C                     EXSR RTN31A
|   C                     Z-ADDTDATE     SCH08
|    *
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|    *資料結束
|   C                     SETON                     53
| 02-C                     ENDIF
|   C*
| 01-C                     ENDDO
|     *在此做資料的預讀，再將KEY值帶回
|     *主要修改翻頁上的BUG
|    C           KEYCH1    READECH0                      46
|    C           KEYCH5    SETLLCH0
|    C*
| 03-C           *IN46     IFEQ '1'
|   C                     SETON                     53
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
| 03-C                     ENDIF
|    C*將畫面上最後一筆資料KEEP住
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
08===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
09===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
| 02-C           DBGN1     IFNE *BLANK
|   C                     SETON                     95    *LST PAG
| 02-C                     END
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C                     MOVEL*BLANK    ERRID
|    C                     MOVEL*BLANK    ERRF
|    C*
09===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
10===C           RTN200    BEGSR
|    C*
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
|    C                     MOVEL*BLANK    NEW     1
|     *
| 01-C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLCH0
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
11===C           RTN240    BEGSR
|    C*
|    C                     SETON                     29
|    C           KEYCH5    CHAINCH0                  40
|     *
| 01-C           CH05      IFEQ 'P1'
|   C           CH05      OREQ 'P3'
|   C                     EXSR RTN25A                     *FIEL->SCRN
| 01*C                     ELSE
|   C                     EXSR RTN25A
|   C                     EXSR RTN25B
| 01-C                     ENDIF
|     *
|    C                     SETOF                     3031  *NO INPUT
| 02-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|    *
|   C                     EXSR RTN290
|    *
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 03-C           *IN03     IFEQ '0'
| 04-C           *IN12     IFEQ '0'
|   C                     MOVE 'SCR003'  APPSCR
|   C                     EXSR RTN300
| 04*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
| 03-C                     END
|   C*
| 02-C                     END
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN25A....MOVE DATA TO SCREEN
      *==============================================================*
12===CSR         RTN25A    BEGSR
|    C*
|    C                     MOVELCH01      DCH01
|     *
|    C           DCH01     CHAIN#B0                  40
|    C  N40                MOVEL#B03      D#B03
|    C   40                MOVEL*BLANK    D#B03
|     *
|    C                     MOVELCH02      DCH02
|     *
|    C           KEYCH6    CHAINND0                  40
|    C  N40                MOVELND04      DND04
|    C   40                MOVEL*BLANK    DND04
|     *
|    C                     MOVELCH06      DCH06
|    C           DCH06     CHAINNB0                  40
|    C  N40                MOVELNB03      DNB03
|    C  N40N41   NB15      CHAINNA0                  41
|    C  N40N41             MOVELNA03      DNA03
|    C  N40 41             MOVEL*BLANK    DNA03
|    C   40                MOVEL*BLANK    DNB03
|     *
|    C                     MOVELCH07      DCH07
|    C           KEYCH7    CHAINNE0                  40
|    C  N40                MOVELNE05      DNE05
|    C   40                MOVEL*BLANK    DNE05
|     *
|    C                     MOVELCH04      DCH04
|    C                     MOVELCH05      DCH05   2
|    C                     Z-ADDCH03      WDATE
|    C                     EXSR RTN31A
|    C                     Z-ADDTDATE     DCH03
|     *
|    C                     Z-ADDCH08      WDATE
|    C                     EXSR RTN31A
|    C                     Z-ADDTDATE     DCH08
|     *
|    C                     Z-ADDCH09      WDATE
|    C                     EXSR RTN31A
|    C                     Z-ADDTDATE     DCH09
|     *
|    C                     MOVELCH10      DCH10
|    C                     Z-ADDCH11      DCH11
|    C                     MOVELCH12      DCH12
|    C                     MOVELCH14      DCH14
|    C                     MOVELCH15      DCH15
|    C*
12===CSR                   ENDSR
      *==============================================================*
      *          RTN25B....MOVE DATA TO SCREEN
      *==============================================================*
13===CSR         RTN25B    BEGSR
|    C*
|    C           CH04      CHAINCJ0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELCJ02      DCJ02
|   C                     MOVELCJ03      DCJ03
|   C                     MOVELCJ04      DCJ04
|   C                     MOVELCJ05      DCJ05
| 01*C                     ELSE
|   C                     MOVEL*BLANK    DCJ02
|   C                     MOVEL*BLANK    DCJ03
|   C                     MOVEL*BLANK    DCJ04
|   C                     MOVEL*BLANK    DCJ05
| 01-C                     ENDIF
|    C*
13===CSR                   ENDSR
     C*==============================================================*
     C*          RTN290...判斷該用哪各畫面呈現
     C*==============================================================*
14===C           RTN290    BEGSR
|     *
 00A+C           KEYCH8    CHAINCI0                  42
 00A+C  N42                MOVELCI05      DCI05     P
 00A+C   42                MOVEL*BLANK    DCI05
 00A+C*
| 01-C                     SELEC
|   C           CH05      WHEQ 'P1'
|   C                     SETOF                     15
|   C                     EXFMTDSPD2
|   C           CH05      WHEQ 'P2'
| 02-C                     SELEC
|   C           DCH12     WHEQ '1'
|   C           DCH12     OREQ *BLANK
|   C                     SETON                     8182
|   C                     EXFMTDSPD3
|   C           DCH12     WHEQ '2'
|   C                     SETOF                     81
|   C                     SETON                     82
|   C                     EXFMTDSPD3
|   C           DCH12     WHEQ '3'
|   C                     SETOF                     8182
|   C                     EXFMTDSPD3
| 02-C                     ENDSL
|   C           CH05      WHEQ 'P3'
|   C                     SETOF                     15
|   C                     EXFMTDSPD2
| 01-C                     ENDSL
|     *
14===CSR                   ENDSR
     C*==============================================================*
     C*          RTN300....'SC03' SCREEN MAIN ROUTINE --- SFLSR
     C*==============================================================*
15===C           RTN300    BEGSR
|    C*
| 01-C           DOPT1     CASEQ'5'       RTN340           *INQ
| 01-C                     END
|    C   12                SETOF                     12
|     *按F3之後回到主選單畫面
| 02-C           *IN03     IFEQ '1'
|   C                     MOVE 'SCR001'  APPSCR
|   C                     SETOF                     03
| 02-C                     END
|    C*
15===C                     ENDSR
     C*==============================================================*
     C*          RTN340....INQ DATA --- SFLSR2
     C*==============================================================*
16===C           RTN340    BEGSR
|    C*
|    C                     SETOF                     343380*NO INPUT
|    C                     SETOF                     32
|    C                     EXSR RTN391                     *INT SFLSR
|    C                     EXSR RTN398                     *READ DATA TO SFLSR
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           APPSCR    ANDEQ'SCR003'
|    *
|   C                     EXSR RTN390
|    *
|   C                     WRITEDSPC3
|   C                     EXFMTSFLCR2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN99     IFEQ '0'                         SAVE
|   C                     MOVE 'SCR001'  APPSCR
| 04-C                     END
|   C*
| 03*C                     ELSE
|   C           *LOVAL    SETLLCH0
|   C                     MOVE 'SCR002'  APPSCR
| 03-C                     END                             *IN03 ENDIF
| 02-C                     END                             *IN12 ENDIF
|   C*
| 01-C                     END                             *ENDDO
|    C*
16===C                     ENDSR
     C*==============================================================*
     C*          RTN390....決定畫面所要秀出的代號
     C*==============================================================*
17===C           RTN390    BEGSR
|     *
| 01-C                     SELEC
|   C           DCH05     WHEQ 'P1'
|   C                     SETOF                     828389
|   C                     SETOF                     9293
|   C                     SETON                     818891
|   C           DCH05     WHEQ 'P2'
| 02-C           DCH12     IFEQ '1'
|   C                     SETON                     818283
|   C                     SETON                     8992
|   C                     SETOF                     889193
| 02-C                     ENDIF
| 03-C           DCH12     IFEQ '2'
|   C                     SETON                     828389
|   C                     SETON                     92
|   C                     SETOF                     889193
| 03-C                     ENDIF
| 04-C           DCH12     IFEQ '3'
|   C                     SETOF                     828381
|   C                     SETOF                     888991
|   C                     SETOF                     93
|   C                     SETON                     92
| 04-C                     ENDIF
|   C           DCH05     WHEQ 'P3'
|   C                     SETOF                     828391
|   C                     SETOF                     888992
|   C                     SETON                     8193
| 01-C                     ENDSL
|     *
17===C                     ENDSR
     C*==============================================================*
     C*          RTN391....INIT 'SC03' -- SFLSR2
     C*==============================================================*
18===C           RTN391    BEGSR
|    C*
|    C                     Z-ADD1         DRRN2
|    C                     Z-ADD0         WRRN2   40
|    C                     Z-ADD0         RRN2
|    C                     Z-ADD200       DSPRC2  40
|    C                     Z-ADD10        WPRCD2  40       *PAG RCD
|    C                     MOVE 'N'       WBOTM2  1        *BOTTOM
|    C*
|    C                     Z-ADD11        @SFTOP  20
|    C                     Z-ADD20        @SFBOT  20
|    C                     Z-ADD1         @LNUM   20
|    C*
|    C                     SETON                     52    *SFLCLR
|    C                     WRITESFLCR2
|    C                     SETOF                     525053
|    C                     SETON                     51    *SFLDSPCTL
|    C*
|    C           KEYCH8    SETLLCI0
|    C*
18===C                     ENDSR
     C*==============================================================*
     C*          RTN398....FILE TO SCREEN --- SFLSR(FOR A,U,D,I)
     C*==============================================================*
19===C           RTN398    BEGSR
|    C*
|    C           KEYCH8    READECI0                      44*NF/EOF
|    C*
| 01-C           *IN44     DOWEQ'0'
|   C                     EXSR RTN39B
|   C                     ADD  1         RRN2
|   C                     WRITESFLSR2
|   C           KEYCH8    READECI0                      44
| 01-C                     END
|    C*
|    C                     SETON                     53
|    C                     Z-ADDRRN2      WRRN2      50
|    C*
19===C                     ENDSR
     C*==============================================================*
     C*          RTN39B....FILE TO SCREEN --- MOVE
     C*==============================================================*
20===C           RTN39B    BEGSR
|    C*
|    C                     MOVEL'Y'       DCHK
|    C                     MOVELCI03      DCI03
|    C           KEYCH9    CHAINNC0                  40
|    C  N40                MOVELNC05      DNC05
|    C   40                MOVEL*BLANK    DNC05
|    C                     Z-ADDCI04      DCI04
|     *---------------------------------------------*
|     *取得最新未稅單價                           *
|     *利用到貨運日，客訂單若為直送便是到客戶日   *
|     *---------------------------------------------*
|    C                     Z-ADD0         WCH08
| 01-C           CH12      IFEQ '2'
|   C           CH12      OREQ '3'
|   C                     Z-ADDCH09      WCH08
| 01*C                     ELSE
|   C                     Z-ADDCH08      WCH08
| 01-C                     ENDIF
|     *
|     *先取得活動報價，若無再取得年度報價
|     *先活動
|    C                     MOVEL'2'       WCC06
|    C                     EXSR RTN39H
|     *在年度
| 02-C           DCC09     IFEQ 0
|   C                     MOVEL'1'       WCC06
|   C                     EXSR RTN39H
| 02-C                     ENDIF
|    C*
20===C                     ENDSR
     C*==============================================================*
     C*          RTN39H....取得最新報價單價
     C*==============================================================*
21===C           RTN39H    BEGSR
|     *
|   C                     Z-ADD0         DCC09
|     *
|    C           KEYCH2    SETGTCC0
|    C           KEYCH3    REDPECC0                      47
| 01-C           *IN47     IFEQ '0'
|   C           WY        ANDEQCC05
|    *
| 02-C           CC08      IFNE 0
|   C           WCH08     IFLE CC08
|   C           WCH08     ANDGECC07
|   C                     Z-ADDCC09      DCC09
     C                     ENDIF
| 02*C                     ELSE
| 03-C           WCH08     IFGE CC07
|   C                     Z-ADDCC09      DCC09
| 03-C                     ENDIF
| 02-C                     ENDIF
| 01-C                     ENDIF
|     *
21===C                     ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
22===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
|    C********************
|    C*  FOR  SCR002     *
|    C********************
|    C** SCR002
|    C*
22===C           ENDF4     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
23===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
23===C                     ENDSR
     C*==============================================================*
     C*          RTN31A....CALL P31
     C*==============================================================*
24===C           RTN31A    BEGSR
|     *
|    C                     CALL 'P31'
|    C                     PARM WDATE     P31I1   80
|    C                     PARM '2'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '3'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           TDATE     PARM           P31IO   80
|     *
24===C                     ENDSR
     C*==============================================================*
     C*          RTN31B....CALL P31
     C*==============================================================*
25===C           RTN31B    BEGSR
|     *
|    C                     CALL 'P31'
|    C                     PARM WDATE     P31I1   80
|    C                     PARM '3'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '2'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           TDATE     PARM           P31IO   80
|     *
25===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
     C*          ERRSR     BEGSR
     C*
     C*                    CALL 'P50'
     C*          DMSG      PARM           P5001O 78
     C*                    SETON                     8099
     C*
     C*                    ENDSR'*DETC'
     C/COPY HBP2CVTR
**
新增修改      刪除查詢
