      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PUR030                                        *
      * AUTHER       : A1388  WIND                                   *
      * CREATE DATE  : 97/11/04                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                             *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :分店驗收數量差異表                           *
      ****************************************************************
     FPA#BPF  IF  E           K        DISK
     FPUR030D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DCL01
     I                                      603 604 DDOC
     I                                      605 6100DCL03S
     I                                      611 6160DCL03E
     I                                      617 617 DATA
     I                                      618 619 DCL02S
     I                                      620 621 DCL02E
     I                                      622 626 DCL04S
     I                                      627 631 DCL04E
     I                                      641 6480DATES
     I                                      651 6580DATEE
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN88     OREQ '1'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEL*BLANK    DOWNL
  02-C           *IN03     IFEQ '0'
     C*
    C           *IN04     CASEQ'1'       RTNF4
    C                     CAS            RTN100           .CHECK      ?
     C                     ENDCS
    C*  F7 DOWNLOAD*
  04-C           *IN99     IFEQ '0'
    C           *IN07     ANDEQ'1'
    C                     SETOF                     88
    C                     CALL 'PUR030C2'
  04-C                     ENDIF
  03-C                     ENDIF
  01-C                     ENDDO
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C*
|    C*          AUT       IFNE 'D91'
|    C*          AUT       ANDNE'REP'
|    C*                    SETON                     31
|    C*                    END
|    C*
|    C                     MOVE *BLANK    DCL01
|    C                     Z-ADD0         DCL03S
|    C                     Z-ADD0         DCL03E
|    C                     Z-ADD0         DATES   80
|    C                     Z-ADD0         DATEE   80
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DCL01     IFEQ *BLANKS
|   C                     SETON                     60  99
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     MOVEL*BLANK    D#B03
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C           DCL01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#B03      D#B03
| 02*C                     ELSE
|   C                     SETON                     6099
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 02-C                     END
|    C   99                GOTO END100
|    C**到分店日
| 03-C           DCL03S    IFEQ 0
|   C                     Z-ADD010192    DCL03S
| 03*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DCL03S    P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 04-C           P3011O    IFEQ 'N'
|   C                     SETON                     61  99
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 04-C                     END
| 03-C                     END
|    C   99                GOTO END100
|    C*
| 05-C           DCL03E    IFEQ 0
|   C                     Z-ADD123129    DCL03E
| 05*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DCL03E    P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 06-C           P3011O    IFEQ 'N'
|   C                     SETON                     62  99
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 06-C                     END
| 05-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'P31'
|    C                     PARM DCL03S    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DATES     PARM           P3101O  80
|    C*
|    C                     CALL 'P31'
|    C                     PARM DCL03E    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DATEE     PARM           P3101O  80
|    C*
| 07-C           DATES     IFGT DATEE
|   C                     SETON                     616299
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 07-C                     END
|    C   99                GOTO END100
|    C**通路
| 08-C           DCL02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCL02S
| 08-C                     END
|    C*
| 09-C           DCL02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCL02E
| 09-C                     END
|    C*
| 10-C           DCL02S    IFGT DCL02E
|   C                     SETON                     636499
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 10-C                     END
|    C   99                GOTO END100
|    C*
|    C**分店
| 11-C           DCL04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCL04S
| 11-C                     END
|    C*
| 12-C           DCL04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCL04E
| 12-C                     END
|    C*
| 13-C           DCL04S    IFGT DCL04E
|   C                     SETON                     656699
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 13-C                     END
|    C   99                GOTO END100
|    C*
|    C                     SETON                     88
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETOF                     88
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*分店
|   C*          D#ROW     IFEQ 10
|   C*          D#COL     ANDGE36
|   C*          D#COL     ANDLE40
|   C*                    CALL 'SWD003'
|   C*                    PARM           DCL01
|   C*                    PARM 'C1'      CL02
|   C*                    PARM           DCL04S
|   C*                    GOTO ENDF4
|   C*                    END
|   C*
|   C*          D#ROW     IFEQ 10
|   C*          D#COL     ANDGE46
|   C*          D#COL     ANDLE50
|   C*                    CALL 'SWD003'
|   C*                    PARM           DCL01
|   C*                    PARM 'C1'      CL02    2
|   C*                    PARM           DCL04E
|   C*                    GOTO ENDF4
|   C*                    END
|   C*
| 02-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE36
|   C           D#COL     ANDLE37
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
      *===============================================================*
     C/COPY HBP2CVTR
