     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H* PROGRAM NAME : PUR0600                                       *
     H* AUTHER       : DEREK                                         *
     H* CREATE DATE  : 2012/11/27                                    *
     H* UPDATE DATE  :                                               *
     H* SYSTEM       :                                               *
     H* SUBSYSTEM    :採購系統                                     *
     H* REMARK       :驗收月報表                                   *
     H****************************************************************
     FSCWK040 IP  E           K        DISK
     F            CM0                               KRENAMECM0R
     FSCWK04  O   E           K        DISK
     I*----------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DCL01
     I                                      603 604 DDOC
     I                                      605 6100DCL07S
     I                                      611 6160DCL07E
     I                                      617 617 DATA
     I                                      618 622 DCM02S
     I                                      623 627 DCM02E
     I                                      628 632 DCL04S
     I                                      633 637 DCL04E
     I                                      641 6480DATES
     I                                      651 6580DATEE
     IDA02        DS
     I                                        1   43DUTY
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN010
     C*
     C           CM07      IFEQ 0
|    C                     CALL 'MCC0021'
|    C                     PARM           CM01             公司別
|    C                     PARM           CL02             通路別
|    C                     PARM           CM03             產品代號
|    C                     PARM           CL07             到貨運日期
|    C                     PARM           WTX18   82       單價
     C*
     C                     Z-ADDWTX18     CM07             單價
|    C           CM06      MULT CM07      WAMT   110H
|    C                     Z-ADDWAMT      CM08             金額
|    C           CM08      MULT DUTY      WTAX    90H
|    C                     Z-ADDWTAX      CM09             稅額
     C                     ENDIF
     C*
     C                     WRITECM0
     C*==============================================================*
01===C           RTN010    BEGSR
|    C           *NAMVAR   DEFN           DA02             稅率REFLIB
|    C                     IN   DA02
|    C                     SETON                     10
01===C                     ENDSR
     C*==============================================================*
