      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PUR0612                                       *
      * AUTHER       : A1492  TERRY                                  *
      * CREATE DATE  : 2012/01/12                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :採購單彙總表                                 *
      ****************************************************************
     FSCWK251 IP  E           K        DISK
     FPUR061P1O   E             39     PRINTER
     I*----------------------------------------------------------------
     IW251
     I                                              W25102L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DCH01
     I                                      603 604 DCH02S
     I                                      605 606 DCH02E
     I                                      607 611 DCH07S
     I                                      612 616 DCH07E
     I                                      617 621 DCH06S
     I                                      622 626 DCH06E
     I                                      627 635 DCI03S
     I                                      636 644 DCI03E
     I                                      645 6500DCD03S
     I                                      651 6560DCD03E
     I                                      657 6620DCH08S
     I                                      663 6680DCH08E
     I                                      669 669 DPRTTP
     I                                      670 6770DATE3S
     I                                      678 6850DATE3E
     I                                      686 6930DATE8S
     I                                      694 7010DATE8E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100
     C*
     CL1                   EXSR RTN110
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     1030
|    C                     CLEARPD2
|    C                     CLEARPD3
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....明細
      *==============================================================*
02===C           RTN100    BEGSR
|    C*
|    C                     ADD  W25106    D25106
|    C                     ADD  W25108    D25108
|    C                     ADD  W25109    D25109
|    C                     ADD  W25106    T25106
|    C                     ADD  W25108    T25108
|    C                     ADD  W25109    T25109
|    C*
|    C                     WRITEPD1
|    C                     CLEARPD1
|    C                     SETOF                     30
|    C*
|    C   39                EXSR RTN900
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN110....廠商合計
      *==============================================================*
03===C           RTN110    BEGSR
|    C*
|    C                     WRITEPD2
|    C                     CLEARPD2
|    C*
|    C                     SETON                     30
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
04===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     WRITEPH1
|    C*
|    C                     SETOF                     39
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
05===C           RTNLR     BEGSR
|    C*
|    C* GET公司名稱
| 01-C           *IN10     IFEQ '0'
|   C                     EXSR RTN010
|   C                     WRITEPE9
| 01*C                     ELSE
|   C                     WRITEPE3
|   C                     WRITEPD3
| 01-C                     END
|     *
|    C                     WRITEPE2
|    C*
05===C                     ENDSR
