      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PUR0401                                       *
      * AUTHER       : A1491  EASON                                  *
      * CREATE DATE  : 97/10/30                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :運費總表                                     *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
      ****************************************************************
     FPOCKPF  IF  E           K        DISK
     FMANBPF  IF  E           K        DISK
     FSCWK06  UF  E           K        DISK                      A
      *
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DCK01
     I                                      605 609 DCK08S
     I                                      610 614 DCK08E
     I                                      620 6250DCK03S
     I                                      626 6310DCK03E
     I                                      641 6480DATES
     I                                      651 6580DATEE
     I                                      660 660 DCK09S
     I                                      661 661 DCK09E
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWK     KLIST
     C                     KFLD           CK01
     C                     KFLD           CK08
     C                     KFLD           CK03
     C                     KFLD           CK07
     C                     KFLD           CK09
     C                     KFLD           CK10
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C                     EXSR RTN100
     C                     EXSR RTN200
      *
     C                     SETON                     LR
      *
      *==============================================================*
      *          RTN100....DETAIL
      *==============================================================*
01===C           RTN100    BEGSR
|     *
|    C           *LOVAL    SETLLCK0
|    C                     READ CK0                      46
| 01-C           *IN46     DOWEQ'0'
|    *
|   C           KEYWK     CHAINWK0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     ADD  CK14      WK06
|   C                     UPDATWK0
| 02*C                     ELSE
|   C                     MOVELCK01      WK01
|   C*
|   C                     MOVELCK08      WK02
|   C                     MOVEL*BLANK    WK021
|   C           CK08      CHAINMANBPF               41
|   C  N41                MOVELNB03      WK021
|   C*
|   C                     Z-ADDCK03      WK03
|   C                     MOVELCK07      WK04
|   C                     MOVELCK09      WK05
|   C                     MOVELCK10      WK051
|   C                     Z-ADDCK14      WK06
|   C                     WRITEWK0
| 02-C                     ENDIF
|   C*
|   C                     READ CK0                      46
| 01-C                     ENDDO
|     *
|     *
01===C                     ENDSR
      *==============================================================*
      *          RTN200....
      *==============================================================*
02===C           RTN200    BEGSR
|     *
|    C           *LOVAL    SETLLWK0
|    C                     READ WK0                      46
| 01-C           *IN46     DOWEQ'0'
|    *
|   C                     CALL 'GET006'
|   C                     PARM WK04      T006I1  1
|   C                     PARM WK05      T006I2  1
|   C                     PARM WK03      T006I3  80
|   C                     PARM           T006O1  40
|    *
| 02-C*          WK06      IFLT T006O1
|   C*                    Z-ADDT006O1    WK06
|   C*                    UPDATWK0
| 02-C*                    ENDIF
|    *
|   C                     READ WK0                      46
| 01-C                     ENDDO
|     *
02===C                     ENDSR
