      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PUR0502                                       *
      * AUTHER       : A1388  WIND                                   *
      * CREATE DATE  : 2008/11/03                                    *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :供應商負擔運費明細表                         *
      ****************************************************************
     FPOCKPF  IP  E           K        DISK
     FMANAPF  IF  E           K        DISK
     FMANBPF  IF  E           K        DISK
     FMANEPF  IF  E           K        DISK
     FSCWK061 O   E           K        DISK
     FSCWK062 O   E           K        DISK
     I*----------------------------------------------------------------
     ICK0
     I                                              CK01  L5
     I                                              CK08  L4
     I                                              CK04  L3
     I                                              CK09  L2
     I                                              CK10  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DCK01
     I                                      603 604 DDOC
     I                                      605 6100DCK03S
     I                                      611 6160DCK03E
     I                                      617 6170DATA
     I                                      618 622 DCK08S
     I                                      623 627 DCK08E
     I                                      628 628 DCK09S
     I                                      629 629 DCK09E
     I                                      631 6380DATES
     I                                      641 6480DATEE
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYNE     KLIST
     C                     KFLD           CK01
     C                     KFLD           CK02
     C                     KFLD           CK10
     C           KEY#B     KLIST
     C                     KFLD           CK01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     MOVELDCK01     W6200
     C*供應商
     C                     MOVELCK08      W6201
     C                     MOVEL*BLANK    W6202
     C           CK08      CHAINMANBPF               40
     C  N40                MOVELNB03      W6202
     C*
     C                     Z-ADDCK03      W6203
     C*分店貨運區碼
     C                     MOVELCK09      W6204
     C                     MOVEL*BLANK    W6205
     C           CK09      CHAINMANAPF               40
     C  N40                MOVELNA03      W6205     P
     C*分店
     C                     MOVELCK10      W6206
     C                     MOVEL*BLANK    W6207
     C           KEYNE     CHAINMANEPF               40
     C  N40                MOVELNE05      W6207     P
     C*
     C                     ADD  CK12      W6208            箱數
     C                     Z-ADDCK13      W6209            單價
     C                     ADD  CK14      HCK14            未稅金額
     C*
     CL1 10                EXSR RTNL1
     CL2 10                EXSR RTNL2
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     CLEARWK061
|    C                     CLEARWK062
|    C                     Z-ADD*ZERO     HCK14   60
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTNL1  ...該分店之當日運費
      *==============================================================*
02===C           RTNL1     BEGSR
|    C*
|    C*取最低運費
|    C                     CALL 'GET006'
|    C                     PARM           CK07
|    C                     PARM           CK09
|    C                     PARM           CK03
|    C                     PARM           T006O1  40
|    C*
| 01-C*          HCK14     IFLT T006O1
|   C*                    Z-ADDT006O1    HCK14
| 01-C*                    ENDIF
|    C                     ADD  HCK14     W6210
|    C*
| 02-C           DATA      IFEQ 2
|   C                     WRITEWK062
|   C                     Z-ADD*ZERO     W6208
|   C                     Z-ADD*ZERO     W6210
| 02-C                     ENDIF
|    C                     Z-ADD*ZERO     HCK14
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL2  ...到分店日期小計
      *==============================================================*
03===C           RTNL2     BEGSR
|    C*
| 01-C           DATA      IFEQ 1
     C                     MOVELW6200     W6100
|   C                     MOVELW6201     W6101
|   C                     MOVELW6202     W6102
|   C                     Z-ADDW6203     W6103
|   C                     MOVELW6204     W6104
|   C                     MOVELW6205     W6105
|   C                     Z-ADDW6208     W6106            箱數
|   C                     Z-ADDW6209     W6107            單價
|   C                     Z-ADDW6210     W6108            未稅金額
|   C                     WRITEWK061
|   C                     Z-ADD*ZERO     W6208
|   C                     Z-ADD*ZERO     W6210
|   C                     Z-ADD*ZERO     HCK14
| 01-C                     ENDIF
|    C*
03===C                     ENDSR
      *==============================================================*
