      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PUR040                                        *
      * AUTHER       : A1491  EASON                                  *
      * CREATE DATE  : 97/10/29                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :運費總表                                     *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
      ****************************************************************
     FPA#BPF  IF  E           K        DISK
     FPUR040D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
 @   I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DCK01
     I                                      605 609 DCK08S
     I                                      610 614 DCK08E
     I                                      620 6250DCK03S
     I                                      626 6310DCK03E
     I                                      641 6480DATES
     I                                      651 6580DATEE
     I                                      660 660 DCK09S
     I                                      661 661 DCK09E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*          KEYND     KLIST
     C*                    KFLD           DCL01
     C*                    KFLD           DCL02
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
     C*
  01-C           *IN03     DOUEQ'1'
    C           *IN99     OREQ '0'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEL*BLANK    DOWNL
  02-C           *IN03     IFEQ '0'
    C*  F4 PROMPT PROCESS *
  03-C           *IN04     IFEQ '1'
    C                     EXSR RTNF4
    C                     SETON                     99
    C                     ITER
  03-C                     ENDIF
    C*
    C                     EXSR RTN100                     .CHECK      ?
    C*  F7 DOWNLOAD*
  04-C           *IN99     IFEQ '0'
    C           *IN07     ANDEQ'1'
    C                     MOVEL'1'       DOWNL
    C                     SETON                     99
    C                     OUT  *NAMVAR
    C                     CALL 'PUR040C1'
    C                     IN   LDA
  04-C                     ENDIF
    C*
  02-C                     END
  01-C                     END
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C*                    MOVEL$USER     AUT     3
|    C*          AUT       IFNE 'D91'
|    C*          AUT       ANDNE'REP'
|    C*                    SETON                     31
|    C*                    END
|    C                     MOVE *BLANK    DCK01
|    C                     MOVE *BLANK    DCK09S
|    C                     MOVE *BLANK    DCK09E
|    C                     Z-ADD0         DCK03S
|    C                     Z-ADD0         DCK03E
|    C                     Z-ADD0         W6      60
|    C                     MOVEL'SCR001'  APPSCR  6
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DCK01     IFEQ *BLANKS
|   C                     SETON                     6099
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     MOVEL*BLANK    D#B03
| 01-C                     END
|    C   99                GOTO END100
|    C**公司別
|    C           DCK01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#B03      D#B03
| 02*C                     ELSE
|   C                     SETON                     6099
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 02-C                     END
|    C   99                GOTO END100
|    C**供應商代號
|     *
| 03-C           DCK08S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCK08S
| 03-C                     END
|    C*
| 04-C           DCK08E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCK08E
| 04-C                     END
|    C*
| 05-C           DCK08S    IFGT DCK08E
|   C                     SETON                     616299
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C**到分店日
| 06-C           DCK03S    IFEQ 0
|   C                     Z-ADD010192    DCK03S
| 06*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DCK03S    P0901I  60
|   C                     PARM           P0901O  1
| 07-C           P0901O    IFEQ 'N'
|   C                     SETON                     6399
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 07-C                     END
| 06-C                     END
|    C   99                GOTO END100
|    C*
| 08-C           DCK03E    IFEQ 0
|   C                     Z-ADD123129    DCK03E
| 08*C                     ELSE
|   C                     CALL 'P09'
|   C                     PARM DCK03E    P0901I  60
|   C                     PARM           P0901O  1
| 09-C           P0901O    IFEQ 'N'
|   C                     SETON                     6499
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 09-C                     END
| 08-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DCK03S    S001I2  60
|    C           W6        PARM           S001O1  60
|    C                     MOVE W6        HB2@F6  6
|    C                     EXSR HB@68L
|    C                     MOVE HB2@T8    DATES
|    C*
|    C                     CALL 'RES001'
|    C                     PARM 'MDY'     S001I1  3
|    C                     PARM DCK03E    S001I2  60
|    C           W6        PARM           S001O1  60
|    C                     MOVE W6        HB2@F6  6
|    C                     EXSR HB@68L
|    C                     MOVE HB2@T8    DATEE
|    C*
| 10-C           DATES     IFGT DATEE
|   C                     SETON                     636499
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 10-C                     END
|    C   99                GOTO END100
|    C**分店地區
|     *
| 11-C           DCK09S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCK09S
| 11-C                     END
|    C*
| 12-C           DCK09E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCK09E
| 12-C                     END
|    C*
| 13-C           DCK09S    IFGT DCK09E
|   C                     SETON                     656699
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 13-C                     END
|    C   99                GOTO END100
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*供應商
| 02-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'SWD002'
|   C                     PARM           DCK08S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 8
|   C           D#COL     ANDGE46
|   C           D#COL     ANDLE50
|   C                     CALL 'SWD002'
|   C                     PARM           DCK08E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*
| 04-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE38
|   C                     CALL 'SWD010'
|   C                     PARM           DCK09S
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE42
|   C           D#COL     ANDLE42
|   C                     CALL 'SWD010'
|   C                     PARM           DCK09E
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 06-C           D#ROW     IFEQ 18
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 06-C                     END
|   C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
     C/COPY HBP2CVTR
