      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PUR061                                        *
      * AUTHER       : A1492  TERRY                                  *
      * CREATE DATE  : 101/01/09                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                             *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :採購單彙總表                                 *
      ****************************************************************
     FPA#BPF  IF  E           K        DISK
     FPUR061D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DCH01
     I                                      603 604 DCH02S
     I                                      605 606 DCH02E
     I                                      607 611 DCH07S
     I                                      612 616 DCH07E
     I                                      617 621 DCH06S
     I                                      622 626 DCH06E
     I                                      627 635 DCI03S
     I                                      636 644 DCI03E
     I                                      645 6500DCD03S
     I                                      651 6560DCD03E
     I                                      657 6620DCH08S
     I                                      663 6680DCH08E
     I                                      669 669 DPRTTP
     I                                      670 6770DATE3S
     I                                      678 6850DATE3E
     I                                      686 6930DATE8S
     I                                      694 7010DATE8E
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C           *IN88     OREQ '1'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEL*BLANK    DOWNL
  02-C           *IN03     IFEQ '0'
    C*
  03-C           *IN04     CASEQ'1'       RTNF4
    C                     CAS            RTN100           .CHECK
  03-C                     ENDCS                                       ?
    C*  F7 DOWNLOAD*
  04-C           *IN99     IFEQ '0'
    C           *IN07     ANDEQ'1'
    C                     MOVEL'1'       DOWNL
     C                     EXSR OUTLDA
    C                     SETOF                     88
    C                     CALL 'PUR061C1'
  04-C                     ENDIF
  02-C                     ENDIF
  01-C                     ENDDO
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C*
|    C                     MOVE *BLANK    DCH01
|    C                     MOVEL*BLANK    DCH02S
|    C                     MOVEL*BLANK    DCH02E
|    C                     MOVEL*BLANK    DCH07S
|    C                     MOVEL*BLANK    DCH07E
|    C                     MOVEL*BLANK    DCH06S
|    C                     MOVEL*BLANK    DCH06E
|    C                     MOVEL*BLANK    DCI03S
|    C                     MOVEL*BLANK    DCI03E
|    C                     Z-ADD0         DCD03S
|    C                     Z-ADD0         DCD03E
|    C                     Z-ADD0         DCH08S
|    C                     Z-ADD0         DCH08E
|    C                     Z-ADD0         DATE3S  80
|    C                     Z-ADD0         DATE3E  80
|    C                     Z-ADD0         DATE8S  80
|    C                     Z-ADD0         DATE8E  80
|    C                     MOVEL'2'       DPRTTP
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DCH01     IFEQ *BLANKS
|   C                     SETON                     60  99
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     MOVEL*BLANK    D#B03
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C           DCH01     CHAINPA#BPF               40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#B03      D#B03
| 02*C                     ELSE
|   C                     SETON                     6099
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 02-C                     END
|    C   99                GOTO END100
|    C**通路代號
| 03-C           DCH02S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCH02S
| 03-C                     END
|    C*
| 04-C           DCH02E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCH02E
| 04-C                     END
|    C*
| 05-C           DCH02S    IFGT DCH02E
|   C                     SETON                     616299
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C**分店代號
| 06-C           DCH07S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCH07S
| 06-C                     END
|    C*
| 07-C           DCH07E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCH07E
| 07-C                     END
|    C*
| 08-C           DCH07S    IFGT DCH07E
|   C                     SETON                     636499
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 08-C                     END
|    C   99                GOTO END100
|    C*
|    C**供應商代號
| 09-C           DCH06S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCH06S
| 09-C                     END
|    C*
| 10-C           DCH06E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCH06E
| 10-C                     END
|    C*
| 11-C           DCH06S    IFGT DCH06E
|   C                     SETON                     656699
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 11-C                     END
|    C   99                GOTO END100
|    C*
|    C**產品代號
| 12-C           DCI03S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DCI03S
| 12-C                     END
|    C*
| 13-C           DCI03E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DCI03E
| 13-C                     END
|    C*
| 14-C           DCI03S    IFGT DCI03E
|   C                     SETON                     676899
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 14-C                     END
|    C   99                GOTO END100
|    C*
|    C**訂貨日期
| 15-C           DCD03S    IFEQ 0
|   C                     Z-ADD010192    DCD03S
| 15*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DCD03S    P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 16-C           P3011O    IFEQ 'N'
|   C                     SETON                     69  99
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 16-C                     END
| 15-C                     END
|    C   99                GOTO END100
|    C*
| 17-C           DCD03E    IFEQ 0
|   C                     Z-ADD123129    DCD03E
| 17*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DCD03E    P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 18-C           P3011O    IFEQ 'N'
|   C                     SETON                     70  99
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 18-C                     END
| 17-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'P31'
|    C                     PARM DCD03S    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DATE3S    PARM           P3101O  80
|    C*
|    C                     CALL 'P31'
|    C                     PARM DCD03E    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DATE3E    PARM           P3101O  80
|    C*
| 19-C           DATE3S    IFGT DATE3E
|   C                     SETON                     697099
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 19-C                     END
|    C   99                GOTO END100
|    C*
|    C**到貨日期
| 20-C           DCH08S    IFEQ 0
|   C                     Z-ADD010192    DCH08S
| 20*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DCH08S    P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 21-C           P3011O    IFEQ 'N'
|   C                     SETON                     71  99
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 21-C                     END
| 20-C                     END
|    C   99                GOTO END100
|    C*
| 22-C           DCH08E    IFEQ 0
|   C                     Z-ADD123129    DCH08E
| 22*C                     ELSE
|   C                     CALL 'P30'
|   C                     PARM DCH08E    P3001I  80
|   C                     PARM '3'       P3002I  1
|   C                     PARM '1'       P3003I  1
|   C                     PARM           P3011O  1
| 23-C           P3011O    IFEQ 'N'
|   C                     SETON                     72  99
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 23-C                     END
| 22-C                     END
|    C   99                GOTO END100
|    C**
|    C                     CALL 'P31'
|    C                     PARM DCH08S    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DATE8S    PARM           P3101O  80
|    C*
|    C                     CALL 'P31'
|    C                     PARM DCH08E    P3101I  80
|    C                     PARM '3'       P3102I  1
|    C                     PARM '1'       P3103I  1
|    C                     PARM '2'       P3104I  1
|    C                     PARM '1'       P3105I  1
|    C           DATE8E    PARM           P3101O  80
|    C*
| 24-C           DATE8S    IFGT DATE8E
|   C                     SETON                     717299
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 24-C                     END
|    C   99                GOTO END100
|    C*
|    C                     SETON                     88
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C                     SETOF                     88
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*供應商代號
| 02-C           D#ROW     IFEQ 09
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE42
|   C                     CALL 'SWD002'
|   C                     PARM           DCH06S
|   C                     GOTO ENDF4
| 02-C                     END
|   C*
| 03-C           D#ROW     IFEQ 09
|   C           D#COL     ANDGE46
|   C           D#COL     ANDLE50
|   C                     CALL 'SWD002'
|   C                     PARM           DCH06E
|   C                     GOTO ENDF4
| 03-C                     END
|   C*產品
| 04-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE46
|   C                     CALL 'SWD005'
|   C                     PARM           DCH01
|   C                     PARM           DCI03S
|   C                     GOTO ENDF4
| 04-C                     END
|   C*
| 05-C           D#ROW     IFEQ 10
|   C           D#COL     ANDGE50
|   C           D#COL     ANDLE58
|   C                     CALL 'SWD005'
|   C                     PARM           DCH01
|   C                     PARM           DCI03E
|   C                     GOTO ENDF4
| 05-C                     END
|   C*
| 06-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE38
|   C           D#COL     ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 06-C                     END
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
      *===============================================================*
     C/COPY HBP2CVTR
