      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PUR0101                                       *
      * AUTHER       : A1491  EASON                                  *
      * CREATE DATE  : 97/10/30                                      *
      * UPDATE DATE  : 97/11/17                                      *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :採購系統                                     *
      * REMARK       :驗收彙總表                                   *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* 00A 101/03/29 DEREK 增加（產品歸屬）選項                   *
     A*---------------------------------------------------------------
      ****************************************************************
     FINTXTM  IP  E           K        DISK
 00A+FMANCPF  IF  E           K        DISK
     FSCWK05  UF  E           K        DISK                      A
      *
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      601 602 DCL01
     I                                      603 604 DCL02
     I                                      605 609 DCM02S
     I                                      610 614 DCM02E
     I                                      620 6250DCL07S
     I                                      626 6310DCL07E
     I                                      641 6480DATES
     I                                      651 6580DATEE
     I                                      659 659 DOPT
 00A+I                                      660 661 DNC09
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYWK     KLIST
     C                     KFLD           TX01
     C                     KFLD           TX27
     C                     KFLD           TX07
     C                     KFLD           TX06
     C                     KFLD           TX11
     C           KEYNC     KLIST                           MANCPF
     C                     KFLD           TX01             公司
     C                     KFLD           TX11             產品代號
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
      *
     C                     EXSR RTN100
      *
      *==============================================================*
      *          RTN100....DETAIL
      *==============================================================*
01===C           RTN100    BEGSR
|    C*
| 01-C           DOPT      IFEQ '2'
|   C           TX03      ANDEQ'B1'
|   C                     GOTO END1
| 01-C                     ENDIF
|    C*
| 02-C           DOPT      IFEQ '3'
|   C           TX03      ANDNE'B1'
|   C                     GOTO END1
| 02-C                     ENDIF
|    C*
|    C*00A+START (選取產品歸屬,空白表全選)
| 03-C           DNC09     IFNE *BLANK
|   C           KEYNC     CHAINNC0                  40
| 04-C           *IN40     IFEQ '0'
|   C           NC09      ANDNEDNC09
|   C                     GOTO END1
| 04-C                     ENDIF
| 03-C                     ENDIF
|    C*00A+END
|    C           KEYWK     CHAINWK0                  40
| 05-C           *IN40     IFEQ '0'
| 06-C           TX03      IFEQ 'B1'
|   C                     SUB  TX14      WK06
|   C                     SUB  TX15      WK07
|   C                     SUB  TX15      WK08
|   C                     SUB  TX19      WK10
|   C                     SUB  TX19A     WK11
| 06*C                     ELSE
|   C                     ADD  TX14      WK06
|   C                     ADD  TX15      WK07
|   C                     ADD  TX15      WK08
|   C                     ADD  TX19      WK10
|   C                     ADD  TX19A     WK11
| 06-C                     ENDIF
|   C                     UPDATWK0
| 05*C                     ELSE
|   C                     MOVELTX01      WK01
|   C                     MOVELTX27      WK02
|   C                     MOVELTX07      WK04
|   C                     MOVELTX11      WK05
|   C                     Z-ADDTX18      WK09
|   C                     Z-ADDTX06      WK15
| 07-C           TX03      IFNE 'B1'
|   C                     Z-ADDTX14      WK06
|   C                     Z-ADDTX14      WK07
|   C                     Z-ADDTX15      WK08
|   C                     Z-ADDTX19      WK10
|   C                     Z-ADDTX19A     WK11
| 07*C                     ELSE
|   C                     Z-SUBTX14      WK06
|   C                     Z-SUBTX14      WK07
|   C                     Z-SUBTX15      WK08
|   C                     Z-SUBTX19      WK10
|   C                     Z-SUBTX19A     WK11
| 07-C                     ENDIF
|   C                     WRITEWK0
| 05-C                     ENDIF
|    C           END1      TAG
|     *
01===C                     ENDSR
