     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : SEH0013                                    *
     H*    PROGRAM NAME :通路銷售資料批次處理                      *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/10/23                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :採購管理                                  *
     H****************************************************************
     FSCWK03  IF  E           K        DISK
     FC#EHPF  IF  E           K        DISK
     FSEHAPF  UF  E           K        DISK                      A
     FINTAPF  UF  E           K        DISK
     FINTBPF  UF  E           K        DISK
     E*---------------------------------------------------------------
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
      *
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      187 1920$WWW
     I                                      201 2080$EG8
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I                                      501 502 DHA01
     I                                      503 504 DHA02
     I                                      503 503 DHA02L
     I                                      510 5150WHA03
     I                                      520 5270WHA03S
     I                                      520 5250HA03S
     I                                      530 5370WHA03E
     I                                      530 5350HA03E
     I                                      540 544 HA041
     I                                      545 549 HA042
     I                                      550 554 HA043
     I                                      555 559 HA044
     I                                      560 564 HA045
     I                                      565 565 @A01
     I                                      600 6070WEH07
     I                                      610 6170WEH08
 00A+I                                      618 6250NHA03S
 00A+I                                      618 6230YMS
 00A+I                                      624 6250DDS
 00A+I                                      626 6330NHA03E
 00A+I                                      626 6310YME
 00A+I                                      632 6330DDE
     I            DS
     I*                                       1   80QHA03
     I                                        1   60QHA03M
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
      *
     C           KEYHA     KLIST
     C                     KFLD           HA01
     C                     KFLD           HA02
     C                     KFLD           HA03
     C                     KFLD           HA04
     C                     KFLD           HA05
      *
     C           KEYTA     KLIST
     C                     KFLD           HA01
     C                     KFLD           QHA03M
     C                     KFLD           HA05
      *
     C           KEYTB     KLIST
     C                     KFLD           HA01
     C                     KFLD           QHA03M
     C                     KFLD           HA02
     C                     KFLD           HA04
     C                     KFLD           HA05
 00A+ *
 00A+C           KEYWK     KLIST
 00A+C                     KFLD           DHA01
 00A+C                     KFLD           DHA02
 00A+C                     KFLD           WEH07
 00A+ *
 00A+C           KEYWK1    KLIST
 00A+C                     KFLD           DHA01
 00A+C                     KFLD           DHA02
      *
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
      *
      *產生銷售批次號碼
     C                     EXSR RTN010
      *
      *加入SEHAPF銷售檔BY SCWK03
     C                     EXSR RTN100
      *
      *重新計算庫存INTAPF,INTBPF BY SEHAPF
     C                     EXSR RTN200
      *
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010...產生銷售批次號碼
     C*==============================================================*
01===C           RTN010    BEGSR
|     *
|    C                     MOVEL*BLANK    DHA09  13
|     *
|    C                     CALL 'GET001'
|    C                     PARM DHA01     T001I1  2
|    C                     PARM 'S1'      T001I2  2
|    C                     PARM $WWW      T001I3  60       西元YYMMDD
|    C           DHA09     PARM           T001O1 13
|     *
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100...加入SEHAPF銷售檔BY SCWK03
     C*==============================================================*
02===C           RTN100    BEGSR
|     *
|00A-C*          *LOVAL    SETLLWK030
|00A-C*                    READ WK030                    46
|00A+C           KEYWK     SETLLWK030
|00A+C           KEYWK1    READEWK030                    46
| 01-C           *IN46     DOWEQ'0'
|00A+C           WK0303    ANDLEWHA03E
|    *
     C           HA041     IFNE *BLANK
     C           WK0304    ANDEQHA041
     C           HA042     ORNE *BLANK
     C           WK0304    ANDEQHA042
     C           HA043     ORNE *BLANK
     C           WK0304    ANDEQHA043
     C           HA044     ORNE *BLANK
     C           WK0304    ANDEQHA044
     C           HA045     ORNE *BLANK
     C           WK0304    ANDEQHA045
     C*
|   C                     MOVELWK0301    HA01
|   C                     MOVELWK0302    HA02
|   C                     Z-ADDWK0303    HA03
|   C*                    Z-ADDHA03      QHA03
|   C                     MOVELWK0304    HA04
|   C                     MOVELWK0305    HA05
|   C                     Z-ADDWK0306    HA06
|   C                     Z-ADDWK0307    HA07
|   C                     Z-ADDWK0308    HA08
|   C                     MOVELDHA09     HA09
|   C                     MOVEL*BLANK    HA10
|   C                     Z-ADD$EG8      HAVV
|   C                     MOVEL'SEH0013' HAWW      P
|   C                     Z-ADD$EG8      HAXX
|   C                     TIME           HAYY
|   C                     MOVEL$USER     HAZZ
|   C                     WRITEHA0
     C                     ENDIF
|    *
|   C*00A-                READ WK030                    46
|00A+C           KEYWK1    READEWK030                    46
| 01-C                     ENDDO
|     *
02===C                     ENDSR
     C*==============================================================*
     C*          RTN200...重新計算庫存INTAPF,INTBPF BY SEHAPF
     C*==============================================================*
03===C           RTN200    BEGSR
|    C*
|    C           DHA01     CHAINEH0                  40
|    C                     Z-ADDEH02      QHA03M
|     *
|00A-C*          *LOVAL    SETLLHA0
|00A-C*                    READ HA0                      46
|00A+C           KEYWK     SETLLHA0
|00A+C           KEYWK1    READEHA0                      46
| 01-C           *IN46     DOWEQ'0'
|00A+C           HA03      ANDLEWEH08
|    *
|   C           KEYTA     CHAINTA0                  40
| 02-C           *IN40     IFEQ '0'
| 03-C           HA06      IFGT 0
|   C                     ADD  HA06      TA16
| 03*C                     ELSE
|   C                     SUB  HA06      TA15             原負改存正值
| 03-C                     ENDIF
|   C                     MOVEL'SEH0013' TAWW      P
|   C                     Z-ADD$EG8      TAXX
|   C                     TIME           TAYY
|   C                     MOVEL$USER     TAZZ
|   C                     UPDATTA0
| 02-C                     ENDIF
|    *
|   C           KEYTB     CHAINTB0                  40
| 04-C           *IN40     IFEQ '0'
| 05-C           HA06      IFGT 0
|   C                     ADD  HA06      TB13
| 05*C                     ELSE
|   C                     SUB  HA06      TB12             原負改存正值
| 05-C                     ENDIF
|   C                     MOVEL'SEH0013' TBWW      P
|   C                     Z-ADD$EG8      TBXX
|   C                     TIME           TBYY
|   C                     MOVEL$USER     TBZZ
|   C                     UPDATTB0
| 04-C                     ENDIF
|    *
|   C                     MOVEL'P'       HA10
|   C                     UPDATHA0
|    *
|   C*00A-                READ HA0                      46
|00A+C           KEYWK1    READEHA0                      46
| 01-C                     ENDDO
|     *
03===C                     ENDSR
