     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : SEH0021                                    *
     H*    PROGRAM NAME :通路銷售資料確認                          *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/10/27                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :採購管理                                  *
     H****************************************************************
     FSEHAPF  IF  E           K        DISK
     FMANEPF  IF  E           K        DISK
     E*---------------------------------------------------------------
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
      *
     I           UDS
     I                                      101 110 $USER
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      201 2080$EG8
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
      *
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DHA01
     I                                      503 504 DHA02
     I                                      505 5100EH02
     I                                      510 5150SDATE
     I                                      520 5250EDATE
     I                                      530 5370WHA03S
     I                                      540 5470WHA03E
     I            DS
     I                                        1   80TDATE
     I                                        1   60T01
     I                                        7   80T02
     I            DS
     I                                        1   80WDATE
     I                                        1   60W01
     I                                        7   80W02
      *
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN           PTDA01
     C*==============================================================*
     C*                    *ENTRY PLIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C                     PARM           @A01    1
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
      *
     C           KEYHA     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C                     KFLD           DHA03
     C                     KFLD           NE03
      *
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
      *
     C  N10                EXSR RTN010
      *
      *檢核SEHAPF銷售檔銷售分店
     C                     EXSR RTN100
      *
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010...初始
     C*==============================================================*
01===C           RTN010    BEGSR
|     *
|    C                     Z-ADD0         ADATE   80
|    C                     Z-ADD0         BDATE   80
|    C                     Z-ADD0         DHA03   80
|    C                     Z-ADD0         QQ      40
     C                     Z-ADDWHA03S    TDATE
     C                     Z-ADDWHA03E    WDATE
|     *
|    C                     SETON                     10
|     *
     C                     Z-ADDTDATE     ADATE
     C                     EXSR RTN31A
     C                     Z-ADDBDATE     SDATE
     C                     Z-ADDWDATE     ADATE
     C                     EXSR RTN31A
     C                     Z-ADDBDATE     EDATE
|     *
01===C                     ENDSR
     C*==============================================================*
     C*          RTN100...檢核SEHAPF銷售檔銷售分店
     C*==============================================================*
02===C           RTN100    BEGSR
|     *
|     *
     C                     EXSR RTN201
|     *
|    C           *LOVAL    SETLLNE0
|    C                     READ NE0                      47
| 01-C           *IN47     DOWEQ'0'
|    *
     C                     Z-ADDHA03      HA03
| 02-C           0         DO   DCNT      QQ
|   C                     EXSR RTN037
|    *
|   C           KEYHA     SETLLHA0
|   C           KEYHA     READEHA0                      46
| 03-C           *IN46     IFEQ '1'
|    *
|   C                     MOVEL'1'       @A01
|   C                     GOTO ETN100
|    *
| 03-C                     ENDIF
| 02-C                     ENDDO
|    *
|   C                     READ NE0                      47
| 01-C                     ENDDO
|     *
|     *
02===C           ETN100    ENDSR
     C*==============================================================*
     C*          RTN31A....CALL P31
     C*==============================================================*
61===C           RTN31A    BEGSR
|     *
|    C                     CALL 'P31'
|    C                     PARM ADATE     P31I1   80
|    C                     PARM '2'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '3'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           BDATE     PARM           P31IO   80
|     *
61===C                     ENDSR
     C*==============================================================*
     C*          RTN037...計算日期
     C*==============================================================*
03===C           RTN037    BEGSR
|     *
|    C                     CALL 'P37'
|    C                     PARM TDATE     P3701I  80
|    C                     PARM '2'       P3702I  1
|    C                     PARM '1'       P3703I  1
|    C                     PARM QQ        P3704I  40
|    C                     PARM           P3711O  80
|     *
|    C                     Z-ADDP3711O    DHA03
|     *
03===C                     ENDSR
     C*==============================================================*
     C*          RTN201.. 計算相距日數
     C*==============================================================*
04===C           RTN201    BEGSR
|     *
|    C                     CALL 'P32'
|    C                     PARM WHA03S    P3201I  80
|    C                     PARM WHA03E    P3202I  80
|    C                     PARM '2'       P3203I  1
|    C                     PARM '1'       P3204I  1
|    C                     PARM           P3211O  90
     C                     Z-ADDP3211O    DCNT    40
|     *
04===C                     ENDSR
