     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : SEH002                                     *
     H*    PROGRAM NAME :通路銷售資料確認                          *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/10/27                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :採購管理                                  *
     H****************************************************************
     FPA#BPF  IF  E           K        DISK
     FC#EHPF  IF  E           K        DISK
     FMANDPF  UF  E           K        DISK
     FSEHAPF  UF  E           K        DISK
     FSEH002D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I            DS
     I                                        1  13 HA09
     I                                        5   90HA09D
     I                                       10  130HA09S
     I            DS
     I                                        1   80HA03
     I                                        4   80HA035
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$DATE
     I                                      203 2080DDATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      173 176 $COR
     I                                      187 192 $WWW
     I                                      201 2080$A8YMD
     I                                      201 2080$EG8
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DHA01
     I                                      503 504 DHA02
     I                                      505 5100EH02
     I                                      530 5370EH07
     I                                      540 5470EH08
     I                                      550 550 @K01
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C*          *ENTRY    PLIST
     C*          *IN03     PARM *IN03     IN03    1
     C*          *IN10     PARM *IN10     IN10    1
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYND     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C           KEYHA     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C                     KFLD           EH07
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   10                EXSR R0200                      *INIT MSG.
     C  N10                EXSR R0100                      *INIT VALUE
     C*
     C                     MOVEL*BLANK    @PRT    1        *PRINT
  01-C           *IN03     DOUEQ'1'
    C           @PRT      OREQ 'Y'
    C                     EXSR R1000                      *SCRN
  01-C                     END
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C*
|    C                     SETON                     1027
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVEL*BLANK    DHA01
|    C                     MOVEL*BLANK    DHA02
|    C                     Z-ADD0         DHA03
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R0200 ....INITIAL VALUE
     C*==============================================================*
02===CSR         R0200     BEGSR
|    C*
|    C                     IN   LDA
|     *
| 01-C           $DATA     IFEQ 'N'
|   C                     MOVEL'ERR0100' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     99
|   C                     GOTO E0200
| 01-C                     END
|     *
| 02-C           $DATA     IFEQ 'Y'
|   C                     MOVEL'MSG0002' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     99
|   C                     GOTO E0200
| 02-C                     END
|     *
|    C                     SETON                     2799  報表格式MESSAGE
|    C*
02===C           E0200     ENDSR
     C*===============================================================*
     C*          R1000  ...SCREEN MAIN PROCESS
     C*===============================================================*
03===C           R1000     BEGSR
|    C*
|    C                     EXFMTDSPD1
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD*ZERO     #LIN
|    C                     Z-ADD*ZERO     #COL
|    C*
| 01-C           *IN03     IFEQ '1'
|   C                     GOTO E1000
| 01-C                     END
|    C*
| 02-C           *IN04     IFEQ '1'
|   C                     EXSR R1E00                      .PROMPT
|   C                     GOTO E1000
| 02-C                     END
|    C*
|    C                     EXSR R1B00                      .CHECK      ?
|    C*
| 03-C           *IN99     IFEQ *ZERO
|   C           *IN14     ANDEQ'1'
|    *
|   C                     EXSR R1D00
|    *
|   C           KEYND     CHAINND0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVEL'R'       ND22
|   C                     MOVEL'SEH002'  NDWW
|   C                     Z-ADD$EG8      NDXX
|   C                     TIME           NDYY
|   C                     MOVEL$USER     NDZZ
|   C                     UPDATND0
| 04-C                     ENDIF
|    *
|   C                     SETOF                     27
|   C                     SETON                     28    .執行中
|   C                     WRITEDSPD1
|   C                     SETOF                     28
|   C*
|   C                     OUT  LDA
|   C                     MOVEL'Y'       @PRT
| 03-C                     END
|    C*
03===C           E1000     ENDSR
     C*===============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
04===C           R1B00     BEGSR
|    C*
|    C* << CHACK 公司別NOT *BLANK >>
| 01-C           DHA01     IFEQ *BLANK
|   C                     MOVEL*BLANK    HA01N
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C   99                GOTO E1B00
|     *
|    C           DHA01     CHAIN#B0                  40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    HA01N
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6199
| 02*C                     ELSE
|   C                     MOVEL#B03      HA01N
| 02-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C*通路代號
| 03-C           DHA02     IFEQ *BLANK
|   C                     MOVEL*BLANK    HA02N
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 03-C                     END
|    C   99                GOTO E1B00
|     *
|    C           KEYND     CHAINND0                  40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    HA02N
|   C                     MOVEL'ERR0019' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 04*C                     ELSE
|   C                     MOVELND04      HA02N
|    *
| 05-C           ND22      IFEQ 'R'
|   C                     MOVEL'ERR0095' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     99
| 05-C                     END
|   C   99                GOTO E1B00
|    *
| 04-C                     END
|    C   99                GOTO E1B00
|     *
|    C           DHA01     CHAINEH0                  40
| 06-C           *IN40     IFEQ '0'
|   C                     CALL 'P39'
|   C                     PARM EH02      P3901I  60
|   C                     PARM '2'       P3902I  1
|   C                     PARM '1'       P3903I  1
|   C                     PARM '3'       P3904I  1
|   C                     PARM '1'       P3905I  1
|   C           DHA03     PARM           P3911O  60
|    *
| 06*C                     ELSE
|   C                     Z-ADD0         DHA03
|   C                     MOVEL'ERR0049' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6199
| 06-C                     END
|    C   99                GOTO E1B00
|     *'R'表示銷售已確認(FOR月結)，'Y'表示已確認本月銷售資料
|    C*(SEHAPF)，但未做銷售確認。
| 07-C           ND22      IFEQ 'Y'
|   C                     GOTO E1B00
| 07-C                     ENDIF
|     *
|    C                     OUT  LDA
|    C                     CALL 'SEH002C1'
|    C                     PARM ' '       @A01    1
|    C                     IN   LDA
| 08-C           @K01      IFEQ '1'
|   C                     MOVEL'ERR0097' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     99
| 08-C                     END
|    C   99                GOTO E1B00
|    C*          @K01      IFEQ ' '
|    C*                    MOVEL'ERR0100' ERRID
|    C*                    MOVEL'SCMF'    ERRF
|    C*                    SETON                     99
|    C*                    END
|    C*  99                GOTO E1B00
|     *
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
04===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1D00 ....UPDAT DATA
     C*==============================================================*
05===C           R1D00     BEGSR
|    C*
|    C                     Z-ADD0         TPHA3   80
|    C                     MOVEL*BLANK    TPHA4   5
|    C                     MOVEL*BLANK    TPHA5   9
|    C                     MOVEL*BLANK    TPHA9  13
|    C                     Z-ADD0         CNT     40
|    C*
|    C           KEYHA     SETLLHA0
|    C                     READ HA0                      41
| 01-C           *IN41     DOWEQ'0'
|   C*
| 02-C           HA03      IFGT EH08
|   C                     LEAVE
| 02-C                     ENDIF
|   C*
| 03-C*          HA03      IFNE TPHA3
|   C*          HA04      ORNE TPHA4
|   C*          HA05      ORNE TPHA5
| 04-C           HA03      IFNE TPHA3
|   C                     Z-ADD0         CNT
| 04-C                     ENDIF
|   C                     Z-ADDHA035     HA09D
|   C                     ADD  1         CNT
|   C                     Z-ADDCNT       HA09S
|   C                     MOVELHA09      TPHA9
|   C                     Z-ADDHA03      TPHA3
|   C*                    MOVELHA04      TPHA4
|   C*                    MOVELHA05      TPHA5
| 03-C*                    ENDIF
|   C*
|   C                     MOVELTPHA9     HA09
|   C                     UPDATHA0
|   C*
|   C                     READ HA0                      41
| 01-C                     ENDDO
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
06===C           R1E00     BEGSR
|    C*
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C*
|    C*          #LIN      IFEQ 7
|    C*          #COL      ANDGE46
|    C*          #COL      ANDLE52
|    C*                    CALL 'PYI512'
|    C*          DEM041    PARM DEM041    I512I1  7         部門代碼
|    C*                    PARM           @RTNC   2          FUN KEY
|    C*                    END
|    C*
06===C           E1E00     ENDSR
     C*==============================================================*
