     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : SER0502                                    *
     H*    PROGRAM NAME :通路銷售明細表                          *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/10/28                                   *
     H*    UPDATE DATE  : 101/01/04 A1492 TERRY 增加產品歸屬       *
     H*    SYSTEM       :採購管理                                  *
     H****************************************************************
     FSCWK071 IP  E           K        DISK
     FMANDPF  IF  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FSER050P O   E             39     PRINTER
     E*---------------------------------------------------------------
     I*WK07
     I*                                              W701  L2
     I*                                              W703  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      550 550 @K01
     I                                      601 602 DHA01
     I                                      603 604 DHA02
     I                                      605 6100DHA03S
     I                                      611 6160DHA03E
     I                                      617 617 DATA
     I                                      618 622 DHA04S
     I                                      623 627 DHA04E
     I                                      628 628 DNC10S
     I                                      629 629 DNC10E
     I                                      630 631 DNC11S
     I                                      632 633 DNC11E
     I                                      634 635 DNC18S
     I                                      636 637 DNC18E
     I                                      641 6480DATES
     I                                      651 6580DATEE
     I                                      661 6680WHA03S
     I                                      671 6780WHA03E
     I                                      681 689 DHA05S
     I                                      691 699 DHA05E
     I                                      701 702 DNC12S
     I                                      703 704 DNC12E
TERRYI                                      705 706 DNC09
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYND     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C           KEY#B     KLIST
     C                     KFLD           DHA01
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C   39                EXSR RTN900
     C*
     C*                    ADD  W705      Q1
     C*                    ADD  W706      Q2
     C                     ADD  W703      Q3
     C                     ADD  W704      Q4
     C*
     C*L1 10                EXSR RTNL1
     C*L2 10                EXSR RTNL2
     C                     EXSR RTNL1
     CLR 10                EXSR RTNL3
     CLR                   EXSR RTNLR
     C*==============================================================*
     C*          RTN010....GET HEADING
     C*==============================================================*
01===C           RTN010    BEGSR
|    C* GET公司別
|    C                     MOVEL*BLANK    D#B03
|    C           KEY#B     CHAINPA#BPF               40
|    C  N40                MOVEL#B03      D#B03
|    C                     MOVEL*BLANK    DND04
|    C           KEYND     CHAINMANDPF               40
|    C  N40                MOVELND04      DND04
|    C                     WRITEPH1
|    C                     SETOF                     39
|    C                     SETON                     10
|    C                     SETON                     303132
|    C*
|    C*                    Z-ADD*ZERO     Q1
|    C*                    Z-ADD*ZERO     Q2
|    C                     Z-ADD*ZERO     Q3
|    C                     Z-ADD*ZERO     Q4
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTNL1 ....產品合計
      *==============================================================*
02===C           RTNL1     BEGSR
|    C*
|    C                     WRITEPD1
     C                     SETOF                     30
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNL2 ....識別合計
      *==============================================================*
02===C*          RTNL2     BEGSR
|    C*
|    C*                    SETON                     30
|    C*                    WRITEPD2
|    C*
|    C*                    Z-ADD*ZERO     Q1
|    C*                    Z-ADD*ZERO     Q2
|    C*
02===C*                    ENDSR
      *==============================================================*
      *          RTNL3 ....總計
      *==============================================================*
02===C           RTNL3     BEGSR
|    C*
|    C                     SETON                     30
|    C                     WRITEPD3
|    C*
|    C*                    Z-ADD*ZERO     Q1
|    C*                    Z-ADD*ZERO     Q2
|    C*                    Z-ADD*ZERO     Q3
|    C*                    Z-ADD*ZERO     Q4
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN900....OVERFLOW
      *==============================================================*
02===C           RTN900    BEGSR
|    C*
|    C                     WRITEPE1
|    C                     MOVEL*BLANK    D#B03
|    C           KEY#B     CHAINPA#BPF               40
|    C  N40                MOVEL#B03      D#B03
|    C                     MOVEL*BLANK    DND04
|    C           KEYND     CHAINMANDPF               40
|    C  N40                MOVELND04      DND04
|    C                     WRITEPH1
|    C*
|    C                     SETON                     303132
|    C                     SETOF                     39
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTNLR ....(NO DATA)
      *==============================================================*
03===C           RTNLR     BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|    C                     MOVEL*BLANK    D#B03
|    C           KEY#B     CHAINPA#BPF               40
|    C  N40                MOVEL#B03      D#B03
|    C                     MOVEL*BLANK    DND04
|    C           KEYND     CHAINMANDPF               40
|    C  N40                MOVELND04      DND04
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01-C                     END
|    C                     WRITEPE2
|    C*
03===C                     ENDSR
