     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : SER0503                                    *
     H*    PROGRAM NAME :通路銷售明細表                          *
     H*    AUTHOR       : A1388 WIND                                 *
     H*    CREATE DATE  : 97/11/21                                   *
     H*    UPDATE DATE  : 101/01/04 A1492 TERRY 增加產品歸屬       *
     H*    SYSTEM       :採購管理                                  *
     H****************************************************************
     FSEHAPF  IF  E                    DISK
     FMANCPF  IF  E           K        DISK
     FSCWK071 UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      598 5990$PRTID
     I                                      550 550 @K01
     I                                      601 602 DHA01
     I                                      603 604 DHA02
     I                                      605 6100DHA03S
     I                                      611 6160DHA03E
     I                                      617 617 DATA
     I                                      618 622 DHA04S
     I                                      623 627 DHA04E
     I                                      628 628 DNC10S
     I                                      629 629 DNC10E
     I                                      630 631 DNC11S
     I                                      632 633 DNC11E
     I                                      634 635 DNC18S
     I                                      636 637 DNC18E
     I                                      641 6480DATES
     I                                      651 6580DATEE
     I                                      661 6680WHA03S
     I                                      671 6780WHA03E
     I                                      681 689 DHA05S
     I                                      691 699 DHA05E
     I                                      701 702 DNC12S
     I                                      703 704 DNC12E
TERRYI                                      705 706 DNC09
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYND     KLIST
     C                     KFLD           HA01
     C                     KFLD           HA05
     C           KEYW7     KLIST
     C                     KFLD           HA05
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C*
     C                     MOVEL*BLANK    HHA05   9
     C                     SETOF                     40
     C*
     C                     READ SEHAPF                   40
  01-C           *IN40     DOWEQ'0'
    C*
    C           KEYND     CHAINMANCPF               41
  02-C           *IN41     IFEQ '1'
    C                     GOTO S1
  02-C                     ENDIF
    C*
    C           DNC10S    IFNE *BLANK
    C           NC10      ANDLTDNC10S
    C                     GOTO S1
  02-C                     ENDIF
    C*
    C           DNC10E    IFNE *BLANK
    C           NC10      ANDGTDNC10E
    C                     GOTO S1
  02-C                     ENDIF
    C*
    C           DNC11S    IFNE *BLANK
    C           NC11      ANDLTDNC11S
    C                     GOTO S1
  02-C                     ENDIF
    C*
    C           DNC11E    IFNE *BLANK
    C           NC11      ANDGTDNC11E
    C                     GOTO S1
  02-C                     ENDIF
    C*
    C           DNC18S    IFNE *BLANK
    C           NC18      ANDLTDNC18S
    C                     GOTO S1
  02-C                     ENDIF
    C*
    C           DNC18E    IFNE *BLANK
    C           NC18      ANDGTDNC18E
    C                     GOTO S1
  02-C                     ENDIF
    C*
    C           DNC12S    IFNE *BLANK
    C           NC12      ANDLTDNC12S
    C                     GOTO S1
  02-C                     ENDIF
    C*
    C           DNC12E    IFNE *BLANK
    C           NC12      ANDGTDNC12E
    C                     GOTO S1
  02-C                     ENDIF
    C*
TERRYC           DNC09     IFNE *BLANK
|    C           NC09      ANDNEDNC09
|    C                     GOTO S1
TERRYC                     ENDIF
    C*
    C           HA05      IFEQ HHA05
    C*
    C           KEYW7     CHAINSCWK071              42
  04-C           *IN42     IFEQ '0'
    C                     ADD  HA06      W703
    C                     ADD  HA08      W704
    C                     UPDATWK07
  04-C                     ENDIF
    C*
  03*C                     ELSE
    C           KEYW7     CHAINSCWK071              42
  05-C           *IN42     IFEQ '1'
    C                     EXSR R1000
    C                     MOVELHA05      HHA05
    C                     Z-ADDHA06      W703
    C                     Z-ADDHA08      W704
    C                     WRITEWK07
  05-C                     ENDIF
    C*
  03-C                     ENDIF
    C*
    C           S1        TAG
    C                     READ SEHAPF                   40
  01-C                     ENDDO
     C*
     C                     SETON                     LR
     C*==============================================================*
      *          R1000
      *==============================================================*
01===C           R1000     BEGSR
|    C*
|    C                     MOVELHA05      W701
|    C                     MOVELNC05      W702
|    C*
01===C                     ENDSR
      *==============================================================*
