     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM-ID   : SER0301                                    *
     H*    PROGRAM NAME :銷貨收入分店彙總表                        *
     H*    AUTHOR       : A1388 WIND                                 *
     H*    CREATE DATE  : 97/11/06                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :銷售管理                                  *
     H****************************************************************
     FPA#BPF  IF  E           K        DISK
     FC#EHPF  IF  E           K        DISK
     FMANDPF  IF  E           K        DISK
     FSER030D CF  E                    WORKSTN      KINFDS DSPFDS
     E*---------------------------------------------------------------*
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*DATA AREA
     IPTDA01      DS
     I                                        1   1 DFMT
     I                                        2   2 DTYPE
     I*LOCAL DATA AREA
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$DATE
     I                                      125 1270$CPY
     I                                      138 138 $INQ
     I                                      141 141 $RMK03
     I                                      152 161 $USERN
     I                                      162 1620$EVR
     I                                      173 176 $COR
     I                                      201 2080$A8YMD
     I                                      203 2080DDATE
     I                                      217 218 $PRTCD
     I                                      219 219 $PENV
     I                                      500 500 $DATA
     I                                      598 5990$PRTID
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      550 550 @K01
     I                                      601 602 DHA01
     I                                      603 604 DHA02
     I                                      605 6100DHA03S
     I                                      611 6160DHA03E
     I                                      617 617 DATA
     I                                      618 622 DHA04S
     I                                      623 627 DHA04E
     I                                      628 629 DNC09S
     I                                      630 631 DNC09E
     I                                      641 6480DATES
     I                                      651 6580DATEE
     I                                      661 6680WHA03S
     I                                      671 6780WHA03E
     I                                      679 680 DNC12S
     I                                      681 682 DNC12E
     I                                      683 683 DNC10S
     I                                      684 684 DNC10E
     I                                      685 686 DNC11S
     I                                      687 688 DNC11E
     I                                      689 690 DNC18S
     I                                      691 692 DNC18E
     I            DS
     I                                        1   80SHA03
     I                                        1   60SHA03Y
     I                                        7   80SHA03D
     I            DS
     I                                        1   80EHA03
     I                                        1   60EHA03Y
     I                                        7   80EHA03D
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYND     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N97N98             EXSR R0100                      .INIT SCREEN
     C*
  01-C           *IN03     DOUEQ'1'
    C           *IN88     OREQ '1'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
  02-C           *IN03     IFEQ '0'
    C*
  03-C           *IN04     CASEQ'1'       R1E00
    C                     CAS            R1B00                        ?
  03-C                     ENDCS
    C*  F7 DOWNLOAD*
  04-C           *IN99     IFEQ '0'
    C           *IN07     ANDEQ'1'
    C                     CALL 'SER0302C'
    C                     SETOF                     88
  04-C                     ENDIF
  02-C                     ENDIF
  01-C                     ENDDO
     C*
     C                     OUT  *NAMVAR
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*==============================================================*
     C*          R0100 ....SCREEN INIT VALUE SET
     C*==============================================================*
01===CSR         R0100     BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C                     Z-ADD2         $EVR
|    C                     MOVEL$USER     AUT     3
|    C                     SETON                     1027
|    C* SCREEN INIT VALUE SET *+++++++++++++++++++++++++++++++++++++++
|    C                     MOVEL*BLANK    DHA01
|    C                     MOVEL*BLANK    DHA02
|    C                     MOVEL*BLANK    D#B03
|    C                     MOVEL*BLANK    DND04
|    C                     MOVEL*BLANK    DHA04S
|    C                     MOVEL*BLANK    DHA04E
|    C                     Z-ADD0         DHA03S
|    C                     Z-ADD0         DHA03E
|    C                     MOVEL*BLANK    DNC09S
|    C                     MOVEL*BLANK    DNC09E
|    C                     Z-ADD0         WDATE   80
|    C                     Z-ADD0         TDATE   80
|    C                     Z-ADD0         SHA03
|    C                     Z-ADD0         EHA03
|    C                     Z-ADD0         DATES   80
|    C                     Z-ADD0         DATEE   80
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
01===C                     ENDSR
     C*==============================================================*
     C*          R1B00  ...CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
02===C           R1B00     BEGSR
|    C*
|    C* << CHACK 公司別NOT *BLANK >>
| 01-C           DHA01     IFEQ *BLANK
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6199
| 01-C                     END
|    C   99                GOTO E1B00
|     *
|    C           DHA01     CHAINPA#BPF               40
| 02-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6199
| 02*C                     ELSE
|   C                     MOVEL#B03      D#B03
| 02-C                     END
|    C   99                GOTO E1B00
|     *通路
| 03-C           DHA02     IFEQ *BLANK
|   C                     MOVEL*BLANK    DND04
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 03-C                     END
|    C   99                GOTO E1B00
|     *
|    C           KEYND     CHAINMANDPF               40
| 04-C           *IN40     IFEQ '1'
|   C                     MOVEL*BLANK    DND04
|   C                     MOVEL'ERR0019' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6299
| 04*C                     ELSE
|   C                     MOVELND04      DND04
| 04-C                     END
|    C   99                GOTO E1B00
|    C*
|    C**分店代號
| 05-C           DHA04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DHA04S    P
| 05-C                     END
|    C*
| 06-C           DHA04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DHA04E    P
| 06-C                     END
|    C*
| 07-C           DHA04S    IFGT DHA04E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     636499
| 07-C                     END
|    C   99                GOTO E1B00
|    C*
|    C*+<<DATA CHECK>>+++++++++++++++++++++++++++++++++++++++++++++++++
|     *
|    C           DHA01     CHAINC#EHPF               40
| 08-C           *IN40     IFEQ '1'
|   C                     MOVEL'ERR0049' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6599
| 08-C                     END
|    C   99                GOTO E1B00
|     *
|    C*銷售日期
| 09-C           DHA03S    IFEQ *ZERO
|   C                     Z-ADDEH07      WDATE
|   C                     EXSR RTN31A
|   C                     Z-ADDTDATE     DHA03S
|    *
|   C                     Z-ADDEH08      WDATE
|   C                     EXSR RTN31A
|   C                     Z-ADDTDATE     DHA03E
| 09-C                     END
|    C   99                GOTO E1B00
|     *
|    C                     CALL 'P30'
|    C                     PARM DHA03S    P3001I  80
|    C                     PARM '3'       P3002I  1
|    C                     PARM '1'       P3003I  1
|    C                     PARM           P3011O  1
| 11-C           P3011O    IFEQ 'N'
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6599
| 11-C                     END
|    C   99                GOTO E1B00
|     *
|    C                     CALL 'P30'
|    C                     PARM DHA03E    P3001I  80
|    C                     PARM '3'       P3002I  1
|    C                     PARM '1'       P3003I  1
|    C                     PARM           P3011O  1
| 12-C           P3011O    IFEQ 'N'
|   C                     MOVEL'ERR0004' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6699
| 12-C                     END
|    C   99                GOTO E1B00
|     *
|    C                     Z-ADDDHA03E    WDATE
|    C                     EXSR RTN31B
| 13-C           TDATE     IFGT EH08
|   C                     MOVEL'ERR0098' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6699
| 13-C                     END
|    C   99                GOTO E1B00
|     *
|    C                     Z-ADDDHA03S    WDATE
|    C                     EXSR RTN31B
|    C                     Z-ADDTDATE     WHA03S
|    C                     Z-ADDDHA03E    WDATE
|    C                     EXSR RTN31B
|    C                     Z-ADDTDATE     WHA03E
| 14-C           WHA03S    IFGT WHA03E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     656699
| 14-C                     END
|    C   99                GOTO E1B00
|     *
|    C*產品歸屬
| 15-C           DNC09S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DNC09S
| 15-C                     END
|    C*
| 16-C           DNC09E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DNC09E
| 16-C                     END
| 15-C           DNC10S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DNC10S
| 15-C                     END
|    C*
| 16-C           DNC10E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DNC10E
| 16-C                     END
| 15-C           DNC11S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DNC11S
| 15-C                     END
|    C*
| 16-C           DNC11E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DNC11E
| 16-C                     END
| 15-C           DNC12S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DNC12S
| 15-C                     END
|    C*
| 16-C           DNC12E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DNC12E
| 16-C                     END
| 15-C           DNC18S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DNC18S
| 15-C                     END
|    C*
| 16-C           DNC18E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DNC18E
| 16-C                     END
|    C*
| 17-C           DNC09S    IFGT DNC09E
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     676899
| 17-C                     END
|    C   99                GOTO E1B00
|    C*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
|    C*
|    C                     SETON                     88
02===CSR         E1B00     ENDSR
     C*==============================================================*
     C*          R1E00 ....欄位查詢 (PF04 : CALL SUB-PROGRAM)
     C*==============================================================*
03===C           R1E00     BEGSR
|    C*
|    C                     SETOF                     88
|    C           #CSR      DIV  256       #LIN             *LINE
|    C                     MVR            #COL             *COLUMN
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*          #LIN      IFEQ 7
|   C*          #COL      ANDGE46
|   C*          #COL      ANDLE52
|   C*                    CALL 'PYI512'
|   C*          DEM041    PARM DEM041    I512I1  7         部門代碼
|   C*                    PARM           @RTNC   2          FUN KEY
|   C*                    END
|   C*
| 02-C           #LIN      IFEQ 8
|   C           #COL      ANDGE39
|   C           #COL      ANDLE43
|   C                     CALL 'SWD003'
|   C                     PARM DHA01     P101I1  2        *代碼欄位
|   C                     PARM DHA02     P102I1  2        *代碼欄位
|   C           DHA04S    PARM DHA04S    P103I1  5        *代碼欄位
|   C                     GOTO E1E00
| 02-C                     END
|   C*
| 03-C           #LIN      IFEQ 8
|   C           #COL      ANDGE47
|   C           #COL      ANDLE51
|   C                     CALL 'SWD003'
|   C                     PARM DHA01     P101I1  2        *代碼欄位
|   C                     PARM DHA02     P102I1  2        *代碼欄位
|   C           DHA04E    PARM DHA04E    P103I1  5        *代碼欄位
|   C                     GOTO E1E00
| 03-C                     END
|   C*
| 04-C           #LIN      IFEQ 11
|   C           #COL      ANDGE39
|   C           #COL      ANDLE40
|   C                     CALL 'SWD001'
|   C                     PARM 'GUISHU'  PARMI1  8
|   C           DNC09S    PARM DNC09S    PARMO1 10
|   C                     GOTO E1E00
| 04-C                     END
|   C*
| 05-C           #LIN      IFEQ 11
|   C           #COL      ANDGE44
|   C           #COL      ANDLE45
|   C                     CALL 'SWD001'
|   C                     PARM 'GUISHU'  PARMI1  8
|   C           DNC09E    PARM DNC09E    PARMO1 10
|   C                     GOTO E1E00
| 05-C                     END
|   C*
| 06-C           #LIN      IFEQ 12
|   C           #COL      ANDGE39
|   C           #COL      ANDLE40
|   C                     CALL 'SWD001'
|   C                     PARM 'BRAND'   PARMI1
|   C           DNC12S    PARM DNC12S    PARMO1
|   C                     GOTO E1E00
| 06-C                     END
|   C**
| 07-C           #LIN      IFEQ 12
|   C           #COL      ANDGE44
|   C           #COL      ANDLE45
|   C                     CALL 'SWD001'
|   C                     PARM 'BRAND'   PARMI1
|   C           DNC12E    PARM DNC12E    PARMO1
|   C                     GOTO E1E00
| 07-C                     END
|   C*
| 08-C           #LIN      IFEQ 13
|   C           #COL      ANDGE39
|   C           #COL      ANDLE39
|   C                     CALL 'SWD001'
|   C                     PARM 'ID'      PARMI1  8        *代碼欄位
|   C           DNC10S    PARM DNC10S    PARMO1 10        *代碼欄位
|   C                     GOTO E1E00
| 08-C                     END
|   C*
| 09-C           #LIN      IFEQ 13
|   C           #COL      ANDGE44
|   C           #COL      ANDLE44
|   C                     CALL 'SWD001'
|   C                     PARM 'ID'      PARMI1  8        *代碼欄位
|   C           DNC10E    PARM DNC10E    PARMO1 10        *代碼欄位
|   C                     GOTO E1E00
| 09-C                     END
|   C*
| 10-C           #LIN      IFEQ 14
|   C           #COL      ANDGE39
|   C           #COL      ANDLE40
|   C                     CALL 'SWD001'
|   C                     PARM 'GROUP'   PARMI1  8        *代碼欄位
|   C           DNC11S    PARM DNC11S    PARMO1 10        *代碼欄位
|   C                     GOTO E1E00
| 10-C                     END
|   C*
| 11-C           #LIN      IFEQ 14
|   C           #COL      ANDGE44
|   C           #COL      ANDLE45
|   C                     CALL 'SWD001'
|   C                     PARM 'GROUP'   PARMI1  8        *代碼欄位
|   C           DNC11E    PARM DNC11E    PARMO1 10        *代碼欄位
|   C                     GOTO E1E00
| 11-C                     END
|   C*
| 12-C           #LIN      IFEQ 15
|   C           #COL      ANDGE39
|   C           #COL      ANDLE40
|   C                     CALL 'SWD001'
|   C                     PARM 'PLACE'   PARMI1  8        *代碼欄位
|   C           DNC18S    PARM DNC18S    PARMO1 10        *代碼欄位
|   C                     GOTO E1E00
| 12-C                     END
|   C*
| 13-C           #LIN      IFEQ 15
|   C           #COL      ANDGE44
|   C           #COL      ANDLE45
|   C                     CALL 'SWD001'
|   C                     PARM 'PLACE'   PARMI1  8        *代碼欄位
|   C           DNC18E    PARM DNC18E    PARMO1 10        *代碼欄位
|   C                     GOTO E1E00
| 13-C                     END
|   C*
| 14-C           #LIN      IFEQ 19
|   C           #COL      ANDGE38
|   C           #COL      ANDLE39
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO E1E00
| 14-C                     END
|   C*
| 01-C                     END
|    C*
03===C           E1E00     ENDSR
     C*==============================================================*
     C*          RTN31A....CALL P31
     C*==============================================================*
04===C           RTN31A    BEGSR
|     *
|    C                     CALL 'P31'
|    C                     PARM WDATE     P31I1   80
|    C                     PARM '2'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '3'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           TDATE     PARM           P31IO   80
|     *
04===C                     ENDSR
     C*==============================================================*
     C*          RTN31B....CALL P31
     C*==============================================================*
05===C           RTN31B    BEGSR
|     *
|    C                     CALL 'P31'
|    C                     PARM WDATE     P31I1   80
|    C                     PARM '3'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '2'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           TDATE     PARM           P31IO   80
|     *
05===C                     ENDSR
