      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : SER0103                                       *
      * AUTHER       : A1491  EASON                                  *
      * CREATE DATE  : 97/10/27                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :                                               *
      * REMARK       :通路無銷售資料異常表                         *
      ****************************************************************
     FSCWKPF  IP  E           K        DISK
     FPA#BPF  IF  E           K        DISK
     FMANDPF  IF  E           K        DISK
     FMANEPF  IF  E           K        DISK
     FSCWK16  O   E           K        DISK
     FSER010P O   E             39     PRINTER
      *
     IWK0
     I                                              WK03  L1
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      501 502 DHA01
     I                                      503 504 DHA02
     I                                      510 5150DHA03S
     I                                      520 5250DHA03E
     I*
      *
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
      *
     C           KEYND     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
      *
     C           KEYNE     KLIST
     C                     KFLD           DHA01
     C                     KFLD           DHA02
     C                     KFLD           WK04
      *
      *==============================================================*
      *                    DEFN ROUTINE
      *==============================================================*
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C                     EXSR RTN100                                 L
     C*
     CL1 10                EXSR RTN800
     CLR                   EXSR RTN888
      *==============================================================*
      *          RTN010....CHECK HEADING
      *==============================================================*
01===C           RTN010    BEGSR
|    C***
     C                     MOVELDHA01     W1601
|    C           DHA01     CHAIN#B0                  40
|    C   40                MOVEL*BLANK    D#B03
|    C  N40                MOVEL#B03      D#B03
|    C***
|    C           KEYND     CHAINND0                  40
|    C   40                MOVEL*BLANK    DND04
|    C  N40                MOVELND04      DND04
|    C*
|    C                     WRITEPH1
|    C                     SETON                     38  10
|    C                     SETOF                         39
|    C                     Z-ADD0         TOTAL
|    C                     Z-ADD0         WDATE   80
|    C                     Z-ADD0         TDATE   80
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN100....READE DETAIL
      *==============================================================*
02===C           RTN100    BEGSR
|     *
| 01-C           *IN39     IFEQ '1'
|   C                     WRITEPH1
|   C                     SETOF                     39
| 01-C                     ENDIF
|     *
|    C                     Z-ADDWK03      WDATE
|    C                     EXSR RTN31A
|    C                     Z-ADDTDATE     SHA03
|    C                     MOVELWK04      NE03
|    C           KEYNE     CHAINNE0                  40
|    C   40                MOVEL*BLANK    DNE05
|    C  N40                MOVELNE05      DNE05
|     *
     C                     Z-ADDWK03      W1602
     C                     MOVELNE03      W1603
     C                     MOVELDNE05     W1604
     C                     WRITEW16
|     *
|    C                     WRITEPD1
|     *(CLEAR DETAIL)
|    C                     SETOF                     38
|    C                     ADD  1         TOTAL
|     *
02===C                     ENDSR
      *==============================================================*
      *          RTN800....--L1
      *==============================================================*
03===C           RTN800    BEGSR
|    C*
|    C                     WRITEPE1                        *印合計
|    C*(合計）
|    C                     Z-ADD0         TOTAL
|    C                     SETON                     38
|    C*
03===C                     ENDSR
      *==============================================================*
      *          RTN888....--LR
      *==============================================================*
04===C           RTN888    BEGSR
|    C*
| 01-C           *IN10     IFEQ '0'
|   C                     WRITEPH1
|   C                     WRITEPE3
| 01*C                     ELSE
|   C*
|   C                     WRITEPE2
| 01-C                     END
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RTN31A....CALL P31
     C*==============================================================*
05===C           RTN31A    BEGSR
|     *
|    C                     CALL 'P31'
|    C                     PARM WDATE     P31I1   80
|    C                     PARM '2'       P3112   1
|    C                     PARM '1'       P31I3   1
|    C                     PARM '3'       P31I4   1
|    C                     PARM '1'       P31I5   1
|    C           TDATE     PARM           P31IO   80
|     *
05===C                     ENDSR
