     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   : KIS0061                                    *
     H*    PROGRAM NAME :茂世產品匯總表(後台)                    *
     H*    AUTHOR       : A1491 EASON                                *
     H*    CREATE DATE  : 97/03/26                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                          *
     H****************************************************************
     FINTNLF04UF  E           K        DISK
     FPOCMPF  IF  E           K        DISK
     FC#EKPF  IF  E           K        DISK
     FINTBPF  UF  E           K        DISK
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      139 139 $RMK01
     I                                      201 2080$A8YMD
     I*
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYCM     KLIST
     C                     KFLD           TN09
     C                     KFLD           TN03
     C                     KFLD           TN05
     C           KEYCM1    KLIST
     C                     KFLD           XTN09
     C                     KFLD           XTN03
     C                     KFLD           XTN05
     C           KEYTB     KLIST
     C                     KFLD           TN01
     C                     KFLD           EK02
     C                     KFLD           TN02
     C                     KFLD           TN04
     C                     KFLD           TN05
     C           KEYTB1    KLIST
     C                     KFLD           XTN01
     C                     KFLD           EK02
     C                     KFLD           XTN02
     C                     KFLD           XTN04
     C                     KFLD           XTN05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100                      .MAIN
      *
     C                     EXSR R0200                      .MAIN
      *
     C                     Z-ADDCOUNT     COUNT
      *
     C                     SETON                     LR
     C*==============================================================*
     C*                    R0100 ... DEL 原本的資料
     C*==============================================================*
01===C           R0100     BEGSR
|     *
|    C           *LOCK     IN   *NAMVAR
|     *
|    C                     SETON                     10
|     *
01===C                     ENDSR
     C*==============================================================*
     C*                    R0200 ... INIT PROCESS
     C*==============================================================*
02===C           R0200     BEGSR
|     *
|    C                     MOVEL*BLANK    XTN01   2
|    C                     MOVEL*BLANK    XTN02   2
|    C                     MOVEL*BLANK    XTN03   5
|    C                     MOVEL*BLANK    XTN04   5
|    C                     MOVEL*BLANK    XTN05   9
|    C                     MOVEL*BLANK    XTN09  13
|    C                     Z-ADD0         XTN07   60
|    C                     MOVEL*BLANK    WTN09  13
|    C                     MOVEL*BLANK    WTN05   9
|    C                     Z-ADD*ZERO     WTNVV   80
|    C                     Z-ADD*ZERO     COUNT   80
|    C                     MOVEL'N'       DCHK    1
|     *
|    C           *LOVAL    SETLLTN0
|    C                     READ TN0                      46
|     *
| 01-C           *IN46     IFEQ '0'
|   C                     MOVELTN09      WTN09
|   C                     MOVELTN05      WTN05
|   C                     Z-ADDTNVV      WTNVV
| 01-C                     ENDIF
|     *
| 02-C           *IN46     DOWEQ'0'
|    *
| 03-C           TN09      IFEQ WTN09
|   C           TN05      ANDEQWTN05
|   C           TNVV      ANDGTWTNVV
|    *
|   C           KEYCM     CHAINCM0                  40
| 04-C           *IN40     IFEQ '0'
|    *
|   C           TN01      SETLLEK0
|   C           TN01      READEEK0                      47
| 05-C           *IN47     DOWEQ'0'
|    *
| 06-C           CM16      IFLE EK08
|   C           CM16      ANDGEEK07
|    *
|   C           KEYTB     CHAINTB0                  41
| 07-C           *IN41     IFEQ '0'
|   C                     SUB  TN07      TB16
|   C                     UPDATTB0
|   C*                    LEAVE
| 07-C                     ENDIF
|    *
| 06-C                     ENDIF
|    *
|   C           TN01      READEEK0                      47
| 05-C                     ENDDO
|    *
| 04-C                     ENDIF
|    *
|   C                     MOVELTN01      XTN01   2
|   C                     MOVELTN02      XTN02   2
|   C                     MOVELTN03      XTN03   5
|   C                     MOVELTN04      XTN04   5
|   C                     MOVELTN05      XTN05   9
|   C                     MOVELTN09      XTN09  13
|   C                     Z-ADDTN07      XTN07   60
|    *
|   C                     DELETTN0
|    *
|   C                     MOVEL'Y'       DCHK
|    *
|   C                     ADD  1         COUNT
| 03-C                     ENDIF
|    *
| 08-C           TN09      IFNE WTN09
|   C           TN05      ORNE WTN05
|   C                     MOVELTN09      WTN09
|   C                     MOVELTN05      WTN05
|   C                     Z-ADDTNVV      WTNVV
|    *
| 09-C           DCHK      IFEQ 'Y'
|   C                     EXSR R0300
|   C                     MOVEL'N'       DCHK
| 09-C                     ENDIF
|    *
| 08-C                     ENDIF
|    *
|   C                     READ TN0                      46
| 02-C                     ENDDO
|     *
| 10-C           DCHK      IFEQ 'Y'
|   C                     EXSR R0300
| 10-C                     ENDIF
|     *
02===C                     ENDSR
     C*==============================================================*
     C*                    R0300 ... DEL 原本的資料
     C*==============================================================*
03===C           R0300     BEGSR
|     *
|    C           KEYCM1    CHAINCM0                  40
| 01-C           *IN40     IFEQ '0'
|    *
|   C           XTN01     SETLLEK0
|   C           XTN01     READEEK0                      47
| 02-C           *IN47     DOWEQ'0'
|    *
| 03-C           CM16      IFLE EK08
|   C           CM16      ANDGEEK07
|    *
|   C           KEYTB1    CHAINTB0                  41
| 04-C           *IN41     IFEQ '0'
|   C                     ADD  XTN07     TB16
|   C                     UPDATTB0
|   C*                    LEAVE
| 04-C                     ENDIF
|    *
| 03-C                     ENDIF
|    *
|   C           XTN01     READEEK0                      47
| 02-C                     ENDDO
|    *
| 01-C                     ENDIF
|     *
03===C                     ENDSR
