     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   :                                            *
     H*    PROGRAM NAME :                                            *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  :                                            *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                          *
     H****************************************************************
     FINTNPF  IP  E           K        DISK
     FINTAPF  UF  E           K        DISK                      A
     FINTBPF  UF  E           K        DISK                      A
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     I*
     I            DS
     I                                        1  10 TAZZ
     I            DS
     I                                        1  10 TBZZ
     I            DS
     I                                        1  10 TNZZ
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYTA     KLIST
     C                     KFLD           TN01
     C                     KFLD           DTA02
     C                     KFLD           TN05
     C           KEYTB     KLIST
     C                     KFLD           TN01
     C                     KFLD           DTA02
     C                     KFLD           TN02
     C                     KFLD           TN04
     C                     KFLD           TN05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100                      .MAIN
     C                     EXSR R0200                      .MAIN
     C*==============================================================*
     C*                    R0100 ...
     C*==============================================================*
01===C           R0100     BEGSR
|     *
     C                     Z-ADD200912    DTA02   60
|    C                     SETON                     10
|     *
01===C                     ENDSR
     C*==============================================================*
     C*                    R0200 ...
     C*==============================================================*
02===C           R0200     BEGSR
|     *
     C           KEYTB     CHAINTB0                  40
     C           *IN40     IFEQ '0'
     C                     ADD  TN07      TB17
     C                     UPDATTB0
     C                     ELSE
     C                     MOVELTN01      TB01
     C                     Z-ADDDTA02     TB02
     C                     MOVELTN02      TB03
     C                     MOVELTN04      TB04
     C                     MOVELTN05      TB05
     C                     Z-ADD0         TB06
     C                     Z-ADD0         TB07
     C                     Z-ADD0         TB08
     C                     Z-ADD0         TB09
     C                     Z-ADD0         TB10
     C                     Z-ADD0         TB11
     C                     Z-ADD0         TB12
     C                     Z-ADD0         TB13
     C                     Z-ADD0         TB14
     C                     Z-ADD0         TB15
     C                     Z-ADD0         TB16
     C                     Z-ADDTN07      TB17
     C                     Z-ADD0         TB18
     C                     MOVEL'EASON'   TBZZ
     C                     WRITETB0
     C                     ENDIF
|     *
     C           KEYTA     CHAINTA0                  40
     C           *IN40     IFEQ '0'
     C                     ADD  TN07      TA18
     C                     UPDATTA0
     C                     ELSE
     C                     MOVELTN01      TA01
     C                     Z-ADDDTA02     TA02
     C                     MOVELTN05      TA03
     C                     Z-ADD0         TA04
     C                     Z-ADD0         TA05
     C                     Z-ADD0         TA06
     C                     Z-ADD0         TA07
     C                     Z-ADD0         TA08
     C                     Z-ADD0         TA09
     C                     Z-ADD0         TA10
     C                     Z-ADD0         TA11
     C                     Z-ADD0         TA12
     C                     Z-ADD0         TA13
     C                     Z-ADD0         TA14
     C                     Z-ADD0         TA15
     C                     Z-ADD0         TA16
     C                     Z-ADD0         TA17
     C                     Z-ADDTN07      TA18
     C                     Z-ADD0         TA19
     C                     MOVEL'EASON'   TAZZ
     C                     WRITETA0
     C                     ENDIF
|     *
02===C                     ENDSR
