     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H*    PROGRAM-ID   :                                            *
     H*    PROGRAM NAME :                                            *
     H*    AUTHOR       :                                            *
     H*    CREATE DATE  :                                            *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :                                          *
     H****************************************************************
     FINTAPF  UF  E           K        DISK
     FINTAPFX IF  E           K        DISK
     FINTBPF  UF  E           K        DISK                      A
     FINTBPFX IF  E           K        DISK
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     I*
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C*
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYTA     KLIST
     C                     KFLD           TX01
     C                     KFLD           XTA02
     C                     KFLD           TX03
     C           KEYTB     KLIST
     C                     KFLD           TY01
     C                     KFLD           XTA02
     C                     KFLD           TY03
     C                     KFLD           TY04
     C                     KFLD           TY05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100                      .MAIN
     C                     EXSR R0200                      .MAIN
     C                     SETON                     LR
     C*==============================================================*
     C*                    R0100 ...
     C*==============================================================*
01===C           R0100     BEGSR
|     *
|    C                     SETON                     10
|    C                     Z-ADD201001    XTA02   60
|     *
01===C                     ENDSR
     C*==============================================================*
     C*                    R0200 ...
     C*==============================================================*
02===C           R0200     BEGSR
|     *
|    C           *LOVAL    SETLLTY0
|    C                     READ TY0                      46
| 01-C           *IN46     DOWEQ'0'
|   C           KEYTB     CHAINTB0                  40
| 02-C           *IN40     IFEQ '0'
|   C                     Z-ADDTY06      TB06
|   C                     Z-ADDTY17      TB17
|   C                     UPDATTB0
| 02*C                     ELSE
|   C                     MOVELTY01      TB01
|   C                     Z-ADDXTA02     TB02
|   C                     MOVELTY03      TB03
|   C                     MOVELTY04      TB04
|   C                     MOVELTY05      TB05
|   C                     Z-ADDTY06      TB06
|   C                     Z-ADDTY17      TB17
|   C                     WRITETB0
| 02-C                     ENDIF
|   C                     READ TY0                      46
| 01-C                     ENDDO
|     *
|    C           *LOVAL    SETLLTX0
|    C                     READ TX0                      46
| 03-C           *IN46     DOWEQ'0'
|   C           KEYTA     CHAINTA0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     Z-ADDTX04      TA04
|   C                     Z-ADDTX05      TA05
|   C                     Z-ADDTX06      TA06
|   C                     Z-ADDTX18      TA18
|   C                     UPDATTA0
| 04-C                     ENDIF
|   C                     READ TX0                      46
| 03-C                     ENDDO
|     *
02===C                     ENDSR
