     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*                                                              *
     H****************************************************************
     FC#EXPF  IF  E           K        DISK
     FINTFPF  UF  E           K        DISK
     FINTGPF  UF  E           K        DISK
     FINTKPF  UF  E           K        DISK
     FINTNPF  UF  E           K        DISK
     FINTPPF  UF  E           K        DISK
     FMANBPF  UF  E           K        DISK
     FMANBWK  UF  E           K        DISK
     FMANCPF  UF  E           K        DISK
     FPOCAPF  UF  E           K        DISK
     FPOCCPF  UF  E           K        DISK
     FPOCEPF  UF  E           K        DISK
     FPOCGPF  UF  E           K        DISK
     FPOCHPF  UF  E           K        DISK
     FPOCIPF  UF  E           K        DISK
     FPOCKPF  UF  E           K        DISK
     FPOCMPF  UF  E           K        DISK
     FPOCOPF  UF  E           K        DISK
     E*---------------------------------------------------------------
     E*---------------------------------------------------------------
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      139 139 $RMK01
     I                                      201 2080$A8YMD
     I*
     I*
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
      *
     C                     EXSR R0200                      .MAIN
      *
     C                     SETON                     LR
     C*==============================================================*
     C*                    R0200 ... INIT PROCESS
     C*==============================================================*
02===C           R0200     BEGSR
|     *
     C           *LOVAL    SETLLTF0
     C                     READ TF0                      46
     C           *IN46     DOWEQ'0'
     C           TF02      CHAINEX0                  40
     C  N40                MOVELEX02      TF02
     C  N40                UPDATTF0
     C                     READ TF0                      46
     C                     ENDDO
|     *
     C           *LOVAL    SETLLTG0
     C                     READ TG0                      46
     C           *IN46     DOWEQ'0'
     C           TG06      CHAINEX0                  40
     C  N40                MOVELEX02      TG06
     C  N40                UPDATTG0
     C                     READ TG0                      46
     C                     ENDDO
|     *
     C           *LOVAL    SETLLTK0
     C                     READ TK0                      46
     C           *IN46     DOWEQ'0'
     C           TK06      CHAINEX0                  40
     C  N40                MOVELEX02      TK06
     C  N40                UPDATTK0
     C                     READ TK0                      46
     C                     ENDDO
|     *
     C           *LOVAL    SETLLTN0
     C                     READ TN0                      46
     C           *IN46     DOWEQ'0'
     C           TN03      CHAINEX0                  40
     C  N40                MOVELEX02      TN03
     C  N40                UPDATTN0
     C                     READ TN0                      46
     C                     ENDDO
|     *
     C           *LOVAL    SETLLTP0
     C                     READ TP0                      46
     C           *IN46     DOWEQ'0'
     C           TP13      CHAINEX0                  40
     C  N40                MOVELEX02      TP13
     C  N40                UPDATTP0
     C                     READ TP0                      46
     C                     ENDDO
|     *
     C           *LOVAL    SETLLNB0
     C                     READ NB0                      46
     C           *IN46     DOWEQ'0'
     C           NB01      CHAINEX0                  40
     C  N40                MOVELEX02      NB01
     C  N40                UPDATNB0
     C                     READ NB0                      46
     C                     ENDDO
|     *
     C           *LOVAL    SETLLWNB0
     C                     READ WNB0                     46
     C           *IN46     DOWEQ'0'
     C           WNB01     CHAINEX0                  40
     C  N40                MOVELEX02      WNB01
     C  N40                UPDATWNB0
     C                     READ WNB0                     46
     C                     ENDDO
      *
     C           *LOVAL    SETLLNC0
     C                     READ NC0                      46
     C           *IN46     DOWEQ'0'
     C           NC03      CHAINEX0                  40
     C  N40                MOVELEX02      NC03
     C  N40                UPDATNC0
     C                     READ NC0                      46
     C                     ENDDO
      *
     C           *LOVAL    SETLLCA0
     C                     READ CA0                      46
     C           *IN46     DOWEQ'0'
     C           CA03      CHAINEX0                  40
     C  N40                MOVELEX02      CA03
     C  N40                UPDATCA0
     C                     READ CA0                      46
     C                     ENDDO
      *
     C           *LOVAL    SETLLCC0
     C                     READ CC0                      46
     C           *IN46     DOWEQ'0'
     C           CC03      CHAINEX0                  40
     C  N40                MOVELEX02      CC03
     C  N40                UPDATCC0
     C                     READ CC0                      46
     C                     ENDDO
      *
     C           *LOVAL    SETLLCE0
     C                     READ CE0                      46
     C           *IN46     DOWEQ'0'
     C           CE02      CHAINEX0                  40
     C  N40                MOVELEX02      CE02
     C  N40                UPDATCE0
     C                     READ CE0                      46
     C                     ENDDO
      *
     C           *LOVAL    SETLLCG0
     C                     READ CG0                      46
     C           *IN46     DOWEQ'0'
     C           CG02      CHAINEX0                  40
     C  N40                MOVELEX02      CG02
     C  N40                UPDATCG0
     C                     READ CG0                      46
     C                     ENDDO
      *
     C           *LOVAL    SETLLCH0
     C                     READ CH0                      46
     C           *IN46     DOWEQ'0'
     C           CH06      CHAINEX0                  40
     C  N40                MOVELEX02      CH06
     C  N40                UPDATCH0
     C                     READ CH0                      46
     C                     ENDDO
      *
     C           *LOVAL    SETLLCI0
     C                     READ CI0                      46
     C           *IN46     DOWEQ'0'
     C           CI02      CHAINEX0                  40
     C  N40                MOVELEX02      CI02
     C  N40                UPDATCI0
     C                     READ CI0                      46
     C                     ENDDO
      *
     C           *LOVAL    SETLLCK0
     C                     READ CK0                      46
     C           *IN46     DOWEQ'0'
     C           CK08      CHAINEX0                  40
     C  N40                MOVELEX02      CK08
     C  N40                UPDATCK0
     C                     READ CK0                      46
     C                     ENDDO
      *
     C           *LOVAL    SETLLCM0
     C                     READ CM0                      46
     C           *IN46     DOWEQ'0'
     C           CM02      CHAINEX0                  40
     C  N40                MOVELEX02      CM02
     C  N40                UPDATCM0
     C                     READ CM0                      46
     C                     ENDDO
      *
     C           *LOVAL    SETLLCO0
     C                     READ CO0                      46
     C           *IN46     DOWEQ'0'
     C           CO02      CHAINEX0                  40
     C  N40                MOVELEX02      CO02
     C  N40                UPDATCO0
     C                     READ CO0                      46
     C                     ENDDO
|     *
03===C                     ENDSR
