     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     H*
     H*    PROGRAM ID   : VOU0012
     H*    PROGRAM NAME : 銷售傳票批次
     H*    AUTHOR       : A1492 TERRY
     H*    CREATE DATE  : 2009.01.16
     H*    UPDATE DATE  : 2010.03.08 修改傳票科目
     H*    SYSTEM       : 進銷存收TO總帳
     H*===============================================================
     H* MODI CODE     DATE     DESCRIPTION
     H*---------------------------------------------------------------
     A*---------------------------------------------------------------
     A* before Compiler :
     A* OVRDBF   FILE(WFJR1012) TOFILE(*LIBL/WFJR10PF)   明細
     F****************************************************************
     FWFJR10PFUF  E           K        DISK                      A
     FWFJR10LFIF  E           K        DISK
     F            WFJR10R                           KRENAMEWFJR10L
     FWFJR1012UF  E           K        DISK                      A
     F            WFJR10R                           KRENAMEWFJR10A
     FP@JAPF  UF  E           K        DISK                      A
     FSEHAPF  IF  E           K        DISK
     FINTAPF  IF  E           K        DISK
     FINTPLF01IF  E           K        DISK
     FINTQLF01IF  E           K        DISK
     FC#EELF01IF  E           K        DISK
     FPOCCLF02IF  E           K        DISK
     FMANCPF  IF  E           K        DISK
     FGLAAPF  IF  E           K        DISK
     FGLAFPF  IF  E           K        DISK
     FGLAHPF  O   E           K        DISK
     FWFJR11PFO   E           K        DISK
     FWFJR12PFO   E           K        DISK
     E*---------------------------------------------------------------*
     E*輸入欄位代碼 ... EX.( 10 )=>AH05A
     E                    CHK1        7  2
     E*輸入欄位內容 ... EX.( R&D )=>AH05
     E                    CHK2        4 20
     E*輸入欄位說明 EX.(研發部)=>CALL 檢核程式&AA04得之.
     E                    CHK3        7 20
     IWFJR10A
     I              JR1001                          JR01A
     I              JR1003                          JR03A
     ISDS        SDS
     I                                     *PROGRAM APPPGM
     I*CURSOR POSTITON
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I*LOCAL DATA AREA
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$ADMDY
     I                                      187 1920$ADYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      152 161 $USERN
     I                                      201 2080ADYYMD
     I                                      609 6140F02YM
     I                                      609 6160F02
     I*檢核程式之參數.....................................
     ICHKPGM      DS
     I                                        1   2 AH01
     I                                        3  22 WPARM1
     I                                       23  32 WPARM2
     I                                       33  33 WCHK
     I            DS
     I                                        1   80HA03
     I                                        1   60HAYYMM
     I            DS
     I                                        1   5 HA04
     I                                        3   4 @HA04
     I            DS
     I                                        1   80KCC07
     I                                        1   40KCC07Y
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN AH03      WAH03
     C           *LIKE     DEFN JR1001    WR1001
     C           *LIKE     DEFN JR1002    WR1002
     C           *LIKE     DEFN J1002$    W1002$
     C           *LIKE     DEFN JR1003    WR1003
     C           *LIKE     DEFN CC09      WCC09
     C           *LIKE     DEFN TA07      COST
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYAA     KLIST
     C                     KFLD           AH01
     C                     KFLD           CHK1,I
     C           KEYAF     KLIST
     C                     KFLD           AH01             *公司別
     C                     KFLD           AH04             *會計科目
     C           P1KEY     KLIST
     C                     KFLD           TJA01
     C           P2KEY     KLIST
     C                     KFLD           JR1001
     C                     KFLD           JR1002
     C                     KFLD           J1002$
     C                     KFLD           JR1003
     C                     KFLD           JR1004
     C                     KFLD           JR1005
     C                     KFLD           JR1006
     C                     KFLD           JR1007
     C                     KFLD           JR1008
     C                     KFLD           JR1009
     C                     KFLD           JR1010
     C                     KFLD           JR1011
     C           P2KEYA    KLIST
     C                     KFLD           JR01A
     C                     KFLD           JR1002
     C                     KFLD           J1002$
     C                     KFLD           JR03A
     C                     KFLD           JR1004
     C                     KFLD           JR1005
     C                     KFLD           JR1006
     C                     KFLD           JR1007
     C                     KFLD           JR1008
     C                     KFLD           JR1009
     C                     KFLD           JR1010
     C                     KFLD           JR1011
     C           P3KEY     KLIST
     C                     KFLD           EE01
     C                     KFLD           EE02
     C                     KFLD           EE04
     C                     KFLD           EE03
     C           P4KEY     KLIST
     C                     KFLD           TA01
     C                     KFLD           TA02
     C                     KFLD           TA03
     C           P5KEY     KLIST
     C                     KFLD           HA09
     C                     KFLD           HA05
     C           KEYCC     KLIST
     C                     KFLD           KCC01   2
     C                     KFLD           KCC02   2
     C                     KFLD           KCC04   9
     C                     KFLD           KCC06   1
     C                     KFLD           KCC07
     C           KEYCC1    KLIST
     C                     KFLD           KCC01
     C                     KFLD           KCC02
     C                     KFLD           KCC04
     C                     KFLD           KCC06
     C           KEYMC     KLIST
     C                     KFLD           HA01
     C                     KFLD           HA05
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     EXSR R0100                      *INITIAL
     C*
     C                     EXSR R2000
     C                     EXSR R4000
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R0100 ....INITIAL VALUE
     C*==============================================================*
01===C           R0100     BEGSR
|    C*--------------------------------------------------------------*
|    C                     Z-ADD*ZERO     W01    132
|    C                     Z-ADD*ZERO     W02    132
|    C                     Z-ADD0         WAMT   152H
|    C                     MOVEL*BLANK    TJA01  13
|    C                     Z-ADD0         TJA02   80
|    C                     SETOF                     49
|    C*
|    C                     MOVELAPPPGM    JAWW
|    C                     Z-ADDADYYMD    JAXX
|    C                     TIME           JAYY
|    C                     MOVEL$USER     JAZZ
01===C                     ENDSR
     C*==============================================================*
     C*          R2000 .計算家樂福銷售檔
     C*==============================================================*
02===C           R2000     BEGSR
|    C*
     C           *LOVAL    SETLLHA0
|    C                     READ HA0                      45
| 01-C           *IN45     DOWEQ'0'
|   C*
|   C                     MOVELHA09      JA01
| 02-C           JA01      IFNE TJA01
|   C                     MOVELJA01      TJA01
|   C                     Z-ADDHA03      TJA02
|   C           P1KEY     CHAINJA0                  42
|   C   42                EXSR R2E00
| 02-C                     ENDIF
|   C  N42                GOTO $NEXT
|    *
|    *傳票WFJR10PF
|   C                     EXSR R2A00
|   C*
|   C           $NEXT     TAG
|   C                     READ HA0                      45
| 01-C                     END
|    C*
02===C           E2000     ENDSR
     C*==============================================================*
     C*          R2A10 ... 寫入 WFJR11PF
     C*==============================================================*
     C           R2A10     BEGSR
     C                     Z-ADDHA03      JR1101
     C                     MOVE HA01      JR1102
     C                     MOVE HA01      J1102$
     C                     MOVE HA02      J1102#
     C                     MOVE 'S1'      JR1103
     C                     MOVE HA04      J1103$
     C                     Z-ADDHA07      JR1104
     C           HA08      SUB  HA07      JR1105
     C                     Z-ADDHA08      JR1106
     C                     MOVE HA05      JR1107
     C                     MOVE HA09      JR1108
     C                     Z-ADDHA06      JR1109
     C                     WRITEWFJR11R
     C                     ENDSR
     C*==============================================================*
     C*          R2A20 ... 判斷無庫存及陳列數量
     C*==============================================================*
     C           R2A20     BEGSR
    C                     EXSR R2A2A
     C           P5KEY     SETLLTQ0
     C           P5KEY     READETQ0                      48
    C           *IN48     DOWEQ'0'
    C           @HA06     ANDGT0
     C                     SUB  TQ06      @HA06
    C           @HA06     IFLT 0
     C           TQ06      ADD  @HA06     @QTY    60         可扣數量
     C                     ADD  @QTY      TQQTY
     C*          @QTY      MULT TQ07      WAMT      H
     C                     Z-ADDTQ08      WAMT
     C                     ADD  WAMT      TQAMT
     C                     Z-ADD@QTY      JR1205
    C                     EXSR R2A2B
    C                     ELSE
     C                     ADD  TQ06      TQQTY
     C*          TQ06      MULT TQ07      WAMT      H
     C                     Z-ADDTQ08      WAMT
     C                     ADD  WAMT      TQAMT
     C                     Z-ADDTQ06      JR1205
    C                     EXSR R2A2B
     C           P5KEY     READETQ0                      48
    C                     ENDIF
    C                     ENDDO
     C*
     C           P5KEY     SETLLTP0
     C           P5KEY     READETP0                      48
    C           *IN48     DOWEQ'0'
    C           @HA06     ANDGT0
     C                     SUB  TP06      @HA06
    C           @HA06     IFLT 0
     C           TP06      ADD  @HA06     @QTY    60       可扣數量
     C                     ADD  @QTY      TPQTY
     C*          @QTY      MULT TP07      WAMT      H
     C                     Z-ADDTP08      WAMT
     C                     ADD  WAMT      TPAMT
     C                     Z-ADD@QTY      JR1205
    C                     EXSR R2A2C
    C                     ELSE
     C                     ADD  TP06      TPQTY
     C*          TP06      MULT TP07      WAMT      H
     C                     Z-ADDTP08      WAMT
     C                     ADD  WAMT      TPAMT
     C                     Z-ADDTP06      JR1205
    C                     EXSR R2A2C
     C           P5KEY     READETP0                      48
    C                     ENDIF
    C                     ENDDO
     C                     ENDSR
     C*==============================================================*
     C*          R2A2A ... INITIAL    WFJR12PF
     C*==============================================================*
     C           R2A2A     BEGSR
     C                     Z-ADD0         TQQTY   60
     C                     Z-ADD0         TPQTY   60
     C                     Z-ADD0         @QTY    60
     C                     Z-ADD0         TQAMT  112
     C                     Z-ADD0         TPAMT  112
     C                     Z-ADDHA06      @HA06   60
     C*
     C                     Z-ADDHA03      JR1201
     C                     MOVE HA01      JR1202
     C                     MOVE HA01      J1202$
     C                     MOVE HA02      J1202#
     C                     MOVE 'S1'      JR1203
     C                     MOVE HA04      J1203$
     C                     MOVE HA05      JR1204
     C                     MOVE HA09      JR1209
     C                     Z-ADDHA06      JR1210
     C                     ENDSR
     C*==============================================================*
     C*          R2A2B ... 銷售成本 INTQPF 寫入 WFJR12PF
     C*==============================================================*
     C           R2A2B     BEGSR
     C                     Z-ADDWAMT      JR1206
     C                     Z-ADDTQ07      JR1207
     C                     MOVE TQ10      JR1208
     C                     WRITEWFJR12R
     C                     ENDSR
     C*==============================================================*
     C*          R2A2C ... 銷售成本 INTPPF 寫入 WFJR12PF
     C*==============================================================*
     C           R2A2C     BEGSR
     C                     Z-ADDWAMT      JR1206
     C                     Z-ADDTP07      JR1207
     C                     MOVE TP10      JR1208
     C                     WRITEWFJR12R
     C                     ENDSR
     C*==============================================================*
     C*          R2A30 ... 銷售成本 SEHAPF 寫入 WFJR12PF
     C*==============================================================*
     C           R2A30     BEGSR
     C                     Z-ADDHAQTY     JR1205
     C                     Z-ADDW02       JR1206
     C                     Z-ADDCOST      JR1207
     C                     MOVE *BLANK    JR1208
     C*                    Z-ADDCOST      JR1211
     C                     WRITEWFJR12R
     C                     ENDSR
     C*==============================================================*
     C*          R2C00 ....取得最新年度報價單價
     C*==============================================================*
04===C           R2C00     BEGSR
|    C*
|    C                     MOVELHA01      KCC01            公司別
|    C                     MOVELHA02      KCC02            通路別
|    C                     MOVELHA05      KCC04            產品代號
|    C                     MOVEL'1'       KCC06            年度報價
|    C                     Z-ADDHA03      KCC07            日期
|     *
|    C                     Z-ADD0         WCC09
|     *
|    C           KEYCC     SETGTCC0
|    C           KEYCC1    REDPECC0                      47
| 01C           *IN47     IFEQ '0'
|  C           KCC07Y    ANDEQCC05
|    *
| 02-C           CC08      IFNE 0
| 03-C           KCC07     IFLE CC08
|   C           KCC07     ANDGECC07
|   C                     Z-ADDCC09      WCC09
| 03-C                     ENDIF
| 02*C                     ELSE
| 04-C           KCC07     IFGE CC07
|   C                     Z-ADDCC09      WCC09
| 04-C                     ENDIF
| 02-C                     ENDIF
|   C                     ENDIF
|     *
04===C                     ENDSR
     C*==============================================================*
     C*          R2E00 ... READ SEHAPF=>WRITE P@JAPF
     C*==============================================================*
03===C           R2E00     BEGSR
|    C*
|    C*                    MOVELTJA01     JA01
|    C*                    Z-ADDADYYMD    JA02
|    C                     MOVELTJA01     JA01
|    C                     Z-ADDTJA02     JA02
|    C*                    MOVELAPPPGM    JAWW
|    C*                    Z-ADDADYYMD    JAXX
|    C*                    TIME           JAYY
|    C*                    MOVEL$USER     JAZZ
|    C                     WRITEJA0
|    C*
03===C                     ENDSR
     C*==============================================================*
     C*          R2A00 ... 寫入暫存檔－傳票
     C*==============================================================*
04===C           R2A00     BEGSR
|    C*
|    C                     Z-ADDF02       JR1001
|    C                     Z-ADDHA03      JR01A
|    C                     MOVEL'SC'      JR1002
|    C                     MOVE HA01      J1002$
|    C                     MOVEL'1'       JR1003
     C                     MOVE *BLANK    JR1006
|   C                     SELEC
|   C           HA06      WHGT 0                           銷貨
|    C                     MOVEL'1'       JR03A
|   C           HA06      WHEQ 0                            Q'TY = 0
|   C           HA07      ANDGT0                            AMT  > 0
|    C                     MOVEL'2'       JR03A
|   C           HA06      WHEQ 0                            Q'TY = 0
|   C           HA07      ANDLT0                            AMT  < 0
|    C                     MOVEL'3'       JR03A
|   C           HA06      WHLT 0                            Q'TY < 0
|   C           HA07      ANDLT0                            AMT  < 0
|    C                     MOVEL'4'       JR03A             銷退
|   C                     ENDSL
|    C*（１）一................銷貨收入傳票
|     *會計科目－應收帳款－客戶
|    C                     MOVEL'1132    'JR1004
|    C*
|    C                     Z-ADD0         W01
|    C                     Z-ADD0         W02
|>*  C           HA08      IFGE 0
|    C                     Z-ADDHA08      W01
|>*  C                     ELSE
|>*  C           HA08      MULT -1        W02
|>*  C                     END
|>*  C*
|>   C****                 MOVEL'1'       J1003$
|    C*
|    C           P2KEY     CHAINWFJR10R              41
|    C                     EXSR RWF10
|   C                     EXSR R2A10                      寫入WF 11
|     *----------------------------------------------------------------
|    C*（１）三................銷貨收入傳票
|     *會計科目－銷項稅額
|    C                     MOVEL'2193    'JR1004
     C                     MOVE *BLANK    JR1006
|    C*
|    C                     Z-ADD0         W01
|    C                     Z-ADD0         W02
|    C           HA08      SUB  HA07      WAMT
|>*  C           WAMT      IFLE 0
|>*  C           WAMT      MULT -1        W01
|>*  C                     ELSE
|    C                     Z-ADDWAMT      W02
|>*  C                     END
|>*  C*
|>   C****                 MOVEL'2'       J1003$
|    C*
|    C           P2KEY     CHAINWFJR10R              41
|    C                     EXSR RWF10
|    C*
|     *----------------------------------------------------------------
|    C*（１）三................銷貨收入傳票
|     *會計科目－銷貨收入－客戶
|    C                     MOVELHA01      EE01
|    C                     MOVELHA02      EE02
|    C                     MOVELHA04      EE04
|    C                     MOVEL'410106'  EE03
|    C                     MOVEL*BLANK    JR1004
     C                     MOVE *BLANK    JR1006
|    C           P3KEY     CHAINEE0                  43
|    C* N43      EE03      CAT  EE05      JR1004
|   C           *IN43     IFEQ '0'
|    C           EE03      CAT  EE05      JR1004
|   C                     ELSE
|    C           EE03      CAT  @HA04     JR1004
|   C                     ENDIF
|    C*
|    C                     Z-ADD0         W01
|    C                     Z-ADD0         W02
|>*  C           HA07      IFGE 0
|    C                     Z-ADDHA07      W02
|>*  C                     ELSE
|>*  C           HA07      MULT -1        W01
|>*  C                     END
|>*  C*
|>   C****                 MOVEL'2'       J1003$
|    C*
|    C           P2KEY     CHAINWFJR10R              41
|    C                     EXSR RWF10
|     *----------------------------------------------------------------
|     * HA06 , 數量 = 0 時 ,不需寫成本傳票
|     *因成本 = 數量*單位成本,數量= 0 ,成本算出來也= 0
|    C*----------------------------------------------------------------
    C           HA06      IFGT 0
|    C*（２）一................銷貨成本傳票
|     *會計科目－銷貨成本－客戶
|     *
|   C                     EXSR R2A20                      陳列庫存
|     *
|    C                     MOVEL'2'       JR1003
|    C                     Z-ADDHA03      JR01A
|    C                     Z-ADDF02       JR1001
|    C                     MOVEL'SC'      JR1002
|    C                     MOVE HA01      J1002$
|    C                     MOVEL'5'       JR03A
|    C                     MOVELHA01      EE01
|    C                     MOVELHA02      EE02
|    C                     MOVELHA04      EE04
|    C                     MOVEL'510106'  EE03
|    C                     MOVEL*BLANK    JR1004
     C                     MOVE *BLANK    JR1006
|    C           P3KEY     CHAINEE0                  43
|    C* N43      EE03      CAT  EE05      JR1004
|   C           *IN43     IFEQ '0'
|    C           EE03      CAT  EE05      JR1004
|   C                     ELSE
|    C           EE03      CAT  @HA04     JR1004
|   C                     ENDIF
|    C*
|    C                     Z-ADDHA06      HAQTY   60
|    C                     SUB  TQQTY     HAQTY
|    C                     SUB  TPQTY     HAQTY
|    C*
|    C                     MOVELHA01      TA01
|    C*                    MOVELHAYYMM    TA02
|    C                     MOVELF02YM     TA02
|    C                     MOVELHA05      TA03
|    C                     Z-ADD0         W01
|    C                     Z-ADD0         W02
|    C                     Z-ADD0         WAMT
|    C                     Z-ADD0         COST
|   C           HAQTY     IFNE 0
|    C           P4KEY     CHAINTA0                  43
|    C* N43      HA06      MULT TA07      WAMT      H
|   C           *IN43     IFEQ '1'
|   C           TA07      OREQ 0
|    C                     EXSR R2C00
|    C                     Z-ADDWCC09     COST
|   C                     ELSE
|    C                     Z-ADDTA07      COST
|   C                     ENDIF
|   C                     ENDIF
|    C           HAQTY     MULT COST      WAMT      H
|    C                     ADD  TQAMT     WAMT
|    C                     ADD  TPAMT     WAMT
|    C*
|    C*          WAMT      IFGE 0
|    C                     Z-ADDWAMT      W01
|    C*                    ELSE
|    C*          WAMT      MULT -1        W02
|    C*                    END
|    C*
|    C                     MOVEL'1'       J1003$
|    C*
|    C           P2KEY     CHAINWFJR10R              41
|    C                     EXSR RWF10
|     *----------------------------------------------------------------
|    C*（２）三................銷貨成本傳票
|     *會計科目－存貨
|    C                     MOVEL'1141    'JR1004
     C                     MOVE *BLANK    JR1006
|    C*
|    C                     Z-ADD0         W01
|    C                     Z-ADD0         W02
|    C                     Z-ADD0         WAMT
|    C           HAQTY     MULT COST      WAMT      H
|    C*
|    C*          WAMT      IFGE 0
|    C                     Z-ADDWAMT      W02
|    C*                    ELSE
|    C*          WAMT      MULT -1        W01
|    C*                    END
|    C*
|    C                     MOVEL'2'       J1003$
|    C*
|    C           P2KEY     CHAINWFJR10R              41
|    C                     EXSR RWF10
|    C           HAQTY     IFGT 0
|   C                     EXSR R2A30                      寫入WF 12
|    C                     ENDIF
|    C*
|     *----------------------------------------------------------------
|    C*（２）三................銷貨成本傳票
|     *會計科目－盤存利益
|   C           TQAMT     IFGT 0
|    C                     MOVELHA01      EE01
|    C                     MOVELHA02      EE02
|    C                     MOVELHA04      EE04
|    C**                   MOVEL'710506'  EE03
|    C**                   MOVEL*BLANK    JR1004
|    C**         P3KEY     CHAINEE0                  43
|   C**         *IN43     IFEQ '0'
|    C**         EE03      CAT  EE05      JR1004
|   C**                   ELSE
|    C**         EE03      CAT  @HA04     JR1004
|   C**                   ENDIF
|    C*
|    C                     MOVEL'213019  'JR1004    P
     C                     MOVE *BLANK    JR1006
|    C           KEYMC     CHAINNC0                  43
|    C  N43                MOVELNC03      JR1006    P
|    C   43                MOVE *BLANK    JR1006
|    C*
|    C                     Z-ADDTQAMT     WAMT
|    C*
|    C*          WAMT      IFGE 0
|    C                     Z-ADDWAMT      W02
|    C*                    ELSE
|    C*          WAMT      MULT -1        W01
|    C*                    END
|    C*
|    C                     MOVEL'2'       J1003$
|    C*
|    C           P2KEY     CHAINWFJR10R              41
|    C                     EXSR RWF10
|   C                     ENDIF
|     *----------------------------------------------------------------
|    C*（２）三................銷貨成本傳票
|     *會計科目－其他應付款(銷售陳列)
|   C           TPAMT     IFGT 0
|    C                     MOVELHA01      EE01
|    C                     MOVELHA02      EE02
|    C                     MOVELHA04      EE04
|    C                     MOVEL'213009'  EE03
|    C                     MOVEL*BLANK    JR1004
     C                     MOVE *BLANK    JR1006
|    C           P3KEY     CHAINEE0                  43
|    C* N43      EE03      CAT  EE05      JR1004
|   C           *IN43     IFEQ '0'
|    C           EE03      CAT  EE05      JR1004
|   C                     ELSE
|    C           EE03      CAT  @HA04     JR1004
|   C                     ENDIF
|    C*
|    C                     Z-ADDTPAMT     WAMT
|    C*
|    C*          WAMT      IFGE 0
|    C                     Z-ADDWAMT      W02
|    C*                    ELSE
|    C*          WAMT      MULT -1        W01
|    C*                    END
|    C*
|    C                     MOVEL'2'       J1003$
|    C*
|    C           P2KEY     CHAINWFJR10R              41
|    C                     EXSR RWF10
|   C                     ENDIF
|   C                     ENDIF
|   C           HA06      IFLT 0                              銷退
|     *----------------------------------------------------------------
|    C*（２）一................銷貨成本傳票
|     *會計科目－銷貨成本－客戶
|     *
|    C                     MOVEL'2'       JR1003
|    C                     Z-ADDHA03      JR01A
|    C                     Z-ADDF02       JR1001
|    C                     MOVEL'SC'      JR1002
|    C                     MOVE HA01      J1002$
|    C                     MOVEL'6'       JR03A
|    C                     MOVELHA01      EE01
|    C                     MOVELHA02      EE02
|    C                     MOVELHA04      EE04
|    C                     MOVEL'510106'  EE03      P
|    C                     MOVEL*BLANK    JR1004
|    C           P3KEY     CHAINEE0                  43
|    C* N43      EE03      CAT  EE05      JR1004
|   C           *IN43     IFEQ '0'
|    C           EE03      CAT  EE05      JR1004
|   C                     ELSE
|    C           EE03      CAT  @HA04     JR1004
|   C                     ENDIF
     C                     MOVE *BLANK    JR1006
|    C*
|    C                     MOVELHA01      TA01
|    C                     MOVELF02YM     TA02
|    C                     MOVELHA05      TA03
|    C                     Z-ADD0         W01
|    C                     Z-ADD0         W02
|    C                     Z-ADD0         WAMT
|    C           P4KEY     CHAINTA0                  43
|    C* N43      HA06      MULT TA07      WAMT      H
|   C           *IN43     IFEQ '1'
|   C           TA07      OREQ 0
|    C                     EXSR R2C00
|    C                     Z-ADDWCC09     COST
|   C                     ELSE
|    C                     Z-ADDTA07      COST
|   C                     ENDIF
|    C           HA06      MULT COST      WAMT      H
|    C*
|    C           WAMT      IFGE 0
|    C                     Z-ADDWAMT      W01
|    C                     ELSE
|    C           WAMT      MULT -1        W02
|    C                     END
|    C*
|    C*                    MOVEL'1'       J1003$
|    C*
|    C           P2KEY     CHAINWFJR10R              41
|    C                     EXSR RWF10
|     *----------------------------------------------------------------
|    C*（２）三................銷貨成本傳票
|     *會計科目－存貨
|    C                     MOVEL'1141    'JR1004
     C                     MOVE *BLANK    JR1006
|    C                     Z-ADDW02       W01
|    C                     Z-ADD0         W02
|    C*
|    C           P2KEY     CHAINWFJR10R              41
|    C                     EXSR RWF10
|    C*
|   C                     ENDIF
|    C*
04===C                     ENDSR
     C*==============================================================*
     C*          RWF10 ... 寫入．更新傳票暫存檔WFJR10PF (BY 月)
     C*==============================================================*
05===C           RWF10     BEGSR
|    C*
| 01-C           *IN41     IFEQ '1'
|   C                     Z-ADDW01       JR1012
|   C                     Z-ADDW02       JR1013
|    *判別借貸方
|   C           JR1012    SUB  JR1013    WAMT
|    *金額不為０才寫入
| > C           WAMT      IFGT 0
| > C                     MOVEL'1'       J1003$
| > C                     END
| > C           WAMT      IFLT 0
| > C                     MOVEL'2'       J1003$
| > C                     END
| 02-C           WAMT      IFNE 0
|   C                     WRITEWFJR10R
| 02-C                     END
|    *
| 01*C                     ELSE
|   C                     ADD  W01       JR1012
|   C                     ADD  W02       JR1013
|    *判別借貸方
|   C           JR1012    SUB  JR1013    WAMT
| > C           WAMT      IFGT 0
| > C                     MOVEL'1'       J1003$
| > C                     Z-ADDWAMT      JR1012
| > C                     Z-ADD0         JR1013
| > C                     END
| > C           WAMT      IFLT 0
| > C                     MOVEL'2'       J1003$
| > C                     Z-ADD0         JR1012
| > C           WAMT      MULT -1        JR1013
| > C                     END
|    *金額為０不產生傳票
| 03-C           WAMT      IFNE 0
|   C                     UPDATWFJR10R
| 03*C                     ELSE
|   C                     DELETWFJR10R
| 03-C                     END
| 01-C                     END
|    C*
|    C           P2KEYA    CHAINWFJR10A              44
|    C                     EXSR RWF10A                      寫入明細
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          RWF10A... 寫入．更新傳票暫存檔WFJR10A (明細)
     C*==============================================================*
05===C           RWF10A    BEGSR
|    C*
| 01C           *IN44     IFEQ '1'
|   C                     Z-ADDW01       JR1012
|   C                     Z-ADDW02       JR1013
|    *判別借貸方
|   C           JR1012    SUB  JR1013    WAMT
|    *金額不為０才寫入
| > C           WAMT      IFGT 0
| > C                     MOVEL'1'       J1003$
| > C                     END
| > C           WAMT      IFLT 0
| > C                     MOVEL'2'       J1003$
| > C                     END
| 02-C           WAMT      IFNE 0
|   C                     WRITEWFJR10A
| 02-C                     END
|    *
| 01C                     ELSE
|   C                     ADD  W01       JR1012
|   C                     ADD  W02       JR1013
|    *判別借貸方
|   C           JR1012    SUB  JR1013    WAMT
| > C           WAMT      IFGT 0
| > C                     MOVEL'1'       J1003$
| > C                     Z-ADDWAMT      JR1012
| > C                     Z-ADD0         JR1013
| > C                     END
| > C           WAMT      IFLT 0
| > C                     MOVEL'2'       J1003$
| > C                     Z-ADD0         JR1012
| > C           WAMT      MULT -1        JR1013
| > C                     END
|    *金額為０不產生傳票
| 03-C           WAMT      IFNE 0
|   C                     UPDATWFJR10A
| 03*C                     ELSE
|   C                     DELETWFJR10A
| 03-C                     END
| 01C                     END
|    C*
05===C                     ENDSR
     C*==============================================================*
     C*          R4000 .產生銷售傳票
     C*==============================================================*
06===C           R4000     BEGSR
|    C*
|    C                     MOVEL*BLANKS   WR1001
|    C                     MOVEL*BLANKS   WR1002
|    C                     MOVEL*BLANKS   W1002$
|    C                     MOVEL*BLANKS   WR1003
|     *
|    C           *LOVAL    SETLLWFJR10L
|    C                     READ WFJR10L                  46
| 01-C           *IN46     DOWEQ'0'
|   C                     EXSR R4100
|    *
|   C                     READ WFJR10L                  46
| 01-C                     END
|    C*
06===C           E4000     ENDSR
     C*==============================================================*
     C*          R4100 .  產生銷售傳票
     C*==============================================================*
07===C           R4100     BEGSR
|    C*
|    C* <<清除傳票檔部份欄位 >>
|    C                     EXSR R40XX
|     *----------------------------------------------------------------
|     *傳票日期
|    C                     MOVELJR1002    AH01
|    C                     Z-ADDJR1001    AH10
|    C*傳票號碼
| 01-C           JR1001    IFNE WR1001
|   C           JR1002    ORNE WR1002
|   C           J1002$    ORNE W1002$
|   C           JR1003    ORNE WR1003
|   C                     MOVEL*BLANKS   AH02
|   C                     CALL 'GLS002'
|   C                     PARM AH01      P002I1  2
|   C                     PARM AH10      P002I2  80
|   C                     PARM 'F'       P002I3  1
|   C           AH02      PARM           P002O1  9
|   C                     MOVELJR1001    WR1001
|   C                     MOVELJR1002    WR1002
|   C                     MOVELJ1002$    W1002$
|   C                     MOVELJR1003    WR1003
|   C                     Z-ADD0         WAH03
| 01-C                     END
|     *
|    C                     MOVELJR1004    AH04
|    C           KEYAF     CHAINAF0                  40
| 02C           *IN40     IFEQ '0'
|    *
| 03-C           AF11      IFNE *BLANK
|   C                     MOVELJR1005    AH05
| 03-C                     END
|    *
| 04-C           AF12      IFNE *BLANK
|   C                     MOVELJR1006    AH06
| 04-C                     END
|    *
| 05-C           AF13      IFNE *BLANK
|   C                     MOVELJR1007    AH07
| 05-C                     END
|    *
| 06-C           AF14      IFNE *BLANK
|   C                     MOVELJR1008    AH08
| 06-C                     END
|    *
| 07-C           AF15      IFNE *BLANK
|   C                     MOVELJR1009    AH09
| 07-C                     END
|    *
| 08-C           AF16      IFNE *BLANK
|   C                     MOVELJR1010    AH14
| 08-C                     END
|    *
| 09-C           AF17      IFNE *BLANK
|   C                     MOVELJR1011    AH15
| 09-C                     END
| 02C                     ENDIF
|    *
|   C                     Z-ADDJR1012    AH12
|   C                     Z-ADDJR1013    AH13
|    *
|   C                     MOVEL'SA'      AH17
|   C                     MOVEL*BLANKS   AH18
|   C                     MOVEL'V'       AH19
|   C                     MOVEL*BLANKS   AH20
|   C                     Z-ADD*ZEROS    AH21
|   C                     MOVEL*BLANKS   AH22
|   C                     Z-ADD*ZEROS    AH23
|   C                     MOVEL*BLANKS   AH24
|   C                     Z-ADDADYYMD    AH25
|   C                     MOVEL$USER     AH26
|   C                     TIME           AH97
|   C                     Z-ADDADYYMD    AH98
|   C                     MOVEL$USER     AH99
|   C* <<取得會計科目資料 >>
|   C                     EXSR R40YY
|   C* <<寫入傳票檔 >>
|   C                     EXSR R40ZZ
| 02-C*                    END
|    C*
07===C           E4A00     ENDSR
     C*==============================================================*
     C*          R40XX ...清除傳票檔部份欄位
     C*==============================================================*
08===C           R40XX     BEGSR
|    C*
|    C                     MOVEL*BLANKS   AH04
|    C                     MOVEL*BLANKS   AH05
|    C                     MOVEL*BLANKS   AH05A
|    C                     MOVEL*BLANKS   AH06
|    C                     MOVEL*BLANKS   AH06A
|    C                     MOVEL*BLANKS   AH07
|    C                     MOVEL*BLANKS   AH07A
|    C                     MOVEL*BLANKS   AH08
|    C                     MOVEL*BLANKS   AH08A
|    C                     Z-ADD*ZEROS    AH09
|    C                     MOVEL*BLANKS   AH09A
|    C                     Z-ADD*ZEROS    AH12
|    C                     Z-ADD*ZEROS    AH13
|    C                     MOVEL*BLANKS   AH14
|    C                     MOVEL*BLANKS   AH14A
|    C                     MOVEL*BLANKS   AH15
|    C                     MOVEL*BLANKS   AH15A
|    C                     MOVEL*BLANKS   AH16
|    C                     MOVEL'SA'      AH17
|    C                     MOVEL*BLANKS   AH18
|    C                     MOVEL'V'       AH19
|    C                     MOVEL*BLANKS   AH20
|    C                     Z-ADD*ZEROS    AH21
|    C                     MOVEL*BLANKS   AH22
|    C                     Z-ADD*ZEROS    AH23
|    C                     MOVEL*BLANKS   AH24
|    C                     Z-ADDADYYMD    AH25
|    C                     MOVEL$USER     AH26
|    C                     TIME           AH97
|    C                     Z-ADDADYYMD    AH98
|    C                     MOVEL$USER     AH99
|    C*
08===C                     ENDSR
     C*==============================================================*
     C*          R40YY ...取得會計科目資料
     C*==============================================================*
09===C           R40YY     BEGSR
|    C*
|    C                     MOVEA*BLANKS   CHK1
|    C                     MOVEA*BLANKS   CHK2
|    C                     MOVEA*BLANKS   CHK3
|    C*<<取得會計科目各欄位名稱>>
|    C           KEYAF     CHAINAF0                  40
| 01-C           *IN40     IFEQ '0'
|   C                     MOVELAF11      AH05A
|   C                     MOVELAF12      AH06A
|   C                     MOVELAF13      AH07A
|   C                     MOVELAF14      AH08A
|   C                     MOVELAF15      AH09A
|   C                     MOVELAF16      AH14A
|   C                     MOVELAF17      AH15A
|   C*
|   C                     MOVELAF11      CHK1,1
|   C                     MOVELAF12      CHK1,2
|   C                     MOVELAF13      CHK1,3
|   C                     MOVELAF14      CHK1,4
|   C                     MOVELAF15      CHK1,5
|   C                     MOVELAF16      CHK1,6
|   C                     MOVELAF17      CHK1,7
| 01-C                     END
|    C* << 輸入欄位說明CHK3 >>
|    C*
|    C                     MOVELAH05      CHK2,1
|    C                     MOVELAH06      CHK2,2
|    C                     MOVELAH07      CHK2,3
|    C                     MOVELAH08      CHK2,4
| 02-C                     DO   4         I       10
| 03-C           CHK2,I    IFNE *BLANKS
|   C           KEYAA     CHAINAA0                  40
| 04-C           *IN40     IFEQ '0'
|   C           AA04      ANDNE*BLANKS
|   C*
|   C                     MOVELCHK2,I    WPARM1
|   C                     MOVELAA05      WPARM2
|   C                     MOVEL'0'       WCHK
|   C                     CALL AA04
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C           CHK3,I    PARM           DESC   20
| 04*C                     ELSE
|   C                     MOVELCHK2,I    CHK3,I
| 04-C                     END
| 03-C                     END
| 02-C                     END
|    C*
| 05-C           AH09      IFNE 0
|   C                     CALL 'P56'                      *P56(GET'/')
|   C                     PARM AH09      P5601I  80
|   C                     PARM           P5601O 10
|   C                     MOVELP5601O    CHK3,5
| 05-C                     END
|    C*
| 06-C           AH14      IFNE 0
|   C                     CALL 'P55'                      *P55(GET,.)
|   C                     PARM AH14      P5501I 185
|   C                     PARM 2         P5502I  10
|   C                     PARM           P5501O 24
|   C                     MOVELP5501O    CHK3,6
| 06-C                     END
|    C*
| 07-C           AH15      IFNE *BLANK
|   C                     Z-ADD7         I
|   C           KEYAA     CHAINAA0                  40
| 08-C           *IN40     IFEQ '0'
|   C           AA04      ANDNE*BLANKS
|   C*
|   C                     MOVELAH15      WPARM1
|   C                     MOVELAA05      WPARM2
|   C                     MOVEL'0'       WCHK
|   C                     CALL AA04
|   C                     PARM           CHKPGM
|   C                     PARM           TORN    1
|   C           CHK3,7    PARM           DESC   20
|   C*                    ELSE
|   C                     MOVELAH15      CHK3,7
| 08-C                     END
| 07-C                     END
|    C*<<摘要 >>
| 09-C                     DO   7         K       10
| 10-C           CHK3,K    IFNE *BLANKS
|   C                     CALL 'GLS001'
|   C                     PARM AH16      S001I1 80
|   C                     PARM CHK3,K    S001I2 80
|   C                     PARM 49        S001I3  30
|   C           AH16      PARM           S001O1 80
| 10-C                     END
| 09-C                     END
|    C*
09===C                     ENDSR
     C*==============================================================*
     C*          R40ZZ ... WRITE GLAHPF
     C*==============================================================*
10===C           R40ZZ     BEGSR
|    C*
|    C                     ADD  1         WAH03
|    C                     Z-ADDWAH03     AH03
|    C                     WRITEAH0
|    C*
10===C                     ENDSR
