     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : VPA001                                     *
     A*    AUTHOR       : JONATHAN                                   *
     A*    DATE WRITTEN : 103/03/27                                  *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : VIP維護                                  *
     A*    SUBSYSTEM    :                                          *
     A*    PROCEDURE    :直客(VIP)資料維護                       *
     A*    REMARK       :                                            *
     A* 00A 104/03/03 DEREK增加中文姓名搜尋                        *
     A****************************************************************
     FVPA001D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     F                                        RRN1  KSFILE SFLSR1
     F                                        RRN2  KSFILE SFLSR2
     FVPAAPF  UF  E           K        DISK                      A
 00A+FVPAALF01IF  E           K        DISK
 00A+F            AA0                               KRENAMEAAL1
     FPA#BPF  IF  E           K        DISK
     A****************************************************************
     E*: FUNCTION DATA :
     E                    WFUN    5   5  6
     E*: A/U/D/I AUT
     E                    WA01        5  1
     E*
     E                    CHK       999 20
     A****************************************************************
     I*
     I           SDS
     I                                     *PROGRAM PGMNAM
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      135 135 $ADD
     I                                      136 136 $UPD
     I                                      137 137 $DLT
     I                                      138 138 $INQ
     I                                      139 139 $RMK01
     I                                      173 174 $CD01
     I                                      201 2080$A8YMD
     I                                      201 2040$WWW
     I            DS
     I                                        1   1 DOPT1
     I                                        1   10WNUM
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
     I                                    B 378 3790#DRRN
     I            DS
     I                                        1  15 DVPCE
     I                                        1   3 CELLH
     I                                        1   2 CELLH2
     I            DS
     I                                        1  10 D#AL9
     I                                        1   1 D#910
     I                                        2   5 D#911
     I                                        6  10 D#912
     I            DS
     I                                        1  10 D#AL92
     I                                        1   1 D#920
     I                                        2   5 D#921
     I                                        6  10 D#922
     I**
      *==============================================================*
      *                    DEFINE ROUTINE
      *==============================================================*
      *
      *
     C                     Z-ADD0         HRRN1   40
     C                     Z-ADD0         W6      60
     C*
     C                     MOVE *BLANKS   APPSCR  6
     C*
     C                     MOVE *BLANK    WQUERY  1
     C           *LIKE     DEFN DBGN1     OBGN1            公司代號
     C           *LIKE     DEFN DBCEL     OBGN2            客戶電話
     C           *LIKE     DEFN DBNME     OBGN3            客戶姓名
      *
     C           *LIKE     DEFN RRN2      @PRRN                        OM
     C*
      *==============================================================*
      *                    KLIST
      *==============================================================*
      *
     C           KEYSET    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBCEL
 00A+C           KSET      KLIST
 00A+C                     KFLD           DBGN1
 00A+C                     KFLD           DBNME
     C           KEYCA     KLIST
     C                     KFLD           DBGN1
     C                     KFLD           TVPCE
     C           KEYCA2    KLIST
     C                     KFLD           AA01
     C                     KFLD           AA02
     C           KEYCA3    KLIST
     C                     KFLD           DCA01
 00A+C           KEYCA4    KLIST
 00A+C                     KFLD           AA01
 00A+C                     KFLD           AA03
     C           KEYSE2    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           VIPCE
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C                     EXSR RTN010                     *INIT ENVIRMENT
     C                     EXSR RTN191                     *INIT SFL
      *
     C                     EXSR RTN192                     *READ NEXT PAGE
     C                     EXSR RTN195                     *EXFMT
     C*
  01-C           *IN03     DOWEQ'0'                        *03    OFF
    C*
  02-C           *IN06     CASEQ'1'       RTN110
    C           *IN25     CASEQ'1'       RTN192
    C                     CAS            RTN170
  02-C                     END
    C  N03                EXSR RTN195
    C*
  01-C                     END
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN010....INITIAL VALUE
     C*==============================================================*
01===C           RTN010    BEGSR
|    C*將權限寫入，一開始呼叫程式便會將權限寫入LDA
|    C                     MOVE $ADD      WA01,1
|    C                     MOVE $UPD      WA01,2
|    C                     MOVE $DLT      WA01,4
|    C                     MOVE $INQ      WA01,5
|    C                     MOVE 'SCR000'  APPSCR
|    C*
|    C                     Z-ADD0         WDATE   80
|    C                     Z-ADD0         TDATE   80
|    C*
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN110....F6(ADD)
      *==============================================================*
02===C           RTN110    BEGSR
|    C*
|    C                     MOVE '1'       DOPT1
| 01-C           WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|   C                     SETON                       99
|   C                     MOVEL'ERR9999' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 01*C                     ELSE
|   C                     EXSR RTN11B
|   C  N99                EXSR RTN200
| 02-C           DRRN1     IFGT 0
|   C           DRRN1     SUB  1         HRRN1
| 02-C                     END
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 01-C                     END
|    C                     SETOF                     12
|    C*
02===C                     ENDSR
      *==============================================================*
      *          RTN11B....ENTER
      *==============================================================*
03===C           RTN11B    BEGSR
|     *
| 01-C           DBGN1     IFEQ *BLANK
|   C                     SETON                     99
|   C                     MOVEL'ERR0017' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 01-C                     END
|    C   99                GOTO END110
|     *
| 02-C           DBGN1     IFNE *BLANK
|   C           DBGN1     CHAIN#B0                  40
| 03-C           *IN40     IFEQ '1'
|   C                     SETON                     99
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 03-C                     END
| 02-C                     END
|    C   99                GOTO END110
|     *
|    C           DBGN1     CHAIN#B0                  40
|    C  N40                MOVEL#B03      S#B03
|    C   40                MOVEL*BLANK    S#B03
|     *
03===C           END110    ENDSR
      *==============================================================*
      *          RTN170....ENTER
      *==============================================================*
04===C           RTN170    BEGSR
|    C*
| 01-C           DBGN1     IFNE OBGN1
|   C           DBCEL     ORNE OBGN2
|   C           DBNME     ORNE OBGN3
|   C                     Z-ADD0         HRRN1
|    *新增畫面秀出文字功能
|   C                     EXSR RTN190
|   C                     EXSR RTN191
|   C                     EXSR RTN192
|   C                     MOVELDBGN1     OBGN1
|   C                     MOVELDBCEL     OBGN2
|   C                     MOVELDBNME     OBGN3
| 01*C                     ELSE
|   C                     EXSR RTN171
| 02-C           *IN99     IFEQ '0'
|   C                     Z-ADDRRN1      HRRN1
|   C                     EXSR RTN191
|   C                     EXSR RTN192
| 02-C                     ENDIF
| 01-C                     ENDIF
|    C*
04===C                     ENDSR
      *==============================================================*
      *          RTN171...讀取畫面上DOPT1是否有輸入
      *==============================================================*
05===C           RTN171    BEGSR
|    C*
|    C                     SETON                     54
|    C*
|    C                     READCSFLSR1                 5757*NF
| 01-C           *IN57     DOWEQ'0'                        *40 LOOP
|   C*
|   C                     SETOF                     60    *DOP *IND
| 02-C           *IN99     IFEQ '0'
|   C*
| 03-C           DOPT1     IFNE *BLANK
|   C                     EXSR RTN180                     *CHK
| 04-C           *IN99     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C                     Z-ADDRRN1      DRRN1
|   C                     EXSR RTN200
| 04-C                     END
| 03-C                     END
| 02-C                     END                             *IN99
|   C*
|   C           RRN1      CHAINSFLSR1               40
|   C  N99                MOVE *BLANKS   DOPT1
|   C                     UPDATSFLSR1
|   C                     READCSFLSR1                 5757*NF
|   C*
| 01-C                     END                             *40 END
| 05-C           *IN99     IFEQ '0'
|   C                     SETOF                     5412
| 05-C                     END
|    C*
05===C                     ENDSR
      *==============================================================*
      *          RTN180....第一層畫面的檢查
      *==============================================================*
06===CSR         RTN180    BEGSR
|    C* CHK AUT *
|    C*權限判斷在主畫面呼叫時，便會去判斷權限，目前不放在程式裡
|    C*          WA01,WNUM IFNE 'Y'                         WNUM = DOPT
|    C*                    SETON                     609099
|    C*                    Z-ADDRRN1      DRRN1
|    C*                    END
|    C*  99                GOTO END180
|    C*
| 01-C           DOPT1     IFEQ '2'
|   C           DOPT1     OREQ '4'
| 02-C           CA09      IFEQ 'A'
|   C                     SETON                     9960
|   C                     MOVEL'ERR0061' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     Z-ADDRRN1      DRRN1
| 02-C                     END
| 01-C                     END
|    C   99                GOTO END180
|     *
06===C           END180    ENDSR
      *==============================================================*
      *          RTN190....CHECK 'SC01' SCREEN
      *==============================================================*
07===CSR         RTN190    BEGSR
|    C*
|    C           DBGN1     CHAIN#B0                  40
|    C  N40                MOVEL#B03      S#B03
|    C   40                MOVEL*BLANK    S#B03
|    C*
07===C                     ENDSR
      *=========================================================*
      *          RTN191...第一層SFL INITIAL                  *
      *=========================================================*
08===C           RTN191    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     Z-ADD0         DRRN1
|    C                     Z-ADD0         RRN1
|    C                     Z-ADD0         WRRN1   40
|    C                     Z-ADD10        WPRCD1  30
|    C                     Z-ADD0         DSPRC1  40
|    C           HRRN1     DIV  WPRCD1    DSPRC1
|    C                     MULT WPRCD1    DSPRC1
|    C                     MOVE 'N'       WBOTM1  1
|    C                     SETOF                     53
|    C                     SETON                     5254
|    C                     WRITESFLCR1
|    C                     SETOF                     52
|00A+C*
|00A+C                     SELEC
|00A+C           DBCEL     WHEQ *BLANK
|00A+C           DBNME     ANDEQ*BLANK
|00A+C           KEYSET    SETLLAA0
|00A+C           DBCEL     WHNE *BLANK
|    C           KEYSET    SETLLAA0
|00A+C           DBNME     WHNE *BLANK
|00A+C           KSET      SETLLAAL1
|00A+C                     ENDSL
|    C*
08===C                     ENDSR
      *=========================================================*
      *          RTN192 .. ROLLUP MAIN ROUTINE
      *=========================================================*
09===C           RTN192    BEGSR
|    C*
| 01-C           WBOTM1    IFEQ 'Y'
|   C                     SETON                     99    *LST PAG
|   C                     MOVEL'MSG0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     Z-ADDRRN1      DRRN1
| 01*C                     ELSE
|   C                     EXSR RTN193
| 01-C                     END
|    C*
09===C                     ENDSR
      *=========================================================*
      *          RTN193 .. ADD SUBFILE DATA
      *=========================================================*
10===C           RTN193    BEGSR
|    C*
|    C                     MOVE *BLANKS   DOPT1
|    C                     SETOF                     5354
|    C                     Z-ADDWRRN1     RRN1
|    C                     ADD  WPRCD1    DSPRC1
| 01-C           RRN1      DOWLTDSPRC1
|    *去判斷畫面上欄位如有沒有輸入，就將所有資料秀出
|00A+C*
|00A+C                     SELEC
|00A+C           DBCEL     WHEQ *BLANK
|00A+C           DBNME     ANDEQ*BLANK
|00A+C           DBGN1     READEAA0                      46
|00A+C           DBCEL     WHNE *BLANK
|   C           DBGN1     READEAA0                      46
|00A+C           DBNME     WHNE *BLANK
|00A+C           DBGN1     READEAAL1                     46
|00A+C                     ENDSL
|   C*
| 02-C           *IN46     IFEQ '0'
|    *
|   C                     MOVELAA02      VIPCE
|   C                     MOVELAA03      VIPNM
|    *
|   C                     ADD  1         RRN1
|   C                     WRITESFLSR1
| 02*C                     ELSE
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
|    *資料結束
|   C                     SETON                     53
| 02-C                     ENDIF
|   C*
| 01-C                     ENDDO
|     *在此做資料的預讀，再將KEY值帶回
|     *主要修改翻頁上的BUG
|00A+C                     SELEC
|00A+C           DBCEL     WHEQ *BLANK
|00A+C           DBNME     ANDEQ*BLANK
|00A+C           DBGN1     READEAA0                      46
|00A+C           KEYCA2    SETLLAA0
|00A+C           DBCEL     WHNE *BLANK
|    C           DBGN1     READEAA0                      46
|    C           KEYCA2    SETLLAA0
|00A+C           DBNME     WHNE *BLANK
|00A+C           DBGN1     READEAAL1                     46
|00A+C           KEYCA4    SETLLAAL1
|00A+C                     ENDSL
|    C*
| 03-C           *IN46     IFEQ '1'
|   C                     SETON                     53
|   C                     Z-ADDRRN1      DSPRC1
|   C                     MOVE 'Y'       WBOTM1
| 03-C                     ENDIF
|    C*將畫面上最後一筆資料KEEP住
|    C                     Z-ADDRRN1      DRRN1      50
|    C                     Z-ADDRRN1      WRRN1
|    C*
10===C                     ENDSR
      *==============================================================*
      *          RTN195... EXFMT SFL                                 *
      *==============================================================*
11===C           RTN195    BEGSR
|    C*
| 01-C           RRN1      IFLE *ZEROS
| 02-C           DBGN1     IFNE *BLANK
|   C                     SETON                     99    *LST PAG
|   C                     MOVEL'MSG0003' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 02-C                     END
| 01*C                     ELSE
|   C                     SETON                     50
| 01-C                     END
|    C*
|    C                     SETON                     51    *SFLDSPCTL
|    C                     WRITEDSPC1
|    C                     EXFMTSFLCR1
|    C                     SETOF                     5051
|    C                     MOVEA*ALL'0'   *IN,60
|    C                     Z-ADD0         D#ROW
|    C                     Z-ADD0         D#COL
|    C                     MOVEL*BLANK    ERRID
|    C                     MOVEL*BLANK    ERRF
|    C*
11===C                     ENDSR
      *==============================================================*
      *          RTN200....'SC02' SCREEN MAIN ROUTINE
      *==============================================================*
12===C           RTN200    BEGSR
|    C*特別為明細維護新增
|    C                     MOVE 'SCR002'  APPSCR
|    C                     MOVE WFUN,WNUM DFUN
|     *
| 01-C           DOPT1     CASEQ'1'       RTN210           *ADD
|   C           DOPT1     CASEQ'2'       RTN220           *UPD
|   C           DOPT1     CASEQ'4'       RTN230           *DEL
|   C           DOPT1     CASEQ'5'       RTN240           *INQ
| 01-C                     END
|    C*
|    C           *LOVAL    SETLLAA0
|    C*
12===C                     ENDSR
      *==============================================================*
      *          RTN210....ADD DATA
      *==============================================================*
13===C           RTN210    BEGSR
|    C*
|    C                     SETOF                     29
|    C                     SETON                     303132*ADD MSG
|    C                     SETON                     35    *ADD MSG
|    C                     EXSR RTN251                     *CLR FIELD
|    C*首次建檔人員在此新增
|    C*
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C                     MOVEL*BLANK    ERRID
|   C                     MOVEL*BLANK    ERRF
|   C*
| 02-C           *IN03     IFEQ '0'
|   C           *IN12     ANDEQ'0'
|   C*
| 03-C           *IN04     CASEQ'1'       RTNF4
|   C*          *IN05     CASEQ'1'       RTN260
|   C                     CAS            RTN280
| 03-C                     END
|   C*
| 04-C           *IN99     IFEQ '0'
|   C           KEYCA     CHAINAA0                  40
| 05-C           *IN40     IFEQ '1'
|   C           *IN09     ANDEQ'1'
|   C                     MOVELDCA01     AA01
|   C                     MOVELDVPCE     AA02
|   C                     MOVELDVPNM     AA03
|   C                     MOVELDVPSE     AA04
|   C                     MOVELDADDR     AA05
|   C                     MOVELDPPT      AA06
|   C                     Z-ADD$A8YMD    AAVV             建檔日期
|   C                     MOVELPGMNAM    AAWW      P      異動程式
|   C                     Z-ADD0         AAXX             異動日期
|   C                     TIME           AAYY             異動時間
|   C                     MOVEL$USER     AAZZ      P      異動者　
|   C                     WRITEAA0
|   C                     MOVEL*BLANK    DVPCE
|   C                     MOVEL*BLANK    DVPNM
|   C                     MOVEL*BLANK    DVPSE
|   C                     MOVEL*BLANK    DADDR
|   C                     MOVEL*BLANK    DPPT
|   C                     MOVE 'SCR001'  APPSCR
| 05-C                     END
| 04-C                     END
|   C*
| 02*C                     ELSE
|   C                     EXSR RTN280
| 02-C                     END
|   C*
| 01-C                     END
|    C*
13===C                     ENDSR
      *==============================================================*
      *          RTN220....UPD DATA
      *==============================================================*
14===C           RTN220    BEGSR
|    C*
|    C                     SETOF                     29
|    C           KEYSE2    CHAINAA0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
| 01-C           *IN03     DOWEQ'0'
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     SETOF                     3032
|   C                     SETON                     31    *CAN INPUT
|   C                     SETOF                     35    *ADD MSG
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C                     MOVEL*BLANK    ERRID
|   C                     MOVEL*BLANK    ERRF
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C*
| 04-C           *IN04     CASEQ'1'       RTNF4
|   C*          *IN05     CASEQ'1'       RTN260
|   C                     CAS            RTN280
| 04-C                     END
|   C*
| 05-C           *IN99     IFEQ '0'
|   C           KEYCA     CHAINAA0                  40
| 06-C           *IN40     IFEQ '0'
|   C           *IN09     ANDEQ'1'
|   C                     MOVELDVPNM     AA03
|   C                     MOVELDVPSE     AA04
|   C                     MOVELDADDR     AA05
|   C                     MOVELDPPT      AA06
|   C                     MOVELPGMNAM    AAWW      P      異動程式
|   C                     Z-ADD$A8YMD    AAXX             異動日期
|   C                     TIME           AAYY             異動時間
|   C                     MOVEL$USER     AAZZ      P      異動者　
|   C                     UPDATAA0
|   C                     MOVE 'SCR001'  APPSCR
| 06-C                     END
| 05-C                     END
|   C*
| 03*C                     ELSE
|   C                     EXSR RTN280
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
14===C                     ENDSR
      *==============================================================*
      *          RTN230....DEL DATA
      *==============================================================*
15===C           RTN230    BEGSR
|    C*
|    C                     SETON                     29
|    C           KEYSE2    CHAINAA0                  40
|    C*          *LOVAL    SETLLAA0
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     303132*NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     EXSR RTN280
| 04-C           *IN99     IFEQ '0'
|   C                     CALL 'WDS000'
|   C                     PARM 'N'       DLTFLG  1
| 05-C           DLTFLG    IFEQ 'Y'
|   C           KEYCA     CHAINAA0                  40
|   C  N40                DELETAA0
| 05-C                     END
| 04-C                     END
|   C                     MOVE 'SCR001'  APPSCR
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
|   C*
| 02-C                     END
|   C*
| 01-C                     END
|    C*
15===C                     ENDSR
      *==============================================================*
      *          RTN240....INQ DATA
      *==============================================================*
16===C           RTN240    BEGSR
|    C*
|    C                     SETON                     29
|    C           KEYSE2    CHAINAA0                  40
|    C                     EXSR RTN252                     *FIEL->SCRN
|    C                     SETOF                     3031  *NO INPUT
| 01-C           *IN03     DOWEQ'0'                        *CTL LOOP
|   C           *IN12     ANDEQ'0'
|   C           APPSCR    ANDEQ'SCR002'
|   C*
|   C                     EXFMTDSPD2
|   C                     MOVEA*ALL'0'   *IN,60
|   C                     Z-ADD0         D#ROW
|   C                     Z-ADD0         D#COL
|   C*
| 02-C           *IN03     IFEQ '0'
| 03-C           *IN12     IFEQ '0'
|   C                     MOVE 'SCR001'  APPSCR
| 03*C                     ELSE
|   C                     MOVE 'SCR001'  APPSCR
| 03-C                     END
| 02-C                     END
|   C*
| 01-C                     END
|    C*
16===C                     ENDSR
      *==============================================================*
      *          RTN251....CLEAR SCREEN DATA
      *==============================================================*
17===CSR         RTN251    BEGSR
|    C*
|    C                     MOVELDBGN1     DCA01
|    C           DCA01     CHAIN#B0                  40
|    C  N40                MOVEL#B03      D#B03
|    C   40                MOVEL*BLANK    D#B03
|    C                     MOVEL*BLANK    DVPNM
|    C                     MOVEL'M'       DVPSE
|    C                     MOVEL*BLANK    DVPCE
|    C                     MOVEL*BLANK    DADDR
|    C                     MOVEL'A'       DPPT
|    C                     MOVEL'0'       D#920
|    C                     MOVEL'90000'   D#921
|    C                     MOVEL'00000'   D#922
|    C                     MOVEL'0'       D#910
|    C                     MOVEL'99999'   D#911
|    C                     MOVEL'99999'   D#912
|    C*
17===CSR                   ENDSR
      *==============================================================*
      *          RTN252....MOVE DATA TO SCREEN
      *==============================================================*
18===CSR         RTN252    BEGSR
|    C*
|    C                     MOVELAA01      DCA01
|    C*
|    C           DCA01     CHAIN#B0                  40
|    C  N40                MOVEL#B03      D#B03
|    C   40                MOVEL*BLANK    D#B03
|    C*
|    C                     MOVELAA02      DVPCE
|    C                     MOVELAA03      DVPNM
|    C                     MOVELAA04      DVPSE
|    C                     MOVELAA05      DADDR
|    C                     MOVELAA06      DPPT
|    C                     MOVEL'0'       D#920
|    C                     MOVEL'89999'   D#921
|    C                     MOVEL'99999'   D#922
|    C                     MOVEL'0'       D#910
|    C                     MOVEL'99999'   D#911
|    C                     MOVEL'99999'   D#912
|    C*
18===CSR                   ENDSR
      *==============================================================*
      *          RTN260....F5 -- 參考資料
      *==============================================================*
19===CSR         RTN260    BEGSR
|    C*
|    C                     EXSR RTN280
|    C********************
|    C*  GET ROW,COL     *
|    C********************
| 01-C           *IN99     IFEQ '0'
|   C           #CSR      DIV  256       D#ROW            *ROW
|   C                     MVR            D#COL            *COL
| 01-C                     END
|    C                     SETON                     99
|    C*
19===C                     ENDSR
      *==============================================================*
      *          RTN280....CHECK 'SC02' SCREEN
      *==============================================================*
20===CSR         RTN280    BEGSR
|     *電話不可空白
| 01-C           DVPCE     IFEQ *BLANK
|   C                     SETON                     9961
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 01-C                     END
|    C   99                GOTO END280
|     *資料已存在不可重複新增
|    C                     MOVELDVPCE     TVPCE  20
|    C           KEYCA     CHAINAA0                  40
| 02-C           *IN40     IFEQ '0'
|   C           DOPT1     ANDEQ'1'
|   C                     SETON                     9961
|   C                     MOVEL'ERR0003' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 02-C                     END
|    C   99                GOTO END280
|     *資料不存在不可更新
|    C           KEYCA     CHAINAA0                  41
| 03-C           *IN41     IFEQ '1'
|   C           DOPT1     ANDEQ'2'
|   C                     SETON                     9961
|   C                     MOVEL'ERR0002' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 03-C                     END
|    C   99                GOTO END280
|     *電話輸入不可為數字與空白以外的文字
|    C           '01234567'CAT  '89 '     TEMP04 12
|    C           TEMP04    CHECKDVPCE:1   TEMP05  30     98
| 04-C           *IN98     IFEQ '1'
|   C                     SETON                     9961
|   C                     MOVEL'ERR0162' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 04-C                     END
|    C   99                GOTO END280
|     *電話區碼判斷
| 05-C           CELLH     IFLT '021'
|   C           CELLH     ORGT '099'
|   C                     SETON                     9961
|   C                     MOVEL'ERR0162' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 05-C                     END
|    C   99                GOTO END280
|     *手機輸入長度不能超過10位
| 06-C           CELLH2    IFEQ '09'
|    *向右
|   C           ' '       SCAN DVPCE     X       20
|   C           16        SUB  X         Y       10
|   C                     CAT  DVPCE:Y   RESET  15 P
|   C                     MOVE RESET     TEMP01 150P
|   C                     MOVELD#AL92    TEMP02 100
|   C                     MOVELD#AL9     TEMP03 100
| 07-C           TEMP01    IFLE TEMP02
|   C           TEMP01    ORGT TEMP03
|   C                     SETON                     9961
|   C                     MOVEL'ERR0162' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 07-C                     END
|   C                     MOVEL*BLANK    RESET
|   C   99                GOTO END280
| 06-C                     END
|    C*
|    C           'MF'      CHECKDVPSE:1   TEMPSE  10     98
| 08-C           *IN98     IFEQ '1'
|   C                     SETON                     9965
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 08-C                     END
|    C   99                GOTO END280
|     *
20===CSR         END280    ENDSR
     C*==============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
21===C           RTNF4     BEGSR
|    C*
|    C                     SETON                     99
|    C*
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
|    C*
|    C********************
|    C*  FOR  SCR002     *
|    C********************
|     *
|    C*          APPSCR    IFEQ 'SCR002'
|    C**
|    C*          DOPT1     IFEQ '1'
|    C**
|    C*          D#ROW     IFEQ 9
|    C*          D#COL     ANDGE16
|    C*          D#COL     ANDLE20
|    C*                    CALL 'SWD007'
|    C*                    PARM DCA01     PARMO1  2
|    C*                    PARM DCA02     PARMO2  2
|    C*          DCA03     PARM DCA03     PARMO3  5
|    C*
|    C*                    END
|    C*                    END
|    C** SCR002
|    C*                    END
|    C*
21===C           ENDF4     ENDSR
     C*==============================================================*
     C*          RTN990....AUT CHK (CALL SUBPGM)
     C*==============================================================*
22===C           RTN990    BEGSR
|    C*
|    C                     CALL 'S#S01'
|    C                     PARM $USER     S0101I 10
|    C                     PARM           S0102I 10
|    C                     PARM           S0101O  1
| 01-C           S0101O    IFEQ 'N'
|   C                     SETON                     9099
| 01-C                     END
|    C*
22===C                     ENDSR
     C*==============================================================*
     C*          ERRSR ....DATA LOCK ROUTINE
     C*==============================================================*
     C*          ERRSR     BEGSR
     C*
     C*                    CALL 'P50'
     C*          DMSG      PARM           P5001O 78
     C*                    SETON                     8099
     C*
     C*                    ENDSR'*DETC'
     C/COPY HBP2CVTR
**
新增修改      刪除查詢
