     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     H*--------------------------------------------------------------*
     H* PROGRAM NAME : VPB0011                                       *
     H* AUTHER       : JONATHAN YEH                                  *
     H* CREATE DATE  : 2014/04/02                                    *
     H* UPDATE DATE  :                                               *
     H* SYSTEM       :                                             *
     H* SUBSYSTEM    :                                             *
     H* REMARK       :直客(VIP)銷售資料上傳                      *
     H*===============================================================
     H* CODE | AUTHOR |  DATE  | DESCRIPTION
     H*---------------------------------------------------------------
     H*---------------------------------------------------------------
     H****************************************************************
     FVPB002WFIF  E           K        DISK
     FVPSDPF  UF  E           K        DISK                      A
     I*
     I           SDS
     I                                     *PROGRAM PGMNAM
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      201 2080$A8YMD
     I            DS
     I                                        1  20 WF02
     I                                        1   1 WF02A
     I                                        2  20 WF02B
     C*==============================================================*
     C*                    KEY LIST
     C*==============================================================*
     C           KEYWF     KLIST
     C                     KFLD           COM1
     C                     KFLD           COM2
     C                     KFLD           WF01
     C                     KFLD           WF03
     C*                    KFLD           WF02
     C                     KFLD           KWF02
     C                     KFLD           WF04
     C*==============================================================*
     C*                    DEFINE
     C*==============================================================*
     C           *NAMVAR   DEFN *LDA      LDA
     C           *LIKE     DEFN WF02      KWF02
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR R0100                      *INIT ENVIRM
     C*
     C                     EXSR R1000                      *PROCESS    ?
     C*
     C                     SETON                     LR
     C*===============================================================*
     C*          R0100 ... INIT SCREEN
     C*===============================================================*
01===C           R0100     BEGSR
|    C*
|    C                     SETON                     10
|    C                     IN   LDA
|    C*
|    C                     MOVEL'S1'      COM1    2
|    C                     MOVEL'C1'      COM2    2
|    C*
01===C                     ENDSR
     C*===============================================================*
     C*          R1000 ... PROCESS
     C*===============================================================*
02===C           R1000     BEGSR
|    C*
|    C           *LOVAL    SETLLWF0
|    C                     READ WF0                      46
| 01-C           *IN46     DOWEQ'0'
|   C*
|   C           WF02A     IFEQ '@'
|   C                     MOVELWF02B     KWF02     P
|   C                     ELSE
|   C                     MOVELWF02      KWF02     P
|   C                     END
|   C*
|   C           KEYWF     CHAINSD0                  40
|   C*UPLOAD DATA
| 02-C           *IN40     IFEQ '0'
|   C                     EXSR R1100
|   C                     UPDATSD0
| 02*C                     ELSE
|   C                     EXSR R1200
|   C                     WRITESD0
| 02-C                     END
|   C*
|   C                     READ WF0                      46
| 01-C                     ENDDO
|    C*
02===C           E1000     ENDSR
     C*===============================================================*
     C*          R1100 ... UPADTE FILE
     C*===============================================================*
03===C           R1100     BEGSR
|    C*
|    C                     MOVELWF05      SD07      P      銷售數量
|    C                     MOVELWF06      SD08      P      售價
|    C                     MOVELWF07      SD09      P      購買目的
|    C                     MOVELPGMNAM    SDWW      P      異動程式
|    C                     Z-ADD$A8YMD    SDXX             異動日期
|    C                     TIME           SDYY             異動時間
|    C                     MOVEL$USER     SDZZ      P      異動者　
|    C*
03===C           E1100     ENDSR
     C*===============================================================*
     C*          R1200 ... WROITE FILE
     C*===============================================================*
04===C           R1200     BEGSR
|    C*
|    C                     MOVEL'S1'      SD01      P      公司
|    C                     MOVEL'C1'      SD02      P      通路
|    C                     MOVELWF01      SD03      P      分店
|    C                     MOVELWF03      SD04      P      日期
|    C*                    MOVELWF02      SD05      P      電話
|    C                     MOVELKWF02     SD05      P      電話
|    C                     MOVELWF04      SD06      P      產品代號
|    C                     MOVELWF05      SD07      P      銷售數量
|    C                     MOVELWF06      SD08      P      售價
|    C                     MOVELWF07      SD09      P      購買目的
|    C*
|    C                     Z-ADD$A8YMD    SDVV             建檔日期
|    C                     MOVELPGMNAM    SDWW      P      異動程式
|    C                     Z-ADD0         SDXX             異動日期
|    C                     TIME           SDYY             異動時間
|    C                     MOVEL$USER     SDZZ      P      異動者　
|    C*
04===C           E1200     ENDSR
