     FZ003F1@1O   E           K        DISK
     I              X'05'                 C         A
     C*===============================================================*
     C*                    MAIN                                       *
     C*===============================================================*
     C                     EXSR R1000
     C*===============================================================*
     C*          R1000 ... PROCESS                                    *
     C*===============================================================*
     C           R1000     BEGSR
     C*
     C           'AAAAA'   CAT  A:0       WF01      P
     C           WF01      CAT  'BBB':0   WF01      P
     C           WF01      CAT  A:0       WF01      P
     C           WF01      CAT  'CCC':0   WF01      P
     C           WF01      CAT  A:0       WF01      P
     C           WF01      CAT  'SSSS':0  WF01      P
     C           WF01      CAT  X'00':0   WF01
     C*
     C                     WRITEWF0
     C*
     C                     SETON                     LR
     C*
     C                     ENDSR
