     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    PROGRAM ID   : INT014                                     *
     A*    AUTHOR       : A1546 VINCENT                              *
     A*    DATE WRITTEN : 97/10/08                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :庫存管理系統                              *
     A*    REMARK       :現場分店存貨查詢(I)                       *
     A*===============================================================
     FINTOLF02IF  E           K        DISK
     F                                              KINFDS TORCDN
     F            TQ0                               KRENAMETQ0L2
     FUTL2PF  IF  E           K        DISK
     F***UTL3PF  IF  E           K        DISK
     E*
     E********************WL303   1   1 10
     ITORCDN      DS
     I                                     *RECORD  RCDR
     I            DS
     I                                        1   2 TO06
     I                                        1   1 TO06F
     I            DS
     I                                        1  32 L203
     I                                        1   1 L203F
     C*==============================================================*
     C*                    PARAMETER                                 *
     C*==============================================================*
     C           *ENTRY    PLIST
     C           DBGN1     PARM           P01     2        公司別
     C           DBGN2     PARM           P02     2        通路
     C                     PARM           P03     60       庫存年月
     C           DBGN4     PARM           P04     5        分店代號
     C           DBGN3     PARM           P05     9        產品代號
     C                     PARM TQTY      P06     60       數量
     C*==============================================================*
     C*                    DEFINE
     C*==============================================================*
     C           *LIKE     DEFN TO01      DBGN1            公司別
     C           *LIKE     DEFN TO02      DBGN2            通路
     C           *LIKE     DEFN TO04      DBGN3            產品代號
     C           *LIKE     DEFN TO03      DBGN4            分店代號
     C           *LIKE     DEFN TO121     DQTY             數量
     C           *LIKE     DEFN TO121     TQTY             數量
     C*==============================================================*
     C*                    KLIST
     C*==============================================================*
     C           KEYO22    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C                     KFLD           DBGN3
     C                     KFLD           DBGN4
     C                     KFLD           WBGN21           *(YY/MM/DD)
     C           KEYO24    KLIST
     C                     KFLD           DBGN1
     C                     KFLD           DBGN2
     C                     KFLD           DBGN3
     C                     KFLD           DBGN4
     C           KEYL2     KLIST
     C                     KFLD           L201
     C                     KFLD           L202
     C***********KEYL3     KLIST
     C***********          KFLD           L301
     C***********          KFLD           L302
     C*==============================================================*
     C*                    MAIN ROUTINE                              *
     C*==============================================================*
     C                     Z-ADD20291231  WBGN21  80       *日期YMD
     C*
     C           KEYO22    SETLLINTOLF02
     C           KEYO24    READEINTOLF02                 46
     C           *IN46     DOWEQ'0'
     C                     EXSR R1000                      *PROCESS
     C           KEYO24    READEINTOLF02                 46
     C                     ENDDO
     C*
     C                     SETON                     LR
     C*==============================================================*
     C*          R1000 ... PROCESS                                   *
     C*==============================================================*
     CSR         R1000     BEGSR
     C******
     C*(異動日期-CHANGE TO MM/DD/YY)
     C******
     C*********************Z-ADDTO05      XTO05   60
     C*********************CALL 'RES001'
     C*********************PARM 'YMD'     S001I1  3
     C*********************PARM XTO05     S001I2  60
     C***********DTO05     PARM           S001O1  60
     C***
     C*(CHAIN單別說明)
     C***
     C*********************MOVE *BLANK    L301
     C*********************MOVE *BLANK    L302
     C*********************MOVELTO06F     L301
     C*********************MOVELTO06      L302
     C***********KEYL3     CHAINL30                  47
     C***47                MOVE *BLANK    DL303
     C**N47                MOVELL303      DL303
     C* 調撥在途
     C***********RCDR      IFEQ 'TD0T'
     C***********RCDR      OREQ 'TD0T#'
     C*********************MOVELWL303,1   DL303
     C*********************ENDIF
     C******
     C*(數量)
     C******
     C                     Z-ADD0         DQTY
     C*********************Z-ADD0         DQTY1
     C*********************MOVE *BLANK    DMEMO
     C                     MOVE *BLANK    L201
     C                     MOVEL'INTOLF ' L201
     C                     MOVELRCDR      L202
     C           KEYL2     CHAINL20                  48
     C           *IN48     IFEQ '0'
     C                     SELEC
     C           L203F     WHEQ '-'
     C           TO121     MULT -1        DQTY
     C           L203F     WHEQ '@'
     C           TO121     MULT -1        DQTY
     C                     OTHER
     C                     Z-ADDTO121     DQTY
     C                     ENDSL
     C***********TO06      IFEQ 'E1'
     C***********DQTY      MULT -1        DQTY1
     C*********************MOVEL'陳列'  DMEMO
     C*********************ENDIF
     C                     ENDIF
     C*
     C                     ADD  DQTY      TQTY
     C*
     CSR                   ENDSR
