      ****************************************************************
      *   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
      *                                                              *
      * PROGRAM NAME : PIA0082                                       *
      * AUTHER       : A1650  DEREK                                  *
      * CREATE DATE  : 111/03/26                                     *
      * UPDATE DATE  :                                               *
      * SYSTEM       :                                               *
      * SUBSYSTEM    :                                               *
      * REMARK       :盤點更新還原                                 *
      ****************************************************************
     FINPIPF  IF  E           K        DISK
     FINPSPF  IF  E           K        DISK
     FINTPPF  UF  E           K        DISK
     FINTNPF  UF  E           K        DISK
      *==============================================================*
     I*
     I           UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      152 161 $USERN
     I                                      111 1160$CHYMD
     I                                      201 2080$A8YMD
     I                                      203 2080A6YMD
     I                                      500 500 $DATA
     I* PROGRAM USE DATA DEFINE ++++++++++++++++++++++++++++++++++++++
     I                                      501 502 DPI01
     I                                      503 5060DPI02
     I                                      507 5120DPIYM
     I                                      513 5140D25
     I                                      507 5140DPIYMD
     I                                      509 5140DPXYMD
     ISCDA03      DS
     I                                        1   60DA03
     I            DS
     I                                        1   5 PS02
     I                                        1   1 PS021
     IDA02        DS
     I                                        1   43DUTY
      *==============================================================*
      *                    KEY LIST
      *==============================================================*
     C           KEYPS     KLIST
     C                     KFLD           DPI01            公司別
     C                     KFLD           DPIYM            年月
     C           KEYTN     KLIST
     C                     KFLD           PS01             公司別
     C                     KFLD           XTB03   2        通路
     C                     KFLD           PS09             供應商代號
     C                     KFLD           PS02             分店代號
     C                     KFLD           PS03             產品代號
     C                     KFLD           PS04             陳列驗收單號
      *==============================================================*
      *                    DEFN ROUTINE
      *==============================================================*
     C           *NAMVAR   DEFN           DA02             稅率REFLIB
     C           *NAMVAR   DEFN           SCDA03
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N10                EXSR RTN010
     C*
     C           KEYPS     SETLLPS0
     C           KEYPS     READEPS0                      40
  03-C           *IN40     DOWEQ'0'
    C                     EXSR RTN400                     INTNPF
    C           KEYPS     READEPS0                      40
  03-C                     ENDDO
     C*
     C           *LOCK     IN   SCDA03
     C                     Z-ADDDPIYM     DA03
     C                     OUT  SCDA03
     C*
     C                     SETON                     LR
     C*
      *==============================================================*
      *          RTN010....UPDATE INTAPF
      *==============================================================*
01===C           RTN010    BEGSR
|    C*
|    C                     MOVEL'C1'      XTB03
|    C                     Z-ADD25        D25
|    C                     MOVEL'N'       @WRT    1
|    C*
|    C                     IN   DA02
|    C*
|    C                     IN   SCDA03
|    C*
|    C                     SETON                     10
|    C*
01===C                     ENDSR
      *==============================================================*
      *          RTN400....DETAIL  UPDATE INTNPF
      *==============================================================*
05===C           RTN400    BEGSR
     C           PS021     IFEQ 'C'
 00A+C           PS021     OREQ 'W'
     C                     MOVEL'C1'      XTB03
     C                     ENDIF
     C           PS021     IFEQ 'D'
     C                     MOVEL'D '      XTB03
     C                     ENDIF
     C*
|    C           KEYTN     CHAINTN0                  44
| 01-C           *IN44     IFEQ '0'
|   C                     ADD  PS06      TN07             陳列餘量
|   C                     SUB  PS06      TN17             陳列調整
|   C                     UPDATTN0
| 01-C                     ENDIF
05===C                     ENDSR
      *==============================================================*
