     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARA010AP                                   *
     A*    AUTHOR       : A1118  PHILIP                              *
     A*    CREATE DATE  : 81/04/28                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARA010                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    REMARK       :統一發票申報錯誤報表列印                  *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    47MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    50'統一發票申報狀況報表'
     A                                      SPACEA(2)
     A                                     1'公　司　:'
     A            DSI01     R        O    13REFFLD(SI01)
     A                                    92'日期:'
     A            $EGMDY         6  0     +1EDTCDE(Y)
     A                                    +1'頁次:'
     A                                    +1PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'申報年月:'
     A            DSI21S         4  0O    +1EDTWRD('  /  ')
     A                                    +2'(MM/YY)'
     A                                    92'時間:'
     A                                    +1TIME
     A                                    +2'<ARA010AP>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                    18'發票'
     A                                    81'　客戶　'
     A                                   108'發票'
     A                                   114'作廢'
     A                                   120'申報'
     A                                      SPACEA(1)
     A                                     1'發票號碼'
     A                                    18'聯數'
     A                                    24'發票日期'
     A                                    36'發票金額'
     A                                    49'客戶代號／名稱'
     A                                    81'統一編號'
     A                                    92'訂單號碼'
     A                                   108'狀態'
     A                                   114'註記'
     A                                   120'狀態'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            SI02      R              2
     A            SI17      R             20
M001MA            PSI21          6  0     25
     A                                      EDTCDE(Y)
     A            SI25      R             34EDTCDE(J)
     A            SI08      R             50
     A            SI09      R             56
     A            ME04      R             61
     A            MD17      R             82
     A            SI10      R             93
     A            SI18      R            110
     A            SI19      R            116
     A            MARK           8       120
     A*----------------------------------------------------------------
     A*         R PD2
     A*                                    1'====================+
     A*                                      ====================+
     A*                                      ====================+
     A*                                      ===================='
     A*                                     SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'<<ARA010AP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
