     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARA010BP                                   *
     A*    AUTHOR       : A1118  PHILIP                              *
     A*    CREATE DATE  : 81/04/29                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARA010                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    REMARK       :統一發票申報表列印                        *
     A*===============================================================
     A* MODI CODE |  AUTHOR  |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
      *  M001     | MICHELLE |02.01.04|讀取發票檔得非營業人稅額
     A*---------------------------------------------------------------
      *  M002     | MICHELLE |02.03.19|應稅擴增欄位長度
      *---------------------------------------------------------------
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(4)
     A            AJ02Y          2  0     55
     A            AJ02M          2  0     64
     A                                      SPACEA(3)
     A            #B12      R             20
     A                                      SPACEA(2)
     A            #B02      R             19
     A                                      SPACEA(2)
     A            #B13      R             20
     A            AJ031          2        92
     A            AJ032          6       101
     A                                      SPACEA(6)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(2)
     A            SEQ1           2  0      3
     A            MD171     R              7REFFLD(MD17)
     A            SI231     R             19REFFLD(SI23) EDTCDE(2)
     A            SI2211         1        32
     A            SI2221         1        35
     A            SI2231         1        38
     A            SI241     R             40REFFLD(SI24) EDTCDE(2)
     A            SEQ2           2  0     61
     A            MD172     R             64REFFLD(MD17)
     A            SI232     R             76REFFLD(SI23) EDTCDE(2)
     A            SI2212         1        87
     A            SI2222         1        91
     A            SI2232         1        95
     A            SI242     R             97REFFLD(SI24) EDTCDE(2)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(7)
M002MA*           AJ04      R             38EDTCDE(3)
M002MA            AJ04      R             39EDTCDE(3)
     A            AJ05      R             42EDTCDE(3)
     A            AJ06      R             47EDTCDE(3)
     A            AJ07      R             52EDTCDE(3)
     A            AJBK           3  0     56EDTCDE(3)
M001MA*           AJ08      R             57EDTCDE(3)
M001MA            AJ08      R             59EDTCDE(2)
     A*           AJ09      R             64EDTCDE(3)
M001MA            AJ09      R             69EDTCDE(3)
     A*           AJ10      R             71EDTCDE(3)
M001MA            AJ10      R             77EDTCDE(3)
M001AA            AJ1014         9  0     84EDTCDE(3)
M001AA            AJ14           9  0     91EDTCDE(3)
     A*           AJ11      R             92EDTCDE(3)
M001MA            AJ11      R             98EDTCDE(4)
     A*           AJ12      R            104EDTCDE(1)
M001MA            AJ12      R            106EDTCDE(3)
     A                                      SPACEA(2)
M002MA* 30        AI03      R             38EDTCDE(3)
M002MA  30        AI03           4  0     38EDTCDE(3)
     A  30        AI04      R             42EDTCDE(3)
     A  30        AI05      R             47EDTCDE(3)
     A  30        AI06      R             52EDTCDE(3)
     A  30        AIBKT          3  0     56EDTCDE(3)
     A* 30        AI07      R             57EDTCDE(3)
M001MA  30        AI07      R             59EDTCDE(2)
     A* 30        AI08      R             64EDTCDE(3)
M001MA  30        AI08      R             69EDTCDE(3)
     A* 30        AI09      R             71EDTCDE(3)
M001MA  30        AI09      R             77EDTCDE(3)
     A* 30        AI09C          9  0     78EDTCDE(3)
M001MA  30        AI09C          9  0     84EDTCDE(3)
     A* 30        AI09TX         9  0     85EDTCDE(3)
M001MA  30        AI13           9  0     91EDTCDE(3)
     A* 30        AI10      R             92EDTCDE(3)
M001MA  30        AI10      R             98EDTCDE(4)
     A* 30        AI11      R            104EDTCDE(1)
M001MA  30        AI11      R            106EDTCDE(3)
     A                                    +1' '
     A                                      SPACEA(2)
     A            AI12      R             75EDTCDE(1)
     A            PAGEM          3  0     90EDTCDE(1)
