     A*%%TS  SD  19930830  152617  D910121     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : ARA016D                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 82/08/25                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARA016                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業系統                          *
     A*    REMARK       :人工發票控制維護　 (A/U/D/I)              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.17 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M004      | 00.05.04 |菸酒稅實施，修改應稅
     A*---------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R SFLSR1                    SFL
     A*%%TS  SD  19930830  152617  D910121     REL-V2R2M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B 10  3
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                      VALUES(' ' '2' '4' '5' '6')
     A            SS01      R        O 10  5
M001MA            DSS21          6Y 0O 10  8
     A                                      EDTCDE(Y)
     A            SS08      R        O 10 19
     A            SS02      R        O 10 37
     A            SS27      R        O 10 48EDTCDE(1)
     A            SS28      R        O 10 63EDTCDE(1)
     A            SS20      R        O 10 76
     A            SS36      R        O 10 78
M001MA            DSS22          6Y 0O 11  8
     A                                      EDTCDE(Y)
     A            ME04      R        O 11 18
     A            SS04      R        O 11 37
     A            SS25      R        O 11 48EDTCDE(1)
     A            SS26      R        O 11 63EDTCDE(1)
     A*  91/05/13  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19930830  152617  D910121     REL-V2R2M0  5738-PW1
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0005)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CF06(06)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'ARA016'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'人工發票控制維護'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  1'輸入作業選擇:'
     A                                  6  6'2=修改'
     A                                  6 16'4=刪除'
     A                                  6 26'5=查詢'
     A                                  6 36'6=明細查詢'
     A                                  7  3' 公'
     A                                  7 74'申過'
     A                                  8  3'A司　發票日期客戶代號　　　　+
     A                                      　　發票號碼  　金　額　　　折+
     A                                      扣金額　報帳'
     A                                      DSPATR(UL)
     A            DBGN1     R        B  9  5REFFLD(SS01)
     A            DBGN2          6Y 0B  9  8EDTCDE(Y)
     A            DBGN3     R        B  9 19REFFLD(SS08)
     A            DBGN4     R        B  9 37REFFLD(SS02)
     A          R DSPC1
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F6 =新增'
     A*
     A  98        ERR0          63A  O 24  2MSGID(CPF 5203 PTMF)
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          63A  O 24  2MSGID(URE 0126 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         63A  O 24  2MSGID(URE 0038 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A          R DSPD2
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF12(12)
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'ARA016'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR003'
     A                                  2 30'人工發票控制維護'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  4'原發票公司:'
     A            DSS01     R        O  5 18REFFLD(SS01)
     A            #B03A     R        O  5 21REFFLD(#B03)
     A                                  5 44'　原發票號碼:'
     A            DSS02     R        O  5 60REFFLD(SI02)
M004MA*                                 7  2'人工發票公司:'
M004MA*           DSS03     R        O  7 18REFFLD(SS03)
M004MA*           #B03B     R        O  7 21REFFLD(#B03)
M004MA*                                 7 44'人工發票號碼:'
M004MA*           DSS04     R        B  7 60REFFLD(SS04)
M004MA                                  6  2'人工發票公司:'
M004MA            DSS03     R        O  6 18REFFLD(SS03)
M004MA            #B03B     R        O  6 21REFFLD(#B03)
M004MA                                  6 44'人工發票號碼:'
M004MA            DSS04     R        B  6 60REFFLD(SS04)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
M004MA*                                 9  2'　　客戶代號:'
M004MA*           DSS08     R        O  9 18REFFLD(SS08)
M004MA*           DSS09     R        O  9 24REFFLD(SS09)
M004MA*           ME04      R        O  9 29
M004MA*                                 9 48'送貨日期:'
M001MA*M004M      DSS06C         6Y 0O  9 60
M004MA                                  7  2'　　客戶代號:'
M004MA            DSS08     R        O  7 18REFFLD(SS08)
M004MA            DSS09     R        O  7 24REFFLD(SS09)
M004MA            ME04      R        O  7 29
M004MA                                  7 48'送貨日期:'
M001MA            DSS06C         6Y 0O  7 60
     A                                      EDTCDE(Y)
M004MA*                                11  2'　　　　原因:'
M004MA*           DSS16     R        B 11 18REFFLD(SS16)
M004MA                                  8  2'　　　　原因:'
M004MA            DSS16     R        B  8 18REFFLD(SS16)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
M004MA*           #A03      R        O 11 22
M004MA            #A03      R        O  8 22
M004MA*                                13  2'人工發票日期:'
M001MA*M004M      DSS22C         6Y 0B 13 18
M004MA                                  9  2'人工發票日期:'
M001MA            DSS22C         6Y 0B  9 18
     A                                      EDTCDE(Y)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
M004MA*                                10 44'　　退貨單號:'
M004MA*           DSS11     R        B 10 60REFFLD(SS11)
M004MA                                  9 44'　　退貨單號:'
M004MA            DSS11     R        B  9 60REFFLD(SS11)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
M004AA                                 11  2'　原銷售金額:'
M004AA            DSS32     R        O 11 18EDTCDE(J)
M004AA                                      REFFLD(SS27)
M004MA*                                15  2'　原發票金額:'
M004MA*           DSS27     R        O 15 18EDTCDE(J)
M004MA                                 13  2'　原發票金額:'
M004MA            DSS27     R        O 13 18EDTCDE(J)
     A                                      REFFLD(SS27)
M004MA*                                13 44'　原折扣金額:'
M004MA*           DSS28     R        O 13 60EDTCDE(J)
M004MA                                 11 44'　原折扣金額:'
M004MA            DSS28     R        O 11 60EDTCDE(J)
     A                                      REFFLD(SS27)
M004AA                                 12  2'　原發票稅額:'
M004AA            DSS30          7  0O 12 20
M004AA                                      EDTCDE(J)
M004AA                                 15  2'人工銷售金額:'
M004AA            DSS31     R        B 15 18REFFLD(SS25)
M004AA                                      EDTCDE(J)
M004AA  62                                  DSPATR(PC)
M004AA  62                                  DSPATR(RI)
M004AA  31                                  DSPATR(UL)
M004AA N31                                  DSPATR(PR)
M004MA*                                18  2'人工發票金額:'
M004MA*           DSS25     R        B 18 18REFFLD(SS25)
M004MA                                 17  2'人工發票金額:'
M004MA            DSS25     R        O 17 18REFFLD(SS25)
     A                                      EDTCDE(J)
     A* 66                                  DSPATR(PC)
     A* 66                                  DSPATR(RI)
     A* 31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
M004MA*                                15 44'人工折扣金額:'
M004MA*           DSS26     R        B 15 60REFFLD(SS26)
M004MA                                 12 44'人工折扣金額:'
M004MA            DSS26     R        B 12 60REFFLD(SS26)
     A                                      EDTCDE(J)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
M004AA                                 16  2'人工發票稅額:'
M004AA            DSS29          7  0B 16 20
M004AA                                      EDTCDE(J)
M004AA  69                                  DSPATR(PC)
M004AA  69                                  DSPATR(RI)
M004AA  31                                  DSPATR(UL)
M004AA N31                                  DSPATR(PR)
M004AA                                 15 44'差異銷售金額:'
M004AA            DIFSA     R        O 15 60REFFLD(SS25)
M004AA                                      EDTCDE(J)
M004AA                                 16 44'差異發票稅額:'
M004AA            DIFTX          7  0O 16 62
M004AA                                      EDTCDE(J)
M004AA                                 17 44'差異發票金額:'
M004AA            DIF25     R        O 17 60REFFLD(SS25)
M004AA                                      EDTCDE(J)
M004MA*                                19 44'　　過帳註記:'
M004MA*           DSS36     R        O 19 60REFFLD(SS36)
M004MA                                 19  2'　　過帳註記:'
M004MA            DSS36     R        O 19 18REFFLD(SS36)
M004MA*                                17 44'　　申報註記:'
M004MA*           DSS20     R        O 17 60REFFLD(SS20)
M004MA                                 19 44'　　申報註記:'
M004MA            DSS20     R        O 19 60REFFLD(SS20)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 22 42'F5 =參考資料'
     A                                 22 58'F12=回前畫面'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          63A  O 24  2MSGID(URE 0080 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         63A  O 24  2MSGID(UPT 0011 PTMF)
     A                                      DSPATR(HI)
     A  86        ERR11         63A  O 24  2MSGID(UPT 0012 PTMF)
     A                                      DSPATR(HI)
     A  85        ERR12         63A  O 24  2MSGID(URE 0135 REMF)
     A                                      DSPATR(HI)
M004AA  84        ERR13         63A  O 24  2MSGID(URE 0158 REMF)
M004AA                                      DSPATR(HI)
M004AA  83        ERR14         63A  O 24  2MSGID(URE 0159 REMF)
M004AA                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
