     A*================================================================
     A*  MODI CODE |  AUTHOR  |  DATE  | DESCRIPTION
     A*----------------------------------------------------------------
     A*  M001      | MICHELLE | 990820 | OLD SOURCD LOSE RE-MODIFY
     A*================================================================
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF04(04 '視窗執行')
     A                                      CF14(14 '處理作業')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'ARA014'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 29'　　沖帳批次處理　　'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6 23'收款公司　:'
     A            DAC01          2A  B  6 37
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                  7 23'沖帳公司　:'
     A            DAD10S         2A  B  7 37
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  7 41'-'
     A            DAD10E         2A  B  7 43
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  8 23'客戶別　　:'
     A            DAC02          5A  O  8 37
     A                                  9 23'收款金額　:'
     A            DAC08     R        B  9 37REFFLD(AC08)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                  9 49'(種類: 20現金)'
M001MA*                                10 23'入帳帳號　:'
M001MA*                                     DSPATR(HI)
M001MA                                 10 23'入帳帳號　:'
M001MA                                      DSPATR(HI)
M001MA*           DAC12         14A  H
M001MA            DAC121         6A  B 10 37
M001MA**                                     CHECK(RB)
M001MA**N65                                  DSPATR(HI)
M001MA** 65                                  DSPATR(RI)
M001MA** 65                                  DSPATR(PC)
M001MA N65                                  DSPATR(HI)
M001MA  65                                  DSPATR(RI)
M001MA  65                                  DSPATR(PC)
     A                                 11 23'收款日期　:'
     A            DAC04          6Y 0B 11 37EDTWRD('  /  /  ')
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                 11 49'(MM/DD/YY)'
     A                                 14 17'+----------------------------------
     A                                      --------------+'
     A                                 15 17'|'
     A                                 15 65'|'
     A                                 16 17'|請按F14以便處理此作業，否則按-
     A                                      F3結束此作業|'
     A                                 17 17'|'
     A                                 17 65'|'
     A                                 18 17'+----------------------------------
     A                                      --------------+'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F14=處理作業'
     A  98        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          63A  O 24  2MSGID(UPT 2111 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          63A  O 24  2MSGID(URE 0051 REMF)
     A                                      DSPATR(HI)
     A  95        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          63A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR11         50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR12         50A  O 24  2MSGID(URE 0108 REMF)
     A                                      DSPATR(HI)
     A  87        ERR13         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  86        ERR14         50A  O 24  2MSGID(URE 0064 REMF)
     A                                      DSPATR(HI)
     A  85        ERR15         50A  O 24  2MSGID(URE 0099 REMF)
     A                                      DSPATR(HI)
     A  84        ERR16         50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
