     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : ARA000D                                    *
     A*    AUTHOR       :                                            *
     A*    CREATE DATE  : 10/30/96                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARA000                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款                                  *
     A*    REMARK       :銷退折讓處理                              *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*
     A                                      CA03(03)
     A                                  1  2'ARA000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A*                                 1 62'日期:'
     A*           $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 33'銷退折讓處理'
     A                                      DSPATR(HI)
     A*                                 2 62'時間:'
     A*                                 2 70TIME
     A*                                     EDTWRD('  :  :  ')
     A*                                 3 62' USER :'
     A*           $USER         10A  O  3 70
     A                                 11 20'請輸入選項:'
     A            DENT           1   B 11 34VALUES('A' 'B')
     A                                 11 38'A -銷退折讓處理'
     A                                 12 38'B -康齡銷退庫存量檢核報表'
     A                                 16 13'執行康齡的銷退單折讓處理請先做+
     A                                       ( B -康齡銷退庫存量檢核報表)'
     A                                       DSPATR(HI)
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A*                                   +8'F12=回前畫面'
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
