     A*%%TS  SD  19920727  092559  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARA009D                                    *
     A*    AUTHOR       : A1187  JOYCE                               *
     A*    CREATE DATE  : 81/03/18                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARA009                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :轉帳資料批次作業                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19920727  092559  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF14(14 '處理作業')
     A                                      CF04(04 '視窗作業')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'ARA009'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'轉帳資料批次作業'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6 24'公司別  :'
     A            DSC01S    R        B  6 36REFFLD(SC01)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A N66                                  DSPATR(HI)
     A                                  6 39'-'
     A            DSC01E    R        B  6 41REFFLD(SC01)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A N66                                  DSPATR(HI)
     A                                 10 24'地區    :'
     A            DSC31S    R        B 10 36REFFLD(SC31)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A N64                                  DSPATR(HI)
     A                                 10 39'-'
     A            DSC31E    R        B 10 41REFFLD(SC31)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A N64                                  DSPATR(HI)
     A                                 14 24'單據號碼:'
     A                                 12 24'確認日期:'
M001MA            DSC39S         6Y 0B 12 36
     A                                      EDTWRD('  /  /  ')
     A N61                                  DSPATR(PR)
     A  61                                  DSPATR(UL)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                 12 45'-'
M001MA            DSC39E         6Y 0B 12 47
     A                                      EDTWRD('  /  /  ')
     A N62                                  DSPATR(PR)
     A  62                                  DSPATR(UL)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                 12 59'(MM/DD/YY)'
     A                                  8 24'通路    :'
     A            DSC33S    R        B  8 36REFFLD(SC33)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A N63                                  DSPATR(HI)
     A                                  8 39'-'
     A            DSC33E    R        B  8 41REFFLD(SC33)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A N63                                  DSPATR(HI)
     A                                 14 24'單據號碼:'
     A            DSC02S    R        B 14 36REFFLD(SC02)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                 14 49'-'
     A            DSC02E    R        B 14 51REFFLD(SC02)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F04=視窗查詢'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR10         50A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR11         50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR12         50A  O 24  2MSGID(URE 0108 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                 22 44'F14=處理作業'
