     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : ARA014P                                    *
     A*    AUTHOR       : TINA WHANG                                 *
     A*    CREATE DATE  : 82/03/05                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARA014P                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款系統                              *
     A*    REMARK       :沖帳批次作業處理明細                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    30MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    32'沖帳批次作業處理明細表'
     A                                      SPACEA(1)
     A                                     1'收款公司:'
     A            AC01      R             13REFFLD(AC01)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            AC02      R             13REFFLD(AC02)
     A                                      SPACEA(1)
     A                                     1'收款種類:'
     A            AC05      R             13REFFLD(AC05)
     A            D#A03          8   O    18
     A                                      SPACEA(1)
     A                                     1'原輸入金額:'
     A            DAC08     R             15REFFLD(AC08)
     A                                      EDTCDE(J)
     A                                    50'日期:'
     A            $EGMDY         6  0O    58EDTCDE(Y)
     A                                    69'頁次:'
     A                                    76PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'收款金額　:'
     A            AC08      R             15REFFLD(AC08)
     A                                      EDTCDE(J)
     A                                    50'時間:'
     A                                    58TIME
     A                                      SPACEA(1)
     A                                     1'收款日期　:'
M001MA*           AC04      R             15REFFLD(AC04)
M001MA            LAC04          6  0     15
     A                                      EDTWRD('  /  /  ')
     A                                    50' USER :'
     A            $USER         10   O    58
     A                                    69'<ARR014>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =='
     A                                      SPACEA(1)
     A                                     1'發票日期'
     A                                    15'發票公司'
     A                                    30'發票號碼'
     A                                    45'分配日期'
     A                                    60'沖銷金額'
     A                                    72'收款日期'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  21                                 1' '
     A                                      SPACEA(1)
M001MA            WAD11          6  0      2
     A                                      EDTWRD('  /  /  ')
     A            AD10      R             19REFFLD(AD10)
     A            AD07      R             30REFFLD(AD07)
M001MA            WAD12          6  0     46
     A                                      EDTWRD('  /  /  ')
     A            AD08      R             57REFFLD(AD08)
     A                                      EDTCDE(J)
M001MA            WAD04          6  0     72
     A                                      EDTWRD('  /  /  ')
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A  21                                 1' '
     A                                      SPACEA(1)
     A                                    30'合計沖銷金額-------->'
     A            TOT1      R             57REFFLD(AD08)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A  21                                 1' '
     A                                      SPACEA(1)
     A                                    30'未分配金額　-------->'
     A            AC10      R             57REFFLD(AC10)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =='
     A                                      SPACEA(1)
     A                                     2'<<ARR014>>--->報表結束'
