     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARA009P                                    *
     A*    AUTHOR       : A1034 STEPHANIE                            *
     A*    CREATE DATE  : 81/06/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARA009                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :轉帳批次作業處理報表列印                  *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    27MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    28'轉帳批次作業處理報表列印'
     A                                      SPACEA(2)
     A                                     1'確認日期:'
M001MA            DSC39S         6  0O    13
     A                                      EDTCDE(Y)
     A                                    22'-'
M001MA            DSC39E         6  0O    24
     A                                      EDTCDE(Y)
     A                                      SPACEA(1)
     A                                     1'通路　　:'
     A            DSC33S    R        O    13REFFLD(SC33)
     A                                    22'-'
     A            DSC33E    R        O    24REFFLD(SC33)
     A                                      SPACEA(1)
     A                                     1'地區　　:'
     A            DSC31S    R        O    13REFFLD(SC31)
     A                                    22'-'
     A            DSC31E    R        O    24REFFLD(SC31)
     A                                    51'日期:'
     A            $EGMDY         6  0O    59EDTCDE(Y)
     A                                    68'頁次:'
     A                                    76PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'單據號碼:'
     A            DSC02S    R        O    13REFFLD(SC02)
     A                                    22'-'
     A            DSC02E    R        O    24REFFLD(SC02)
     A                                    51'時間:'
     A                                    59TIME
     A                                    70'<ARA009>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'原始單據'
     A                                    18'發票號碼'
     A                                    34'轉帳單據'
     A                                    50'發票號碼'
     A                                    66'還原保留量'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            SP01      R              2
     A            SP03      R             19
     A            SP02      R             34
     A            SP04      R             51
     A            SP05      R             69
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<ARA009>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
