     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    47MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    50'統一發票未確認表'
     A                                      SPACEA(2)
     A                                     1'公　司　:'
     A            DSI01     R        O    13REFFLD(SI01)
     A                                    92'日期:'
     A            $EGMDY         6  0     +1EDTCDE(Y)
     A                                    +1'頁次:'
     A                                    +1PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'申報年月:'
     A            DSI21S         4  0O    +1EDTWRD('  /  ')
     A                                    +2'(MM/YY)'
     A                                    92'時間:'
     A                                    +1TIME
     A                                    +2'<ARA010P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                    18'發票'
     A                                    81'　客戶　'
     A                                      SPACEA(1)
     A                                     1'發票號碼'
     A                                    18'聯數'
     A                                    24'發票日期'
     A                                    36'發票金額'
     A                                    49'客戶代號／名稱'
     A                                    81'統一編號'
     A                                    92'訂單號碼'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            SI02      R              2
     A            SI17      R             20
M001MA            PSI21          6  0     25
     A                                      EDTCDE(Y)
     A            SI25      R             34EDTCDE(J)
     A            SI08      R             50
     A            SI09      R             56
     A            ME04      R             61
     A            MD17      R             82
     A            SI10      R             93
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'<<ARA010P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
