     A*%%TS  SD  20020916  160654  REPGMR      REL-V4R4M0  5769-PW1
     A*  81/02/17  11:09:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : ARA0052D                                   *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/03/26                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARA005                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :收款沖帳處理－沖帳修改                    *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.09 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A* M004      | 00.10.16 |顯示正負數
     A*---------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A*
     A          R SFLSR1                    SFL
     A*%%TS  SD  20020916  160654  REPGMR      REL-V4R4M0  5769-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B 13  2VALUES(' ' '2' '4' '5' '7')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            AD07      R        O 13 13
     A            SI11      R        O 13 24
     A            SI25      R        O 13 37EDTCDE(L)
     A            SI30      R        O 13 48EDTCDE(L)
     A            DAD08     R        B 13 60REFFLD(AD08)
     A                                      EDTCDE(3)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A            DAD12          6Y 0O 13 72EDTCDE(4)
     A            AD10      R        O 13 79
     A            HAD08     R        H      REFFLD(AD08)
     A            DAD11          6Y 0O 13  4EDTWRD('  /  /  ')
     A            HAD09     R        H      REFFLD(AD09)
     A*------------------------------------------------------------
     A*
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  20020916  160654  REPGMR      REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0008)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'ARA005'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR004'
     A                                  2 35'沖帳修改'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司　　:'
     A            AC01      R        O  4 14
     A            #B03      R        O  4 17
     A                                  4 39'客戶代號:'
     A            AC02      R        O  4 51
     A            AC03      R        O  4 57
     A            ME04      R        O  4 62
     A                                  5  2'收款日期:'
     A            DAC04          6Y 0O  5 14EDTWRD('  /  /  ')
     A                                  5 23'(MM/DD/YY)'
     A                                  5 39'種類　　:'
     A            AC05      R        O  5 51
     A            MTYPE          6A  O  5 54
     A                                  6  2'收款金額:'
     A            AC08      R        O  6 14EDTCDE(1)
     A                                  6 37'未分配餘額:'
     A            AC10      R        O  6 51EDTCDE(J)
     A                                  7  2'票據號碼:'
     A            AC06      R        O  7 14
     A                                  7 39'兌現日期:'
     A            DAC07          6Y 0O  7 51EDTWRD('  /  /  ')
     A                                  7 61'(MM/DD/YY)'
     A                                  9  2'輸入作業選擇:'
     A                                  9 20'2=修改'
     A                                  9 31'4=清除'
     A                                  9 42'5=沖帳查詢'
     A                                  9 56'7=明細查詢'
     A            DBGN1     R        B 12 13REFFLD(AD07)
     A            DBGN0          6Y 0B 12  4EDTCDE(Y)
     A                                 11  2'A發票日期發票號碼  送貨單號+
     A                                      碼發票金額未收餘額  沖銷金+
     A                                      額 日期公司'
     A                                      DSPATR(UL)
     A                                 10  3'(MM/DD/YY)'
     A                                 10 70'分配發票'
     A*------------------------------------------------------------
     A          R DSPC1
     A*
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F12=回前畫面'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          63A  O 24  2MSGID(URE 0048 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         63A  O 24  2MSGID(URE 0123 REMF)
     A                                      DSPATR(HI)
     A  86        ERR11         63A  O 24  2MSGID(URE 0124 REMF)
     A                                      DSPATR(HI)
     A  85        ERR12         63A  O 24  2MSGID(URE 0064 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A          R SFLSR2                    SFL
     A*%%TS  SD  19920514  110455  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN2           4S 0H
     A            SJ03      R        O 12  3
     A            D#A       R        O 12 14REFFLD(SJ04)
     A                                      EDTCDE(1)
     A            SJ13           4Y 0O 12 22EDTCDE(1)
     A            PRICE          5Y 0O 12 29EDTCDE(1)
     A            DSJ06          8Y 0O 12 36EDTCDE(1)
     A            SJ14           5Y 0O 12 50EDTCDE(1)
     A            SJ15           4Y 0O 12 61EDTCDE(1)
     A            SJ09           9Y 0O 12 67EDTCDE(1)
     A**60                                  DSPATR(PC)
     A**60                                  DSPATR(RI)
     A**31                                  DSPATR(UL)
     A*N31                                  DSPATR(PR)
     A            MA03      R          13  2
     A*------------------------------------------------------------
     A*
     A**                                    CSRLOC(D#ROW      D#COL)
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*%%TS  SD  19940527  161249  D910121     REL-V2R2M0  5738-PW1
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0004)
     A                                      SFLDROP(CF01)
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN2          4S 0H      SFLRCDNBR
     A                                  1  2'ARI021'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 33'發票資料查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司　　:'
     A            SI01      R        O  4 14
     A            D#B03         16A  O  4 17
     A                                  4 39'客戶代號:'
     A            SI08      R        O  4 52
     A                                  4 58'-'
     A            SI09      R        O  4 60
     A                                  5  2'發票號碼:'
     A            SI02      R        O  5 14
     A            ME04      R        O  5 52
     A                                  6  2'發票金額:'
M004MA*           SI25      R        O  6 14EDTCDE(1)
M004MA            SI25      R        O  6 14EDTCDE(J)
     A                                  6 39'發票日期:'
M001MA*           DSI21     R        O  6 52REFFLD(SI21)
M001MA            DSI21          6  0O  6 52
     A                                      EDTWRD('  /  /  ')
     A                                  7  2'價差折讓:'
     A            SI27      R        O  7 14EDTCDE(1)
     A                                  7 39'送貨單號:'
     A            SI11      R        O  7 52
     A                                  8  2'銷退折讓:'
     A            SI28      R        O  8 14EDTCDE(1)
     A                                  8 39'未沖金額:'
     A                                 11  2'產品代號   數量 數量  售價-
     A                                       發票金額訂購數量搭贈數量  +
     A                                      銷退金額'
     A                                      DSPATR(UL)
     A                                 10  2'             訂購 搭贈        -
     A                                                     銷退    銷退    -
     A                                              '
     A            SI30      R        O  8 52REFFLD(RERFR/SI30 *LIBL/RERF)
M004MA*                                     EDTCDE(1)
M004MA                                      EDTCDE(J)
     A                                  6 62'(MM/DD/YY)'
     A                                  9  2'確認日期:'
M001MA*           DSI35     R        O  9 15REFFLD(SI35)
M001MA            DSI35          6  0O  9 15
     A                                      EDTWRD('  /  /  ')
     A                                  9 25'(MM/DD/YY)'
     A*------------------------------------------------------------
     A          R DSPC2
     A*
     A                                 22  2'執行'
     A                                    +2'F1 =產品說明'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F12=回前畫面'
     A*
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          63A  O 24  2MSGID(URE 0037 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         63A  O 24  2MSGID(URE 0025 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
