     A*%%TS  SD  19940527  160240  D910121     REL-V2R2M0  5738-PW1
     A*  81/02/17  11:09:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : ARI024D                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/03/27                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARI024                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :折讓查詢 (I)                              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M004      | 00.05.17 |菸酒稅法實施
     A*================================================================
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A*
     A          R SFLSR1                    SFL
     A*%%TS  SD  19940527  160240  D910121     REL-V2R2M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B  9  2VALUES(' ' '5')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            AH01      R        H      REFFLD(AH01 *LIBL/ARAHLF)
     A            AH02      R        O  9  5REFFLD(AH02 *LIBL/ARAHLF)
     A            AH03      R        O  9 21REFFLD(AH03 *LIBL/ARAHLF)
     A            DAH05          6Y 0O  9 12EDTWRD('  /  /  ')
     A            AH04      R        O  9 27REFFLD(AH04 *LIBL/ARAHLF)
M004MA*           AH06      R        O  9 42REFFLD(AH06 *LIBL/ARAHLF)
M004MA            WAH06     R        O  9 41REFFLD(AH06 *LIBL/ARAHLF)
     A                                      EDTCDE(1)
     A            KIND           6A  O  9 57
     A            DAH07     R        O  9 64REFFLD(AH07 *LIBL/ARAHLF)
M001DA*           HAH05          6Y 0H
M001AA            HAH05          8Y 0H
     A*------------------------------------------------------------
     A*
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19940527  160240  D910121     REL-V2R2M0  5738-PW1
     A                                      SFLSIZ(0024)
     A                                      SFLPAG(0012)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'ARI024'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 34'折讓查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  4'5=明細查詢'
     A                                  6 10'折讓日期'
     A                                  7  2'A 客戶  MM/DD/YY分店  折讓單+
     A                                      號      折讓金額　種類 退貨單+
     A                                      號   '
     A                                      DSPATR(UL)
     A            DBGN1     R        B  8  5REFFLD(AH02 *LIBL/ARAHLF)
     A            DBGN2     R        B  8 21REFFLD(AH03 *LIBL/ARAHLF)
M001DA*           DBGN3     R        B  8 12REFFLD(AH05 *LIBL/ARAHLF)
M001AA            DBGN3          6  0B  8 12
     A                                      EDTWRD('  /  /  ')
     A            DBGN4     R        B  8 27REFFLD(AH04 *LIBL/ARAHLF)
     A*------------------------------------------------------------
     A          R DSPC1
     A*
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          63A  O 24  2MSGID(URE 0055 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*------------------------------------------------------------
     A          R SFLSR2                    SFL
     A*
     A  54                                  SFLNXTCHG
     A            RRN2           4S 0H
     A            DOPT2          1A  B 12  2VALUES(' ' '5')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            SH03      R        O 12  5
     A            SH04      R        O 12 17EDTCDE(1)
     A            SH05      R        O 12 31EDTCDE(1)
     A            DTOT           5  0O 12 42EDTCDE(1)
     A            SH07      R        O 12 50EDTCDE(1)
M004AA            S207           9  0O 12 65EDTCDE(1)
     A*------------------------------------------------------------
     A*
     A****                                  CSRLOC(D#ROW      D#COL)
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*%%TS  SD  19920729  092851  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0008)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN2          4S 0H      SFLRCDNBR
     A                                  1  2'ARI024'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 33'銷貨折讓查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司　　:'
     A            AH01      R        O  4 15REFFLD(AH01 *LIBL/ARAHLF)
     A            D#B03         16A  O  4 18
     A                                  4 40'客戶代號:'
     A            AH02      R        O  4 52REFFLD(AH02 *LIBL/ARAHLF)
     A                                  4 58'-'
     A            AH03      R        O  4 60REFFLD(AH03 *LIBL/ARAHLF)
     A            ME04      R        O  5 50
     A                                  6  2'折讓單號:'
     A            AH04      R        O  6 15REFFLD(AH04 *LIBL/ARAHLF)
     A                                  6 40'折讓日期:'
     A            DAH05          6Y 0O  6 52EDTWRD('  /  /  ')
     A                                  6 62'(MM/DD/YY)'
     A                                  7  2'退貨單號:'
     A            AH07      R        O  7 15REFFLD(AH07 *LIBL/ARAHLF)
M004MA*                                 8 40'折讓金額:'
M004MA                                  8 36'未稅折讓金額:'
     A            AH06      R        O  8 52REFFLD(AH06 *LIBL/ARAHLF)
     A                                      EDTCDE(1)
M004AA                                  9 40'折讓稅額:'
M004AA            WTAX           9  0O  9 52
M004AA                                      EDTCDE(1)
M004AA                                 10 36'含稅折讓金額:'
M004AA            WAH06          9  0O 10 52
M004AA                                      EDTCDE(1)
     A                                  9  3'5=對應發票查詢'
     A                                 11  2'A 產品代號 銷退數量　搭贈退回+
     A                                      數量　退貨總數   銷退金額     +
M004AA                                      銷退稅額 '
     A                                      DSPATR(UL)
     A                                  7 40'退貨日期:'
M001DA*           DAH08     R        O  7 52REFFLD(SG0/AH08 *LIBL/ARAHLF)
M001AA            DAH08          6  0O  7 52
     A                                      EDTCDE(Y)
     A                                  7 62'(MM/DD/YY)'
     A*------------------------------------------------------------
     A          R DSPC2
     A*
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F12=回前畫面'
     A*
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          63A  O 24  2MSGID(URE 0037 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         63A  O 24  2MSGID(URE 0025 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
