     A*%%TS  SD  19920820  163400  REPGMRP     REL-V2R1M0  5738-PW1
     A*  81/02/17  11:09:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : ARI023D                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/04/10                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARI0232                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :應收帳款查詢－帳齡分析查詢 (I)            *
     A*===============================================================
     A* MODI CODE |  DATE  |  AUTHOR  | DESCRIPTION
     A*---------------------------------------------------------------
     A*  M004     |00.10.16| MICHELLE |顯示正負數
     A*---------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*----------------------------------------------------------------
     A          R DSPC1
     A*%%TS  SD  19920820  163400  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CF12(12)
     A                                  1  2'ARI023'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 33'帳齡分析查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  2'客戶代號:'
     A            ASI12          5A  O  5 14
     A            ME04      R        O  5 22REFFLD(RERFR/ME04 *LIBL/RERF)
     A            DSI30Z    R        O 12  2REFFLD(RERFR/SI30 *LIBL/RERF)
M004MA*                                     EDTCDE(1)
M004MA                                      EDTCDE(J)
     A            DSI30A    R        O 12 15REFFLD(RERFR/SI30 *LIBL/RERF)
M004MA*                                     EDTCDE(1)
M004MA                                      EDTCDE(J)
     A            DSI30B    R        O 12 28REFFLD(RERFR/SI30 *LIBL/RERF)
M004MA*                                     EDTCDE(1)
M004MA                                      EDTCDE(J)
     A            DSI30C    R        O 12 41REFFLD(RERFR/SI30 *LIBL/RERF)
M004MA*                                     EDTCDE(1)
M004MA                                      EDTCDE(J)
     A            DSI30D    R        O 12 54REFFLD(RERFR/SI30 *LIBL/RERF)
M004MA*                                     EDTCDE(1)
M004MA                                      EDTCDE(J)
     A            DSI30E    R        O 12 67REFFLD(RERFR/SI30 *LIBL/RERF)
M004MA*                                     EDTCDE(1)
M004MA                                      EDTCDE(J)
     A                                 22  3'F12:返回上一畫面'
     A                                  7  2'應收額度　　:'
     A                                  8  2'計畫使用額度:'
     A                                 11  2'    未到期   0 <--> 30   30 <-->-
     A                                       60   60 <--> 90   90 <-->180     1-
     A                                      80 --> '
     A                                      DSPATR(UL)
     A            MD31      R        O  7 18REFFLD(RERFR/MD31 *LIBL/RERF)
     A                                      EDTCDE(1)
     A            MD30      R        O  8 18REFFLD(RERFR/MD30 *LIBL/RERF)
     A                                      EDTCDE(1)
