     A*%%TS  SD  19970127  101400  D910454     REL-V3R1M0  5763-PW1
     A*  80/11/15  13:46:08    REPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : ARM001D                                    *
     A*    AUTHOR       : A1005   ROGER CHIEN                        *
     A*    CREATE DATE  : 80/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARM001C                                    *
     A*    SYSTEM       :人頭馬匯東應收報表系統                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19970127  101400  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'ARM001'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'應收帳款報表主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 30'              '
     A                                      DSPATR(RI)
     A                                  3 63'USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  4 30' '
     A                                      DSPATR(RI)
     A                                  4 32'報表列印'
     A                                  4 43' '
     A                                      DSPATR(RI)
     A                                  5 30'              '
     A                                      DSPATR(RI)
     A                                  6  3'41.客戶對帳單'
     A                                      DSPATR(UL)
     A                                  6 28'57.收款未分配餘額表'
     A                                      DSPATR(UL)
     A                                  6 54'73.遞延銷貨退回餘額明細表'
     A                                      DSPATR(UL)
     A                                  7  3'42.帳齡分析表'
     A                                      DSPATR(UL)
     A                                  7 28'58.預開發票明細表'
     A                                      DSPATR(UL)
     A                                  7 54'74.試飲分析彙總表'
     A                                      DSPATR(UL)
     A                                  8  3'43.現金收入明細表'
     A                                      DSPATR(UL)
     A                                  8 28'59.統一發票申報表－試印'
     A                                      DSPATR(UL)
     A                                  8 54'75.搭贈分析彙總表'
     A                                      DSPATR(UL)
M001MA*                                 9  3'44.票據沖帳明細表'
M001MA                                  9  3'44.票據收入明細表'
     A                                      DSPATR(UL)
M001MA                                  9 28'60.產品送貨彙總表'
     A                                      DSPATR(UL)
     A                                  9 54'76.轉帳銷退折讓明細表　'
     A                                      DSPATR(UL)
     A                                 10  3'45.銷貨收入明細表'
     A                                      DSPATR(UL)
     A                                 10 28'61.跨月折讓明細表'
     A                                      DSPATR(UL)
M001MA                                 10 54'77.應收帳款週轉率分析表'
     A                                      DSPATR(UL)
     A                                 11  3'46.銷貨成本明細表'
     A                                      DSPATR(UL)
     A                                 11 28'62.統一發票調結參考表'
     A                                      DSPATR(UL)
     A                                 11 54'78.應收票據明細表　　　'
     A                                      DSPATR(UL)
     A                                 12  3'47.折讓明細表'
     A                                      DSPATR(UL)
     A                                 12 28'63.應收帳款彙總表'
     A                                      DSPATR(UL)
     A                                 12 54'79.折讓單簽收明細表　　'
     A                                      DSPATR(UL)
     A                                 13  3'48.應收帳款明細表'
     A                                      DSPATR(UL)
     A                                 13 28'64.收款沖帳明細表'
     A                                      DSPATR(UL)
     A                                 13 54'80.調整原因分析表　　　'
     A                                      DSPATR(UL)
     A                                 14  3'49.票據預計兌現明細表'
     A                                      DSPATR(UL)
     A                                 14 28'65.代理商補差額報表'
     A                                      DSPATR(UL)
M001MA*                                14 54'81.票據未兌現明細表　　'
M001MA                                 14 54'81.票據兌現明細表依日期'
     A                                      DSPATR(UL)
     A                                 15  3'50.電子統一發票重印'
     A                                      DSPATR(UL)
     A                                 15 28'66.發票作廢排行榜'
     A                                      DSPATR(UL)
     A                                 15 54'82.發票日期帳齡分析表　'
     A                                      DSPATR(UL)
     A                                 16  3'51.統一發票申報表'
     A                                      DSPATR(UL)
     A                                 16 28'67.收款分配明細表'
     A                                      DSPATR(UL)
     A                                 16 54'83.帳齡排行表　'
     A                                      DSPATR(UL)
     A                                 17  3'52.應收帳款管理表'
     A                                      DSPATR(UL)
     A                                 17 28'68.出貨統一發票核對表'
     A                                      DSPATR(UL)
     A                                 17 54'84.康齡銷退折讓差異表'
     A                                      DSPATR(UL)
     A                                 18  3'53.票據兌現明細表'
     A                                      DSPATR(UL)
     A                                 18 28'69.產品銷貨成本明細表'
     A                                      DSPATR(UL)
     A                                 18 54'85.銷退折讓成本餘數表'
     A                                      DSPATR(UL)
     A                                 19  3'54.轉帳／寄賣發票列印'
     A                                      DSPATR(UL)
     A                                 19 28'70.寄賣產品成本明細表'
     A                                      DSPATR(UL)
     A                                 19 54'86.康齡專櫃銷項稅額'
     A                                      DSPATR(UL)
     A                                 20  3'55.銷退折讓分配差異表'
     A                                      DSPATR(UL)
     A                                 20 28'71.折讓成本差異報表'
     A                                      DSPATR(UL)
     A                                 20 54'87.收款未分配明細表'
     A                                      DSPATR(UL)
     A                                 21  3'56.折讓單'
     A                                      DSPATR(UL)
     A                                 21 28'72.人工發票差異報表'
     A                                      DSPATR(UL)
     A                                 21 54'88.應收日帳齡排行表'
     A                                      DSPATR(UL)
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A                                 23 30'請輸入選擇項目:'
     A            DOPID          2A  B 23 48DSPATR(UL)
     A                                      VALUES('  ' '41' '42' '43' '44' '45-
     A                                      ' '46' '47' '48' '49' '50' '51' '52-
     A                                      ' '53' '54' '55' '56' '57' '58' '59-
     A                                      ' '60' '61' '62' '63' '64' '65' '66-
     A                                      ' '67' '68' '69' '70' '71' '72' '73-
     A                                      ' '74' '75' '76' '77' '78' '79' '80-
     A                                      ' '81' '82' '83' '84' '85' '86' '87-
                                            ' '88')
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
