     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR067P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 82/01/18                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR067                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款系統                              *
     A*    REMARK       :收款分配明細表                            *
     A*===============================================================
     A* CODE |  AUTHOR  |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M004 | MICHELLE | 00.06.15 |新增銷退稅額及銷退總金額欄
     A*================================================================
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
M004MA*                                   47MSGCON(030 URE9999 REMF)
M004MA                                    64MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
M004MA*                                   52'收款分配明細表'
M004MA                                    69'收款分配明細表'
     A                                      SPACEA(1)
     A                                     1'發票公司:'
     A            DAD10S    R             +1REFFLD(AD10)
     A                                    +1'-'
     A            DAD10E    R             +1REFFLD(AD10)
     A                                      SPACEA(1)
     A                                     1'收款種類:'
     A            DAD05S    R             +1REFFLD(AD05)
     A                                    +1'-'
     A            DAD05E    R             +1REFFLD(AD05)
M004MA*                                   90'日期:'
M004MA*           $EGMDY         6  0O    98EDTCDE(Y)
M004MA*                                  108'頁次:'
M004MA*                                  115PAGNBR EDTCDE(Z)
M004MA                                   124'日期:'
M004MA            $EGMDY         6  0O   132EDTCDE(Y)
M004MA                                   142'頁次:'
M004MA                                   149PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DAD02S    R             +1REFFLD(AD02)
     A                                    +1'-'
     A            DAD02E    R             +1REFFLD(AD02)
M004MA*                                   90'時間:'
M004MA*                                   98TIME
M004MA                                   124'時間:'
M004MA                                   132TIME
     A                                      SPACEA(1)
     A                                     1'分配日期:'
M001DA*           DAD12S    R             +1REFFLD(AD12)
M001AA            DAD12S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
M001DA*           DAD12E    R             +1REFFLD(AD12)
M001AA            DAD12E         6  0     +1
     A                                      EDTWRD('  /  /  ')
M004MA*                                   90' USER :'
M004MA*           $USER         10   O    98
M004MA*                                  110'<ARR067>'
M004MA                                   124' USER :'
M004MA            $USER         10   O   132
M004MA                                   144'<ARR067>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     1'客戶代號／簡稱'
     A                                    29'分配日期'
     A                                    41'沖帳金額'
     A                                    52'發票號碼'
     A                                    62'發票日期'
     A                                    75'銷退金額'
M004AA                                    89'銷退稅額'
M004AA                                   103'銷退總金額'
M004MA*                                   86'收款種類'
M004MA*                                  102'收款日期'
M004MA*                                  113'收款公司'
M004MA                                   118'收款種類'
M004MA                                   132'收款日期'
M004MA                                   144'收款公司'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N31                                 1' '
     A                                      SPACEA(1)
     A N32        WF8102    R              2REFFLD(AD02)
     A N32        WF8103    R              7REFFLD(AD03)
     A N32        ME04          18   O    11
M001DA*N33        WF804A    R             30REFFLD(AD12)
M001AA N33        WF804A         6  0     30
     A                                      EDTWRD('  /  /  ')
     A            WF8105    R             39REFFLD(AD08)
     A                                      EDTCDE(2)
     A            WF8106    R             52REFFLD(AD07)
M100DA*           WF807A    R             63REFFLD(AD11)
M100AA            WF807A         6  0     63
     A                                      EDTWRD('  /  /  ')
     A            WF8108    R             73REFFLD(AD08)
     A                                      EDTCDE(2)
M004AA            WF8112         9  0     87
M004AA                                      EDTCDE(2)
M004AA            D0812          9  0    103
M004AA                                      EDTCDE(2)
M004MA*           WF8109    R             87REFFLD(AD05)
M004MA* 37                                89'價差折讓'
M004MA*N37        D#A03         14   O    89
M001DA*M004M      WF810A    R            103REFFLD(AD04)
M001AA*           WF810A         6  0    103
M004MA*                                     EDTWRD('  /  /  ')
M004MA*           WF8111    R            118REFFLD(AD01)
M004MA            WF8109    R            119REFFLD(AD05)
M004MA  37                               121'價差折讓'
M004MA N37        D#A03         14   O   121
M001DA*M004M      WF810A    R            103REFFLD(AD04)
M001AA            WF810A         6  0    133
M004MA                                      EDTWRD('  /  /  ')
M004MA            WF8111    R            149REFFLD(AD01)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    11'日期小計----------------->'
     A            T18105    R             39REFFLD(AD08)
     A                                      EDTCDE(J)
     A            T18108    R             73REFFLD(AD08)
     A                                      EDTCDE(J)
M004AA            T18112         9  0     87
M004AA                                      EDTCDE(J)
M004AA            T10812         9  0    103
M004AA                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    11'客戶小計----------------->'
     A            T28105    R             39REFFLD(AD08)
     A                                      EDTCDE(J)
     A            T28108    R             73REFFLD(AD08)
     A                                      EDTCDE(J)
M004AA            T28112         9  0     87
M004AA                                      EDTCDE(J)
M004AA            T20812         9  0    103
M004AA                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A            WF8101    R              9REFFLD(AD10)
     A                                    11'公司總計----------------->'
     A            T38105    R             39REFFLD(AD08)
     A                                      EDTCDE(J)
     A            T38108    R             73REFFLD(AD08)
     A                                      EDTCDE(J)
M004AA            T38112         9  0     87
M004AA                                      EDTCDE(J)
M004AA            T30812         9  0    103
M004AA                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'<<ARR067>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
