     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR045AP                                   *
     A*    AUTHOR       : A1118  PHILIP                              *
     A*    CREATE DATE  : 81/04/02                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR045                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    REMARK       :銷貨收入明細表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    86MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    92'銷貨收入明細表'
     A                                      SPACEA(2)
     A                                     1'公司別:'
     A            DSI01          1   O    11
     A                                      SPACEA(1)
     A                                     1'辦事處:'
     A            COMPS          1   O    11
     A                                    12'-'
     A            COMPE          1   O    13
     A            #B03           8   O    +1
     A                                      SPACEA(1)
     A                                     1'日　期:'
     A            DSI35S         6  0O    11EDTCDE(Y)
     A                                    +0'～'
     A            DSI35E         6  0O    +1EDTCDE(Y)
     A                                   172'日期:'
     A            $EGMDY         6  0O   179EDTCDE(Y)
     A                                   189'頁次:'
     A                                   195PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'轉　帳:'
     A            DSI10          1A  O    11
     A            TEXT1          8A  O    +1
     A                                   172'時間:'
     A                                   179TIME
     A                                   189'<ARR045AP>'
     A                                      SPACEA(1)
     A                                     1'專　櫃:'
     A            DSEL           1A  O    11
     A  20                                +1'不含專櫃'
     A                                   172' USER :'
     A            $USER         10A  O   179
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     1'日　期'
     A                                     9'單別'
     A                                    15'訂單單號'
     A                                    28'發票號碼'
     A                                    39'客戶代號／名稱'
     A                                    73'銷售'
     A                                    85'折扣'
     A                                    97'搭贈'
     A                                   109'淨售'
     A                                   124'F.O.B.'
     A                                   138'F.H.I.'
     A                                   154'DUTY'
     A                                   165'總成本'
     A                                   180'毛利'
     A                                   190'毛利(%)'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  30        PSI35          6  0O     1EDTCDE(Y)
     A  31        SI101          2   O    11
     A            SI10      R             15
     A            SI02      R             28
     A            SI12      R             40
     A            SI13      R             45
     A            ME04      R             49
     A            SSJ06          9  0O    71EDTCDE(J)
     A            SDISC          9  0O    83EDTCDE(J)
     A            S1305          9  0O    95EDTCDE(J)
     A            S0607          9  0O   107EDTCDE(J)
     A            PSD10         11  2    119EDTCDE(J)
     A            PSD11         10  2    134EDTCDE(J)
     A            PSD12         10  2    148EDTCDE(J)
     A            PCOST         11  2    162EDTCDE(J)
     A            PGROS         10  2    177EDTCDE(J)
     A            PRATE          5  2    191EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'單別小計'
     A                                    +0'--------------------'
     A                                    +0'--------------------'
     A                                    +0'------------------>'
     A
     A            ISJ06          9  0O    71EDTCDE(J)
     A            IDISC          9  0O    83EDTCDE(J)
     A            I1305          9  0O    95EDTCDE(J)
     A            I0607          9  0O   107EDTCDE(J)
     A            ISD10         11  2    119EDTCDE(J)
     A            ISD11         10  2    134EDTCDE(J)
     A            ISD12         10  2    148EDTCDE(J)
     A            ICOST         11  2    162EDTCDE(J)
     A            IGROS         10  2    177EDTCDE(J)
     A            IRATE          5  2    191EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                     1'日期小計'
     A                                    +0'--------------------'
     A                                    +0'--------------------'
     A                                    +0'------------------>'
     A            ESJ06          9  0O    71EDTCDE(J)
     A            EDISC          9  0O    83EDTCDE(J)
     A            E1305          9  0O    95EDTCDE(J)
     A            E0607          9  0O   107EDTCDE(J)
     A            ESD10         11  2    119EDTCDE(J)
     A            ESD11         10  2    134EDTCDE(J)
     A            ESD12         10  2    148EDTCDE(J)
     A            ECOST         11  2    162EDTCDE(J)
     A            EGROS         10  2    177EDTCDE(J)
     A            ERATE          5  2    191EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEB(1)
     A                                     1' '
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'總計'
     A                                    +0'--------------------'
     A                                    +0'--------------------'
     A                                    +0'---------------------->'
     A            TSJ06          9  0O    71EDTCDE(J)
     A            TDISC          9  0O    83EDTCDE(J)
     A            T1305          9  0O    95EDTCDE(J)
     A            T0607          9  0O   107EDTCDE(J)
     A            TSD10         11  2    119EDTCDE(J)
     A            TSD11         10  2    134EDTCDE(J)
     A            TSD12         10  2    148EDTCDE(J)
     A            TCOST         11  2    162EDTCDE(J)
     A            TGROS         10  2    177EDTCDE(J)
     A            TRATE          5  2    191EDTCDE(J)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'<<ARR045AP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
