     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : ARR071P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 07/13/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR071                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    REMARK       :折讓成本差異表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    63MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    69'折讓成本差異表'
     A                                      SPACEA(2)
     A                                     1'辦事處:'
     A            COMP           1   O    +1
     A            COMPC          6   O    +1
     A                                   128'日期:'
     A            $EGMDY         6  0O   136EDTCDE(Y)
     A                                   146'頁次:'
     A                                   153PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSH03S         9   O    +1
     A                                    +1'-'
     A            DSH03E         9   O    +1
     A                                   128'時間:'
     A                                   136TIME
     A                                      SPACEA(1)
     A                                     1'折讓日期:'
     A            DSG26S         6  0O    +1EDTCDE(Y)
     A                                    +1'-'
     A            DSG26E         6  0O    +1EDTCDE(Y)
     A                                   128' USER :'
     A            $USER         10A  O   136
     A                                   148'<ARR071P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===========+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     1'折讓單號'
     A                                    14'折讓日期'
     A                                    25'原始折讓單號'
     A                                    40'產品代號／簡稱'
     A                                    68'客戶代號／簡稱'
     A                                    98'數量'
     A                                   105'搭贈'
     A                                   112'銷退金額(R/C)'
     A                                   128'訂購成本(W)'
     A                                   146'差異成本'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----------+
     A                                       -------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        WF7804    R              2REFFLD(SG09)
E100DA*N30        D7807     R             15REFFLD(SG26)
E100AA N30        D7807          6  0     15
     A                                      EDTCDE(Y)
     A N30        WF7805    R             26REFFLD(SG18)
     A            WF7806    R             41REFFLD(SH03)
     A            MA03      R             50REFFLD(MA03)
     A            WF7802    R             69REFFLD(SG04)
     A            WF7803    R             74REFFLD(SG05)
     A            ME04      R             78REFFLD(ME04)
     A            WF7810    R             97REFFLD(SH12)
     A                                      EDTCDE(J)
     A            WF7811    R            105REFFLD(SH13)
     A                                      EDTCDE(J)
     A            WF7808         9  2    112
     A                                      EDTCDE(J)
     A            WF7809    R            125REFFLD(SH08)
     A                                      EDTCDE(J)
     A            TOT089    R            141REFFLD(SH08)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    97'總　計----->'
     A            TOT108         9  2    112
     A                                      EDTCDE(J)
     A            TOT109    R            125REFFLD(SH08)
     A                                      EDTCDE(J)
     A            TOT189        11  2O   141EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===========+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===========+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'<<ARR071P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
