     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : ARR068P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 82/03/25                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR068                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :出貨統一發票核對表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    35MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    39'出貨統一發票核對表'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            SI01      R             +1
     A            #B03      R             +1
     A                                    65'日期:'
     A            $EGMDY         6  0O    73EDTCDE(Y)
     A                                    82'頁次:'
     A                                    90PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'物流點　:'
     A            DSI05S    R             +1REFFLD(SI05)
     A                                    +1'-'
     A            DSI05E    R             +1REFFLD(SI05)
     A                                    65'時間:'
     A                                    73TIME
     A                                    84'<ARR068>'
     A                                      SPACEA(1)
     A                                     1'出貨日期:'
M001DA*           DSI06S    R             +1REFFLD(SI06)
M001AA            DSI06S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
M001DA*           DSI06E    R             +1REFFLD(SI06)
M001AA            DSI06E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    65' USER :'
     A            $USER         10A  O    72
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     1'送貨日期'
     A                                    11'發票號碼'
     A                                    23'客戶代號／名稱'
     A                                    57'金　額'
     A                                    66'發票狀態'
     A                                    81'簽　名'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N21                                 1' '
     A N21                                  SPACEA(1)
M001DA*N30        DSI06     R              2EDTCDE(Y)
M001AA N30        DSI06          6  0      2EDTCDE(Y)
M001DA*                                     REFFLD(SI06)
     A            SI02      R             12
     A            SI08      R             24
     A            SI09      R             29
     A            ME04      R             33
     A            SI25      R             53EDTCDE(J)
     A  22                                66'己作廢'
     A  23                                66'重開之發票'
     A  24                                66'待作廢'
     A  25                                66'己作廢待重開'
     A                                    81'_______________'
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    33'張數小計------->'
     A            TOT            5  0     +1EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'<<ARR068>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
