     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR043P                                    *
     A*    AUTHOR       : A1139 JANE                                 *
     A*    CREATE DATE  : 81/04/02                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR043                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :現金收入明細表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    27MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    33'現金收入明細表'
     A                                      SPACEA(2)
     A                                    51'日期:'
     A            $EGMDY         6  0O    59EDTCDE(Y)
     A                                    68'頁次:'
     A                                    76PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'公司:'
     A            DAD01     R              9REFFLD(AD01)
     A            D#B03         16   O    12
     A                                    51'時間:'
     A                                    59TIME
     A                                    70'<ARR043>'
     A                                      SPACEA(1)
     A                                     1'日期:'
M001DA*           DAD04S    R              9REFFLD(AD04)
M001AA            DAD04S         6  0      9
     A                                      EDTWRD('  /  /  ')
     A                                    17'～'
M001DA*           DAD04E    R             21REFFLD(AD04)
M001AA            DAD04E         6  0     21
     A                                      EDTWRD('  /  /  ')
     A                                    51' USER :'
     A            $USER         10A  O    59
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'客戶代號／名稱'
     A                                    25'收款日期'
     A                                    35'發票號碼'
     A                                    48'收款種類'
     A                                    65'金額'
     A                                    73'業務員'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  31        AD02      R              2
     A  31        ME04      R              7
M001DA*           DDATE     R             26EDTWRD('  /  /  ')
M001AA            DDATE          6  0     26EDTWRD('  /  /  ')
M001DA*                                     REFFLD(AD04)
     A            AD07      R             36
     A            MARK          10O       48
     A            AD08      R             59EDTCDE(J)
     A  30        MC02      R             73
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    25'客戶小計----------->'
     A            CUSTOT         9  0     59EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A                                     7'合　　　　　　計 +
     A                                       -------------------->'
     A            ENDTOT         9  0     59EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<ARR043>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE4
     A                                     1'                    +
     A                                                           +
     A                                                           +
     A                                                           '
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE5                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
