     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : ARR075P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 01/13/94                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR075                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :應收帳款週轉率分析表                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    31MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    34'應收帳款週轉率分析表'
     A                                      SPACEA(2)
     A                                     1'公司別:'
     A            CD03      R        O    11REFFLD(CD03)
     A            #B03      R        O    +1REFFLD(#B03)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DCD06S    R        O    13REFFLD(CD06)
     A                                    19'-'
     A            DCD06E    R        O    21REFFLD(CD06)
     A                                    61'日期:'
     A            $EGMDY         6  0O    69EDTCDE(Y)
     A                                    79'頁次:'
     A                                    86PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'確認年月:'
M001MA*           DCD01S    R        O    13REFFLD(CD01)
M001MA            DCD01S         4  0O    13
     A                                      EDTWRD('  /  ')
     A                                    19'-'
M001MA*           DCD01E    R        O    21REFFLD(CD01)
M001MA            DCD01E         4  0O    21
     A                                      EDTWRD('  /  ')
     A                                    30'確認天數:'
     A            TOTD           3  0O    +1EDTCDE(J)
     A                                    61'時間:'
     A                                    69TIME
     A                                      SPACEA(1)
     A                                     1'業務員　:'
     A            DCD09S    R             +1REFFLD(CD09)
     A                                    +1' - '
     A            DCD09E    R             +1REFFLD(CD09)
     A                                    61' USER :'
     A            $USER         10   O    69
     A                                    80'<ARR075>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========='
     A                                      SPACEA(1)
     A                                     1'客戶代號／客戶簡稱'
M001MA*           MCD01S    R        O    25REFFLD(CD01)
M001MA            MCD01S         4  0O    25
     A                                      EDTWRD('  /  ')
     A                                    30'期初應收'
M001MA*           MCD01E    R             41REFFLD(CD01)
M001MA            MCD01E         4  0     41
     A                                      EDTWRD('  /  ')
     A                                    46'期末應收'
     A                                    61'淨收入'
     A                                    70'週轉率'
     A                                    78'收款天數'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            CD06      R              1REFFLD(CD06)
     A            ME04      R              6REFFLD(ME04)
     A            MAK05     R             28REFFLD(AK05)
     A                                      EDTCDE(J)
     A            MAK10     R             44REFFLD(AK05)
     A                                      EDTCDE(J)
     A            CD46      R             57REFFLD(CD24)
     A                                      EDTCDE(J)
     A            TOT1           5  2     71
     A                                      EDTCDE(J)
     A            TOT2           5  0     80
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------'
     A                                      SPACEA(1)
     A            #B03      R        O     1REFFLD(#B03)
     A                                    +0'小計--->'
     A            T1T4           9  0     28EDTCDE(J)
     A            T1T5           9  0     44EDTCDE(J)
     A            T1T3           9  0     57EDTCDE(J)
     A            T1T1           5  2     71
     A                                      EDTCDE(J)
     A            T1T2           5  0     80
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    13'公司合計--->'
     A            T2T4           9  0     28EDTCDE(J)
     A            T2T5           9  0     44EDTCDE(J)
     A            T2T3           9  0     57EDTCDE(J)
     A            T2T1           5  2     71
     A                                      EDTCDE(J)
     A            T2T2           5  0     80
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========='
     A                                      SPACEA(1)
     A                                     2'<<ARR075>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
