     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR045BP                                   *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 82/04/28                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR0452                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    REMARK       :銷貨收入明細表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    80MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    86'銷貨收入明細表'
     A                                      SPACEA(2)
     A                                     1'公司別:'
     A            DSI01          1   O    11
     A                                      SPACEA(1)
     A                                     1'辦事處:'
     A            COMPS          1   O    11
     A                                    12'-'
     A            COMPE          1   O    13
     A            #B03           8   O    +1
     A                                      SPACEA(1)
     A                                     1'日　期:'
     A            DSI35S         6  0O    11EDTCDE(Y)
     A                                    +0'～'
     A            DSI35E         6  0O    +1EDTCDE(Y)
     A                                   160'日期:'
     A            $EGMDY         6  0O   167EDTCDE(Y)
     A                                   177'頁次:'
     A                                   185PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'轉　帳:'
     A            DSI10          1A  O    11
     A            TEXT1          8A  O    +1
     A                                   160'時間:'
     A                                   167TIME
     A                                   177'<ARR045BP>'
     A                                      SPACEA(1)
     A                                     1'專　櫃:'
     A            DSC04     R        O    11REFFLD(SC04)
     A            DME04     R        O    +1REFFLD(ME04)
     A                                   160' USER :'
     A            $USER         10A  O   167
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========='
     A                                      SPACEA(1)
     A                                     1'日　期'
     A                                    10'訂單單號'
     A                                    23'發票號碼'
     A                                    34'客戶代號／名稱'
     A                                    71'銷售'
     A                                    83'折扣'
     A                                    95'搭贈'
     A                                   107'淨售'
     A                                   120'營業稅'
     A                                   137'F.O.B.'
     A                                   152'總成本'
     A                                   169'毛利'
     A                                   179'毛利(%)'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A  30        DATE           6  0O     2EDTCDE(Y)
     A            WF7004    R             +1
     A                                      REFFLD(SC02)
     A            WF7005    R             +1
     A                                      REFFLD(SI02)
     A            WF7006    R             +1
     A                                      REFFLD(SC04)
     A                                    +0'-'
     A            WF7007    R             +0
     A                                      REFFLD(SC05)
     A            WME04     R             +1REFFLD(ME04)
     A            WF7008    R             65REFFLD(WF7008 *LIBL/REWF70)
     A                                      EDTCDE(J)
     A            WF7009    R             +1REFFLD(WF7009 *LIBL/REWF70)
     A                                      EDTCDE(J)
     A            WF7010    R             +1REFFLD(WF7010 *LIBL/REWF70)
     A                                      EDTCDE(J)
     A            WF7011    R             +1REFFLD(WF7011 *LIBL/REWF70)
     A                                      EDTCDE(J)
     A            WF7019    R            117REFFLD(WF7019 *LIBL/REWF70)
     A                                      EDTCDE(J)
     A            WF7012    R            130REFFLD(WF7012 *LIBL/REWF70)
     A                                      EDTCDE(J)
     A            WF7015    R            148REFFLD(WF7015 *LIBL/REWF70)
     A                                      EDTCDE(J)
     A            WF7016    R            166REFFLD(WF7016 *LIBL/REWF70)
     A                                      EDTCDE(J)
     A            WF7017    R            180REFFLD(WF7017 *LIBL/REWF70)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEB(1)
     A                                     1'日期小計'
     A                                    +0'--------------------'
     A                                    +0'--------------------'
     A                                    +0'------------>'
     A            T1TOT1         9  0O    +1EDTCDE(J)
     A            T1TOT2         9  0O    +1EDTCDE(J)
     A            T1TOT3         9  0O    +1EDTCDE(J)
     A            T1TOT4         9  0O    +1EDTCDE(J)
     A            T1TOT5         9  0    117EDTCDE(J)
     A            T1TOT6        12  2    130EDTCDE(J)
     A            T1TOT8        12  2    148EDTCDE(J)
     A            T1TOT9        10  2    165EDTCDE(J)
     A            T1TOTA         5  2    180EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEB(1)
     A                                     1'專櫃小計'
     A                                    +0'--------------------'
     A                                    +0'--------------------'
     A                                    +0'------------>'
     A            T2TOT1         9  0O    +1EDTCDE(J)
     A            T2TOT2         9  0O    +1EDTCDE(J)
     A            T2TOT3         9  0O    +1EDTCDE(J)
     A            T2TOT4         9  0O    +1EDTCDE(J)
     A            T2TOT5         9  0    117EDTCDE(J)
     A            T2TOT6        12  2    130EDTCDE(J)
     A            T2TOT8        12  2    148EDTCDE(J)
     A            T2TOT9        10  2    165EDTCDE(J)
     A            T2TOTA         5  2    180EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEB(1)
     A                                     1'總　　計'
     A                                    +0'--------------------'
     A                                    +0'--------------------'
     A                                    +0'------------>'
     A            T3TOT1         9  0O    +1EDTCDE(J)
     A            T3TOT2         9  0O    +1EDTCDE(J)
     A            T3TOT3         9  0O    +1EDTCDE(J)
     A            T3TOT4         9  0O    +1EDTCDE(J)
     A            T3TOT5         9  0    117EDTCDE(J)
     A            T3TOT6        12  2    130EDTCDE(J)
     A            T3TOT8        12  2    148EDTCDE(J)
     A            T3TOT9        10  2    165EDTCDE(J)
     A            T3TOTA         5  2    180EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEB(1)
     A                                     1' '
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========'
     A                                      SPACEA(1)
     A                                     2'<<ARR045BP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
