     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : ARR083P                                     *
     A*    AUTHOR       : SAM                                        *
     A*    CREATE DATE  : 97/01/24                                   *
     A*    PROGRAM NAME : ARR0831                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :　　　　　　                              *
     A*    REMARK       :                                            *
     A****************************************************************
     A                                      REF(REFLIB/RERF)
     A          R PH1                       SKIPB(2)
     A                                    40MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    45'收款未分配明細表'
     A                                    97'<ARR083>'
     A                                      SPACEA(1)
     A                                     1'公　　司：'
     A            DAC01S         2        13
     A                                    16'-'
     A            DAC01E         2        18
     A                                      SPACEA(1)
     A                                     1'客戶代號：'
     A            DAC02S    R             13REFFLD(AC02)
     A                                    22'-'
     A            DAC02E    R             24REFFLD(AC02)
     A                                    90'日期:'
     A            $EGMDY         6  0O    97EDTCDE(Y)
     A                                      SPACEA(1)
     A                                     1'業務人員：'
     A            DAC09S    R             13REFFLD(AC09)
     A                                    22'-'
     A            DAC09E    R             24REFFLD(AC09)
     A                                    90'時間:'
     A                                    97TIME
     A                                      SPACEA(1)
     A                                     1'收款日期：'
M001DA*           DAC04S    R             13REFFLD(AC04)
M001AA            DAC04S         6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'-'
M001DA*           DAC04E    R             24REFFLD(AC04)
M001AA            DAC04E         6  0     24
     A                                      EDTWRD('  /  /  ')
     A                                    90' USER :'
     A            $USER         10   O    97
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===='
     A                                      SPACEA(1)
     A                                     1'公司'
     A                                     9'客戶代號'
     A                                    22'客戶名稱'
     A                                    40'種類/名稱'
     A                                    68'收款金額'
     A                                    80'未分配金額'
     A                                    96'業務人員'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1
     A            AC01      R              3
     A            AC02      R             11
     A            ME04      R             22
     A            AC05      R             42
     A            P#A03         10        48
     A            AC08      R             65EDTCDE(N)
     A            AC10      R             79EDTCDE(N)
     A            MC02      R             98
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===='
     A                                      SPACEA(1)
     A                                     2'<<ARR083>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
