     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR061P                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/10/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR061                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :跨月折讓明細表                            *
     A*===============================================================
     A* CODE |  AUTHOR  |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M004 | MICHELLE | 00.06.12 |新增稅額欄
     A*================================================================
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
M004MA*                                   59MSGCON(030 URE9999 REMF)
     A                                    85
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
M004MA*                                   65'跨月折讓明細表'
     A                                    91
     A                                      '跨月折讓明細表'
     A                                      SPACEA(001)
M004MA*                                   65'（依產品排序）'
     A                                    91
     A                                      '（依產品排序）'
     A                                      SPACEA(001)
     A                                     1
     A                                      '公　司　:'
     A            SG01      R             +1
     A            #B03      R             +1
     A                                      REFFLD(#B03)
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號:'
     A            DSH03S    R             +1
     A                                      REFFLD(SH03)
     A                                    +1
     A                                      '-'
     A            DSH03E    R             +1
     A                                      REFFLD(SH03)
M004MA*                                  134'日期:'
M004MA*           $EGMDY         6  0O   142EDTCDE(Y)
M004MA*                                  151'頁次:'
M004MA*                                  158PAGNBR EDTCDE(Z)
     A                                   170
     A                                      '日期:'
     A            $EGMDY         6  0O   178
     A                                      EDTCDE(Y)
     A                                   187
     A                                      '頁次:'
     A                                   194
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1
     A                                      '客戶代號:'
     A            DSG45S         9A  O    +1
     A                                    +1
     A                                      '-'
     A            DSG45E         9A  O    +1
M004MA*                                  134'時間:'
M004MA*                                  142TIME
M004MA*                                  152'<ARR061A>'
     A                                   170
     A                                      '時間:'
     A                                   178
     A                                      TIME
     A                                   188
     A                                      '<ARR061A>'
     A                                      SPACEA(001)
     A                                     1
     A                                      '折讓年月:'
     A            DSG26          4  0     +1
     A                                      EDTCDE(Y)
M004MA*                                  134' USER :'
M004MA*           $USER         10A  O   142
     A                                   171
     A                                      'USER :'
     A            $USER         10A  O   178
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(001)
     A                                     1
     A                                      '歸屬'
     A                                      SPACEB(001)
     A                                     7
     A                                      '產品代號／簡稱'
     A                                    36
     A                                      '客戶代號／簡稱'
     A                                    61
     A                                      '銷　量'
     A                                    69
     A                                      '贈品'
     A                                    82
     A                                      '單　價'
M004MA*                                   95'金　額'
     A                                    98
     A                                      '未稅金額'
     A                                   110
     A                                      '銷退稅額'
     A                                   120
     A                                      '銷退總金額'
M004MA*                                  107'訂購成本'
M004MA*                                  122'新搭贈成本'
M004MA*                                  139'舊搭贈成本'
M004MA*                                  160'總成本'
     A                                   137
     A                                      '訂購成本'
     A                                   153
     A                                      '新搭贈成本'
     A                                   170
     A                                      '舊搭贈成本'
     A                                   191
     A                                      '總成本'
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A            W0707          9  0    120
     A                                      EDTCDE(J)
     A N32        SH11      R              2
     A  30        SH03      R              8
     A  30        MA03      R             +0
     A            SG04      R             +0
     A            SG05      R             +0
     A            ME04      R             +0
     A            SH12      R             +0
     A                                      EDTCDE(J)
     A            SH13      R             +0
     A                                      EDTCDE(J)
     A            PAMT      R             +3
     A**********                            REFFLD(SH07)
     A                                      REFFLD(SD06)
     A                                      EDTCDE(J)
     A            SH07      R             96
     A*                                     REFFLD(SH07)
     A                                      EDTCDE(J)
     A            S207           9  0    108
     A                                      EDTCDE(J)
M004MA*           CSH12     R            105EDTCDE(J)
     A            CSH12     R            135
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           CSH13N    R            122EDTCDE(J)
     A            CSH13N    R            152
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           CSH13O    R            139EDTCDE(J)
     A            CSH13O    R            169
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           SH08      R            156EDTCDE(J)
     A            SH08      R            185
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PD2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     7
     A                                      '客戶小計-------------------------
     A                                      ------------->'
     A            SH12S     R             62
     A                                      EDTCDE(J)
     A                                      REFFLD(SH12)
     A            SH13S     R             69
     A                                      EDTCDE(J)
     A                                      REFFLD(SH13)
     A            SH07S     R             96
     A                                      EDTCDE(J)
     A                                      REFFLD(SH07)
     A            S207S          9  0    108
     A                                      EDTCDE(J)
     A            W0707S         9  0    120
     A                                      EDTCDE(J)
M004MA*           CSH12S    R            105EDTCDE(J)
     A            CSH12S    R            135
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           N1SH13    R            122EDTCDE(J)
     A            N1SH13    R            152
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           O1SH13    R            139EDTCDE(J)
     A            O1SH13    R            169
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           SH08S     R            156EDTCDE(J)
     A            SH08S     R            185
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PD3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     7
     A                                      '產品小計-------------------------
     A                                      ------------->'
     A            SH12P     R             62
     A                                      EDTCDE(J)
     A                                      REFFLD(SH12)
     A            SH13P     R             69
     A                                      EDTCDE(J)
     A                                      REFFLD(SH13)
     A            SH07P     R             96
     A                                      EDTCDE(J)
     A                                      REFFLD(SH07)
     A            S207P          9  0    108
     A                                      EDTCDE(J)
     A            W0707P         9  0    120
     A                                      EDTCDE(J)
M004MA*           CSH12P    R            105EDTCDE(J)
     A            CSH12P    R            135
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           N2SH13    R            122EDTCDE(J)
     A            N2SH13    R            152
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           O2SH13    R            139EDTCDE(J)
     A            O2SH13    R            169
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           SH08P     R            156EDTCDE(J)
     A            SH08P     R            185
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PD31
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     7
     A                                      '歸屬小計-------------------------
     A                                      ------------->'
     A            SH12B     R             62
     A                                      EDTCDE(J)
     A                                      REFFLD(SH12)
     A            SH13B     R             69
     A                                      EDTCDE(J)
     A                                      REFFLD(SH13)
     A            SH07B     R             96
     A                                      EDTCDE(J)
     A                                      REFFLD(SH07)
     A            S207B          9  0    108
     A                                      EDTCDE(J)
     A            W0707B         9  0    120
     A                                      EDTCDE(J)
M004MA*           CSH12B    R            105EDTCDE(J)
     A            CSH12B    R            135
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           N3SH13    R            122EDTCDE(J)
     A            N3SH13    R            152
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           O3SH13    R            139EDTCDE(J)
     A            O3SH13    R            169
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           SH08B     R            156EDTCDE(J)
     A            SH08B     R            185
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PD4
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     7
     A                                      '公司小計-------------------------
     A                                      ------------->'
     A            SH12C     R             62
     A                                      EDTCDE(J)
     A                                      REFFLD(SH12)
     A            SH13C     R             69
     A                                      EDTCDE(J)
     A                                      REFFLD(SH13)
     A            SH07C     R             96
     A                                      EDTCDE(J)
     A                                      REFFLD(SH07)
     A            S207C          9  0    108
     A                                      EDTCDE(J)
     A            W0707C         9  0    120
     A                                      EDTCDE(J)
M004MA*           CSH12C    R            105EDTCDE(J)
     A            CSH12C    R            135
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           N4SH13    R            122EDTCDE(J)
     A            N4SH13    R            152
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           O4SH13    R            139EDTCDE(J)
     A            O4SH13    R            169
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
M004MA*           SH08C     R            156EDTCDE(J)
     A            SH08C     R            185
     A                                      EDTCDE(J)
     A                                      REFFLD(SH08)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A                                      SPACEA(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 002
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<ARR061A>>--->報表結束'
     A                                      SPACEA(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 002
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE4
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     1
     A                                      ' '
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE5
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      'もも此範圍無資料もも'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(REPLIB/ARR061AP)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       220      *N     )
     A*%%***********************************************************************
