     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR080P                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 83/12/01                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR080                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :發票日期帳齡分析表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    46MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    50'發票日期帳齡分析表'
     A                                      SPACEA(2)
     A                                     1'公司別  :'
     A            COMPS          1   O    12
     A                                    +1'-'
     A            COMPE          1   O    +1
     A                                      SPACEA(1)
     A                                     1'辦事處  :'
     A            DSI01S         1   O    12
     A                                    +1'-'
     A            DSI01E         1   O    +1
     A                                      SPACEA(1)
     A                                     1'通　　路:'
     A            DSI03S         1   O    12
     A                                    +1'-'
     A            DSI03E         1   O    +1
     A                                      SPACEA(1)
     A                                     1'型　　態:'
     A            DSI04S         2   O    12
     A                                    +1'-'
     A            DSI04E         2   O    +1
     A                                    88'日期:'
     A            $EGMDY         6  0O    96EDTCDE(Y)
     A                                   105'頁次:'
     A                                   113PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'確認日期:'
     A            YDATES         6  0O    12EDTWRD('  /  /  ')
     A                                    88'時間:'
     A                                    96TIME
     A                                   108'<ARR080AP>'
     A                                      SPACEA(1)
     A                                     1'分析方式:'
     A            DATA           1   O    12
     A            TITE          24        +1
     A                                    88
     A                                      DFT(' USER :')
     A            $USER         10A  O    96
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'客戶代號／名稱'
     A                                    28'30天內'
     A                                    40'31～60天'
     A                                    54'61～90天'
     A                                    68'91～120天'
     A                                    82'120天以上'
     A                                   100'總額'
     A                                   110'名次'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF1012         5         2
     A            ME04      R              7
     A            WF1013         9  0     26EDTCDE(J)
     A            WF1014         9  0     40EDTCDE(J)
     A            WF1015         9  0     54EDTCDE(J)
     A            WF1016         9  0     68EDTCDE(J)
     A            WF1017         9  0     82EDTCDE(J)
     A            WF1018         9  0     96EDTCDE(J)
     A            SORT           4  0    110EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A                                     7'合　　　　　　計'
     A            ENDO           9  0     26EDTCDE(J)
     A            ENDA           9  0     40EDTCDE(J)
     A            ENDB           9  0     54EDTCDE(J)
     A            ENDC           9  0     68EDTCDE(J)
     A            ENDD           9  0     82EDTCDE(J)
     A            ENDTOT         9  0     96EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<ARR080AP>>--->報表結束'
     A                                      SPACEA(1)
     A  30                                 1'分析方式為Ｂ－未兌現票據還原應+
                                             收帳款者之驗證方法：'
     A                                      SPACEA(1)
        30                                15'以ARR076應收票據明細表之合計，'
     A                                      SPACEA(1)
        30                                15'扣除ARR076中票據所分配之發票+
                                             發票日期大於螢幕確認日者．'
                                            SPACEA(1)
        30                                15'再扣除ARR076中各票據有未分配者+
                                             （因未分配之金額不會影響帳齡），'
                                            SPACEA(1)
        30                                15'再加上分析方式為Ａ之帳齡金額即可'
                                            SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE4
     A                                     1'                    +
     A                                                           +
     A                                                           +
     A                                                           +
     A                                                           +
     A                                                           +
     A                                                 '
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE5                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
