     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : ARR078BP                                   *
     A*    AUTHOR       : AN MNIG HSIA                               *
     A*    CREATE DATE  : 03/12/94                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR078                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款系統                              *
     A*    REMARK       :調整原因分析表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    74MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    80'調整原因分析報表'
     A                                      SPACEA(1)
     A                                    85'依日期'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            WFA601         1   O    +1
     A            D#A03     R        O    +2REFFLD(#A03)
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            COMP           1   O    +1
     A            TEXT           6   O    +1
     A                                      SPACEA(1)
     A                                     1'調整原因:'
     A            DIB17S         2   O    +1
     A                                    +1'-'
     A            DIB17E         2   O    +1
     A                                      SPACEA(1)
     A                                     1'物流點　:'
     A            DIB03S         5   O    +1
     A                                    +1'-'
     A            DIB03E         5   O    +1
     A                                   137'日期:'
     A            $EGMDY         6  0O   145EDTCDE(Y)
     A                                   156'頁次:'
     A                                   164PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DIB01S    R        O    +1REFFLD(IB01)
     A                                    +1'-'
     A            DIB01E    R        O    +1REFFLD(IB01)
     A                                   137'時間:'
     A                                   145TIME
     A                                      SPACEA(1)
     A                                     1'調整日期:'
M001DA*           DIB04S    R        O    +1REFFLD(IB04)
M001AA            DIB04S         6  0O    +1
     A                                      EDTCDE(Y)
     A                                    +2'-'
M001DA*           DIB04E    R        O    +1REFFLD(IB04)
M001AA            DIB04E         6  0O    +1
     A                                      EDTCDE(Y)
     A                                   137' USER :'
     A            $USER         10       145
     A                                   157'<ARR078BP>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     1'原因／說明'
     A                                    27'調整日期'
     A                                    37'物流點／名稱'
     A                                    66'產品代號／簡稱'
     A                                    99'數量'
     A                                   111'F.O.B.'
     A                                   127'F.H.I.'
     A                                   145'DUTY'
     A                                   158'總成本'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
     A N30        WFA607    R              2REFFLD(SC10)
     A N30        D#A031        22         5
     A N31        DA608          6  0     28EDTCDE(Y)
     A N32        WFA606    R             38REFFLD(IA02)
     A N32        D#A033        22        44
     A            WFA605    R             67REFFLD(IA03)
     A            MA03      R             77REFFLD(MA03)
     A            TOT09          7  0     96EDTCDE(J)
     A            TOT10         11  2    107EDTCDE(J)
     A            TOT11         11  2    123EDTCDE(J)
     A            TOT12         11  2    139EDTCDE(J)
     A            TOT01         11  2    155EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    77'物流點小計----->'
     A            T1T09          7  0     96EDTCDE(J)
     A            T1T10         11  2    107EDTCDE(J)
     A            T1T11         11  2    123EDTCDE(J)
     A            T1T12         11  2    139EDTCDE(J)
     A            T1T01         11  2    155EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    77'日期小計------->'
     A            T2T09          7  0     96EDTCDE(J)
     A            T2T10         11  2    107EDTCDE(J)
     A            T2T11         11  2    123EDTCDE(J)
     A            T2T12         11  2    139EDTCDE(J)
     A            T2T01         11  2    155EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    77'原因小計------->'
     A            T3T09          7  0     96EDTCDE(J)
     A            T3T10         11  2    107EDTCDE(J)
     A            T3T11         11  2    123EDTCDE(J)
     A            T3T12         11  2    139EDTCDE(J)
     A            T3T01         11  2    155EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT4                       SPACEA(1)
     A                                    77'公司別小計----->'
     A            T4T09          7  0     96EDTCDE(J)
     A            T4T10         11  2    107EDTCDE(J)
     A            T4T11         11  2    123EDTCDE(J)
     A            T4T12         11  2    139EDTCDE(J)
     A            T4T01         11  2    155EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT5                       SPACEA(1)
     A                                    77'總　　　計----->'
     A            T5T09          7  0     96EDTCDE(J)
     A            T5T10         11  2    107EDTCDE(J)
     A            T5T11         11  2    123EDTCDE(J)
     A            T5T12         11  2    139EDTCDE(J)
     A            T5T01         11  2    155EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     2'<<ARR078BP>>-->報表結束'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
