     A*================================================================
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*----------------------------------------------------------------
     A* M003 |MICHELLE|02.03.14|顯示未確認稅額
     A*----------------------------------------------------------------
     A* M004 |MICHELLE|04.05.20|確認金額改列銷售金額,稅額及發票金額
     A*----------------------------------------------------------------
     A*================================================================
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    77MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    81'統一發票調節參考表'
     A                                      SPACEA(1)
     A                                     1'發票公司:'
     A            WF4401    R             +1REFFLD(WF4401 *LIBL/REWF44)
     A            #B03      R             +1
     A                                   162'日期:'
     A            $EGMDY         6  0O   170EDTCDE(Y)
     A                                   180'頁次:'
     A                                   187PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'發票年月:'
     A            DSI21          4  0     +1EDTWRD('  /  ')
     A                                   162'時間:'
     A                                   170TIME
     A                                      SPACEA(1)
     A                                     1'含人工作廢發票:'
     A            DSEL           1        +1
M002AA                                    +5'註記＝＊：發票跨月確認且重開'
     A                                   163'USER :'
     A            $USER         10   O   170
     A                                   180'<ARR062>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
M002AA                                       ========+
     A                                       =========='
     A                                      SPACEA(1)
     A                                    67'　發　票　金　額　'
     A                                      UNDERLINE
     A                                   107'　確　認　金　額　'
     A                                      UNDERLINE
M003MA*                                  147'未　確　認　金　額'
M003MA                                   145'未　　確　　認　　金　　額'
     A                                      UNDERLINE
     A                                      SPACEA(1)
     A                                     1'發票日期'
     A                                    12'發票號碼'
     A                                    23'客戶代號／簡稱'
     A                                    58'銷售金額'
M003MA*                                   74'折扣'
M003MA*                                   86'淨售'
M003MA                                    74'稅額'
M003MA                                    84'發票金額'
     A                                    98'銷售金額'
M003MA*                                  114'折扣'
M003MA*                                  126'淨售'
M003MA                                   114'稅額'
M003MA                                   124'發票金額'
     A                                   138'銷售金額'
     A                                   154'折扣'
     A                                   166'淨售'
M003AA                                   176'稅　額'
M003MA*                                  172'確認日期'
M003MA*                                  183'註記'
M003MA                                   184'確認日期'
M003MA                                   194'註'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
M003AA                                       --------+
     A                                       ----------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
M001DA*           DF4403    R              2REFFLD(WF4403 *LIBL/REWF44)
M001AA            DF4403         6  0      2
     A                                      EDTWRD('  /  /  ')
     A            WF4404    R             13REFFLD(WF4404 *LIBL/REWF44)
     A            WF4405    R             24REFFLD(WF4405 *LIBL/REWF44)
     A            WF4406    R             30REFFLD(WF4406 *LIBL/REWF44)
     A            ME04      R             35
     A            WF4407    R             56REFFLD(WF4407 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            WF4408    R             68REFFLD(WF4408 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            WF4409    R             80REFFLD(WF4409 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A  30        WF4410    R             96REFFLD(WF4407 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A  30        WF4411    R            108REFFLD(WF4408 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A  30        WF4412    R            120REFFLD(WF4409 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A N30        WF4413    R            136REFFLD(WF4407 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A N30        WF4414    R            148REFFLD(WF4408 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A N30        WF4415    R            160REFFLD(WF4409 *LIBL/REWF44)
     A                                      EDTCDE(J)
M003AA N30        WF4420    R            172REFFLD(WF4420 *LIBL/REWF44)
M003AA                                      EDTCDE(J)
M001DA*           DF4416    R            173REFFLD(WF4416 *LIBL/REWF44)
M001AA*M003M      DF4416         6  0    173
M003MA            DF4416         6  0    185
     A                                      EDTWRD('  /  /  ')
M003MA*           WF4419    R            182REFFLD(WF4419 *LIBL/REWF44)
M003MA*           MARK           8O      183
M003MA            WF4419    R            194REFFLD(WF4419 *LIBL/REWF44)
M003MA            MARK           4O      195
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(3)
     A                                    56'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
M003AA                                       --------------+
     A                                       ----------------'
     A                                      SPACEA(1)
     A            T14407    R             56REFFLD(WF4407 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T14408    R             68REFFLD(WF4408 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T14409    R             80REFFLD(WF4409 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T14410    R             96REFFLD(WF4407 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T14411    R            108REFFLD(WF4408 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T14412    R            120REFFLD(WF4409 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T14413    R            136REFFLD(WF4407 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T14414    R            148REFFLD(WF4408 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T14415    R            160REFFLD(WF4409 *LIBL/REWF44)
     A                                      EDTCDE(J)
M003AA            T14420    R            172REFFLD(WF4420 *LIBL/REWF44)
M003AA                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(3)
     A                                     2'もも總計もも－－－＞'
     A            T24407    R             56REFFLD(WF4407 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T24408    R             68REFFLD(WF4408 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T24409    R             80REFFLD(WF4409 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T24410    R             96REFFLD(WF4407 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T24411    R            108REFFLD(WF4408 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T24412    R            120REFFLD(WF4409 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T24413    R            136REFFLD(WF4407 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T24414    R            148REFFLD(WF4408 *LIBL/REWF44)
     A                                      EDTCDE(J)
     A            T24415    R            160REFFLD(WF4409 *LIBL/REWF44)
     A                                      EDTCDE(J)
M003AA            T24420    R            172REFFLD(WF4420 *LIBL/REWF44)
M003AA                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
M003AA                                       ========+
     A                                       =========='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
M003AA                                       ========+
     A                                       =========='
     A                                      SPACEA(1)
     A                                     2'<<ARR062>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
