     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR041D                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/04/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR041                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :客戶對帳單                                *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF04(04 'F4 HELP')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'ARR041'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 34'客戶對帳單'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5 26'辦事處:'
     A            DSI01          1A  B  5 38VALUES('1' '2' '3' ' ')
     A                                  5 42'(1-台北 2-台中 3-高雄" "-+
     A                                      全部)'
     A                                  6 26'通路　　　:'
     A                                      DSPATR(HI)
     A            DSI03S    R        B  6 40REFFLD(SI03)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A N60                                  DSPATR(HI)
     A                                  6 50'-'
     A            DSI03E         1A  B  6 52
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A N61                                  DSPATR(HI)
     A                                  7 26'型態      :'
     A                                      DSPATR(HI)
     A            DSI04S    R        B  7 40REFFLD(SI04)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A N62                                  DSPATR(HI)
     A                                  7 50'-'
     A            DSI04E    R        B  7 52REFFLD(SI04)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A N63                                  DSPATR(HI)
     A                                  9 26'客戶代號　:'
     A                                      DSPATR(HI)
     A                                  9 50'-'
     A                                 10 26'業務員代號:'
     A                                      DSPATR(HI)
     A            DSI31S    R        B 10 40REFFLD(SI31)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A N66                                  DSPATR(HI)
     A                                 10 50'-'
     A            DSI31E    R        B 10 52REFFLD(RERFR/SI31 *LIBL/RERF)
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A N67                                  DSPATR(HI)
     A                                 12 26'應收日期　:'
M001DA*           DSI29S    R        B 12 40REFFLD(RERFR/SI29 *LIBL/RERF)
M001AA            DSI29S         6  0B 12 40
     A                                      EDTCDE(Y)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A                                 12 50'-'
     A            DSI29E         6Y 0B 12 52EDTCDE(Y)
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A                                 13 26'確認日期　:'
M001DA*           DSI35S    R        B 13 40REFFLD(RERFR/SI35 *LIBL/RERF)
M001AA            DSI35S         6Y 0B 13 40
     A                                      EDTCDE(Y)
     A  70                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A                                 13 50'-'
     A            DSI35E         6Y 0B 13 52EDTCDE(Y)
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A                                 16 26'執行環境　:'
     A            $EVR           1Y 0B 16 40VALUES(1 2)
     A                                      EDTCDE(3)
     A                                      CHECK(RB)
     A                                 16 43'(1-即時   2-批次)'
     A                                 17 26'列印份數　:'
     A            $CPY           3Y 0B 17 40EDTCDE(3)
     A                                      CHECK(RB)
     A                                 18 26'列表機　　:'
     A                                      DSPATR(HI)
     A            $PRTID         2Y 0B 18 40CHECK(RB)
     A                                      DSPATR(HI)
     A                                      EDTCDE(3)
     A                                 20 32'***請準備套版紙***      '
     A                                      DSPATR(HI)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2140 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR8          50A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                 12 63'(MM/DD/YY)'
     A            DSI12S    R        B  9 40REFFLD(RERFR/SI12 *LIBL/RERF)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A            DSI12E    R        B  9 52REFFLD(RERFR/SI12 *LIBL/RERF)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
