     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR041P                                    *
     A*    AUTHOR       : A1139 JANE                                 *
     A*    CREATE DATE  : 81/04/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR041                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :客戶對帳單                                *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(11)
     A            DME03         46        50
     A                                      SPACEA(2)
     A            ME05      R             50
     A                                      SPACEA(2)
     A            ME06      R             50
     A                                      SPACEA(3)
     A            SI12      R             60
     A                                    +1'-'
     A            SI13      R             68
     A                                      SPACEA(1)
     A            MC02      R             59
     A                                      SPACEA(2)
     A            PYY            2  0     20
     A            PMM            2  0     26
     A            PDD            2  0     31
     A                                      SPACEA(5)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A            DSI06          6  0      6EDTWRD('  /  /  ')
     A            SI10      R             19
     A            SI11      R             37
     A            SI02      R             55
     A            PSI30     R             72EDTCDE(1)
     A                                      REFFLD(SI30)
     A*           DSI29          6  0    107EDTWRD('  /  /  ')
     A*----------------------------------------------------------------
     A          R PD2                       SPACEB(2)
     A                                    52'應收帳款合計　:'
     A            PD1TOT         9  0     72EDTCDE(1)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEB(1)
     A            DF1101         6  0      6EDTWRD('  /  /  ')
     A            WF1102    R             19REFFLD(WF1102 *LIBL/REWF11)
     A            WF1103    R             37REFFLD(WF1103 *LIBL/REWF11)
     A            WF1104    R             55REFFLD(WF1104 *LIBL/REWF11)
     A N30        WF1105    R             72REFFLD(WF1105 *LIBL/REWF11)
     A                                      EDTCDE(1)
     A            WF1106    R             88REFFLD(WF1106 *LIBL/REWF11)
     A            DF1107         6  0    107EDTWRD('  /  /  ')
     A*----------------------------------------------------------------
     A          R PD4                       SPACEB(2)
     A                                    52'未兌現票據合計:'
     A            PD3TOT         9  0     72EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PD5                       SPACEB(2)
     A                                    52'もも煩請開立劃線支票もも'
