     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : ARR070P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 05/04/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR070                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    REMARK       :寄賣產品成本明細表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    43MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    48'寄賣產品成本明細表'
     A                                      SPACEA(2)
     A                                     1'公司別:'
     A            DSE01A         1   O    +1
     A                                      SPACEA(1)
     A                                     1'辦事處:'
     A            DSE01B         1   O    +1
     A            COMPC          6O       +1
     A                                    88'日期:'
     A            $EGMDY         6  0O    96EDTCDE(Y)
     A                                   106'頁次:'
     A                                   113PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'確認日期:'
     A            DSE24S         6  0O    +1EDTCDE(Y)
     A                                    +0'～'
     A            DSE24E         6  0O    +1EDTCDE(Y)
     A                                    88'時間:'
     A                                    96TIME
     A                                   106'<ARR070P>'
     A                                      SPACEA(1)
     A                                     1'禮　盒:'
     A            DSEL1          1A  O    11
     A N21                                13'禮盒不拆'
     A  21                                13'禮盒拆單瓶'
     A                                    88' USER :'
     A            $USER         10A  O    96
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===========+
     A                                       ======='
     A                                      SPACEA(1)
     A                                    57'--------------------------'
     A                                    83'寄賣成本'
     A                                    93'--------------------------'
     A                                      SPACEA(1)
     A                                     1'客戶代號／簡稱'
     A                                    29'產品代號／名稱'
     A                                    56'寄賣數量'
     A                                    71' F.O.B'
     A                                    84' F.H.I'
     A                                    94'公賣利益'
     A                                   109'總成本'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----------+
     A                                       -------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        WF7103    R              2REFFLD(SE04)
     A N30        WF7104    R              7REFFLD(SE05)
     A N30        ME04      R             11REFFLD(ME04)
     A            WF7105    R             30REFFLD(SF03)
     A            MA03      R             +0REFFLD(MA03)
     A            WF7106         6  0O    58EDTCDE(J)
     A            WF7107         9  2O    66EDTCDE(J)
     A            WF7108         9  2O    79EDTCDE(J)
     A            WF7109         9  2O    92EDTCDE(J)
     A            T07105        10  2O   105EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    39'小　計---------->'
     A            T17101         6  0O    58EDTCDE(J)
     A            T17102         9  2O    66EDTCDE(J)
     A            T17103         9  2O    79EDTCDE(J)
     A            T17104         9  2O    92EDTCDE(J)
     A            T17105        10  2O   105EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    39'總　計---------->'
     A            T27101         6  0O    58EDTCDE(J)
     A            T27102         9  2O    66EDTCDE(J)
     A            T27103         9  2O    79EDTCDE(J)
     A            T27104         9  2O    92EDTCDE(J)
     A            T27105        10  2O   105EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===========+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===========+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'<<ARR070P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
