     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR044P                                    *
     A*    AUTHOR       : A1139 JANE                                 *
     A*    CREATE DATE  : 81/04/02                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR044                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :票據收入明細表                            *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.22  Y2K MODIFY                    */
     /*=============================================================*/
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    35MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    41'票據收入明細表'
     A                                      SPACEA(2)
     A                                    68'日期:'
     A            $EGMDY         6  0O    76EDTCDE(Y)
     A                                    85'頁次:'
     A                                    93PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'公司:'
     A            DAD01     R              9REFFLD(AD01)
     A            D#B03         16   O    12
     A                                    68'時間:'
     A                                    76TIME
     A                                    87'<ARR044>'
     A                                      SPACEA(1)
     A                                     1'日期:'
M001MA*           DAD04S    R              9REFFLD(AD04)
M001MA            DAD04S         6  0      9
     A                                      EDTWRD('  /  /  ')
     A                                    17'～'
M001MA*           DAD04E    R             21REFFLD(AD04)
M001MA            DAD04E         6  0     21
     A                                      EDTWRD('  /  /  ')
     A                                    68' USER :'
     A            $USER         10A  O    76
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'客戶代號／名稱'
     A                                    25'收款日期'
     A                                    35'發票號碼'
     A                                    49'票據號碼'
     A                                    68'金額'
     A                                    74'預計兌現日'
     A                                    86'業務員'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  31        AD02      R              2
     A  31        ME04      R              7
     A            DDATE          6  0     26EDTWRD('  /  /  ')
     A            AD07      R             36
     A            AD06      R             48
     A            DAD08          7  0     64EDTCDE(J)
     A            DAC07          6  0     77EDTWRD('  /  /  ')
     A  30        MC02      R             86
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    35'客戶小計----------------->'
     A            CUSTOT         8  0     63EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A                                     7'合　　　　　　計+
     A                                       ---------------------+
     A                                       ---------------->'
     A            ENDTOT         8  0     63EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<ARR044>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE4
     A                                     1'                    +
     A                                                           +
     A                                                           +
     A                                                           +
     A                                                           '
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE5                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
