     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR055P                                    *
     A*    AUTHOR       : A1139 JANE                                 *
     A*    CREATE DATE  : 81/04/23                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR055                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :物流點存貨成本表                          *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    58MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    63'物流點存貨成本表'
     A                                      SPACEA(2)
     A                                   117'日期:'
     A            $EGMDY         6  0O   125EDTCDE(Y)
     A                                   134'頁次:'
     A                                   141PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'公司別:'
     A            DIA01     R        O    11REFFLD(IA01)
     A            D#A03     R        O    17REFFLD(#A03)
     A                                   117'時間:'
     A                                   125TIME
     A                                   135'<ARR055>'
     A                                      SPACEA(1)
     A                                     1'物流點:'
     A            IA02      R        O    11
     A            NAME          22   O    17
     A                                   117' USER :'
     A            $USER         10A  O   135
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =======================+
     A                                       =================================='
     A                                      SPACEA(1)
     A                                    51'<--------------單　位　成　本--+
     A                                      ----------->'
     A                                    99'<------------------- 總　成　本 +
     A                                       ----------------->'
     A                                      SPACEA(1)
     A                                     1'產品代號／名稱'
     A                                    31'單位'
     A                                    42'庫存量'
     A                                    52'   FOB'
     A                                    63'   FHI'
     A                                    74'  DUTY'
     A                                    89'  TOTAL'
     A                                   107'   FOB'
     A                                   122'   FHI'
     A                                   136'FOB+FHI'
     A                                   150'   DUTY'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----------------------+
     A                                       ----------------------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            IA03      R              2
     A            MA03      R             12
     A            MA13      R             31
     A            IA06      R             42EDTCDE(J)
     A            MA31      R             51EDTCDE(J)
     A            MA32      R             62EDTCDE(J)
     A            MA33      R             73EDTCDE(J)
     A            UNIT           9  2     84EDTCDE(J)
     A            DTOT1         11  2     99EDTCDE(J)
     A            DTOT2         11  2    114EDTCDE(J)
     A            DTOT4         11  2    129EDTCDE(J)
     A            DTOT3         11  2    144EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'物流點小計-->'
     A            T1TOT0         6S 0     42EDTCDE(J)
     A            T1TOT1        11  2     99EDTCDE(J)
     A            T1TOT2        11  2    114EDTCDE(J)
     A            T1TOT4        11  2    129EDTCDE(J)
     A            T1TOT3        11  2    144EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =======================+
     A                                       =================================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =======================+
     A                                       =================================='
     A                                      SPACEA(1)
     A                                     2'<<ARR055>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =======================+
     A                                       =================================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE4                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
