     A*%%TS  SD  19941205  144402  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR083D                                    *
     A*    AUTHOR       :                                            *
     A*    CREATE DATE  : 97/01/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR083                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :　　　　                                  *
     A*    REMARK       :　　　　　　　　　                        *
     A****************************************************************
     A*%%EC
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'ARR083'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'收款未分配明細表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6 28'公司別:'
     A            DAC01S    R        O  6 38REFFLD(AC01)
     A                                  6 41'-'
     A            DAC01E    R        O  6 43REFFLD(AC01)
     A                                  6 46'(R-匯東 W-匯齡 " "-全部)'
     A                                  7 46'(辦事處：１台北　２台中　３高雄)'
     A                                  9 26'客戶代號:'
     A            DAC02S    R        O  9 38REFFLD(AC02)
     A                                  9 44'-'
     A            DAC02E    R        O  9 47REFFLD(AC02)
     A                                 11 26'業務人員:'
     A            DAC09S    R        O 11 38REFFLD(AC09)
     A                                  9 44'-'
     A            DAC09E    R        O 11 47REFFLD(AC09)
     A                                 13 26'收款日期:'
M001DA*           DAC04S    R        O 13 38REFFLD(AC04)
M001AA            DAC04S         6  0O 13 38
     A                                      EDTWRD('  /  /  ')
     A                                 13 47'-'
M001DA*           DAC04E    R        O 13 49REFFLD(AC04)
M001AA            DAC04E         6  0O 13 49
     A                                      EDTWRD('  /  /  ')
     A                                 13 58'(MM/DD/YY)'
     A                                 16 26'執行環境:'
     A            $EVR           1  0O 16 38
     A                                      EDTCDE(3)
     A                                 16 42'(1-即時   2-批次)'
     A                                 17 26'列印份數:'
     A            $CPY           3  0O 17 38EDTCDE(3)
     A                                 18 26'列表機　:'
     A            $PRTID         2  0O 18 38
     A                                      EDTCDE(3)
     A                                 20 27'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
