     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : ARR064P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR064                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款系統                              *
     A*    REMARK       :收款沖帳明細表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    42MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    48'收款沖帳明細表'
     A                                      SPACEA(1)
     A                                     1'公司別:'
     A            WF4901    R             +1REFFLD(AC01)
     A            #B03          16   O    +1
     A                                      SPACEA(1)
     A                                     1'收款種類:'
     A            DAC05S    R             +1REFFLD(AC05)
     A                                    +1'-'
     A            DAC05E    R             +1REFFLD(AC05)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DAC02S    R             +1REFFLD(AC02)
     A                                    +1'-'
     A            DAC02E    R             +1REFFLD(AC02)
     A                                    88'日期:'
     A            $EGMDY         6  0O    96EDTCDE(Y)
     A                                   106'頁次:'
     A                                   113PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'挑選日期:'
M001DA*           DAC04S    R             +1REFFLD(AC04)
M001AA            DAC04S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
M001DA*           DAC04E    R             +1REFFLD(AC04)
M001AA            DAC04E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    88'時間:'
     A                                    96TIME
     A                                      SPACEA(1)
     A                                     1'收款日期:'
M001DA*           D4902     R             +1REFFLD(AC04)
M001AA            D4902          6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    89'USER :'
     A            $USER         10   O    96
     A                                   108'<ARR064>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     1'客戶代號／簡稱'
     A                                    26'收款種類'
     A                                    46'收款金額'
     A                                    57'分配公司別'
     A                                    70'發票號碼'
     A                                    82'分配金額'
     A                                    94'未分配金額'
     A                                   107'分配日期'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ----------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N20                                 1' '
     A                                      SPACEA(1)
     A N31        WF4903    R              2REFFLD(AC02)
     A N31        ME04          18   O     7
     A N32        WF4905    R             26REFFLD(AC05)
     A N32        D#A03         16   O    28
     A N33        WF4907    R             45REFFLD(AC08)
     A                                      EDTCDE(J)
     A  34        WF5007    R             62REFFLD(AD10)
     A  34        WF5009    R             70REFFLD(AD07)
     A  34        WF5008    R             82REFFLD(AD08)
     A                                      EDTCDE(J)
     A N33        WF4908    R             94REFFLD(AC08)
     A                                      EDTCDE(J)
M001DA*           D5010     R            107REFFLD(AD12)
M001AA            D5010          6  0    107
     A                                      EDTWRD('  /  /  ')
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A  22                                 2'日期收款種類合計:'
     A            PKIND     R             26REFFLD(AC05)
     A            P#A03         16   O    28
     A            PAMT      R             45REFFLD(AC08)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A N35                                 1' '
     A                                      SPACEA(1)
     A  21                                 2'公司收款種類合計:'
     A            CKIND     R             26REFFLD(AC05)
     A            C#A03         16   O    28
     A            CAMT      R             45REFFLD(AC08)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     7'日期小計----------------------->'
     A            T14907    R             45REFFLD(AC08)
     A                                      EDTCDE(J)
     A            T15008    R             82REFFLD(AD08)
     A                                      EDTCDE(J)
     A            T14908    R             94REFFLD(AC08)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'<<ARR064>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
