     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    PRTF NAME    : ARR077P                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 83/02/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARR077                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :進銷存系統                                *
     A*    REMARK       :折讓單簽收明細表                          *
     A*===============================================================
     A* CODE |  AUTHOR  |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M004 | MICHELLE | 00.06.15 |新增折讓稅額及折讓總金額欄
     A*================================================================
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
M004MA*                                   40MSGCON(030 URE9999 REMF)
M004MA                                    52MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
M004MA*                                   45'折讓單簽收明細表'
M004MA                                    57'折讓單簽收明細表'
     A                                      SPACEA(1)
     A                                     1'公司　:'
     A            DSG01S         1   O    +1
     A                                    +1'-'
     A            DSG01E         1   O    +1
     A                                      SPACEA(1)
     A                                     1'辦事處:'
     A            COMP           1   O    +1
     A            #COMP          6   O    +2
M004MA*                                   81'日期:'
M004MA*           $EGMDY         6  0O    89EDTCDE(Y)
M004MA*                                   98'頁次:'
M004MA*                                  106PAGNBR EDTCDE(Z)
M004MA                                   104'日期:'
M004MA            $EGMDY         6  0O   112EDTCDE(Y)
M004MA                                   121'頁次:'
M004MA                                   129PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'折讓日期:'
M001DA*           DSG26S    R        O    +1REFFLD(SG26)
M001AA            DSG26S         6  0O    +1
     A                                      EDTCDE(Y)
     A                                    +1'-'
M001DA*           DSG26E    R        O    +1REFFLD(SG26)
M001AA            DSG26E         6  0O    +1
     A                                      EDTCDE(Y)
M004MA*                                   81'時間:'
M004MA*                                   89TIME
M004MA*                                  100'<ARR077P>'
M004MA                                   104'時間:'
M004MA                                   112TIME
M004MA                                   123'<ARR077P>'
     A                                      SPACEA(1)
     A                                     1'業務員:'
     A            DSG11S    R        O    +1REFFLD(SG11)
     A                                    +1'-'
     A            DSG11E    R        O    +1REFFLD(SG11)
M004MA*                                   81' USER :'
M004MA*           $USER         10A  O    89
M004MA                                   104' USER :'
M004MA            $USER         10A  O   112
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     1'折讓日期'
M004MA*                                   11'業務人員'
M004MA                                    16'業務人員'
     A                                    31'客戶代號　　　簡稱'
M004MA*                                   64'折讓單號'
M004MA                                    62'折讓單號'
M004MA*                                   83'金額'
M004MA                                    76'未稅金額'
M004AA                                    90'稅　額'
M004AA                                   102'總金額'
M004MA*                                   89'業務員簽收'
M004MA*                                  101'回收日期'
M004MA                                   111'業務員簽收'
M004MA                                   123'回收日期'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
M001DA*           SG26      R              2EDTCDE(Y)
M001AA            DSG26          6  0      2EDTCDE(Y)
M004MA*           SG11      R             12
M004MA*           MC02      R             19
M004MA*           SG04      R             32
M004MA*           SG05      R             39
M004MA*           ME04      R             45
M004MA*           SG09      R             65
M004MA*           SG10      R             77EDTCDE(J)
M004MA*           UL1           10   O    90
M004MA*                                     UNDERLINE
M004MA*           UL2           10   O   102
M004MA*                                     UNDERLINE
M004MA            SG11      R             11
M004MA            MC02      R             18
M004MA            SG04      R             31
M004MA            SG05      R             37
M004MA            ME04      R             42
M004MA            SG09      R             61
M004MA            SG10      R             74EDTCDE(J)
M004AA            SX10           9  0     89EDTCDE(3)
M004AA            D1010          9  0    101EDTCDE(J)
M004MA            UL1           10   O   113
M004MA                                      UNDERLINE
M004MA            UL2           10   O   124
M004MA                                      UNDERLINE
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
M001DA*           AF05      R              2EDTCDE(Y)
M001AA            DAF05          6  0      2EDTCDE(Y)
M004MA*           ME15      R             12
M004MA*           MC02      R             19
M004MA*           AF03      R             32
M004MA*           AF04      R             39
M004MA*           ME04      R             45
M004MA*           AF02      R             65
M004MA*           AF07      R             77EDTCDE(J)
M004MA*           UL3           10   O    90
M004MA*                                     UNDERLINE
M004MA*           UL4           10   O   102
M004MA            ME15      R             11
M004MA            MC02      R             18
M004MA            AF03      R             31
M004MA            AF04      R             37
M004MA            ME04      R             42
M004MA            AF02      R             61
M004MA            AF07      R             74EDTCDE(J)
M004AA            AF09           9  0     89EDTCDE(3)
M004AA            D0709          9  0    100EDTCDE(J)
M004MA            UL3           10   O   112
M004MA                                      UNDERLINE
M004MA            UL4           10   O   123
     A                                      UNDERLINE
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'<<ARR077P>>--->報表結束 '
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
