     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : CKR3D0D                                    *
     A*    AUTHOR       : A1092   TAILOR                             *
     A*    CREATE DATE  : 79/12/17                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : CKR3D0                                     *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :票據系統                                  *
     A*    PURPOSE      :收現記錄列印                              *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/CKRF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPD1
     A                                      CA03(03 '結束執行')
     A                                  1  2'<CKR3D0D>'
     A            CONAME        40A  O  1 20MSGID(US#9002 S#MF)
     A                                  1 64'日期:'
     A            $CHYMD         6Y 0O  1 72EDTCDE(Y)
     A            $USERN        10A  O  2  2
     A                                  2 33'收現記錄列印'
     A                                  5 32'公司別:'
     A            DBG01     R        B  5 42REFFLD(BG01)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  7 30'日期　起:'
     A            DBG02S    R        B  7 42REFFLD(BG02)
     A                                      EDTWRD('  /  /  ')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  8 28'　　　　訖'
     A            DBG02E    R        B  8 42REFFLD(BG02)
     A                                      EDTWRD('  /  /  ')
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                 13 30'執行環境:'
     A            $EVR           1Y 0B 13 42EDTCDE(3)
     A                                      VALUES(1 2)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                 13 47'(1-即時2-批次)'
     A                                 14 30'列印份數:'
     A            $CPY           3Y 0B 14 42EDTCDE(3)
     A                                      CHECK(RB)
     A                                 15 30'列表機　:'
     A            $PRTID         1Y 0B 15 42EDTCDE(3)
     A            PRINTMARK     40A  O 17 30MSGID(UPT 0001 PTMF)
     A                                 19 28'***請準備　８０行報表紙***'
     A  98        ERR1          50A  O 22  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 22  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 22  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 22  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 22  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 22  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          50A  O 22  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A                                 23  2'PF3 =回主畫面'
     A                                 24 67'【泛太資訊】'
