     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : CKR3D0P                                    *
     A*    AUTHOR       : A1092   TAILOR                             *
     A*    CREATE DATE  : 79/12/17                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : CKR3D2                                     *
     A*    SYSTEM       :財務系統                                  *
     A*    SUBSYSTEM    :票據系統                                  *
     A*    PURPOSE      :收現記錄列印                              *
     A****************************************************************
     A                                      REF(*LIBL/CKRF)
     A          R PH1                       SKIPB(2)
     A                                    52'日期:'
     A            $CHYMD         6  0     60EDTCDE(Y)
     A                                    68'頁次:'
     A                                    76PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                    52'時間:'
     A                                    60TIME
     A                                    69'<CKR3D0P>'
     A                                      SPACEA(2)
     A            #B03      R             29REFFLD(#B03 *LIBL/PTRF)
     A                                      SPACEA(1)
     A                                    22'收現記錄列印'
     A                                      SPACEA(1)
     A                                    16'================================='
     A                                      SPACEA(1)
     A            DBG02S    R        O    17REFFLD(BG02)
     A                                      EDTCDE(Y)
     A                                    27'---'
     A            DBG02E    R        O    32REFFLD(BG02)
     A                                      EDTCDE(Y)
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     3'存款日期'
     A                                    16'銀行簡稱'
     A                                    31'銀行帳號'
     A                                    56'金額'
     A                                    67'繳款單號'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  31        BG02      R              4EDTWRD('  /  /  ')
     A  31        BA04      R             16
     A  31        BG04      R             32
     A            BG05      R             50EDTCDE(1)
     A            BG03      R             68
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(2)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       -------------------'
     A                                      SPACEA(1)
     A                                    36'總金額:'
     A            PSBG05    R             49REFFLD(BG05)
     A                                      EDTWRD('   ,   ,  $0.  ')
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==================='
     A*----------------------------------------------------------------
     A          R PE2                       SPACEB(2)
     A                                     2'***接下頁***'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       =================='
     A                                      SPACEA(2)
     A                                     2'***報表結束***'
