     A*%%TS  SD  19930616  113459  D910121     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : DPA002D                                    *
     A*    AUTHOR       : A1139 JANE                                 *
     A*    CREATE DATE  : 81/04/14                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : DPA002                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款子系統                            *
     A*    REMARK       :產品成本資料維護 (A/U/D/I)                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*----------------------------------------------------------------
     A          R SFLSR                     SFL
     A*%%TS  SD  19920528  085643  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN            4S 0H
     A            DOPT1          1A  B  9  4VALUES(' ' '5')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            IB01      R        O  9  8
     A            MA03      R        O  9 18
     A            MA06      R        O  9 37
     A            IB02      R        O  9 55
     A            IB03      R        O  9 60
     A            DIB04          6Y 0O  9 68EDTWRD('  /  /  ')
     A            IB04      R        H
     A            IBYY      R        H
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19920609  104808  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CF06(06)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           4S 0H      SFLRCDNBR
     A                                  1  2'DPA002'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'產品成本資料維護'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'輸入作業選擇:'
     A                                  5  5'5=查詢'
     A                                  6 67'調整日期'
     A                                  7  4'A  產品代號中文簡稱         +
     A                                      英文簡稱       公司　物流點 MM/-
     A                                      DD/YY'
     A                                      DSPATR(UL)
     A            DBGN1     R        B  8  8REFFLD(IB01)
     A            DBGN2     R        B  8 55REFFLD(IB02)
     A            DBGN3     R        B  8 60REFFLD(IB03)
     A*----------------------------------------------------------------
     A          R DSPC1
     A*%%TS  SD  19920414  164322  REPGMRP     REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F6 =新增'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A  96        ERR1          60A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          60A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          60A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          60A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          60A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          60A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          60A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          60A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          60A  O 24  2MSGID(URE 0038 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         60A  O 24  2MSGID(URE 0039 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A          R DSPD2
     A*%%TS  SD  19930616  113459  D910121     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF12(12)
     A                                      CF14(14)
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'DPA002'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 31'產品成本資料維護'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  1'產品代號　　　:'
     A            DIB01     R        B  4 19REFFLD(IB01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A                                  5  1'中文全稱　　　:'
     A            MA02      R        O  5 19
     A                                  6  1'英文全稱　　　:'
     A            MA04      R        O  6 19
     A            MA05      R        O  7 19
     A                                  7 54'保稅庫存量:'
     A            DIB22     R        O  7 68REFFLD(IB22)
     A                                      EDTCDE(1)
     A                                  8  1'公司別　　　　:'
     A            DIB02     R        B  8 19REFFLD(IB02)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            #B03      R        O  8 22
     A                                  8 54'完稅庫存量:'
     A            DIB23     R        O  8 68REFFLD(IB23)
     A                                      EDTCDE(1)
     A                                  9  1'物流點代號　　:'
     A            DIB03     R        B  9 19REFFLD(IB03)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            D#A03         22A  O  9 25
     A                                  9 55'TOTAL      :'
     A            DIB223    R        O  9 68REFFLD(IB22)
     A                                      EDTCDE(1)
     A                                 10  1'調整日期　　　:'
     A            SIB04          6Y 0O 10 19EDTWRD('  /  /  ')
     A                                 10 29'(MM/DD/YY)'
     A                                 12 30'FOB'
     A                                 12 46'FHI'
     A                                 12 61'DUTY'
     A                                 12 68'庫存數量'
     A                                 13  1'現況  TOTAL'
     A            IB05      R        O 13 19EDTCDE(J)
     A            IB06      R        O 13 35EDTCDE(J)
     A            IB07      R        O 13 51EDTCDE(J)
     A            IB08      R        O 13 70EDTCDE(J)
     A                                 14  1'調整數TOTAL'
     A            DIB10         11Y 2B 14 19EDTCDE(J)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            DIB11         11Y 2B 14 35EDTCDE(J)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            DIB12         11Y 2B 14 51EDTCDE(J)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            DIB13          6Y 0B 14 70EDTCDE(J)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A                                 15  1'調整後TOTAL'
     A            TIB10         11Y 2O 15 19EDTCDE(J)
     A            TIB11         11Y 2O 15 35EDTCDE(J)
     A            TIB12         11Y 2O 15 51EDTCDE(J)
     A            TIB13          6Y 0O 15 70EDTCDE(J)
     A                                 18  1'調整前單位成本:'
     A            IB09      R        O 18 19EDTCDE(J)
     A                                 19  1'調整後單位成本:'
     A            IB14      R        O 19 19EDTCDE(J)
     A                                 20  1'原因　　　　　:'
     A                                      DSPATR(HI)
     A            DIB17     R        B 20 19REFFLD(IB17)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            D#A031        22A  O 20 22
     A                                 21  1'備註　　　　　:'
     A            DIB15     R        B 21 19REFFLD(IB15)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            IB19      R        O 16 23EDTCDE(J)
     A            IB20      R        O 16 39EDTCDE(J)
     A            IB21      R        O 16 55EDTCDE(J)
     A            IB24      R        O 17 23EDTCDE(J)
     A            IB25      R        O 17 39EDTCDE(J)
     A            IB26      R        O 17 55EDTCDE(J)
     A                                 22  3'執行'
     A                                 22 12'F3 =回主畫面'
     A                                 22 28'F4 =視窗查詢'
     A                                 22 44'F12=回前畫面'
     A                                 22 60'F14=確認存檔'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          60A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          60A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          60A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          60A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          60A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          60A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          60A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          60A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          60A  O 24  2MSGID(URE 0062 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         63A  O 24  2MSGID(URE 0061 REMF)
     A                                      DSPATR(HI)
     A  86        ERR11         60A  O 24  2MSGID(URE 0025 REMF)
     A                                      DSPATR(HI)
     A  85        ERR12         60A  O 24  2MSGID(UPT 0011 PTMF)
     A                                      DSPATR(HI)
     A  84        ERR13         60A  O 24  2MSGID(URE 0106 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                 16  1'調整前UNIT '
     A                                 17  1'調整後UNIT '
     A                                 11 69'物流點'
