     A*%%TS  SD  19920507  101423  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : DPA042D                                    *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : DPA042                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :電腦室子系統                              *
     A*    REMARK       :歷史檔案整理                              *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19920507  101423  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A  97                                  FRCDTA
     A  97                                  LOCK
     A                                      CA03(03 '結束執行')
     A                                      CF14(14 '處理作業')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'DPA042'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 33'歷史檔案整理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6 30'月份:'
     A            DMYS           4Y 0O  6 38EDTCDE(Y)
     A                                  6 44'-'
     A            DMYE           4Y 0O  6 46EDTCDE(Y)
     A                                  8 28'磁帶機:'
     A            DTDEV         10A  B  8 38
     A  60                                  DSPATR(PC RI)
     A                                 10 17'+----------------------------------
     A                                      --------------+'
     A                                 12 17'|'
     A                                 12 65'|'
     A                                 14 17'|請按F14以便處理此作業，否則按-
     A                                      F3結束此作業|'
     A                                 15 17'|'
     A                                 15 65'|'
     A                                 16 17'|'
     A                                 16 19'說明:將刪除並備份輸入月份所有+
     A                                      的資料'
     A                                 16 65'|'
     A                                 17 17'|'
     A                                 17 65'|'
     A                                 18 17'+----------------------------------
     A                                      --------------+'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F14=處理作業'
     A  98        ERR1          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2130 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                 19 31'***請準備好磁帶***'
     A                                      DSPATR(HI)
     A                                 11 17'|'
     A                                 11 65'|'
     A                                 13 17'|'
     A                                 13 65'|'
     A                                 12 19'注意:執行此作業前請先作好備份+
     A                                      工作'
     A                                      DSPATR(HI)
