     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : DPA003D                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/07/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : DPA003                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :錯誤統一發票重開                          *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    30MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    35'錯誤統一發票重開'
     A                                      SPACEA(1)
     A                                     1'物流點:'
     A            DSI05     R             +1REFFLD(SI05)
     A            #A03      R        O    +2
     A                                    70'日期:'
     A            $EGMDY         6  0O    78EDTCDE(Y)
     A                                    +1'頁次:'
     A                                    +1PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'送貨日期:'
     A            DSI06          6  0O    +1EDTCDE(Y)
     A                                    70'時間:'
     A                                    +1TIME
     A                                    +1'<DPA003P>'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ==================================-
     A                                      ')
     A                                      SPACEA(1)
     A                                     1'公司'
     A                                    23'原發票號碼'
     A                                    35'重開發票號碼'
     A                                    50'訂單日期'
     A                                    60'訂單號碼'
     A                                    75'送貨單號'
     A                                    90'取號錯誤'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      -----------------------------------
     A                                      ')
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A            SI01      R              2
     A            #B03      R        O    +1
     A            PSI02     R             24REFFLD(SI02)
     A            SI02      R             35
     A            SI07      R             +1
     A            PSC07          6  0     51EDTCDE(Y)
     A            SC02      R             61
     A            SE02      R             76
     A  70                                94'Y'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ==================================-
     A                                      ')
     A                                      SPACEB(1)
     A                                     2'***續下頁***'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ==================================-
     A                                      ')
     A                                      SPACEB(1)
     A                                     2'<<DPA003P>>--->報表結束'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ==================================-
     A                                      ')
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE31                      SPACEA(1)
     A                                     3'もも此範圍無資料もも'
