     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : DWPC03D                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/08/27                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : DWPC031                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :主檔                                      *
     A*    REMARK       :客戶簡明表                                *
     A****************************************************************
     A                                      REF(RERF)
     A          R PD1
     A            ME01      R
     A            ME02      R
     A            ME04      R
     A            MD07      R
     A            MD08      R
     A            ME05      R
     A            ME06      R
     A            ME12      R
     A            ME15      R
     A            MC02      R
