     A*%%TS  SD  19930728  092714  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : DWPC02D                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 07/28/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : DWPC02                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :產品存量－專櫃＆在途量                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19920225  112554  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF04(04 'F4 HELP')
     A                                      CF09(09 'F9 COPY')
     A            $EVR           1Y 0H
     A            $CPY           3Y 0H
     A            $PRTID         2Y 0H
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'DWPC02'
     A                                  1 24MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 24'產品可用量表－含專櫃＆在途量'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 27'ＡＳ／４００＝＝＞ＰＣ'
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A            DIA01S         1A  O  6 36
     A                                      DSPATR(ND)
     A            DIA01E         1A  O  6 49
     A                                      DSPATR(ND)
     A                                 12 22'產品代號:'
     A                                      DSPATR(HI)
     A            DIA03S    R        B 12 36REFFLD(MA01)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A N60                                  DSPATR(HI)
     A                                 12 47'-'
     A            DIA03E    R        B 12 49REFFLD(MA01)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A N61                                  DSPATR(HI)
     A            DIA02S    R        O 10 36REFFLD(IA02)
     A                                      DSPATR(ND)
     A            DIA02E    R        O 10 49REFFLD(IA02)
     A                                      DSPATR(ND)
     A                                  8 22'品牌　　:'
     A                                      DSPATR(HI)
     A            DBRAND    R        B  8 36REFFLD(MA10)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A N64                                  DSPATR(HI)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 22 26'F9 =COPY TO PC'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2140 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR10         50A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
