     A*%%TS  SD  19931207  174624  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : IMI027D                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 82/12/07                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMI027                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存　　　系統                            *
     A*    REMARK       :單位成本異動查詢 (      I)                *
     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.23  Y2K MODIFY                    */
     /*=============================================================*/
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*----------------------------------------------------------------
     A          R SFLSR                     SFL
     A  54                                  SFLNXTCHG
     A            RRN            4S 0H
     A            DOPT1          1A  B  9  3VALUES(' ' '5')
     A            IW01      R        O  9  5
     A            MA03      R        O  9 15
M001MA*           DIW02     R        O  9 39REFFLD(IW02)
M001MA            DIW02          6  0O  9 39
     A                                      EDTWRD('  /  /  ')
     A            IW03      R        O  9 54EDTWRD('  :  :  ')
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           4S 0H      SFLRCDNBR
     A                                  1  2'IMI027'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'單位成本異動查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'輸入作業選擇:'
     A                                  5  5'5=查詢'
     A                                  7  3'A產品代號中文簡稱          +
     A                                      　　調整日期     調整時間 '
     A            DBGN1     R        B  8  5REFFLD(IW01)
     A*----------------------------------------------------------------
     A          R DSPC1
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A  96        ERR1          60A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          60A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          60A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          60A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          60A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          60A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          60A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          60A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          60A  O 24  2MSGID(URE 0038 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         60A  O 24  2MSGID(URE 0039 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A          R DSPD2
     A*%%TS  SD  19931207  174624  D910074     REL-V2R2M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      CF14(14)
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'IMI027'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 31'單位成本異動查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  2'產品代號　　　:'
     A            IW01      R        O  5 20REFFLD(MA01)
     A            MA03      R        O  5 30
     A                                  7  2'調整日期　　　:'
M001MA*           DIW02     R           7 20REFFLD(IW02)
M001MA            DIW02          6  0   7 20
     A                                      EDTWRD('  /  /  ')
     A                                  9  2'調整時間　　　:'
     A            IW03      R           9 20EDTWRD('  :  :  ')
     A                                 12 28'F.O.B.'
     A                                 12 42'F.H.I.'
     A                                 12 57'DUTY'
     A                                 12 66'單位成本'
     A                                 13  2'調整前　　　　:'
     A            IW04           9Y 2O 13 24EDTCDE(1)
     A            IW05           9Y 2O 13 38EDTCDE(1)
     A            IW06           9Y 2O 13 51EDTCDE(1)
     A            DCOST1         9Y 2O 13 65EDTCDE(1)
     A                                 16  2'調整後　　　　:'
     A            IW07           9Y 2O 16 24EDTCDE(1)
     A            IW08           9Y 2O 16 38EDTCDE(1)
     A            IW09           9Y 2O 16 51EDTCDE(1)
     A            DCOST2         9Y 2O 16 65EDTCDE(1)
     A                                 22  3'執行'
     A                                 22 12'F3 =回主畫面'
     A                                 22 28'F12=回前畫面'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          60A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          60A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          60A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          60A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          60A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          60A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          60A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          60A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          60A  O 24  2MSGID(URE 0062 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         63A  O 24  2MSGID(URE 0061 REMF)
     A                                      DSPATR(HI)
     A  86        ERR11         60A  O 24  2MSGID(URE 0025 REMF)
     A                                      DSPATR(HI)
     A  85        ERR12         60A  O 24  2MSGID(UPT 0011 PTMF)
     A                                      DSPATR(HI)
     A  84        ERR13         60A  O 24  2MSGID(URE 0106 REMF)
     A                                      DSPATR(HI)
     A  83        ERR14         60A  O 24  2MSGID(URE 0132 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
