     A*%%TS  SD  19920609  112055  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : IMI022D                                    *
     A*    AUTHOR       : A1092  TAYLOR                              *
     A*    CREATE DATE  : 81/02/17                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMI022                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存子系統                                *
     A*    REMARK       :物流點存貨狀況                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*--------------------------------------------------------------*
     A          R SFLSR1                    SFL
     A*%%TS  SD  19920528  134133  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B 10  4VALUES(' ' '5' '6')
     A            IA01      R        O 10  9
     A            COMPNY        12A  O 10 12
     A            IA02      R        O 10 32
     A            DFLD          22A  O 10 42
     A*--------------------------------------------------------------*
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19920609  110531  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'IMI022'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'物流點存貨狀況'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  2'輸入作業選擇:'
     A                                  6  6'5=存貨明細查詢'
     A                                  8  4'A  公司／名稱            物流+
     A                                      點  物流點名稱           '
     A                                      DSPATR(UL)
     A            DBGN11    R        B  9  9REFFLD(IA01)
     A            DBGN12    R        B  9 32REFFLD(IA02)
     A*--------------------------------------------------------------*
     A          R DSPC1
     A*%%TS  SD  19920217  160736  REPGMRP     REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 11'F3 =回主畫面'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*--------------------------------------------------------------*
     A          R SFLSR2                    SFL
     A*%%TS  SD  19920528  134427  REPGMRP     REL-V2R1M0  5738-PW1
     A            RRN2           4S 0H
     A            IA03      R        O 10  3
     A            DMA03         18O  O 10 13
     A            MA13      R        O 10 32
     A            DIA06          5Y 0O 10 39EDTCDE(J)
     A            DIA07          5Y 0O 10 47EDTCDE(J)
     A            DIA08          5Y 0O 10 55EDTCDE(J)
     A            DIA09          5Y 0O 10 63EDTCDE(J)
     A            DIA10          5Y 0O 10 71EDTCDE(J)
     A*--------------------------------------------------------------*
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*%%TS  SD  19920609  112055  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN2          4S 0H      SFLRCDNBR
     A                                  1  2'IMI022'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 32'物流點存貨狀況'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6  2'公司代號:'
     A            IA01      R        O  6 14REFFLD(IA0/IA01 *LIBL/IMIAPF)
     A            COMPNY        12A  O    +1
     A            IA02      R        O  6 45REFFLD(IA0/IA02 *LIBL/IMIAPF)
     A                                  6 35'物流點:'
     A            DFLD          22A  O  6 51
     A                                  8  2'產品代號／名稱             單+
     A                                      位 庫存量　良品量　壞品量　保留+
     A                                      量　可用量'
     A                                      DSPATR(UL)
     A            DBGN2     R        B  9  3REFFLD(IA03)
     A*--------------------------------------------------------------*
     A          R DSPC2
     A*%%TS  SD  19920528  134427  REPGMRP     REL-V2R1M0  5738-PW1
     A                                 20  2'==================================-
     A                                      ===================================-
     A                                      ======='
     A                                 22  2'執行'
     A                                 22 11'F3 =回主畫面'
     A                                 22 27'F12=回前畫面'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
