     A*%%TS  SD  19960819  144512  D910454     REL-V3R1M0  5763-PW1
     A*  80/11/15  13:46:08    REPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : IMM001D                                    *
     A*    AUTHOR       : A1005   ROGER CHIEN                        *
     A*    CREATE DATE  : 80/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMM001C                                    *
     A*    SYSTEM       :人頭馬匯東庫存報表系統                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A*  80/11/15  13:50:09    REPGMR      REL-R03M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19960819  144512  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'IMM001'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'庫存管理報表主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  5  2'              '
     A                                      DSPATR(RI)
     A                                  6  2' '
     A                                      DSPATR(RI)
     A                                  6  4'報表列印'
     A                                  6 15' '
     A                                      DSPATR(RI)
     A                                  7  2'              '
     A                                      DSPATR(RI)
     A                                  5 17'41.客戶送貨明細表'
     A                                      DSPATR(UL)
     A                                  6 17'42.產品送貨明細表'
     A                                      DSPATR(UL)
     A                                  7 17'43.進銷存彙總表'
     A                                      DSPATR(UL)
     A                                  8 17'44.異動明細表'
     A                                      DSPATR(UL)
     A                                  9 17'45.存貨週轉率報表'
     A                                      DSPATR(UL)
     A                                 11 17'47.滯銷產品明細表'
     A                                      DSPATR(UL)
     A                                 12 17'48.存貨月報表'
     A                                      DSPATR(UL)
     A                                 22 30'請輸入選擇項目:'
     A            DOPID          2A  B 22 48DSPATR(UL)
     A                                      VALUES('  ' '41' '42' '43' '44' '45-
     A                                      ' '46' '47' '48' '49' '50' '51' '52-
M001MA                                      ' '53' '54' '55'      '57' '58' '59-
M001MA                                      ' '60'      '62' '63' '64' '66' '67-
                                            ')
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                 13 17'49.送貨數量差異報表'
     A                                      DSPATR(UL)
     A                                 14 17'50.物流點成本表'
     A                                      DSPATR(UL)
     A                                 15 17'51.物流點存貨明細表'
     A                                      DSPATR(UL)
     A                                 16 17'52.良壞轉換明細表'
     A                                      DSPATR(UL)
     A                                 17 17'53.倉庫預定送貨明細表'
     A                                      DSPATR(UL)
     A                                 18 17'54.產品保留量彙總表'
     A                                      DSPATR(UL)
     A                                 19 17'55.產品報廢明細表'
     A                                      DSPATR(UL)
M001MA                                 20 15'* 56.內路運輸保險表'
     A                                      DSPATR(UL)
     A                                  5 49'57.產品與庫存量比較差異表'
     A                                      DSPATR(UL)
M001MA*                                 6 49'58.調撥明細／彙總表'
M001MA                                  6 49'58.產品調撥明細／彙總表'
     A                                      DSPATR(UL)
M001MA*                                 7 49'59.車輛送貨明細表'
M001MA                                  7 49'59.車輛／車次送貨明細表'
     A                                      DSPATR(UL)
     A                                  8 49'60.產品送貨數量差異彙總表'
     A                                      DSPATR(UL)
M001MA                                  9 47'* 61.庫存與異動保留量差異表'
     A                                      DSPATR(UL)
     A                                 10 49'62.收貨未確認明細表　　　'
     A                                      DSPATR(UL)
     A                                 11 49'63.產品存量分佈明細表　　'
     A                                      DSPATR(UL)
     A                                 12 49'64.產品可用量表－含專櫃＆在途量'
     A                                      DSPATR(UL)
     A                                 14 49'66.年終庫存物流彙總表'
     A                                      DSPATR(UL)
     A                                 15 49'67. ROLLING FORECAST'
     A                                      DSPATR(UL)
