     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : IMR074P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 05/10/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR074                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :普銷淨出貨表                              *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    30MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    37'普銷淨出貨表'
     A                                      SPACEA(2)
     A                                     1'物流點　:'
     A            DIJ07     R             +1REFFLD(IJ07)
     A            #A031     R   22        +2REFFLD(#A03)
     A                                    53'日期:'
     A            $EGMDY         6  0O    60EDTCDE(Y)
     A                                    70'頁次:'
     A                                    77PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'領貨單號:'
     A            DIJ02S    R             12REFFLD(IJ02)
     A            DIJ022    R             +1REFFLD(IJ02)
     A            DIJ023    R             +1REFFLD(IJ02)
     A                                    53'時間:'
     A                                    60TIME
     A                                      SPACEA(1)
     A                                     1'繳貨單號:'
     A            DIJ02E    R             12REFFLD(IJ02)
     A                                    53' USER :'
     A            $USER         10   O    60
     A                                    72'<IMR074>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'產品代號／簡稱'
     A                                    30'領貨量'
     A                                    40'繳貨量'
     A                                    50'淨出貨量'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            IJ03      R              2REFFLD(IJ03)
     A            MA03      R             11
     A            IJ051     R             31REFFLD(IJ05)
     A                                      EDTCDE(J)
     A            IJ052     R             41REFFLD(IJ05)
     A                                      EDTCDE(J)
     A            TOT01     R             53REFFLD(IJ05)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<IMR074>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
