     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : IMR054P                                    *
     A*    AUTHOR       : A1118 PHILIP                               *
     A*    CREATE DATE  : 81/04/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR054                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :滯銷產品明細表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    46MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    52'滯銷產品明細表'
     A                                      SPACEA(1)
     A                                    90'日期:'
     A            $EGMDY         6  0O    98EDTCDE(Y)
     A                                   107'頁次:'
     A                                   115PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                    90'時間:'
     A                                    98TIME
     A                                      SPACEA(1)
     A                                     1'最後出貨日:'
     A            DSF25          6  0O    17EDTCDE(Y)
     A                                    26'(MM/DD/YY)'
     A                                    90' USER :'
     A            $USER         10   O    98
     A                                   109'<IMR054P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'品牌'
     A                                    +0'產品代號'
     A                                    +1'產品簡稱'
     A                                    36'單位'
     A                                    +0'最後進貨日期'
     A                                    +0'最後出貨日期'
     A                                    +0'物流點'
     A                                    98'存貨量'
     A                                    +2'存貨成本'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  30        MA10      R              3
     A  31        MA01      R             +3
     A  31        MA03      R             +1
     A  31        MA13      R             +0
     A  31        PIPE05         6  0O    +3EDTCDE(Y)
M001MA* 31        PSF25     R             59EDTCDE(Y)
M001MA  31        PSF25          6  0     59EDTCDE(Y)
M001DA*                                     REFFLD(SF25)
     A            IA01      R             71
     A            P#A03         22   O    +0
     A            IA06      R             +3EDTCDE(J)
     A  32        IA06C         11  2O    +1EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    18'小計'
     A                                    +0'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------->'
     A            TIA06          7  0O    96EDTCDE(J)
     A  31        TIA06C        11  2O    +1EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<IMR054>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE31                      SPACEA(1)
     A                                     3'もも此範圍無資料もも'
