     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : IMR076P                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 07/28/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR076                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :產品存量分佈明細表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    62MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    67'產品存量分佈明細表'
     A                                      SPACEA(2)
     A                                     1'公司　:'
     A            DIA01S         1   O    15
     A                                    +1'-'
     A            DIA01E         1   O    +1
     A                                   122'日期:'
     A            $EGMDY         6  0O   130EDTCDE(Y)
     A                                   139'頁次:'
     A                                   147PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DIA03S    R        O    15REFFLD(IA03)
     A                                    +1'-'
     A            DIA03E    R        O    +1REFFLD(IA03)
     A                                   122'時間:'
     A                                   130TIME
     A                                      SPACEA(1)
     A                                     1'物流點　:'
     A            DIA02S    R        O    13REFFLD(IA02)
     A                                    +1'-'
     A            DIA02E    R        O    +1REFFLD(IA02)
     A                                   122' USER :'
     A            $USER         10   O   130
     A                                   141'<IMR076P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     1'產品代號／簡稱'
     A                                    34'　東漢保稅倉　'
     A                                    51'　東漢完稅倉　'
     A                                    69'　南港倉庫　　'
     A                                    86'　田明倉庫　　'
     A                                   103'　台中倉庫　　'
     A                                   120'　高雄倉庫　　'
     A                                   137'　合　　計　　'
     A                                      SPACEA(1)
     A                                    34'庫存量　可用量'
     A                                    51'庫存量　可用量'
     A                                    68'庫存量　可用量'
     A                                    85'庫存量　可用量'
     A                                   102'庫存量　可用量'
     A                                   119'庫存量　可用量'
     A                                   136'庫存量　可用量'
     A                                      SPACEA(1)
     A                                    34'-------  -------'
     A                                    51'-------  -------'
     A                                    68'-------  -------'
     A                                    85'-------  -------'
     A                                   102'-------  -------'
     A                                   119'-------  -------'
     A                                   136'-------  -------'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF8201    R              2REFFLD(MA01)
     A            MA03      R             13
     A            WF8202    R             34REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8203    R             42REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8204    R             51REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8205    R             59REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8206    R             68REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8207    R             76REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8208    R             85REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8209    R             93REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8210    R            102REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8211    R            110REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8212    R            119REFFLD(MA29)
     A                                      EDTCDE(J)
     A            WF8213    R            127REFFLD(MA29)
     A                                      EDTCDE(J)
     A            QTY1      R            136REFFLD(MA29)
     A                                      EDTCDE(J)
     A            QTY2      R            145REFFLD(MA29)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            T1TOT1    R             34REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TOT2    R             42REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TOT3    R             51REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TOT4    R             59REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TOT5    R             68REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TOT6    R             76REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TOT7    R             85REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TOT8    R             93REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TOT9    R            102REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TO10    R            110REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TO11    R            119REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TO12    R            127REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TO13    R            136REFFLD(MA29)
     A                                      EDTCDE(J)
     A            T1TO14    R            145REFFLD(MA29)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'<<IMR076>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
