     A****************************************************************
     A*    DSPF NAME    : IMR065P                                    *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR065                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :產品與庫存量比較差異表                    *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    36MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    38'產品與庫存量比較差異表'
     A                                      SPACEA(1)
     A            #A03      R             +1
     A                                    64'日期:'
     A            $EGMDY         6  0O    71EDTCDE(Y)
     A                                    81'頁次:'
     A                                    88PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'公司別　:'
     A            DIA01S    R             +1REFFLD(IA01)
     A                                    +1'-'
     A            DIA01E    R             +1REFFLD(IA01)
     A                                    64'時間:'
     A                                    71TIME
     A                                    83'<IMR065>'
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DIA03S         9        +1
     A                                    +1'～'
     A            DIA03E         9        +1
     A                                    65'USER :'
     A            $USER         10   O    72
     A                                      SPACEA(1)
     A                                     1'=====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                    35'----庫存主檔----'
     A                                    61'----產品主檔----'
     A                                    83'----差異量----'
     A                                      SPACEA(1)
     A                                     1'產品代號／名稱'
     A                                    30'保稅庫存量'
     A                                    42'完稅庫存量'
     A                                    58'保稅庫存量'
     A                                    70'完稅庫存量'
     A                                    83'保稅'
     A                                    91'完稅'
     A                                      SPACEA(1)
     A                                     1'---------------------+
     A                                       ---------------------+
     A                                       ---------------------+
     A                                       ---------------------+
     A                                       -------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            IA03      R              2REFFLD(IA03)
     A            MA03      R             +1
     A            IA06A     R             34REFFLD(IA06)
     A                                      EDTCDE(J)
     A            IA06B     R             45REFFLD(IA06)
     A                                      EDTCDE(J)
     A            MA29      R             61REFFLD(MA29)
     A                                      EDTCDE(J)
     A            MA30      R             75REFFLD(MA30)
     A                                      EDTCDE(J)
     A            QTYA      R             83REFFLD(IA06)
     A                                      EDTCDE(J)
     A            QTYB      R             91REFFLD(IA06)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'=====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'=====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'<<IMR065>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
