     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : IMR060P                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/08/12                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR0601                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :基本資料子系統                            *
     A*    REMARK       :良壞轉換明細表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    47MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    53'良壞轉換明細表'
     A                                      SPACEA(1)
     A            WDSEL         10        55
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            DID01          1        +1
     A                                      SPACEA(1)
     A                                     1'物流點　:'
     A            DIC03     R             +1REFFLD(IC03)
     A            #A03      R             +5
     A                                    91'日期:'
     A            $EGMDY         6  0O    +1EDTCDE(Y)
     A                                    +1'頁次:'
     A                                    +1PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產　品　:'
     A            DID03S    R             +1REFFLD(ID03)
     A                                    +1'-'
     A            DID03E    R             +1REFFLD(ID03)
     A                                    91'時間:'
     A                                    +1TIME
     A                                      SPACEA(1)
     A                                     1'轉換日期:'
M001MA*           DIC05S    R             +1REFFLD(IC05)
M001MA            DIC05S         6  0     +1
     A                                      EDTCDE(Y)
     A                                    +1'-'
M001MA*           DIC05E    R             +1REFFLD(IC05)
M001MA            DIC05E         6  0     +1
     A                                      EDTCDE(Y)
     A                                    91' USER :'
     A            $USER         10   O    99
     A                                    +2'<IMR060P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    13'產品簡稱'
     A                                    29'單位'
     A                                    35'轉換日期'
     A                                    47'單據號碼'
     A                                    58'數量'
     A                                    69' ＦＯＢ'
     A                                    82' ＦＨＩ'
     A                                    93' ＤＵＴＹ'
     A                                   108'備　　註'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  30        ID03      R              2
     A  30        MA03      R             +1
     A                                    +0'瓶'
M001MA* 31        PIC05     R             +1EDTWRD('  /  /  ')
M001MA  31        PIC05          6  0     +1EDTWRD('  /  /  ')
     A*M001D                                REFFLD(IC05)
     A            ID02      R             +1
     A            ID04      R             +1EDTCDE(J)
     A            DMA31          9  2     65
     A                                      EDTCDE(J)
     A            DMA32          9  2     78
     A                                      EDTCDE(J)
     A            DMA33          9  2     91
     A                                      EDTCDE(J)
     A                                   106'______________'
     A*----------------------------------------------------------------
     A          R PD2                        SPACEA(1)
     A                                    13'日期小計'
     A                                    23'--------------------'
     A                                    43'----------->'
     A            ID04D     R             57REFFLD(ID04)
     A                                      EDTCDE(J)
     A            T1TOT1         9  2     65EDTCDE(J)
     A            T1TOT2         9  2     78EDTCDE(J)
     A            T1TOT3         9  2     91EDTCDE(J)
     A N99                                  SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD3                        SPACEA(1)
     A                                    13'產品小計'
     A                                    23'--------------------'
     A                                    43'----------->'
     A            ID04P     R             57REFFLD(ID04)
     A                                      EDTCDE(J)
     A            T2TOT1         9  2     65EDTCDE(J)
     A            T2TOT2         9  2     78EDTCDE(J)
     A            T2TOT3         9  2     91EDTCDE(J)
     A N99                                  SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1                        SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                    13'總　　計'
     A                                    23'--------------------'
     A                                    43'----------->'
     A            ID04T     R             57REFFLD(ID04)
     A                                      EDTCDE(J)
     A            T3TOT1         9  2     65EDTCDE(J)
     A            T3TOT2         9  2     78EDTCDE(J)
     A            T3TOT3         9  2     91EDTCDE(J)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<IMR060P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<IMR060P>>--->報表結束'
