     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : IMR055P                                    *
     A*    AUTHOR       : A1118 PHILIP                               *
     A*    CREATE DATE  : 81/04/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR055                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :存貨月報表                                *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    84MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    92'存貨月報表'
     A                                      SPACEA(2)
     A                                     1'公司代號:'
     A            IN01      R             +1REFFLD(IN01)
     A            P#A031    R             +1REFFLD(#A03)
     A                                   165'日期:'
     A            $EGMDY         6  0O   173EDTCDE(Y)
     A                                   182'頁次:'
     A                                   190PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'物流點　:'
     A            IN03      R             +1REFFLD(IN03)
     A            P#A03     R             +1REFFLD(#A03)
     A                                   165'時間:'
     A                                   173TIME
     A                                   184'<IMR055>'
     A                                      SPACEA(1)
     A                                     1'年　　月:'
     A            DIN02          4  0O    +1EDTWRD('  /  ')
     A                                    20'(MM/YY)'
     A                                   165' USER :'
     A            $USER         10A  O   173
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    13'期初'
     A                                    22'進貨'
     A                                    30'完稅'
     A                                    37'進貨'
     A                                    45'銷售'
     A                                    53'贈品'
     A                                    59'試飲'
     A                                    66'退貨'
     A                                    73'退搭'
     A                                    80'退試'
     A                                    87'專櫃'
     A                                    95'寄賣'
     A                                   102'收回'
     A                                   109'退回'
     A                                   116'調撥'
     A                                   123'調整'
     A                                   130'禮盒'
     A                                   139'報廢'
     A                                   148'經欠'
     A                                   157'經欠'
     A                                   166'經欠'
     A                                   174'經銷商'
     A                                   183'盤點'
     A                                   192'期末'
     A                                      SPACEA(1)
     A                                     1'產品簡稱'
     A                                    13'存貨'
     A                                    37'退回'
     A                                    95'寄放'
     A                                   130'組拆'
     A                                   148'訂購'
     A                                   157'搭贈'
     A                                   166'合計'
     A                                   174'補貨'
     A                                   192'存貨'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            IN04      R              2
     A            DIN05     R             +1EDTCDE(J)
     A                                      REFFLD(IN05)
     A            IN06      R             +0EDTCDE(J)
     A            IN19      R             +0EDTCDE(J)
     A            IN35      R             +0EDTCDE(J)
     A            IN07      R             +0EDTCDE(J)
     A            IN08      R             +0EDTCDE(J)
     A            IN09      R             +0EDTCDE(J)
     A            IN10      R             +0EDTCDE(J)
     A            IN101     R             +0EDTCDE(J)
     A            IN40      R             +0EDTCDE(J)
     A            IN11      R             +0EDTCDE(J)
     A            IN12      R             +0EDTCDE(J)
     A            IN18      R             +0EDTCDE(J)
     A            IN36      R             +0EDTCDE(J)
     A            IN13      R             +0EDTCDE(J)
     A            IN14      R             +0EDTCDE(J)
     A            IN16      R            129EDTCDE(J)
     A            IN15      R            138EDTCDE(J)
     A            IN37      R            147EDTCDE(J)
     A            IN38      R            156EDTCDE(J)
     A            IN39      R            165EDTCDE(J)
     A            IN20      R            174EDTCDE(J)
     A            IN41      R            182EDTCDE(J)
     A            DIN17     R            190EDTCDE(J)
     A                                      REFFLD(IN17)
     A                                      SPACEA(1)
     A            MA03      R              1
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     2'<<IMR055>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE31                      SPACEA(1)
     A                                     3'もも此範圍無資料もも'
