     A****************************************************************
     A*    DSPF NAME    : IMR072D                                    *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR072C1                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存作業                                  *
     A*    REMARK       :庫存與異動保留量差異表                    *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    36MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    39'庫存與異動保留量差異表'
     A                                      SPACEA(1)
     A                                     1'公司別　:'
     A            DIA01          1A       +1
     A                                    64'日期:'
     A            $EGMDY         6  0O    71EDTCDE(Y)
     A                                    81'頁次:'
     A                                    88PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'物流點　:'
     A            DIA02S    R        O    +1REFFLD(IA02)
     A                                    +1'～'
     A            DIA02E    R        O    +1REFFLD(IA02)
     A                                    64'時間:'
     A                                    71TIME
     A                                    83'<IMR072>'
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DIA03S         9A  O    +1
     A                                    +1'～'
     A            DIA03E         9A  O    +1
     A                                    65'USER :'
     A            $USER         10   O    72
     A                                      SPACEA(1)
     A                                     1'=====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     1'物流點'
     A                                    24'產品代號／名稱'
     A                                    54'庫存保留量'
     A                                    68'異動保留量'
     A                                    84'差異量'
     A                                      SPACEA(1)
     A                                     1'---------------------+
     A                                       ---------------------+
     A                                       ---------------------+
     A                                       ---------------------+
     A                                       -------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        IA02      R              2REFFLD(IA02)
     A N30        #A03      R             +1
     A            IA03      R             25REFFLD(IA03)
     A            MA03      R             35REFFLD(MA03)
     A            IA09      R             59REFFLD(IA09)
     A                                      EDTCDE(1)
     A            QTY       R             72REFFLD(IA09)
     A                                      EDTCDE(1)
     A            TOT1      R             84REFFLD(IA09)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'=====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'=====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'<<IMR072>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
