      ****************************************************************
      *   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
      *                                                              *
      * PROGRAM NAME : IMR067                                        *
      * AUTHER       : TINA WHANG                                    *
      * CREATE DATE  : 82/03/18                                      *
      * UPDATE DATE  :                                               *
      * SYSTEM       :人頭馬匯東                                   *
      * SUBSYSTEM    :庫存作業系統                                 *
      * REMARK       :車輛／車次送貨明細表                         *
      ****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    56MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    62'車輛／車次送貨明細表'
     A                                      SPACEA(1)
     A                                    63'（依送貨日期排序）'
     A                                      SPACEA(1)
     A                                   111'日期:'
     A            $EGMDY         6  0O   119EDTCDE(Y)
     A                                   127'頁次:'
     A                                   136PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                   111'時間:'
     A                                   119TIME
     A                                      SPACEA(1)
     A                                     1'物流點:'
     A            DSE07     R             13REFFLD(SE07)
     A            D#A03         32   O    19
     A                                   112'USER :'
     A            $USER         10   O   119
     A                                   133'<IMR067AP>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'送貨日期'
     A                                    13'車號'
     A                                    22'車次'
     A                                    28'送貨單號'
     A                                    38'送貨總數'
     A                                    50'客戶代號／名稱'
     A                                    80'送貨地址'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  21                                 1' '
     A                                      SPACEA(1)
M001MA*N30        WSE06     R              2REFFLD(SE06)
M001MA N30        WSE06          6  0      2
     A                                      EDTWRD('  /  /  ')
     A N30        SE22      R             13REFFLD(SE22)
     A N30        SE23      R             24REFFLD(SE23)
     A            SE02      R             28REFFLD(SE02)
     A            TOT       R             41REFFLD(SF04)
     A                                      EDTCDE(J)
     A            SE10      R             50REFFLD(SE10)
     A            SE11      R             55REFFLD(SE11)
     A            ME04      R             61REFFLD(ME04)
     A            ME05      R             79REFFLD(ME05)
     A            ME06      R             +0REFFLD(ME06)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    27'車次小計-->'
     A            TOT1      R             41REFFLD(SF04)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<IMR067AP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
