     A*%%TS  SD  19940420  100802  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A*%%TS  SD  19940420  100802  D910121     REL-V2R2M0  5738-PW1
     A                                  1  2'IMR078'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0   1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 28'單位成本移動平均變動表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A     3 70
     A                                  6 26'公司別　'
     A                                  6 36':'
     A            DIN01     R           6 38REFFLD(IN01)
     A                                  8 26'產品代號:'
     A            DIN04S    R           8 38REFFLD(IN04)
     A                                  8 48'-'
     A            DIN04E    R           8 50REFFLD(IN04)
     A                                 10 26'確認年月'
M001MA*           DIN02S    R          10 38REFFLD(IN02)
M001MA            DIN02S         4  0  10 38
     A                                      EDTWRD('  /  ')
     A                                 10 54'(MM/YY)'
     A                                 16 26'執行環境:'
     A            $EVR           1  0  16 38
     A                                      EDTCDE(3)
     A                                 16 41'(1-即時   2-批次)'
     A                                 17 26'列印份數:'
     A            $CPY           3  0  17 38EDTCDE(3)
     A                                 18 26'列表機'
     A                                 18 36':'
     A            $PRTID         2  0  18 38
     A                                      EDTCDE(3)
     A                                 20 26'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                 10 44'-'
M001MA*           DIN02E    R          10 46REFFLD(IN02)
M001MA            DIN02E         4  0  10 46
     A                                      EDTWRD('  /  ')
