     A*%%TS  SD  19951205  090609  DERLERN     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : ARA066D                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 82/03/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : ARA066                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統子系統                            *
     A*    REMARK       :調撥明細／彙總表                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19951205  090609  DERLERN     REL-V3R1M0  5763-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF04(04 'F4 HELP')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'IMR066'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'調撥明細／彙總表'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4 22'產品代號　:'
     A                                      DSPATR(HI)
     A            DIJ03S    R        B  4 36REFFLD(IJ03)
     A N60                                  DSPATR(HI)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  4 46'-'
     A            DIJ03E    R        B  4 48REFFLD(IJ03)
     A N61                                  DSPATR(HI)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  5 22'出貨物流點:'
     A            DIJ07S    R        B  5 36REFFLD(IJ07)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  5 46'-'
     A            DIJ07E    R        B  5 48REFFLD(IJ07)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                  6 22'收貨物流點:'
     A            DIJ08S    R        B  6 36REFFLD(IJ08)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                  6 46'-'
     A            DIJ08E    R        B  6 48REFFLD(IJ08)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                  8 22'調撥日期　:'
M001MA*           DII05S    R        B  8 36REFFLD(II05)
M001MA            DII05S         6  0B  8 36
     A                                      EDTWRD('  /  /  ')
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A                                  8 46'-'
M001MA*           DII05E    R        B  8 48REFFLD(II05)
M001MA            DII05E         6  0B  8 48
     A                                      EDTWRD('  /  /  ')
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A                                  8 58'(MM/DD/YY)'
     A                                  9 22'入庫日期　:'
     A            DII06S         6Y 0B  9 36EDTWRD('  /  /  ')
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A                                  9 46'-'
     A            DII06E         6Y 0B  9 48EDTWRD('  /  /  ')
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A                                  9 58'(MM/DD/YY)'
     A                                 11 22'排列方式　:'
     A            DSORT          1A  B 11 36VALUES('A' 'B')
     A                                 11 39'A.以出貨物流點'
     A                                 12 39'B.以收貨物流點'
     A                                 13 22'選　擇　　:'
     A            DSEL           1A  B 13 36VALUES('A' 'B')
     A                                 13 39'A.明細'
     A                                 14 39'B.彙總'
     A                                 15 22'只列印差異:'
     A            DYES           1A  B 15 36VALUES('Y' 'N')
     A                                 15 40'(Y/N)'
     A                                 15 48'明細報表'
     A                                 17 25'執行環境'
     A                                 17 36':'
     A            $EVR           1Y 0B 17 38VALUES(1 2)
     A                                      EDTCDE(3)
     A                                      CHECK(RB)
     A N31                                  DSPATR(UL)
     A  31                                  DSPATR(PR)
     A                                 17 42'(1-即時   2-批次)'
     A                                 18 25'列印份數'
     A                                 18 36':'
     A            $CPY           3Y 0B 18 38EDTCDE(3)
     A                                      CHECK(RB)
     A                                 19 25'列表機'
     A                                      DSPATR(HI)
     A                                 19 36':'
     A                                      DSPATR(HI)
     A            $PRTID         2Y 0B 19 38CHECK(RB)
     A                                      DSPATR(HI)
     A                                      EDTCDE(3)
     A                                 20 24'***請準備８０行報表紙***'
     A                                      DSPATR(HI)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2140 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          50A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR11         50A  O 24  2MSGID(UPT 0011 RTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
