     A                                      REF(RERF)
     A          R PH1                       SKIPB(10)
     A            DMARK1         1        14
     A            DMARK2         1        32
     A                                      SPACEA(2)
     A            II02      R             15
     A                                      SPACEA(2)
     A            II03      R             15
     A            D#A031    R             +1REFFLD(#A03)
     A                                      SPACEA(2)
     A            II04      R             15
     A            D#A032    R             +1REFFLD(#A03)
     A                                      SPACEA(2)
     A            MM1            2        16
     A            DD1            2        21
     A            YY1            2        26
     A                                      SPACEA(2)
     A            MM2            2        16
     A            DD2            2        21
     A            YY2            2        26
     A                                      SPACEA(3)
     A                                    70'包裝規格'
     A                                      SPACEA(2)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(2)
     A            IJ03      R              2
     A            MA03      R             13
     A            MA13      R             36
     A            IJ04      R             46EDTCDE(1)
     A            IJ05      R             58EDTCDE(2)
     A            MA17      R             71
     A*----------------------------------------------------------------
     A          R PD2
     A            IIZZ      R          59  5
     A            SU02          10     60  4
     A*----------------------------------------------------------------
