     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : IMR057P                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/07/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR057                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :物流點存貨明細表                          *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    31MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    36'物流點存貨明細表'
     A                                      SPACEA(1)
     A            GROUP         10   O    41
     A                                      SPACEA(1)
     A                                    62'日期:'
     A            $EGMDY         6  0O    70EDTCDE(Y)
     A                                    78'頁次:'
     A                                    86PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'公司別:'
     A            DIA01     R        O    11REFFLD(IA01)
     A            D#A03     R        O    17REFFLD(#A03)
     A                                    62'時間:'
     A                                    70TIME
     A                                      SPACEA(1)
     A                                     1'物流點:'
     A            IA02      R        O    11
     A            NAME          22   O    17
     A                                    62' USER :'
     A            $USER         10   O    70
     A                                    80'<IMR057>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     1'產品代號／名稱'
     A                                    31'單位'
     A                                    42'庫存量'
     A                                    52'良品量'
     A                                    62'壞品量'
     A                                    72'保留量'
     A                                    82'可用量'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            IA03      R              2
     A            MA03      R             12
     A            MA13      R             31
     A            IA06      R             42EDTCDE(J)
     A            IA07      R             52EDTCDE(J)
     A            IA08      R             62EDTCDE(J)
     A            IA09      R             72EDTCDE(J)
     A            IA10      R             82EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    12'合　計---------------->'
     A            IA06T          8  0     39EDTCDE(J)
     A            IA07T          8  0     49EDTCDE(J)
     A            IA08T          8  0     59EDTCDE(J)
     A            IA09T          8  0     69EDTCDE(J)
     A            IA10T          8  0     79EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     2'<<IMR057>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
