     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : IMR073P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 04/15/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR073                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :普銷送貨揀料彙總表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    42MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    47'普銷送貨揀料彙總表'
     A                                      SPACEA(1)
     A                                    86'日期:'
     A            $EGMDY         6  0O    93EDTCDE(Y)
     A                                   103'頁次:'
     A                                   110PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'物流點　:'
     A            WF6807    R             +1REFFLD(SE07)
     A            #A031     R   22        +2REFFLD(#A03)
     A                                    86'時間:'
     A                                    93TIME
     A                                      SPACEA(1)
     A  20                                 1'送貨日期:'
     A  20        DSE06     R             12REFFLD(SE06)
     A*                                     REFFLD(SE06)
     A N20                                 1'訂單日期:'
     A N20        DSE39     R             12REFFLD(SE39)
     A*                                     REFFLD(SE39)
     A                                    86' USER :'
     A            $USER         10   O    93
     A                                   105'<IMR073>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'產品識別'
     A                                    25'產品代號'
     A                                    35'產品簡稱'
     A                                    53'單位'
     A                                    61'數量'
     A                                    67'客戶訂單號碼'
     A                                    82'送貨單號'
     A                                    95'訂單單號'
     A                                   108'統一發票'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  32        WF6817         2         1
     A  32        #A032     R              4REFFLD(#A03)
     A  31        WF6816    R             26REFFLD(SF03)
     A  31        MA03      R             35
     A  31        MA13      R             53
     A            PTOT           5  0     60EDTCDE(J)
     A  30        WF6820    R             68REFFLD(SC06)
     A  30        WF6815    R             82REFFLD(SF02)
     A  30        WF6813    R             95REFFLD(SE29)
     A  30        WF6814    R            108REFFLD(SE30)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    31'產品小計---------------->'
     A            PRTOT          5  0     60EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A                                    31'識別小計---------------->'
     A            PRTOT1         5  0     60EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD4                       SPACEA(1)
     A                                     2'*****送貨單張數:'
     A            PSF02          4  0     +1EDTCDE(J)
     A                                    31'合　　計---------------->'
     A            PRRTOT         5  0     60EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<IMR073>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE4
     A                                     1'                    +
     A                                                           +
     A                                                           +
     A                                                          '
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
