     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : IMR053P                                    *
     A*    AUTHOR       : A1139 JANE                                 *
     A*    CREATE DATE  : 81/02/28                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR053                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :專櫃產品存貨彙總表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    33MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    37'專櫃產品存貨彙總表'
     A                                      SPACEA(2)
     A                                     1'公司別:'
     A            DIA01          1   O    +1
     A                                    64'日期:'
     A            $EGMDY         6  0O    72EDTCDE(Y)
     A                                    81'頁次:'
     A                                    89PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'物流點:'
     A            DIA02S         5   O    +1
     A                                    +1'-'
     A            DIA02E         5   O    +1
     A                                    64'時間:'
     A                                    72TIME
     A                                    83'<IMR053>'
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DIA03S         9   O    +1
     A                                    +1'-'
     A            DIA03E         9   O    +1
     A                                    64' USER :'
     A            $USER         10A  O    72
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     1'識別'
     A                                     7'種類'
     A                                    13'產品代號'
     A                                    23'產品簡稱'
     A                                    40'單位'
     A                                    46'物流點'
     A                                    71'存貨量'
     A                                    81'存貨成本'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  31        IA05      R              2
     A  30        IA04      R              9
     A  29        IA03      R             13
     A  29        MA03      R             22
     A  29        MA13      R             40
     A            ME04      R             46
     A            IA06      R             71EDTCDE(J)
     A            PCOST         11  2     79EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    19'產品小計-----------------------+
     A                                      ------------->'
     A            PRTOT1         7  0     69EDTCDE(J)
     A            PRTOT2        11  2     79EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'<<IMR053>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE31                      SPACEA(1)
     A                                     3'もも此範圍無資料もも'
