     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : IMR056P                                    *
     A*    AUTHOR       : A1139 JANE                                 *
     A*    CREATE DATE  : 81/04/25                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : IMR056                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :送貨數量差異報表                          *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    62MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    67'送貨數量差異報表'
     A                                      SPACEA(1)
     A                                     1'物流點:'
     A            DSE07          9A  O    12
     A                                   120'日期:'
     A            $EGMDY         6  0O   128EDTCDE(Y)
     A                                   137'頁次:'
     A                                   145PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSF03S         9A  O    12
     A                                    22'-'
     A            DSF03E         9A  O    24
     A                                   120'時間:'
     A                                   128TIME
     A                                      SPACEA(1)
     A                                     1'業務員　:'
     A            SE32      R             12
     A            MC02      R             18
     A                                   121'USER :'
     A            $USER         10   O   128
     A                                   139'<IMR056>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========='
     A                                      SPACEA(1)
     A                                   115'送貨數量'
     A                                   129'確認數量'
     A                                      SPACEA(1)
     A                                     1'客戶代號／簡稱'
     A                                    31'訂單號碼'
     A                                    44'送貨單號'
     A                                    57'送貨日期'
     A                                    67'確認日期'
     A                                    77'產品代號／簡稱'
     A                                   106'單位'
     A                                   114'銷售'
     A                                   120'搭贈'
     A                                   128'銷售'
     A                                   134'搭贈'
     A                                   140'差異數量'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  31        SE04      R              2
     A  31                                 7'-'
     A  31        SE05      R              8
     A  31        ME04      R             13
     A  30        SE29      R             32
     A  30        SE02      R             45
     A  30        DSE06          6  0     58EDTWRD('  /  /  ')
     A  30        DSE24          6  0     68EDTWRD('  /  /  ')
     A            SF03      R             78
     A            MA03      R             88
     A            MA13      R            106
     A            SF04      R            113EDTCDE(J)
     A            SF05      R            120EDTCDE(J)
     A            SF19      R            127EDTCDE(J)
     A            SF20      R            134EDTCDE(J)
     A            DQTY           5  0    143EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========='
     A                                      SPACEA(1)
     A                                     2'<<IMR056>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ========='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE31                      SPACEA(1)
     A                                     3'もも此範圍無資料もも'
     A*----------------------------------------------------------------
     A          R PE4
     A                                     1'                    +
     A                                                           +
     A                                                           +
     A                                                           +
     A                                                           +
     A                                                           +
     A                                                           +
     A                                                '
     A                                      SPACEA(1)
