     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    84MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    92'存貨明細帳'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            DIN01     R             +1REFFLD(IN01)
     A            #A03      R             +1
     A                                   165'日期:'
     A            $EGMDY         6  0O   173EDTCDE(Y)
     A                                   182'頁次:'
     A                                   190PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DIN04S    R             13REFFLD(IN04)
     A                                    21'-'
     A            DIN04E    R             23REFFLD(IN04)
     A                                   165'時間:'
     A                                   173TIME
     A                                   184'<IMR080B>'
     A                                      SPACEA(1)
     A                                     1'確認年月:'
     A            DIN02S         4  0     +1EDTWRD('  /  ')
     A*                                   +1'-'
     A*           DIN02E         4  0     +1EDTWRD('  /  ')
     A                                   165' USER :'
     A            $USER         10A      173
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                    37'--------------------'
     A                                    57'-----------異　動'
     A                                    76'--------------------'
     A                                    96'-------------------'
     A                                   116'--------------------'
     A                                   136'-----------餘　額'
     A                                   155'--------------------'
     A                                   175'----------------------'
     A                                      SPACEA(1)
     A                                    37'------------'
     A                                    49'數　量'
     A                                    57'------------'
     A                                    70'-----------------------'
     A                                    93'金　額'
     A                                   101'--------------'
     A                                   116'------------'
     A                                   128'數　量'
     A                                   136'------------'
     A                                   149'-----------------------'
     A                                   172'金　額'
     A                                   181'----------------'
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    10'確認日期'
     A                                    19'單別／說明'
     A                                    39'保稅'
     A                                    50'完稅'
     A                                    61'合計'
     A                                    76'FOB+FHI'
     A                                    95'DUTY'
     A                                   107'合計'
     A                                   119'保稅'
     A                                   130'完稅'
     A                                   141'合計'
     A                                   157'FOB+FHI'
     A                                   174'DUTY'
     A                                   187'合計'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WFB201         9         1
     A*           MA03          18        11
     A N20                                10'期初'
     A  20                                10'期末'
     A            DQTY2          8  0    116
     A                                      EDTCDE(M)
     A            QTY2           8  0    127
     A                                      EDTCDE(M)
     A            TQTY2          8  0    138
     A                                      EDTCDE(M)
     A            COST2     R            150REFFLD(MA26)
     A                                      EDTCDE(M)
     A            DCOST2    R            165REFFLD(MA26)
     A                                      EDTCDE(M)
     A            TCOST2    R            180REFFLD(MA26)
     A                                      EDTCDE(M)
     A  20                                  SPACEA(1)
     A  20                                 1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A N30        PB202          6  0     10EDTWRD('  /  /  ')
     A            WFB203         2        +2
     A            P#203         16        +0
     A            DQTY1          8  0     38
     A                                      EDTCDE(M)
     A            QTY1           8  0     50
     A                                      EDTCDE(M)
     A            TQTY1          8  0     60
     A                                      EDTCDE(M)
     A            COST1     R             70REFFLD(MA26)
     A                                      EDTCDE(M)
     A            DCOST1    R             85REFFLD(MA26)
     A                                      EDTCDE(M)
     A            TCOST1    R            100REFFLD(MA26)
     A                                      EDTCDE(M)
     A            DQTY2          8  0    116
     A                                      EDTCDE(M)
     A            QTY2           8  0    127
     A                                      EDTCDE(M)
     A            TQTY2          8  0    138
     A                                      EDTCDE(M)
     A            COST2     R            150REFFLD(MA26)
     A                                      EDTCDE(M)
     A            DCOST2    R            165REFFLD(MA26)
     A                                      EDTCDE(M)
     A            TCOST2    R            180REFFLD(MA26)
     A                                      EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'<<IMR080B>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
