     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : JLB022
     A*    PROGRAM NAME : 傳票寄賣成本彙總表
     A*    AUTHOR       : D910121 CHARLES
     A*    CREATE DATE  : 1993.04.07
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    66MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    70'傳票寄賣退回成本彙總表'
     A                                      SPACEA(2)
     A                                     1'公司　:'
     A            JL1402    R             +1REFFLD(JL1402 *LIBL/WFJL14PF)
     A            #A03      R             +1REFFLD(#A03 *LIBL/RERF)
     A                                   104'日期:'
     A            $EGMDY         6  0    112EDTCDE(Y)
     A                                   121'頁次:'
     A                                   129PAGNBR
     A                                      SPACEA(1)
     A                                     1'辦事處:'
     A            J1402$    R             +1REFFLD(J1402$ *LIBL/WFJL14PF)
     A            DESC           6O       +1
     A                                   104'時間:'
     A                                   112TIME
     A                                      EDTWRD('  :  :  ')
     A                                   122'<JLB0223P>'
     A                                      SPACEA(1)
     A                                     1'確認年月:'
     A            D05            4  0     13
     A                                      EDTWRD('  /  ')
     A                                   104' USER :'
     A            $USER         10A      112
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     1'客戶代號／名稱'
     A                                    26'產品代號／名稱'
     A                                    62'數量'
     A                                    81'ＦＯＢ'
     A                                    99'ＦＨＩ'
     A                                   115'ＤＵＴＹ'
     A                                   135'總成本'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ========================='
     A                                      SPACEA(1)
     A*
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
     A N30        JL1403    R              2REFFLD(JL1403 *LIBL/WFJL14PF)
     A N30        ME04      R              7REFFLD(ME04 *LIBL/MTMEPF)
     A            JL1404    R             27REFFLD(JL1404 *LIBL/WFJL14PF)
     A            MA03      R             36REFFLD(MA03 *LIBL/MTMAPF)
     A            JL1405    R             60REFFLD(JL1405 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            JL1406    R             74REFFLD(JL1406 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            JL1407    R             92REFFLD(JL1407 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            JL1408    R            110REFFLD(JL1408 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            TOT       R            128REFFLD(JL1408 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       -------------------------'
     A                                      SPACEA(1)
     A            T11405    R             60REFFLD(JL1405 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            T11406    R             74REFFLD(JL1406 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            T11407    R             92REFFLD(JL1407 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            T11408    R            110REFFLD(JL1408 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            T1TOT     R            128REFFLD(JL1408 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A                                     2'客戶小計------------->'
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A            T21405    R             60REFFLD(JL1405 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            T21406    R             74REFFLD(JL1406 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            T21407    R             92REFFLD(JL1407 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            T21408    R            110REFFLD(JL1408 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A            T2TOT     R            128REFFLD(JL1408 *LIBL/WFJL14PF)
     A                                      EDTCDE(J)
     A                                     2'合計　　------------->'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'<<JLB0223>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
