     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : JLB051
     A*    PROGRAM NAME : 傳票異動成本表
     A*    AUTHOR       : D910121 CHARLES
     A*    CREATE DATE  : 1993.05.22
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    76MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    80'傳票庫存異動成本表'
     A                                      SPACEA(2)
     A                                   151'日期:'
     A            $EGMDY         6  0    159EDTCDE(Y)
     A                                   168'頁次:'
     A                                   176PAGNBR
     A                                      SPACEA(1)
     A                                     1'公司　:'
     A            JL2002    R             +1REFFLD(JL2002 *LIBL/WFJL20PF)
     A            #A031     R             +1REFFLD(#A03 *LIBL/RERF)
     A                                   151'時間:'
     A                                   159TIME
     A                                      EDTWRD('  :  :  ')
     A                                   169'<JLB0513P>'
     A                                      SPACEA(1)
     A                                     1'確認年月:'
     A            D05            4  0     13
     A                                      EDTWRD('  /  ')
     A                                   151' USER :'
     A            $USER         10A      159
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================='
     A                                      SPACEA(1)
    A                                    11'傳票'
    A                                    17'原'
     A                                    73'－－－－－－－－－－入　　　庫+
     A                                       －－－－－－－－－－'
     A                                   131'－－－－－－－－－－出　　　庫+
     A                                       －－－－－－－－－－'
     A                                      SPACEA(1)
    A                                     1'確認日期'
    A                                    12'別'
    A                                    17'因'
    A                                    21'物流點／名稱'
     A                                    46'產品代號／名稱'
     A                                    73'數量'
     A                                    87'ＦＯＢ'
     A                                   103'ＦＨＩ'
     A                                   117'ＤＵＴＹ'
     A                                   131'數量'
     A                                   144'ＦＯＢ'
     A                                   159'ＦＨＩ'
     A                                   172'ＤＵＴＹ'
     A                                   190'總成本'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
M001MA N33        PL2001         6  0      2
     A                                      EDTWRD('  /  /  ')
     A N32        JL2013    R             13REFFLD(JL2013 *LIBL/WFJL20PF)
     A N31        JL2014    R             18REFFLD(JL2014 *LIBL/WFJL20PF)
     A N30        JL2003    R             22REFFLD(JL2003 *LIBL/WFJL20PF)
     A N30        #A032         20O       27
     A            JL2004    R             47REFFLD(JL2004 *LIBL/WFJL20PF)
     A            MA03      R             56REFFLD(MA03 *LIBL/MTMAPF)
     A            JL2005    R             74REFFLD(JL2005 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            JL2006    R             82REFFLD(JL2006 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            JL2007    R             97REFFLD(JL2007 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            JL2008    R            112REFFLD(JL2008 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            JL2009    R            129REFFLD(JL2009 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            JL2010    R            137REFFLD(JL2010 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            JL2011    R            152REFFLD(JL2011 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            JL2012    R            167REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            TOT       R            183REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       -----------------'
     A                                      SPACEA(1)
     A                                     2'物流點小計----------->'
     A            T12005    R             74REFFLD(JL2005 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T12006    R             82REFFLD(JL2006 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T12007    R             97REFFLD(JL2007 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T12008    R            112REFFLD(JL2008 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T12009    R            129REFFLD(JL2009 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T12010    R            137REFFLD(JL2010 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T12011    R            152REFFLD(JL2011 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T12012    R            167REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T1TOT     R            183REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                     2'原　因小計----------->'
     A            T22005    R             74REFFLD(JL2005 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T22006    R             82REFFLD(JL2006 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T22007    R             97REFFLD(JL2007 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T22008    R            112REFFLD(JL2008 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T22009    R            129REFFLD(JL2009 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T22010    R            137REFFLD(JL2010 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T22011    R            152REFFLD(JL2011 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T22012    R            167REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T2TOT     R            183REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     2'傳票別小計----------->'
     A            T32005    R             74REFFLD(JL2005 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T32006    R             82REFFLD(JL2006 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T32007    R             97REFFLD(JL2007 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T32008    R            112REFFLD(JL2008 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T32009    R            129REFFLD(JL2009 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T32010    R            137REFFLD(JL2010 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T32011    R            152REFFLD(JL2011 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T32012    R            167REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T3TOT     R            183REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT4                       SPACEA(1)
     A                                     2'日　期小計----------->'
     A            T42005    R             74REFFLD(JL2005 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T42006    R             82REFFLD(JL2006 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T42007    R             97REFFLD(JL2007 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T42008    R            112REFFLD(JL2008 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T42009    R            129REFFLD(JL2009 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T42010    R            137REFFLD(JL2010 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T42011    R            152REFFLD(JL2011 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T42012    R            167REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A            T4TOT     R            183REFFLD(JL2012 *LIBL/WFJL20PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     2'<<JLB0513>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
