     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266
     A*
     A*    PROGRAM ID   : JLB041P
     A*    PROGRAM NAME :國外到貨傳票批次
     A*    AUTHOR       : AN MING HSIA
     A*    CREATE DATE  : 05/28/93
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    25MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    31'傳票到貨成本表'
     A                                      SPACEA(2)
     A                                    54'日期:'
     A            $EGMDY         6  0     62EDTCDE(Y)
     A                                    71'頁次:'
     A                                    79PAGNBR
     A                                      SPACEA(1)
     A                                     1'公司　:'
     A            JL1702    R             +1REFFLD(JL1702 *LIBL/WFJL17PF)
     A                                    54'時間:'
     A                                    62TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
     A                                     1'確認日期:'
M001MA            D05            6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'～'
M001MA            D06            6  0     27
     A                                      EDTWRD('  /  /  ')
     A                                    55'USER :'
     A            $USER         10   O    62
     A                                    72'<JLB041P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     1'進貨日期'
     A                                    12'驗收單號'
     A                                    25'供應商代號／名稱'
     A                                    55'到貨成本'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ========================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
M001MA N30        D1701          6  0      2
     A                                      EDTWRD('  /  /  ')
     A            JL1703    R             12REFFLD(JL1703 *LIBL/WFJL17PF)
     A            JL1704    R             25REFFLD(JL1704 *LIBL/WFJL17PF)
     A            MB03      R             31REFFLD(MB03 *LIBL/MTMBPF)
     A                                    49'台幣ＦＯＢ：'
     A            JL1705    R             63REFFLD(JL1705 *LIBL/WFJL17PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    49'台幣ＦＲＴ：'
     A            JL1706    R             63REFFLD(JL1706 *LIBL/WFJL17PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A                                    49'空運運費　：'
     A            JL1707    R             66REFFLD(JL1707 *LIBL/WFJL17PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD4                       SPACEA(1)
     A                                    49'調撥運費　：'
     A            JL1708    R             66REFFLD(JL1708 *LIBL/WFJL17PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD5                       SPACEA(1)
     A                                    49'保稅保險費：'
     A            JL1709    R             66REFFLD(JL1709 *LIBL/WFJL17PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD6                       SPACEA(1)
     A                                    49'保稅報關費：'
     A            JL1710    R             66REFFLD(JL1710 *LIBL/WFJL17PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD7                       SPACEA(1)
     A                                    49'完稅報關費：'
     A            JL1711    R             66REFFLD(JL1711 *LIBL/WFJL17PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD8                       SPACEA(1)
     A                                    45'單號　小計---->'
     A            TOT0           8  0     63EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    45'日期　小計---->'
     A            TOT1           8  0     63EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    45'公司　合計---->'
     A            TOT2           8  0     63EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'<<JLB041>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
