     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : JLB021
     A*    PROGRAM NAME : 傳票銷退金額彙總表
     A*    AUTHOR       : D910121 CHARLES
     A*    CREATE DATE  : 1993.06.14
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*  M004     | 00.04.28 |菸酒稅法實施
     A*---------------------------------------------------------------
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    29MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    33'傳票銷退金額彙總表'
     A                                      SPACEA(1)
     A                                    68'日期:'
     A            $EGMDY         6  0     76EDTCDE(Y)
     A                                    85'頁次:'
     A                                    93PAGNBR
     A                                      SPACEA(1)
     A                                     1'公司:'
     A            JL2102    R              9REFFLD(JL2102 *LIBL/WFJL21PF)
     A            #B03      R             12REFFLD(#B03 *LIBL/RERF)
     A                                    68'時間:'
     A                                    76TIME
     A                                      EDTWRD('  :  :  ')
     A                                    86'<JLB0213P>'
     A                                      SPACEA(1)
     A                                     1'確認日期:'
M001MA            D05            6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'～'
M001MA            D06            6  0     27
     A                                      EDTWRD('  /  /  ')
     A                                    68' USER :'
     A            $USER         10A       76
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =========='
     A                                      SPACEA(1)
     A                                     2'確認日期'
     A                                    13'科目'
     A                                    23'銷退單號'
     A                                    38'客戶代號／名稱'
     A                                    75'銷退金額'
M004AA                                    90'銷退稅額'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =========='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
M001MA N30        PL2101         6  0      2
     A                                      EDTWRD('  /  /  ')
     A N31        JL2103    R             15REFFLD(JL2103 *LIBL/WFJL21PF)
     A            JL2104    R             24REFFLD(JL2104 *LIBL/WFJL21PF)
     A            JL2105    R             41REFFLD(JL2105 *LIBL/WFJL21PF)
     A            ME04      R             46REFFLD(ME04 *LIBL/MTMEPF)
     A            JL2106    R             70REFFLD(JL2106 *LIBL/WFJL21PF)
     A                                      EDTCDE(J)
M004AA            JL2107    R             90REFFLD(JL2107 *LIBL/WFJL21PF)
M004AA                                      EDTCDE(J)
     A*
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ----------'
     A                                      SPACEA(1)
     A                                     2'科目小計------------->'
     A            T12106    R             70REFFLD(JL2106 *LIBL/WFJL21PF)
     A                                      EDTCDE(J)
M004AA            T12107    R             90REFFLD(JL2107 *LIBL/WFJL21PF)
M004AA                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                     2'日期小計------------->'
     A            T22106    R             70REFFLD(JL2106 *LIBL/WFJL21PF)
     A                                      EDTCDE(J)
M004AA            T22107    R             90REFFLD(JL2107 *LIBL/WFJL21PF)
M004AA                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     2'公司小計------------->'
     A            T32106    R             70REFFLD(JL2106 *LIBL/WFJL21PF)
     A                                      EDTCDE(J)
M004AA            T32107    R             90REFFLD(JL2107 *LIBL/WFJL21PF)
M004AA                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =========='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =========='
     A                                      SPACEA(1)
     A                                     2'<<JLB0213>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
