     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266
     A*
     A*    PROGRAM ID   : JLB042P
     A*    PROGRAM NAME :完稅傳票批次
     A*    AUTHOR       : AN MING HSIA
     A*    CREATE DATE  : 06/05/93
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    30MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    36'傳票完稅成本表'
     A                                      SPACEA(2)
     A                                    44'日期:'
     A            $EGMDY         6  0     52EDTCDE(Y)
     A                                    63'頁次:'
     A                                    71PAGNBR
     A                                      SPACEA(1)
     A                                     1'公司　:'
     A            JL1802    R             +1REFFLD(JL1802 *LIBL/WFJL18PF)
     A                                    44'時間:'
     A                                    52TIME
     A                                      EDTWRD('  :  :  ')
     A                                      SPACEA(1)
     A                                     1'確認日期:'
M001MA            D05            6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'～'
M001MA            D06            6  0     27
     A                                      EDTWRD('  /  /  ')
     A                                    45'USER :'
     A            $USER         10   O    52
     A                                    64'<JLB042P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     1'確認日期'
     A                                    12'驗收單號'
     A                                    25'產品代號／名稱'
     A                                    54'完稅量'
     A                                    64'公賣利益'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
M001MA N30        D1801          6  0      2
     A                                      EDTWRD('  /  /  ')
     A            JL1803    R             12REFFLD(JL1803 *LIBL/WFJL18PF)
     A            JL1804    R             25REFFLD(JL1804 *LIBL/WFJL18PF)
     A            MA03      R             35REFFLD(MA03 *LIBL/MTMAPF)
     A            JL1805    R             54REFFLD(JL1805 *LIBL/WFJL18PF)
     A                                      EDTCDE(J)
     A            JL1806    R             64REFFLD(JL1806 *LIBL/WFJL18PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT0                       SPACEA(1)
     A                                    25'單號小計------------->'
     A            T01805    R             54REFFLD(JL1805 *LIBL/WFJL18PF)
     A                                      EDTCDE(J)
     A            T01806    R             64REFFLD(JL1806 *LIBL/WFJL18PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    25'日期小計------------->'
     A            T11805    R             54REFFLD(JL1805 *LIBL/WFJL18PF)
     A                                      EDTCDE(J)
     A            T11806    R             64REFFLD(JL1806 *LIBL/WFJL18PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    25'合計　　------------->'
     A            T21805    R             54REFFLD(JL1805 *LIBL/WFJL18PF)
     A                                      EDTCDE(J)
     A            T21806    R             64REFFLD(JL1806 *LIBL/WFJL18PF)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'<<JLB042>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
