     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : JLB021
     A*    PROGRAM NAME : 傳票銷退成本彙總表
     A*    AUTHOR       : D910121 CHARLES
     A*    CREATE DATE  : 1993.06.14
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    71MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    76'傳票銷退成本彙總表'
     A                                      SPACEA(1)
     A                                   169'日期:'
     A            $EGMDY         6  0    177EDTCDE(Y)
     A                                   186'頁次:'
     A                                   194PAGNBR
     A                                      SPACEA(1)
     A                                     1'公司別　:'
     A            JL1602    R             +1REFFLD(JL1602 *LIBL/WFJL16PF)
     A            #B03      R             +1REFFLD(#B03 *LIBL/RERF)
     A                                   169'時間:'
     A                                   177TIME
     A                                      EDTWRD('  :  :  ')
     A                                   187'<JLB0214P>'
     A                                      SPACEA(1)
     A                                     1'確認日期:'
M001MA            D05            6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'～'
M001MA            D06            6  0     27
     A                                      EDTWRD('  /  /  ')
     A                                   169' USER :'
     A            $USER         10A      177
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                    11'科'
     A                                    15'單'
     A                                    69'－－－－－－－－－－－－訂　　購+
     A                                       －－－－－－－－－－－－'
     A                                   128'－－－－－－－－－－－－搭　　贈+
     A                                       －－－－－－－－－－－－'
     A                                      SPACEA(1)
     A                                     1'確認日期'
     A                                    11'目'
     A                                    15'別'
     A                                    19'客戶代號／名稱'
     A                                    40'產品代號／名稱'
     A                                    70'數量'
     A                                    81'ＦＯＢ'
     A                                    94'ＦＨＩ'
     A                                   105'ＤＵＴＹ'
     A                                   122'小計'
     A                                   129'數量'
     A                                   140'ＦＯＢ'
     A                                   153'ＦＨＩ'
     A                                   164'ＤＵＴＹ'
     A                                   181'小計'
     A                                   193'總計'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
M001MA N32        PL1601         6  0      2
     A                                      EDTWRD('  /  /  ')
     A N31        J1603$    R             12REFFLD(J1603$ *LIBL/WFJL16PF)
     A            JL1603    R             15REFFLD(JL1603 *LIBL/WFJL16PF)
     A            JL1605    R             18REFFLD(JL1605 *LIBL/WFJL16PF)
     A            ME04      R             23REFFLD(ME04 *LIBL/MTMEPF)
     A            JL1604    R             41REFFLD(JL1604 *LIBL/WFJL16PF)
     A            MA03      R             50REFFLD(MA03 *LIBL/MTMAPF)
     A            JL1606    R             69REFFLD(JL1606 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            JL1608    R             76REFFLD(JL1608 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            JL1609    R             89REFFLD(JL1609 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            JL1610    R            102REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*
     A            TOT1      R            115REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            JL1607    R            128REFFLD(JL1607 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            JL1611    R            135REFFLD(JL1611 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            JL1612    R            148REFFLD(JL1612 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            JL1613    R            161REFFLD(JL1613 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*
     A            TOT2      R            174REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            TOT       R            187REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A                                     2'科目小計------------->'
     A            T11606    R             69REFFLD(JL1606 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T11608    R             76REFFLD(JL1608 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T11609    R             89REFFLD(JL1609 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T11610    R            102REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*
     A            T1TOT1    R            115REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T11607    R            128REFFLD(JL1607 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T11611    R            135REFFLD(JL1611 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T11612    R            148REFFLD(JL1612 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T11613    R            161REFFLD(JL1613 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*
     A            T1TOT2    R            174REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T1TOT     R            187REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                     2'日期小計------------->'
     A            T21606    R             69REFFLD(JL1606 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T21608    R             76REFFLD(JL1608 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T21609    R             89REFFLD(JL1609 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T21610    R            102REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*
     A            T2TOT1    R            115REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T21607    R            128REFFLD(JL1607 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T21611    R            135REFFLD(JL1611 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T21612    R            148REFFLD(JL1612 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T21613    R            161REFFLD(JL1613 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*
     A            T2TOT2    R            174REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T2TOT     R            187REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     2'公司小計------------->'
     A            T31606    R             69REFFLD(JL1606 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T31608    R             76REFFLD(JL1608 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T31609    R             89REFFLD(JL1609 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T31610    R            102REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*
     A            T3TOT1    R            115REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T31607    R            128REFFLD(JL1607 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T31611    R            135REFFLD(JL1611 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T31612    R            148REFFLD(JL1612 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T31613    R            161REFFLD(JL1613 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*
     A            T3TOT2    R            174REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A            T3TOT     R            187REFFLD(JL1610 *LIBL/WFJL16PF)
     A                                      EDTCDE(3)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'<<JLB0214>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
