     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : JLB015
     A*    PROGRAM NAME : 人工作廢發票傳票批次
     A*    AUTHOR       : TINA
     A*    CREATE DATE  : 1993.09.07
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A*===============================================================
     A* MODI CODE |  AUTHOR  |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A* M004      | MICHELLE |00.05.08|菸酒稅實施
     A*---------------------------------------------------------------
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    58MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    60'傳票人工作廢發票明細表'
     A                                      SPACEA(2)
     A                                   169'日期:'
     A            $EGMDY         6  0    176EDTCDE(Y)
     A                                   185'頁次:'
     A                                   193PAGNBR
     A                                      SPACEA(1)
     A                                     1'公司別　:'
     A            JL2202         2A       13
     A                                   169'時間:'
     A                                   176TIME
     A                                      EDTWRD('  :  :  ')
     A                                   185'<JLB0153P>'
     A                                      SPACEA(1)
     A                                     1'確認年月:'
     A            D05            4  0     13EDTWRD('  /  ')
     A                                   169' USER :'
     A            $USER         10A      176
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                    23'原'
     A                                    33'人工'
     A                                    74'原'
     A                                    88'人工'
     A                                   103'差異'
     A                                   116'原'
     A                                   130'人工'
     A                                   145'差異'
M004AA                                   160'原'
M004AA                                   174'人工'
M004AA                                   188'差異'
     A                                      SPACEA(1)
     A                                     1'確認日期'
     A                                    11'訂單號碼'
     A                                    23'發票號碼'
     A                                    33'發票號碼'
     A                                    45'客戶代號／名稱'
     A                                    74'發票金額'
     A                                    88'發票金額'
     A                                   103'發票金額'
     A                                   116'折扣金額'
     A                                   130'折扣金額'
     A                                   145'折扣金額'
M004AA                                   160'發票稅額'
M004AA                                   174'發票稅額'
M004AA                                   188'發票稅額'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =================='
     A                                      SPACEA(1)
     A*
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
M001MA N30        W2201          6  0      2
     A                                      EDTCDE(Y)
     A            JL2204    R             11REFFLD(JL2204 *LIBL/WFJL22PF)
     A            JL2205    R             24REFFLD(JL2205 *LIBL/WFJL22PF)
     A            JL2206    R             35REFFLD(JL2206 *LIBL/WFJL22PF)
     A            JL2207    R             47REFFLD(JL2207 *LIBL/WFJL22PF)
     A            ME04      R             53REFFLD(ME04   *LIBL/MTMEPF)
     A            JL2208    R             72REFFLD(JL2208 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            JL2209    R             84REFFLD(JL2209 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            JL2210    R             99REFFLD(JL2210 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            JL2211    R            114REFFLD(JL2211 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            JL2212    R            126REFFLD(JL2212 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            JL2213    R            141REFFLD(JL2213 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
M004AA            JL2214    R            160REFFLD(JL2214 *LIBL/WFJL22PF)
M004AA                                      EDTCDE(J)
M004AA            JL2215    R            174REFFLD(JL2215 *LIBL/WFJL22PF)
M004AA                                      EDTCDE(J)
M004AA            JL2216    R            188REFFLD(JL2216 *LIBL/WFJL22PF)
M004AA                                      EDTCDE(J)
     A*
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    45' 公司小計--------->'
     A            T12208    R             72REFFLD(JL2208 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T12209    R             84REFFLD(JL2209 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T12210    R             99REFFLD(JL2210 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T12211    R            114REFFLD(JL2211 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T12212    R            126REFFLD(JL2212 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T12213    R            141REFFLD(JL2213 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
M004AA            T12214    R            160REFFLD(JL2214 *LIBL/WFJL22PF)
M004AA                                      EDTCDE(J)
M004AA            T12215    R            174REFFLD(JL2215 *LIBL/WFJL22PF)
M004AA                                      EDTCDE(J)
M004AA            T12216    R            188REFFLD(JL2216 *LIBL/WFJL22PF)
M004AA                                      EDTCDE(J)
     A*
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    45' 合計------------->'
     A            T22208    R             72REFFLD(JL2208 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T22209    R             84REFFLD(JL2209 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T22210    R             99REFFLD(JL2210 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T22211    R            114REFFLD(JL2211 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T22212    R            126REFFLD(JL2212 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
     A            T22213    R            141REFFLD(JL2213 *LIBL/WFJL22PF)
     A                                      EDTCDE(J)
M004AA            T22214    R            160REFFLD(JL2214 *LIBL/WFJL22PF)
M004AA                                      EDTCDE(J)
M004AA            T22215    R            174REFFLD(JL2215 *LIBL/WFJL22PF)
M004AA                                      EDTCDE(J)
M004AA            T22216    R            188REFFLD(JL2216 *LIBL/WFJL22PF)
M004AA                                      EDTCDE(J)
     A*
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'<<JLB015P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
