     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : JLB014
     A*    PROGRAM NAME : 傳票補貨成本彙總表
     A*    AUTHOR       : D910121 CHARLES
     A*    CREATE DATE  : 1993.04.07
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    71MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    76'傳票補貨成本彙總表'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            D01            1A       13
     A                                    22'～'
     A            D02            1A       27
     A                                   159'日期:'
     A            $EGMDY         6  0    167EDTCDE(Y)
     A                                   176'頁次:'
     A                                   184PAGNBR
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            D03            1A       13
     A                                    22'～'
     A            D04            1A       27
     A                                   159'時間:'
     A                                   167TIME
     A                                      EDTWRD('  :  :  ')
     A                                   177'<JLB0143P>'
     A                                      SPACEA(1)
     A                                     1'確認日期:'
M001MA            D05            6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'～'
M001MA            D06            6  0     27
     A                                      EDTWRD('  /  /  ')
     A                                   159' USER :'
     A            $USER         10A      167
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                    70'---------------------訂購成本+
     A                                       ---------------------'
     A                                   129'---------------------搭贈成本+
     A                                       ---------------------'
     A                                      SPACEA(1)
     A                                     1'確認日期'
     A                                    11'公司'
     A                                    17'單別'
     A                                    23'產品代號／名稱'
     A                                    53'訂購'
     A                                    61'搭贈'
     A                                    74'ＦＯＢ'
     A                                    88'ＦＨＩ'
     A                                   100'ＤＵＴＹ'
     A                                   118'合計'
     A                                   133'ＦＯＢ'
     A                                   147'ＦＨＩ'
     A                                   159'ＤＵＴＹ'
     A                                   177'合計'
     A                                   193'總計'
     A                                      SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       -----------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
M001MA N30        PL1501         6  0      1
     A                                      EDTWRD('  /  /  ')
     A N31        JL1502    R             13REFFLD(JL1502 *LIBL/WFJL15PF)
     A            JL1503    R             19REFFLD(JL1503 *LIBL/WFJL15PF)
     A            JL1504    R             24REFFLD(JL1504 *LIBL/WFJL15PF)
     A            MA03      R             33REFFLD(MA03 *LIBL/MTMAPF)
     A            JL1505    R             51REFFLD(JL1505 *LIBL/WFJL15PF)
     A                                      EDTCDE(3)
     A            JL1506    R             59REFFLD(JL1506 *LIBL/WFJL15PF)
     A                                      EDTCDE(3)
     A                                      SPACEA(1)
     A                                    33'補貨成本'
     A            JL1507    R             67REFFLD(JL1507 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1508    R             81REFFLD(JL1508 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1509    R             95REFFLD(JL1509 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1        R            109REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1510    R            126REFFLD(JL1510 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1511    R            140REFFLD(JL1511 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1512    R            154REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2        R            168REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            TOT1      R            184REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A*-----------------------------
     A                                    33'累計成本'
     A            JL1513    R             67REFFLD(JL1513 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1514    R             81REFFLD(JL1514 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1515    R             95REFFLD(JL1515 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T3        R            109REFFLD(JL1515 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1516    R            126REFFLD(JL1516 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1517    R            140REFFLD(JL1517 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1518    R            154REFFLD(JL1518 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T4        R            168REFFLD(JL1518 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            TOT2      R            184REFFLD(JL1518 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A*-----------------------------
     A                                    33'差異成本'
     A            JL1519    R             67REFFLD(JL1519 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1520    R             81REFFLD(JL1520 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1521    R             95REFFLD(JL1521 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T5        R            109REFFLD(JL1521 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1522    R            126REFFLD(JL1522 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1523    R            140REFFLD(JL1523 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            JL1524    R            154REFFLD(JL1524 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T6        R            168REFFLD(JL1524 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            TOT3      R            184REFFLD(JL1524 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A*
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       -----------------'
     A                                      SPACEA(1)
     A                                     2'公司小計------------->'
     A            T11505    R             51REFFLD(JL1505 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11506    R             59REFFLD(JL1506 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A                                    33'補貨成本'
     A            T11507    R             67REFFLD(JL1507 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11508    R             81REFFLD(JL1508 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11509    R             95REFFLD(JL1509 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1T1      R            109REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11510    R            126REFFLD(JL1510 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11511    R            140REFFLD(JL1511 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11512    R            154REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1T2      R            168REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1TOT1    R            184REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A*-----------------------------
     A                                    33'累計成本'
     A            T11513    R             67REFFLD(JL1513 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11514    R             81REFFLD(JL1514 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11515    R             95REFFLD(JL1515 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1T3      R            109REFFLD(JL1515 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11516    R            126REFFLD(JL1516 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11517    R            140REFFLD(JL1517 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11518    R            154REFFLD(JL1518 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1T4      R            168REFFLD(JL1518 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1TOT2    R            184REFFLD(JL1518 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A*-----------------------------
     A                                    33'差異成本'
     A            T11519    R             67REFFLD(JL1519 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11520    R             81REFFLD(JL1520 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11521    R             95REFFLD(JL1521 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1T5      R            109REFFLD(JL1521 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11522    R            126REFFLD(JL1522 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11523    R            140REFFLD(JL1523 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T11524    R            154REFFLD(JL1524 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1T6      R            168REFFLD(JL1524 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T1TOT3    R            184REFFLD(JL1524 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A*
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                     2'日期小計------------->'
     A            T21505    R             51REFFLD(JL1505 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21506    R             59REFFLD(JL1506 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A                                    33'補貨成本'
     A            T21507    R             67REFFLD(JL1507 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21508    R             81REFFLD(JL1508 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21509    R             95REFFLD(JL1509 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2T1      R            109REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21510    R            126REFFLD(JL1510 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21511    R            140REFFLD(JL1511 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21512    R            154REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2T2      R            168REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2TOT1    R            184REFFLD(JL1512 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A*-----------------------------
     A                                    33'累計成本'
     A            T21513    R             67REFFLD(JL1513 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21514    R             81REFFLD(JL1514 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21515    R             95REFFLD(JL1515 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2T3      R            109REFFLD(JL1515 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21516    R            126REFFLD(JL1516 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21517    R            140REFFLD(JL1517 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21518    R            154REFFLD(JL1518 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2T4      R            168REFFLD(JL1518 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2TOT2    R            184REFFLD(JL1518 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A*-----------------------------
     A                                    33'差異成本'
     A            T21519    R             67REFFLD(JL1519 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21520    R             81REFFLD(JL1520 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21521    R             95REFFLD(JL1521 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2T5      R            109REFFLD(JL1521 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21522    R            126REFFLD(JL1522 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21523    R            140REFFLD(JL1523 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T21524    R            154REFFLD(JL1524 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2T6      R            168REFFLD(JL1524 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A            T2TOT3    R            184REFFLD(JL1524 *LIBL/WFJL15PF)
     A                                      EDTCDE(M)
     A*
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     2'<<JLB0143>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
