     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : JLB023
     A*    PROGRAM NAME : 傳票試飲退回成本彙總表
     A*    AUTHOR       : AN MING HSIA
     A*    CREATE DATE  : 1993.06.16
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A*===============================================================
     A* CODE |  AUTHOR  |  DATE  | DESCTIPTION
     A*---------------------------------------------------------------
     A* M002 | MICHELLE |02.08.29|變更AMP CODE
     A*---------------------------------------------------------------
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    35MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    37'傳票試飲退回成本彙總表'
     A                                      SPACEA(2)
     A                                    87'日期:'
     A            $EGMDY         6  0     95EDTCDE(Y)
     A                                   104'頁次:'
     A                                   112PAGNBR
     A                                      SPACEA(1)
     A                                     1'公司別　:'
     A            JL1302         2A       13
     A                                    87'時間:'
     A                                    95TIME
     A                                      EDTWRD('  :  :  ')
     A                                   104'<JLB023P>'
     A                                      SPACEA(1)
     A                                     1'確認年月:'
     A            D05            4  0     13EDTWRD('  /  ')
     A                                    87' USER :'
     A            $USER         10A       95
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
M002AA                                       ==========+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     1'等級'
     A                                     7'品牌'
     A                                    14'A&P'
     A*M002A位移+10
     A                                    30'產品代號／名稱'
     A                                    58'數量'
     A                                    72'ＦＯＢ'
     A                                    88'ＦＨＩ'
     A                                   101'ＤＵＴＹ'
     A                                   117'總成本'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==========+
     A                                       ========================='
     A                                      SPACEA(1)
     A*---------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
     A N30        JL1303    R              3REFFLD(JL1303 *LIBL/WFJL13PF)
     A N31        JL1304    R              9REFFLD(JL1304 *LIBL/WFJL13PF)
     A N32        JL1305    R             14REFFLD(JL1305 *LIBL/WFJL13PF)
     A*M002A位移+10
     A            JL1306    R             30REFFLD(JL1306 *LIBL/WFJL13PF)
     A            MA03      R             39REFFLD(MA03 *LIBL/MTMAPF)
     A            JL1307    R             58REFFLD(JL1307 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            JL1308    R             66REFFLD(JL1308 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            JL1309    R             81REFFLD(JL1309 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            JL1310    R             96REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            TOT1      R            111REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A*
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A*M002A位移+10
     A                                    30' A&P小計------------->'
     A            T11307    R             58REFFLD(JL1307 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T11308    R             66REFFLD(JL1308 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T11309    R             81REFFLD(JL1309 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T11310    R             96REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T1TOT1    R            111REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A*
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A*M002A位移+10
     A                                    30'品牌小計------------->'
     A            T21307    R             58REFFLD(JL1307 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T21308    R             66REFFLD(JL1308 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T21309    R             81REFFLD(JL1309 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T21310    R             96REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T2TOT1    R            111REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A*M002A位移+10
     A                                    30'等級小計------------->'
     A            T31307    R             58REFFLD(JL1307 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T31308    R             66REFFLD(JL1308 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T31309    R             81REFFLD(JL1309 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T31310    R             96REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T3TOT1    R            111REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A                                      SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ----------+
     A                                       -------------------------'
     A*----------------------------------------------------------------
     A          R PT4                       SPACEA(1)
     A*M002A位移+10
     A                                    30'公司小計------------->  '
     A            T41307    R             58REFFLD(JL1307 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T41308    R             66REFFLD(JL1308 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T41309    R             81REFFLD(JL1309 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T41310    R             96REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T4TOT1    R            111REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PT5                       SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ----------+
     A                                       -------------------------'
     A                                      SPACEA(1)
     A*M002A位移+10
     A                                    30'總　　計------------->'
     A            T51307    R             58REFFLD(JL1307 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T51308    R             66REFFLD(JL1308 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T51309    R             81REFFLD(JL1309 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T51310    R             96REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A            T5TOT1    R            111REFFLD(JL1310 *LIBL/WFJL13PF)
     A                                      EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==========+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==========+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'<<JLB023P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
