     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : JLB011
     A*    PROGRAM NAME : 傳票銷貨收入明細表
     A*    AUTHOR       : D910121 CHARLES
     A*    CREATE DATE  : 1993.05.22
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    70MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    74'傳票銷貨收入明細表'
     A                                      SPACEA(1)
     A                                   124'日期:'
     A            $EGMDY         6  0    132EDTCDE(Y)
     A                                   141'頁次:'
     A                                   149PAGNBR
     A                                      SPACEA(1)
     A                                     1'公司:'
     A            JL1102    R              9REFFLD(JL1102 *LIBL/WFJL11PF)
     A            #B03      R             12REFFLD(#B03 *LIBL/RERF)
     A                                   124'時間:'
     A                                   132TIME
     A                                      EDTWRD('  :  :  ')
     A                                   142'<JLB0113P>'
     A                                      SPACEA(1)
     A                                     1'確認日期:'
M001MA            D05            6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'～'
M001MA            D06            6  0     27
     A                                      EDTWRD('  /  /  ')
     A                                   124' USER :'
     A            $USER         10A      132
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'確認日期'
     A                                    13'科目'
     A                                    20'單別'
     A                                    32'訂單號碼'
     A                                    45'發票號碼'
     A                                    56'客戶代號／名稱'
     A                                    90'銷售'
     A                                   107'折扣'
     A                                   124'搭贈'
     A                                   141'淨售'
     A                                   156'銷項稅'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A*
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
M001MA N30        PL1101         6  0      2
     A                                      EDTWRD('  /  /  ')
     A N31        J1103$    R             15REFFLD(J1103$ *LIBL/WFJL11PF)
     A N32        JL1103    R             22REFFLD(JL1103 *LIBL/WFJL11PF)
     A            JL1104    R             33REFFLD(JL1104 *LIBL/WFJL11PF)
     A            JL1105    R             46REFFLD(JL1105 *LIBL/WFJL11PF)
     A            JL1106    R             57REFFLD(JL1106 *LIBL/WFJL11PF)
     A            ME04      R             62REFFLD(ME04 *LIBL/MTMEPF)
     A            JL1107    R             81REFFLD(JL1107 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            JL1108    R             98REFFLD(JL1108 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            JL1109    R            115REFFLD(JL1109 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            JL1110    R            132REFFLD(JL1110 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            JL1111    R            149REFFLD(JL1111 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A*
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ---------------'
     A                                      SPACEA(1)
     A                                     2'單別小計------------->'
     A            T11107    R             81REFFLD(JL1107 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T11108    R             98REFFLD(JL1108 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T11109    R            115REFFLD(JL1109 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T11110    R            132REFFLD(JL1110 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T11111    R            149REFFLD(JL1111 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A*
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                     2'科目小計------------->'
     A            T21107    R             81REFFLD(JL1107 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T21108    R             98REFFLD(JL1108 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T21109    R            115REFFLD(JL1109 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T21110    R            132REFFLD(JL1110 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T21111    R            149REFFLD(JL1111 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A*
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     2'日期小計------------->'
     A            T31107    R             81REFFLD(JL1107 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T31108    R             98REFFLD(JL1108 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T31109    R            115REFFLD(JL1109 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T31110    R            132REFFLD(JL1110 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A            T31111    R            149REFFLD(JL1111 *LIBL/WFJL11PF)
     A                                      EDTCDE(J)
     A*
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'<<JLB0113>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
