     A*%%TS  SD  19930712  150121  D910070     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : JLM000D                                    *
     A*    AUTHOR       : JUDY LEE                                   *
     A*    CREATE DATE  : 04/30/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : JLM000C                                    *
     A*    SYSTEM       :產生傳票　　　　　　　                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19930712  150121  D910070     REL-V2R2M0  5738-PW1
     A                                      OVERLAY
     A                                  1  2'JLM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'產生傳票主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  4  1'               '
     A                                      DSPATR(RI)
     A                                  4 17'11.銷售傳票批次'
     A                                      DSPATR(UL)
     A                                  5  1' '
     A                                      DSPATR(RI)
     A                                  5  4'批次作業'
     A                                      DSPATR(UL)
     A                                  5 15' '
     A                                      DSPATR(RI)
     A                                  5 17'12.試飲傳票批次'
     A                                      DSPATR(UL)
     A                                  6  1'               '
     A                                      DSPATR(RI)
     A                                  6 17'13.寄賣傳票批次'
     A                                      DSPATR(UL)
     A                                  9 17'21.銷貨退回傳票批次'
     A                                      DSPATR(UL)
     A                                 10 17'22.寄賣退回傳票批次'
     A                                      DSPATR(UL)
     A                                 11 17'23.試飲退回傳票批次'
     A                                      DSPATR(UL)
     A                                 22 30'請輸入選擇項目:'
     A            DOPID          2A  B 22 48DSPATR(UL)
     A                                      VALUES('  ' '11' '12' '13' '14' +
     A                                      '21' '22' '23' '31' '41' '42' +
     A                                      '43' '51' '15')
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                  7 17'14.補貨傳票批次'
     A                                      DSPATR(UL)
     A                                  8 17'15.人工作廢傳票批次'
     A                                      DSPATR(UL)
     A                                 13 17'31.收款沖帳傳票批次'
     A                                      DSPATR(UL)
     A                                 15 17'41.國外到貨傳票批次'
     A                                      DSPATR(UL)
     A                                 16 17'42.國外完稅傳票批次'
     A                                      DSPATR(UL)
     A                                 17 17'43.國內採購傳票批次'
     A                                      DSPATR(UL)
     A                                 19 17'51.庫存異動傳票批次'
     A                                      DSPATR(UL)
