     A****************************************************************
     A*            獂び戈癟м秨祇Τそ⌒舦┮Τ          *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : KIP006D                                    *
     A*    AUTHOR       : A1492 TERRY                                *
     A*    CREATE DATE  : 98/04/03                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : KIP006                                     *
     A*    SYSTEM       :璟綪扳                                  *
     A*    REMARK       :礟基κだゑ砞﹚                      *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A                                      CHGINPDFT(CS UL)
     A                                      CA03(03 '礶')
     A                                  1  2'<KIP006>'
     A            CONAME        32A  O  1 25MSGID(MSG 9999 R1MF)
     A                                  1 64'ら戳:'
     A            $EGMDY         6Y 0O  1 72EDTWRD('  /  /  ')
     A            USER          10A  O  2  2
     A                                  2 29'礟基κだゑ蝴臔'
     A                                      DSPATR(RI)
     A                                  9 29'礟基κだゑ:'
     A            KIP1           3Y 0B  9 47EDTCDE(4)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  9 51'%'
     A                                 10 29'(1 + κだゑ)      '
     A                                      COLOR(YLW)
     A                                 12 29'礟基κだゑ:'
     A            KIP2           3Y 0B 12 47EDTCDE(4)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                 12 51'%'
     A                                 13 29'(1 - κだゑ)      '
     A                                      COLOR(YLW)
     A                                 23  2'F3=礶'
     A  99        ERR1          50A  O 22  2MSGID(MSG 0018 R1MF)
     A                                      DSPATR(HI)
