     A****************************************************************
     A*    DSPF NAME    : KIR045P                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 82/10/28                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : KIR045                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :盤點系統                                  *
     A*    REMARK       :盤點庫存檢查報表　　                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    57MSGCON(030 URE9999 REMF)
     A                                    62'盤點庫存檢查報表　　'
     A                                      SPACEB(1)
     A                                   110'日期:'
     A                                      SPACEB(2)
     A            $EGMDY         6  0O   118EDTCDE(Y)
     A                                   127'頁次:'
     A                                   135PAGNBR EDTCDE(Z)
     A                                   110'時間:'
     A                                      SPACEB(1)
     A                                   118TIME
     A                                     1'物流點:'
     A                                      SPACEB(1)
     A            WF9201    R        O    +1REFFLD(#D03)
     A            DSTOR         22A  O    17
     A                                   110' USER :'
     A            $USER         10   O   118
     A                                   129'<KIR045>'
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
                                            =====')
     A                                      SPACEB(1)
     A                                    36'------------異動前數量-----------
     A                                      ---'
     A                                      SPACEB(1)
     A                                    76'--異動數量--'
     A                                    92'------------異動後數量-----------
     A                                      ---'
     A                                     1'產品代號　產品簡稱'
     A                                      SPACEB(1)
     A                                    29'單位　庫存量　良品量　壞品量　保+
     A                                      留量　可用量　良品量　壞品量　庫+
     A                                      存量　良品量　壞品量　保留量　可+
                                            用量　盤點單號'
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      -----')
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A            WF9203    R              2REFFLD(MA01)
     A            MA03      R             11
     A            MA13      R             29
     A            WF9204    R             35REFFLD(IA06)
     A                                      EDTCDE(J)
     A            WF9205    R             43REFFLD(IA07)
     A                                      EDTCDE(J)
     A            WF9206    R             51REFFLD(IA08)
     A                                      EDTCDE(J)
     A            WF9207    R             59REFFLD(IA09)
     A                                      EDTCDE(J)
     A            WF9208    R             67REFFLD(IA10)
     A                                      EDTCDE(J)
     A            WF9209    R             75REFFLD(IA10)
     A                                      EDTCDE(J)
     A            WF9210    R             83REFFLD(IA10)
     A                                      EDTCDE(J)
     A            IA06W     R             91REFFLD(IA06)
     A                                      EDTCDE(J)
     A            IA07W     R             99REFFLD(IA07)
     A                                      EDTCDE(J)
     A            IA08W     R            107REFFLD(IA08)
     A                                      EDTCDE(J)
     A            IA09W     R            115REFFLD(IA09)
     A                                      EDTCDE(J)
     A            IA10W     R            123REFFLD(IA10)
     A                                      EDTCDE(J)
     A            WF9211    R            132REFFLD(IO03)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      =====')
     A                                      SPACEB(1)
     A                                     2'***續下頁***'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      =====')
     A                                      SPACEB(1)
     A                                     2'<<KIR045>>--->報表結束'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      =====')
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE4
     A                                     3'もも此範圍無資料もも'
     A                                      SPACEB(1)
