     A****************************************************************
     A*            泛太資訊科技開發股份有限公司－版權所有          *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : KIS007D                                    *
     A*    AUTHOR       : A1491  EASON                               *
     A*    CREATE DATE  : 97/03/26                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :                                            *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R DSPC1
     A                                      CA03(03)
     A                                      CF13(13)
     A                                  1  2'<KIS007D>'
     A            CONAME        32A  O  1 25MSGID(UPT 9900 PTMF)
     A                                  1 64'日期:'
     A            DDATE          6Y 0O  1 72EDTWRD('0  /  /  ')
     A                                  2 28'＜＜其他產品匯總表＞＞  '
     A                                  2  2'<KIS007.1>'
     A            $USERN        10A  O  2  2
     A                                  9 29'供應商:'
     A            SBD03          5A  B    +1
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                    +1'-'
     A            EBD03          5A  B    +1
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                 11 29'訂單日期:'
     A            DBC01          6Y 0B    +1EDTWRD('  /  /  ')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                    +1'-'
     A            EBC01          6Y 0B    +1EDTWRD('  /  /  ')
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                 14 11'                                  -
     A                                                            '
     A                                      DSPATR(RI)
     A                                 15 11' '
     A                                      DSPATR(RI)
     A                                 15 66' '
     A                                      DSPATR(RI)
     A                                 16 11' '
     A                                      DSPATR(RI)
     A  97                             16 23'請按<Ｆ１３>鍵後開始處理'
     A                                      DSPATR(HI)
     A  96                             16 30'產品資料彙整中！！'
     A                                      DSPATR(HI)
     A                                      DSPATR(BL)
     A                                 16 66' '
     A                                      DSPATR(RI)
     A                                 17 11' '
     A                                      DSPATR(RI)
     A                                 17 66' '
     A                                      DSPATR(RI)
     A                                 18 11'                                  -
     A                                                            '
     A                                      DSPATR(RI)
     A                                 23  2'PF03 =回主畫面'
     A                                 23 20'PF13 =處理開始'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        60A  O 24  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
     A* 95        ERR1          50A  O 22  2MSGID(UPT 0010 PTMF)
     A*                                     DSPATR(HI)
