     A*%%TS  SD  20091105  103510  CWDEV3      REL-V4R4M0  5769-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : KIS000D2                                   *
     A*    AUTHOR       : A1492   TERRY                              *
     A*    CREATE DATE  : 98/03/06                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : KIS000C2                                   *
     A*    SYSTEM       :茂世後台                                  *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPC1
     A*%%TS  SD  20091105  103510  CWDEV3      REL-V4R4M0  5769-PW1
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                  1  2'KIS000C2'
     A                                  1 25MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'專櫃進銷存主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70DSPATR(UL)
      *
     A                                  5  5'採購作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6  2'01.後台訂單處理'
     A                                  7  2'02.訂單轉採購批次'
     A                                  8  2'03.採購單查詢'
     A                                  9  2'04.採購單查詢(供應商)'
     A                                 10  2'05.供應商產品報價'
     A                                 11  2'06.驗收單批次結案'
      *
     A                                 13  5'庫存作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 14  2'08.庫存資料查詢'
     A                                 15  2'09.產品異動查詢'
     A                                 16  2'10.產品成本資料維護'
     A                                 17  2'11.業績獎金'
     A                                 18  2'12.產品存貨狀況'
      *
     A                                  5 34'銷售作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 31'21.銷售訂單確認'
     A                                  7 31'22.銷售資料轉檔'
     A                                  8 31'23.失敗訂單處理'
      *
     A                                 11 31'50.報表作業'
     A                                      COLOR(PNK)
      *
     A                                  5 60'調撥作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 57'31.專櫃調撥單作業'
     A                                  7 57'32.專櫃調撥單查詢'
     A                                  8 57'33.調撥單批次結案'
      *
     A                                 10 60'前台作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 57'60.前台專櫃系統'
      *
     A                                 13 34'基本設定'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 14 31'41.牌價百分比維護'
     A                                 15 31'42.牌價資料維護'
     A                                 16 31'43. IP對照表維護'
     A                                 17 31'44.專櫃部門對照碼'
     A                                 18 31'45.產品品牌資料'
      *
     A                                 13 60'月結作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 14 57'71.專櫃銷售年終更新'
     A                                 15 57'72.專櫃調整年終更新'
     A                                 20 29'請輸入選擇項目:'
     A            DOPID          2A  B 20 47DSPATR(UL)
     A                                      VALUES('01' '02' '03' '04' '05' '06-
     A                                      ' '60' '08' '12' '21' '22' '31' '41-
     A                                      ' '42' '43' '09' '10' '23' '11' '50-
     A                                      ' '44' '45'      '32' '33' '71' '72-
                                            ')
     A                                 23  2'執行   F3 = 回主畫面'
     A                                      COLOR(BLU)
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
