     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : KIS000D1                                   *
     A*    AUTHOR       : A1492   TERRY                              *
     A*    CREATE DATE  : 98/03/06                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : KIS000C1                                   *
     A*    SYSTEM       :茂世前台                                  *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPC1
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                  1  2'KIS000C1'
     A                                  1 25MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'進銷存主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  5 34'採購作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 31'01.採購訂單維護'
     A                                  7 31'02.採購訂單查詢'
     A                                  8 31'03.採購訂單驗收'
     A                                  9 31'04.庫存資料查詢'
     A                                 10 31'05.產品存貨狀況'
     A                                 12 34'銷售作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 31'06.銷售訂單維護'
     A                                 14 31'07.銷售訂單查詢'
     A                                 16 34'調撥作業'
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17 31'08.專櫃調撥單作業'
     A                                 18 31'09.專櫃調撥單查詢'
     A                                 21 29'請輸入選擇項目:'
     A            DOPID          2A  B 21 47DSPATR(UL)
     A                                      VALUES('01' '02' '03' '04' '07' '05-
     A                                      ' '06' '08' '09')
     A                                 23 02'執行   F3 = 回主畫面'
     A                                      COLOR(BLU)
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
