     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*===============================================================
     A*---------------------------------------------------------------
     A****************************************************************
     A          R PH1
     A                                    21
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
     A                                    27
     A                                      '錯誤產品一覽表'
     A                                      SPACEA(002)
     A                                     1
     A                                      '訂單日期'
     A                                    13
     A                                      '產品代號'
     A                                    42
     A                                      '錯誤訊息'
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
                                            ----'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A            BC01      R              1
     A                                      EDTWRD('    /  /  ')
     A                                      REFFLD(BC01 W2BCPF)
     A            BD02      R             12
     A                                      REFFLD(BD02 W2BDPF)
     A            MA03      R             22
     A                                      REFFLD(MA03 MTMAPF)
     A            DSE           32O       41
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
                                            ===='
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<KIS008>>--->報表結束'
     A                                      SPACEA(001)
