     A*%%TS  SD  20090604  144820  CWDEV3      REL-V4R4M0  5769-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : KIS013D                                    *
     A*    AUTHOR       : A1491  EASON                               *
     A*    CREATE DATE  : 98/06/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME :                                            *
     A*    SYSTEM       :茂世進銷存                                *
     A*    SUBSYSTEM    :                                          *
     A*    REMARK       :後台採購單查詢--( BY 供應商)            *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*----------------------------------------------------------------
     A          R SFLSR1                    SFL
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B  9  3VALUES(' ' '5')
     A            SBE06     R        O  9  6REFFLD(BE06 W2BEPF)
     A            SMB03     R        O    +1REFFLD(MB03 MTMBPF)
     A            SBE02     R        O    +1REFFLD(BE02 W2BEPF)
     A            SME04     R        O    +1REFFLD(ME04 MTMEPF)
     A            SBE01          6Y 0O    +1EDTWRD('  /  /  ')
     A            SBE03     R        O    +1REFFLD(BE03 W2BEPF)
      *隱藏欄位
     A            SBE01H    R        H      REFFLD(BE01 W2BEPF)
     A*
     A*----------------------------------------------------------------
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  20090604  144820  CWDEV3      REL-V4R4M0  5769-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND(*MORE)
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A                                  1  2'KIS013'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 29'採購單查詢(供應商)'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  1'輸入作業選擇:'
     A                                      COLOR(BLU)
     A                                  5 17'5=查詢'
     A                                      COLOR(BLU)
     A            DRRN1          4S 0H      SFLRCDNBR
     A            DBGN1     R        B  8  6REFFLD(BE06 W2BEPF)
     A            DBGN2     R        B  8 31REFFLD(BE02 W2BEPF)
     A            DBGN3          6Y 0B  8 56EDTWRD('  /  /  ')
     A                                  6  3'(月/日/年)'
     A                                  7  3'A 供應商代號/名稱    專櫃+
     A                                      代號/名稱        採購日期 +
     A                                      採購單號  '
     A                                      DSPATR(UL)
      *----------------------------------------------------------------
     A          R DSPC1
     A                                 22  2'執行'
     A                                      COLOR(BLU)
     A                                 22 10'F3 =回主畫面'
     A                                      COLOR(BLU)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        60A  O 24  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
     A*----------------------------------------------------------------
     A          R SFLSR2                    SFL
     A  54                                  SFLNXTCHG
     A            RRN2           4S 0H
     A            SBF02     R        O  9  2REFFLD(BF02 W2BFPF)
     A            SMA03     R        O  9 12REFFLD(MA03 MTMAPF)
     A            SBF04     R        O  9 32REFFLD(BF04 W2BFPF)
     A                                      EDTCDE(3)
     A            SBF03     R        O  9 44REFFLD(BF03 W2BFPF)
     A                                      EDTCDE(3)
     A            SBH03     R        O  9 54REFFLD(BH03 W2BHPF)
     A                                      EDTCDE(3)
     A            STATUS         8O  O  9 64
     A*----------------------------------------------------------------
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A                                      SFLSIZ(0200)
     A                                      SFLPAG(0010)
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      OVERLAY
     A  37                                  FRCDTA
     A  37                                  LOCK
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN2          4S 0H      SFLRCDNBR
     A                                  1  2'KIS009'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 34'採購單查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  1'採購單號:'
     A            DBE03     R        O  5 13REFFLD(BE03 W2BEPF)
     A                                  5 26'專櫃代號:'
     A            DBE02     R        O  5 38REFFLD(BE02 W2BEPF)
     A            DME04     R        O  5 44REFFLD(ME04 MTMEPF)
     A                                  6  1'採購日期:'
     A            DBE01          6Y 0O  6 13EDTWRD('  /  /  ')
     A                                  6 26'供應廠商:'
     A            DBE06     R        O  6 38REFFLD(BE06 W2BEPF)
     A            DMB03     R        O  6 44REFFLD(MB03 MTMBPF)
     A                                  8  2'產品代號 產品名稱         未+
     A                                      稅單價  採購量  到貨量   狀-
                                            態 '
     A                                      DSPATR(UL)
      *----------------------------------------------------------------
     A          R DSPC2
     A                                 22  2'執行'
     A                                      COLOR(BLU)
     A                                    +2'F3 =回主畫面'
     A                                      COLOR(BLU)
     A                                    +2'F12=回前畫面'
     A                                      COLOR(BLU)
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        60A  O 24  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
