     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*                                                              *
     A*    PROGRAM-ID   : KIS020P                                    *
     A*    PROGRAM NAME :產品名稱報表                              *
     A*    AUTHOR       : A1491  EASON                               *
     A*    CREATE DATE  : 98/06/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       :人事薪資                                  *
     A****************************************************************
      *--------------
     A          R PH1
     A                                      SKIPB(002)
     A                                    20
     A                                      '產品名稱報表'
     A                                      SPACEA(002)
     A                                    40
     A                                      '日期:'
     A            DDATE          6  0     48
     A                                      EDTWRD('0  /  /  ')
     A                                    57
     A                                      '頁次:'
     A                                    65
     A                                      PAGNBR
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號:'
     A            DMA01S    R             13
     A                                      REFFLD(MA01 MTMAPF)
     A                                    23
     A                                      '-'
     A            DMA01E    R             25
     A                                      REFFLD(MA01 MTMAPF)
     A                                    40
     A                                      '時間:'
     A                                    48
     A                                      TIME
     A                                      EDTWRD('  :  :  ')
     A                                    58
     A                                      '<KIS020P>'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ==================================='
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號'
     A                                    12
     A                                      '產品簡稱'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ==================================='
     A                                      SPACEA(001)
      *--------------
     A          R PD1
     A                                      SPACEA(001)
     A            MA01      R              2
     A                                      REFFLD(MA01 MTMAPF)
     A            MA03      R             12
     A                                      REFFLD(MA03 MTMAPF)
     A                                      SPACEA(001)
      *--------------
     A          R PE2
     A                                     1
     A                                      '==================================-
     A                                      ==================================='
     A                                      SPACEA(001)
     A                                     1
     A                                      'KIS020P--->報表結束'
      *--------------
     A          R PE9
     A                                      SPACEB(001)
     A                                    16
     A                                      '無符合列印範圍之資料'
