     A*%%TS  SD  19920331  172443  REPGMRP     REL-V2R1M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R DSPD1
     A*%%TS  SD  19920331  172443  REPGMRP     REL-V2R1M0  5738-PW1
     A                                  6 12'dfiled'
     A                                  6 19':'
     A            FLD001         5   B  6 22
