     A          R PH1                       SKIPB(2)
     A                                    51'日期:'
     A            $ADMDY         6  0     59EDTCDE(Y)
     A                                    68'頁次:'
     A                                    76PAGNBR
     A                                      SPACEA(1)
     A                                     1'傳票介面未處理列印'
     A                                    51'時間:'
     A                                    59TIME
     A                                      EDTWRD('  :  :  ')
     A                                    69'<LOG01P>'
     A                                      SPACEA(2)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     1'進銷存收單號'
     A                                    17'確認日期'
     A                                    29'原因'
     A                                    37'異動日期'
     A                                    49'異動時間'
     A                                    61'異動者'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==================='
     A*
     A          R PD1                       SPACEB(1)
     A            #G01      R              2REFFLD(#G01 *LIBL/WF#GPF01)
M001MA            PG02           6  0     18
     A                                      EDTWRD('  /  /  ')
     A            #G03      R             30REFFLD(#G03 *LIBL/WF#GPF01)
M001MA            PGXX           6  0     38EDTWRD('  /  /  ')
     A            #GYY      R             50EDTWRD('  :  :  ')
     A                                      REFFLD(#GYY *LIBL/WF#GPF01)
     A            #GZZ      R             62REFFLD(#GZZ *LIBL/WF#GPF01)
     A*
     A          R PT1                       SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==================='
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
