     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PROGRAM ID   : LOG001                                     *
     A*    PROGRAM NAME : 銷售送貨傳票批次之歷史檔列印             *
     A*    AUTHOR       : A1149  MAY..                               *
     A*    CREATE DATE  : 1993.04.07                                 *
     A*    UPDATE DATE  :                                            *
     A*    SYSTEM       : 進銷存收TO總帳
     A****************************************************************
     A          R PH1                       SKIPB(2)
     A                                    51'日期:'
     A            $ADMDY         6  0     59EDTCDE(Y)
     A                                    68'頁次:'
     A                                    76PAGNBR
     A                                      SPACEA(1)
     A                                     1'傳票介面控制檔列印表'
     A                                    51'時間:'
     A                                    59TIME
     A                                      EDTWRD('  :  :  ')
     A                                    69'<PA#GPF>'
     A                                      SPACEA(2)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     1'進銷存收單號'
     A                                    23'確認日期'
     A                                    37'異動日期'
     A                                    49'異動時間'
     A                                    61'異動者'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==================='
     A*
     A          R PD1                       SPACEB(1)
     A            #G01      R              2REFFLD(#G01 *LIBL/PA#GPF)
M001MA            PG02           6  0     24
     A                                      EDTWRD('  /  /  ')
M001MA            PGXX           6  0     38EDTWRD('  /  /  ')
     A            #GYY      R             50EDTWRD('  :  :  ')
     A                                      REFFLD(#GYY *LIBL/PA#GPF)
     A            #GZZ      R             62REFFLD(#GZZ *LIBL/PA#GPF)
     A*
     A          R PT1                       SPACEB(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==================='
     A*
     A          R PE9                       SPACEB(1)
     A                                    16'無符合列印範圍之資料'
