     A*%%TS  SD  19930303  101018  REPGMR      REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : SOM000D                                    *
     A*    AUTHOR       : A1034   STEPHANIE                          *
     A*    CREATE DATE  : 81/01/28                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POM000C                                    *
     A*    SYSTEM       :人頭馬匯東銷售訂單系統                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19930303  101018  REPGMR      REL-V2R1M0  5738-PW1
     A                                      OVERLAY
     A                                  1  2'MSOM00D'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'月報表系統主畫面　'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  5  1'               '
     A                                      DSPATR(RI)
     A                                  5 17'41.月通路產品銷售彙總表'
     A                                      DSPATR(UL)
     A                                  6  1' '
     A                                      DSPATR(RI)
     A                                  6  4'報表列印'
     A                                  6 15' '
     A                                      DSPATR(RI)
     A                                  7  1'               '
     A                                      DSPATR(RI)
     A                                 22 30'請輸入選擇項目:'
     A            DOPID          2A  B 22 48DSPATR(UL)
     A                                      VALUES('  ' '41' '42' '43' '44' +
     A                                      '45' '46' '47' '48')
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                  6 17'42.月業務員業績報表　　'
     A                                      DSPATR(UL)
     A                                  7 17'43.月品牌通路銷售彙總表'
     A                                      DSPATR(UL)
     A                                  8 17'44.月ＹＴＤ品牌通路銷售彙總表'
     A                                      DSPATR(UL)
     A                                  9 17'45.月客戶銷售（退）統計表'
     A                                      DSPATR(UL)
     A                                 10 17'46.月產品銷售（退）統計表'
     A                                      DSPATR(UL)
M001MA*                                11 17'47.月產品存貨週轉年報表'
M001MA                                 11 17'47.月存貨週轉統計年報'
     A                                      DSPATR(UL)
     A                                 12 17'48.月通路產品平均銷售單價表'
     A                                      DSPATR(UL)
