     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : MSOR045D                                   *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 05/23/94                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MSOR045                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :月客戶銷售（退）統計表                    *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'MSOR045'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 28'月客戶銷售（退）統計表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4 18'辦事處　:'
     A            COMP           1A  O  4 30
     A                                  4 32'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  5 18'通路　　:'
     A            DCD13S    R        O  5 30REFFLD(CD13)
     A                                  5 40'-'
     A            DCD13E    R        O  5 42REFFLD(CD13)
     A                                  6 18'型態　　:'
     A            DCD14S    R        O  6 30REFFLD(CD14)
     A                                  6 40'-'
     A            DCD14E    R        O  6 42REFFLD(CD14)
     A*                                 7 18'地區　　:'
     A*           DCD11S    R        O  7 30REFFLD(CD11)
     A*                                 7 40'-'
     A*           DCD11E    R        O  7 42REFFLD(CD11)
     A                                  7 18'客戶代號:'
     A            DCD06S         9A  O  7 30
     A                                  7 40'-'
     A            DCD06E         9A  O  7 42
     A                                  8 18'產品組別:'
     A            DMA11          1A  O  8 30
     A                                  9 18'產品代號:'
     A            DCD04S    R        O  9 30REFFLD(CD04)
     A                                  9 40'-'
     A            DCD04E    R        O  9 42REFFLD(CD04)
     A                                 10 16'業務員代號:'
     A            DCD09S    R        O 10 30REFFLD(CD09)
     A                                 10 40'-'
     A            DCD09E    R        O 10 42REFFLD(CD09)
     A                                 11 18'確認年月:'
     A            DCD01          4  0O 11 30
     A                                      EDTWRD('  /  ')
     A                                 11 36'(MM/YY)'
     A                                 11 44'合計方式:'
     A            DSEL3          1   O 11 55
     A                                 11 57'(A=總公司B=分公司)'
     A                                 11 18'分析方式:'
     A            DSEL           1A  O 11 30
     A                                 12 32'( A-原包裝B-單瓶含拆解單瓶)'
     A                                 13 18'統計內容:'
     A            DSEL1          1A  O 13 30
     A                                 13 32'( 1=銷售（退）      2=銷售（退+
     A                                      ）含搭贈'
     A                                 14 32'  3=銷售（退）含試飲4=全部)'
     A                                 16 28'執行環境:'
     A            $EVR           1  0O 16 41
     A                                      EDTCDE(3)
     A                                 16 43'(1-即時   2-批次)'
     A                                 17 28'列印份數:'
     A            $CPY           3  0O 17 41EDTCDE(3)
     A                                 18 28'列表機　:'
     A            $PRTID         2  0O 18 41
     A                                      EDTCDE(3)
     A                                 20 29'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
