     A*%%TS  SD  19941216  103252  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : MSOR048D                                   *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 81/02/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MSOR048D                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :訂單系統                                  *
     A*    REMARK       :通路產品平均銷售單價表                    *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'MSOR048'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 29'通路產品平均銷售單價表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4 25'辦事處　:'
     A            COMP           1A  O  4 37
     A                                  4 40'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  5 25'通路　　:'
     A            DCD13S    R        O  5 37REFFLD(CD13)
     A                                  5 47'-'
     A            DCD13E    R        O  5 49REFFLD(CD13)
     A                                  7 25'地區　　:'
     A            DCD11S    R        O  7 37REFFLD(CD11)
     A                                  7 47'-'
     A            DCD11E    R        O  7 49REFFLD(CD11)
     A                                  8 25'組別　　:'
     A            DCD10S    R        O  8 37REFFLD(CD10)
     A                                  8 47'-'
     A            DCD10E    R        O  8 49REFFLD(CD10)
     A                                  9 25'業務員　:'
     A            DCD09S    R        O  9 37REFFLD(CD09)
     A                                  9 47'-'
     A            DCD09E    R        O  9 49REFFLD(CD09)
     A                                 10 28'產品種類:'
     A            DMA11          1A  O 10 40
     A                                 10 42'(1-BRANDY 2-WHISKY 3-WINE " "-ALL)'
     A                                 11 25'產品代號:'
     A            DCD04S    R        O 11 37REFFLD(CD04)
     A                                 11 47'-'
     A            DCD04E    R        O 11 49REFFLD(CD04)
     A                                 12 25'客戶代號:'
     A            DCD06S         9A  O 12 37
     A                                 12 47'-'
     A            DCD06E         9A  O 12 49
     A                                 13 25'確認年月:'
M001DA*           DCD01S    R        O 13 37REFFLD(CD01)
M001AA            DCD01S         4  0O 13 37
     A                                      EDTWRD('  /  ')
     A                                 13 47'-'
M001DA*           DCD01E    R        O 13 49REFFLD(CD01)
M001AA            DCD01E         4  0O 13 49
     A                                      EDTWRD('  /  ')
     A                                 13 56'(MM/YY)'
     A                                 14 25'分析方式:'
     A            DSEL           1A  O 14 37
     A                                 14 40'A-原包裝'
     A                                 15 40'B-單瓶含拆解之單瓶'
     A                                 17 25'執行環境:'
     A            $EVR           1  0O 17 37
     A                                      EDTCDE(3)
     A                                 17 42'(1-即時   2-批次)'
     A                                 18 25'列印份數:'
     A            $CPY           3  0O 18 37EDTCDE(3)
     A                                 19 25'列表機  :'
     A            $PRTID         2  0O 19 37
     A                                      EDTCDE(3)
     A                                 21 26'***請準備８０行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                  6 25'型態　　:'
     A            DCD14S    R        O  6 37REFFLD(CD14)
     A                                  6 47'-'
     A            DCD14E    R        O  6 49REFFLD(CD14)
