     A*%%TS  SD  19950303  094838  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : MSOR047D                                   *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 03/03/95                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MSOR047                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :月存貨週轉統計年報　　                    *
     A****************************************************************
     A*%%EC
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A*%%TS  SD  19950303  094838  D910074     REL-V2R2M0  5738-PW1
     A                                  1  2'MSOR047'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 28'月存貨週轉統計年報'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5 18'產品組別:'
     A            DMA11          1A  O  5 30
     A                                  5 32'(1-BRANDY 2-WHISKY 3-WINE " "-ALL)'
     A                                  7 18'產品代號:'
     A            DCD04S    R        O  7 30REFFLD(CD04)
     A                                  7 40'-'
     A            DCD04E    R        O  7 42REFFLD(CD04)
     A                                  9 18'確認年月:'
     A            DCD01S         4  0O  9 30
     A                                      EDTWRD('  /  ')
     A                                  7 40'-'
     A            DCD01E         4  0O  9 42
     A                                      EDTWRD('  /  ')
     A                                  9 49'(MM/YY)'
     A                                 16 28'執行環境:'
     A            $EVR           1  0O 16 41
     A                                      EDTCDE(3)
     A                                 16 43'(1-即時   2-批次)'
     A                                 17 28'列印份數:'
     A            $CPY           3  0O 17 41EDTCDE(3)
     A                                 18 28'列表機　:'
     A            $PRTID         2  0O 18 41
     A                                 20 29'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
