     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : MSOR044Z                                   *
     A*    AUTHOR       : D910074  TINA                              *
     A*    CREATE DATE  : 83/04/22                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MSOR044Z                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :訂單系統                                  *
     A*    REMARK       :月ＹＴＤ品牌通路銷售彙總表                *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'MSOR044'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 26'月ＹＴＤ品牌通路銷售彙總表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 32'不含試飲'
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5 25'辦事處　:'
     A            COMP           1A  O  5 37
     A                                  5 40'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  7 25'通　　路:'
     A            DCD13S    R        O  7 37REFFLD(CD13)
     A                                  7 47'-'
     A            DCD13E    R        O  7 49REFFLD(CD13)
     A            SCD04S         2A  O  8 37
     A                                  8 47'-'
     A            SCD04E         2A  O  8 49
     A                                 10 25'產品代號:'
     A            DCD04S    R        O 10 37REFFLD(CD04)
     A                                 10 47'-'
     A            DCD04E    R        O 10 49REFFLD(CD04)
     A                                 12 25'確認年月:'
M001MA*           DCD01S    R        O 12 37REFFLD(CD01)
M001MA            DCD01S         4  0O 12 37
     A                                      EDTWRD('  /  ')
     A                                 12 47'(MM/YY)'
     A                                 16 25'執行環境:'
     A            $EVR           1  0O 16 37
     A                                      EDTCDE(3)
     A                                 16 42'(1-即時   2-批次)'
     A                                 17 25'列印份數:'
     A            $CPY           3  0O 17 37EDTCDE(3)
     A                                 18 25'列表機  :'
     A            $PRTID         2  0O 18 37
     A                                      EDTCDE(3)
     A                                 20 26'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
