     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : MSOR042P                                    *
     A*    AUTHOR       : TINA  WHUNG                                *
     A*    CREATE DATE  : 82/01/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MSO042                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :月結系統                                  *
     A*    REMARK       :業務員業績月報表　　                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    86MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    91'月業務員銷售報表'
     A                                      SPACEA(1)
     A  20                                91'☆★禮盒不拆★☆'
     A N20                                90'☆★禮盒拆單瓶★☆'
     A                                      SPACEA(2)
     A                                     1'辦事處　:'
     A            COMP           1   O    +1
     A            COMPC          6   O    +1
     A                                   169'日期:'
     A            $EGMDY         6  0O   176EDTCDE(Y)
     A                                   185'頁次:'
     A                                   194PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'確認年月:'
     A            DCD01          4  0O    +1EDTWRD('  /  ')
     A                                   169'時間:'
     A                                   176TIME
     A                                      SPACEA(1)
     A                                     1'組　　別:'
     A            DCD10          4   O    +1
     A            D#A03         22A  O    +1
     A                                   169' USER :'
     A            $USER         10A  O   176
     A                                   187'<MSOR042>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                    55'---------------- +
     A                                         銷　售 +
     A                                       -----------------'
     A                                   104'---------------- +
     A                                         銷　退 +
     A                                       -----------------'
     A                                   153'---------------- +
     A                                        實際銷售+
     A                                       -----------------'
     A                                      SPACEA(1)
     A                                     1'業務員'
     A                                    24'產品代號'
     A                                    37'產品簡稱'
     A                                    55'銷售量'
     A                                    68'搭贈'
     A                                    79'試飲'
     A                                    88'銷售金額'
     A                                   104'銷退量'
     A                                   117'搭贈'
     A                                   128'試飲'
     A                                   138'銷退金額'
     A                                   153'銷售量'
     A                                   166'搭贈'
     A                                   177'試飲'
     A                                   185'淨銷售金額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        CD09      R              2
     A N30        MC02      R             10
     A            CD04      R             25
     A            MA03      R             35
     A            CD161     R             54EDTCDE(J)
     A                                      REFFLD(CD16)
     A            CD171     R             65EDTCDE(J)
     A                                      REFFLD(CD17)
     A            CD181     R             76EDTCDE(J)
     A                                      REFFLD(CD18)
     A            CD241     R             87EDTCDE(J)
     A                                      REFFLD(CD24)
     A            CD201     R            103EDTCDE(J)
     A                                      REFFLD(CD20)
     A            CD211     R            114EDTCDE(J)
     A                                      REFFLD(CD21)
     A            CD231     R            125EDTCDE(J)
     A                                      REFFLD(CD23)
     A            CD261     R            136EDTCDE(J)
     A                                      REFFLD(CD26)
     A            CDT11          5  0    152EDTCDE(J)
     A            CDT21          5  0    163EDTCDE(J)
     A            CDT31          5  0    174EDTCDE(J)
     A            CDT41          9  0    185EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            DCD04          6   O    25
     A                                    31'產品分類小計---->'
     A            TOT1      R             54EDTCDE(J)
     A                                      REFFLD(CD16)
     A            TOT2      R             65EDTCDE(J)
     A                                      REFFLD(CD17)
     A            TOT3      R             76EDTCDE(J)
     A                                      REFFLD(CD18)
     A            TOT4      R             87EDTCDE(J)
     A                                      REFFLD(CD24)
     A            TOT5      R            103EDTCDE(J)
     A                                      REFFLD(CD20)
     A            TOT6      R            114EDTCDE(J)
     A                                      REFFLD(CD21)
     A            TOT7      R            125EDTCDE(J)
     A                                      REFFLD(CD23)
     A            TOT8      R            136EDTCDE(J)
     A                                      REFFLD(CD26)
     A            CDT12          5  0    152EDTCDE(J)
     A            CDT22          5  0    163EDTCDE(J)
     A            CDT32          5  0    174EDTCDE(J)
     A            CDT42          9  0    185EDTCDE(J)
     A                                      SPACEA(1)
     A  21                                 2'  '
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    25'業務員小計------>'
     A            T1TOT1    R             54EDTCDE(J)
     A                                      REFFLD(CD16)
     A            T1TOT2    R             65EDTCDE(J)
     A                                      REFFLD(CD17)
     A            T1TOT3    R             76EDTCDE(J)
     A                                      REFFLD(CD18)
     A            T1TOT4    R             87EDTCDE(J)
     A                                      REFFLD(CD24)
     A            T1TOT5    R            103EDTCDE(J)
     A                                      REFFLD(CD20)
     A            T1TOT6    R            114EDTCDE(J)
     A                                      REFFLD(CD21)
     A            T1TOT7    R            125EDTCDE(J)
     A                                      REFFLD(CD23)
     A            T1TOT8    R            136EDTCDE(J)
     A                                      REFFLD(CD26)
     A            CDT13          5  0    152EDTCDE(J)
     A            CDT23          5  0    163EDTCDE(J)
     A            CDT33          5  0    174EDTCDE(J)
     A            CDT43          9  0    185EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    25'組別小計-------->'
     A            T2TOT1    R             54EDTCDE(J)
     A                                      REFFLD(CD16)
     A            T2TOT2    R             65EDTCDE(J)
     A                                      REFFLD(CD17)
     A            T2TOT3    R             76EDTCDE(J)
     A                                      REFFLD(CD18)
     A            T2TOT4    R             87EDTCDE(J)
     A                                      REFFLD(CD24)
     A            T2TOT5    R            103EDTCDE(J)
     A                                      REFFLD(CD20)
     A            T2TOT6    R            114EDTCDE(J)
     A                                      REFFLD(CD21)
     A            T2TOT7    R            125EDTCDE(J)
     A                                      REFFLD(CD23)
     A            T2TOT8    R            136EDTCDE(J)
     A                                      REFFLD(CD26)
     A            CDT14          5  0    152EDTCDE(J)
     A            CDT24          5  0    163EDTCDE(J)
     A            CDT34          5  0    174EDTCDE(J)
     A            CDT44          9  0    185EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT4                       SPACEA(1)
     A                                    25'總　　計-------->'
     A            T3TOT1    R             54EDTCDE(J)
     A                                      REFFLD(CD16)
     A            T3TOT2    R             65EDTCDE(J)
     A                                      REFFLD(CD17)
     A            T3TOT3    R             76EDTCDE(J)
     A                                      REFFLD(CD18)
     A            T3TOT4    R             87EDTCDE(J)
     A                                      REFFLD(CD24)
     A            T3TOT5    R            103EDTCDE(J)
     A                                      REFFLD(CD20)
     A            T3TOT6    R            114EDTCDE(J)
     A                                      REFFLD(CD21)
     A            T3TOT7    R            125EDTCDE(J)
     A                                      REFFLD(CD23)
     A            T3TOT8    R            136EDTCDE(J)
     A                                      REFFLD(CD26)
     A            CDT15          5  0    152EDTCDE(J)
     A            CDT25          5  0    163EDTCDE(J)
     A            CDT35          5  0    174EDTCDE(J)
     A            CDT45          9  0    185EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'<<MSOR042P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
