     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : MSOR044P                                   *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 84/04/22                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MSOR044                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :月結系統                                  *
     A*    REMARK       :月ＹＤＴ通路產品銷售彙總表               *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    83MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    83'月ＹＴＤ品牌通路銷售彙總表'
     A                                      SPACEA(1)
     A                                    78'（運算公式：銷售＋搭贈＋寄賣結單+
     A                                       －銷退）'
     A                                      SPACEA(2)
     A                                     1'通路　  :'
     A            DCD13S         1   O    +1
     A                                    +2'-'
     A            DCD13E         1   O    +1
     A                                      SPACEA(1)
     A                                     1'品牌　　:'
     A            SCD04S         2   O    +1
     A                                    +1'-'
     A            SCD04E         2   O    +1
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DCD04S         9   O    +1
     A                                    +1'-'
     A            DCD04E         9   O    +1
     A                                   166'日期:'
     A            $EGMDY         6  0O   173EDTCDE(Y)
     A                                   183'頁次:'
     A                                   191PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'確認年月:'
     A            DCD01S         4  0O    +1EDTWRD('  /  ')
     A                                   166'時間:'
     A                                   173TIME
     A                                      SPACEA(1)
     A                                     1'ＹＴＤ　:'
     A            YTDS           4  0O    +1EDTWRD('  /  ')
     A                                    +1'-'
     A            YTDE           4  0O    +1EDTWRD('  /  ')
     A                                    50'標準單位:0.75/每單位  '
     A                                   166' USER :'
     A            $USER         10A  O   173
     A                                   184'<MSOR044>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A          R PH2
     A                                     1'品牌／'
     A                                     9'品牌簡稱'
     A            CHN1           1        49
     A            FLD1          10        50
     A            CHN2           1        63
     A            FLD2          10        64
     A            CHN3           1        77
     A            FLD3          10        78
     A            CHN4           1        92
     A            FLD4          10        93
     A            CHN5           1       106
     A            FLD5          10       107
     A            CHN6           1       120
     A            FLD6          10       121
     A            CHN7           1       134
     A            FLD7          10       135
     A            CHN8           1       148
     A            FLD8          10       149
     A            CHN9           1       162
     A            FLD9          10       163
     A            CHN10          1       176
     A            FLD10         10       177
     A                                   190'TOTAL'
     A                                      SPACEA(1)
     A                                    50'數量'
     A                                    64'數量'
     A                                    78'數量'
     A                                    92'數量'
     A                                   106'數量'
     A                                   120'數量'
     A                                   134'數量'
     A                                   148'數量'
     A                                   162'數量'
     A                                   176'數量'
     A                                   190'數量'
     A                                      SPACEA(1)
     A                                    50'比例'
     A                                    64'比例'
     A                                    78'比例'
     A                                    92'比例'
     A                                   106'比例'
     A                                   120'比例'
     A                                   134'比例'
     A                                   148'比例'
     A                                   162'比例'
     A                                   176'比例'
     A                                   190'比例'
     A                                      SPACEA(1)
     A                                    50'金額'
     A                                    64'金額'
     A                                    78'金額'
     A                                    92'金額'
     A                                   106'金額'
     A                                   120'金額'
     A                                   134'金額'
     A                                   148'金額'
     A                                   162'金額'
     A                                   176'金額'
     A                                   190'金額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                     1'辦事處  :'
     A            COMP           1   O    +1
     A            COMPC          6   O    +1
     A                                      SPACEA(1)
     A                                    33'MON'
     A            ARR91          6  0     50EDTCDE(M)
     A            ARR92          6  0     64EDTCDE(M)
     A            ARR93          6  0     78EDTCDE(M)
     A            ARR94          6  0     92EDTCDE(M)
     A            ARR95          6  0    106EDTCDE(M)
     A            ARR96          6  0    120EDTCDE(M)
     A            ARR97          6  0    134EDTCDE(M)
     A            ARR98          6  0    148EDTCDE(M)
     A            ARR99          6  0    162EDTCDE(M)
     A            ARR9A          6  0    176EDTCDE(M)
     A            SUM9           6  0    190EDTCDE(M)
     A                                      SPACEA(1)
     A            PCT11          4  2     50EDTCDE(M)
     A            PCT12          4  2     64EDTCDE(M)
     A            PCT13          4  2     78EDTCDE(M)
     A            PCT14          4  2     92EDTCDE(M)
     A            PCT15          4  2    106EDTCDE(M)
     A            PCT16          4  2    120EDTCDE(M)
     A            PCT17          4  2    134EDTCDE(M)
     A            PCT18          4  2    148EDTCDE(M)
     A            PCT19          4  2    162EDTCDE(M)
     A            PCT1A          4  2    176EDTCDE(M)
     A                                    57'%'
     A                                    74'%'
     A                                    85'%'
     A                                    99'%'
     A                                   113'%'
     A                                   127'%'
     A                                   144'%'
     A                                   155'%'
     A                                   169'%'
     A                                   183'%'
     A                                      SPACEA(1)
     A            ARRA1         12  0     44EDTCDE(M)
     A            ARRA2         12  0     58EDTCDE(M)
     A            ARRA3         12  0     72EDTCDE(M)
     A            ARRA4         12  0     86EDTCDE(M)
     A            ARRA5         12  0    100EDTCDE(M)
     A            ARRA6         12  0    114EDTCDE(M)
     A            ARRA7         12  0    128EDTCDE(M)
     A            ARRA8         12  0    142EDTCDE(M)
     A            ARRA9         12  0    156EDTCDE(M)
     A            ARRAA         12  0    170EDTCDE(M)
     A            SUMA          12  0    184EDTCDE(M)
     A                                      SPACEA(1)
     A                                    33'YTD'
     A            ARRB1          6  0     50EDTCDE(M)
     A            ARRB2          6  0     64EDTCDE(M)
     A            ARRB3          6  0     78EDTCDE(M)
     A            ARRB4          6  0     92EDTCDE(M)
     A            ARRB5          6  0    106EDTCDE(M)
     A            ARRB6          6  0    120EDTCDE(M)
     A            ARRB7          6  0    134EDTCDE(M)
     A            ARRB8          6  0    148EDTCDE(M)
     A            ARRB9          6  0    162EDTCDE(M)
     A            ARRBA          6  0    176EDTCDE(M)
     A            SUMB           6  0    190EDTCDE(M)
     A                                      SPACEA(1)
     A            PCT21          4  2     50EDTCDE(M)
     A            PCT22          4  2     64EDTCDE(M)
     A            PCT23          4  2     78EDTCDE(M)
     A            PCT24          4  2     92EDTCDE(M)
     A            PCT25          4  2    106EDTCDE(M)
     A            PCT26          4  2    120EDTCDE(M)
     A            PCT27          4  2    134EDTCDE(M)
     A            PCT28          4  2    148EDTCDE(M)
     A            PCT29          4  2    162EDTCDE(M)
     A            PCT2A          4  2    176EDTCDE(M)
     A                                    57'%'
     A                                    74'%'
     A                                    85'%'
     A                                    99'%'
     A                                   113'%'
     A                                   127'%'
     A                                   144'%'
     A                                   155'%'
     A                                   169'%'
     A                                   183'%'
     A                                      SPACEA(1)
     A            ARRC1         12  0     44EDTCDE(M)
     A            ARRC2         12  0     58EDTCDE(M)
     A            ARRC3         12  0     72EDTCDE(M)
     A            ARRC4         12  0     86EDTCDE(M)
     A            ARRC5         12  0    100EDTCDE(M)
     A            ARRC6         12  0    114EDTCDE(M)
     A            ARRC7         12  0    128EDTCDE(M)
     A            ARRC8         12  0    142EDTCDE(M)
     A            ARRC9         12  0    156EDTCDE(M)
     A            ARRCA         12  0    170EDTCDE(M)
     A            SUMC          12  0    184EDTCDE(M)
     A                                      SPACEA(1)
     A                                    32'去年MON'
     A            ARRL1          6  0     50EDTCDE(M)
     A            ARRL2          6  0     64EDTCDE(M)
     A            ARRL3          6  0     78EDTCDE(M)
     A            ARRL4          6  0     92EDTCDE(M)
     A            ARRL5          6  0    106EDTCDE(M)
     A            ARRL6          6  0    120EDTCDE(M)
     A            ARRL7          6  0    134EDTCDE(M)
     A            ARRL8          6  0    148EDTCDE(M)
     A            ARRL9          6  0    162EDTCDE(M)
     A            ARRLA          6  0    176EDTCDE(M)
     A            SUML           6  0    190EDTCDE(M)
     A                                      SPACEA(1)
     A            PCT31          4  2     50EDTCDE(M)
     A            PCT32          4  2     64EDTCDE(M)
     A            PCT33          4  2     78EDTCDE(M)
     A            PCT34          4  2     92EDTCDE(M)
     A            PCT35          4  2    106EDTCDE(M)
     A            PCT36          4  2    120EDTCDE(M)
     A            PCT37          4  2    134EDTCDE(M)
     A            PCT38          4  2    148EDTCDE(M)
     A            PCT39          4  2    162EDTCDE(M)
     A            PCT3A          4  2    176EDTCDE(M)
     A                                    57'%'
     A                                    74'%'
     A                                    85'%'
     A                                    99'%'
     A                                   113'%'
     A                                   127'%'
     A                                   144'%'
     A                                   155'%'
     A                                   169'%'
     A                                   183'%'
     A                                      SPACEA(1)
     A            ARRM1         12  0     44EDTCDE(M)
     A            ARRM2         12  0     58EDTCDE(M)
     A            ARRM3         12  0     72EDTCDE(M)
     A            ARRM4         12  0     86EDTCDE(M)
     A            ARRM5         12  0    100EDTCDE(M)
     A            ARRM6         12  0    114EDTCDE(M)
     A            ARRM7         12  0    128EDTCDE(M)
     A            ARRM8         12  0    142EDTCDE(M)
     A            ARRM9         12  0    156EDTCDE(M)
     A            ARRMA         12  0    170EDTCDE(M)
     A            SUMM          12  0    184EDTCDE(M)
     A                                      SPACEA(1)
     A                                    32'去年YTD'
     A            ARRN1          6  0     50EDTCDE(M)
     A            ARRN2          6  0     64EDTCDE(M)
     A            ARRN3          6  0     78EDTCDE(M)
     A            ARRN4          6  0     92EDTCDE(M)
     A            ARRN5          6  0    106EDTCDE(M)
     A            ARRN6          6  0    120EDTCDE(M)
     A            ARRN7          6  0    134EDTCDE(M)
     A            ARRN8          6  0    148EDTCDE(M)
     A            ARRN9          6  0    162EDTCDE(M)
     A            ARRNA          6  0    176EDTCDE(M)
     A            SUMN           6  0    190EDTCDE(M)
     A                                      SPACEA(1)
     A            PCT41          4  2     50EDTCDE(M)
     A            PCT42          4  2     64EDTCDE(M)
     A            PCT43          4  2     78EDTCDE(M)
     A            PCT44          4  2     92EDTCDE(M)
     A            PCT45          4  2    106EDTCDE(M)
     A            PCT46          4  2    120EDTCDE(M)
     A            PCT47          4  2    134EDTCDE(M)
     A            PCT48          4  2    148EDTCDE(M)
     A            PCT49          4  2    162EDTCDE(M)
     A            PCT4A          4  2    176EDTCDE(M)
     A                                    57'%'
     A                                    74'%'
     A                                    85'%'
     A                                    99'%'
     A                                   113'%'
     A                                   127'%'
     A                                   144'%'
     A                                   155'%'
     A                                   169'%'
     A                                   183'%'
     A                                      SPACEA(1)
     A            ARRO1         12  0     44EDTCDE(M)
     A            ARRO2         12  0     58EDTCDE(M)
     A            ARRO3         12  0     72EDTCDE(M)
     A            ARRO4         12  0     86EDTCDE(M)
     A            ARRO5         12  0    100EDTCDE(M)
     A            ARRO6         12  0    114EDTCDE(M)
     A            ARRO7         12  0    128EDTCDE(M)
     A            ARRO8         12  0    142EDTCDE(M)
     A            ARRO9         12  0    156EDTCDE(M)
     A            ARROA         12  0    170EDTCDE(M)
     A            SUMO          12  0    184EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'<<MSOR044>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
