     A*%%TS  SD  19951123  150029  DERLERN     REL-V3R1M0  5763-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*----------------------------------------------------------------
     A          R SFLSR                     SFL
     A*%%TS  SD  19951123  150029  DERLERN     REL-V3R1M0  5763-PW1
     A  54                                  SFLNXTCHG
     A            RRN            4S 0H
     A            MD011     R        O  7  2REFFLD(MD01)
     A            ME04      R        O  7  8
     A            DMD222         9Y 0B  7 27EDTCDE(J)
     A                                      CHECK(RB)
     A            DMD221         9Y 0B  7 40EDTCDE(J)
     A                                      CHECK(RB)
     A            DMD20     R        B  7 55REFFLD(MD20)
     A            DMD21     R        B  7 58REFFLD(MD21)
     A            MD361          1A  O  7 62
     A            DMD22     R        O  7 66REFFLD(MD22)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19920923  134923  D910091     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0014)
     A                                      ROLLUP(25 '下一頁')
     A                                      CF03(03)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  97                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           4S 0H      SFLRCDNBR
     A                                  1  2'MTA007'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'客戶信用額度維護'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 28'金額皆以＜仟元＞為單位'
     A                                      DSPATR(HI)
     A                                      DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A            DBGN1     R        B  6  2REFFLD(MD01)
     A                                  5  1'客戶代號／名稱         +
     A                                      年節信用額度+
     A                                      平時信用額度　寄賣放年節 +
     A                                      主檔信用額度'
     A                                      DSPATR(UL)
     A*----------------------------------------------------------------
     A          R DSPC11
     A*%%TS  SD  19920427  144128  REPGMRP     REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          60A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR4          60A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  28        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
