     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    DSPF NAME    : SOA014P
     A*    AUTHOR       : A1084 CHARLES
     A*    CREATE DATE  : 81/06/04
     A*    UPDATE DATE  :
     A*    PROGRAM NAME : SOA014
     A*    SYSTEM       :人頭馬匯東
     A*    SUBSYSTEM    :銷售訂單系統
     A*    REMARK       :銷售批次作業處理報表列印
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    27MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    28'銷售批次作業處理報表列印'
     A                                      SPACEA(1)
     A                                    51'日期:'
     A            $EGMDY         6  0O    59EDTCDE(Y)
     A                                    68'頁次:'
     A                                    76PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                    51'時間:'
     A                                    59TIME
     A                                    70'<SOA014>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'單據號碼'
     A                                    18'單據年月'
     A                                    34'確認日期'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            #I01      R              2
M001MA*           D#I02     R             19REFFLD(#I02)
M001MA            D#I02          4  0     19
     A                                      EDTWRD('  /  ')
M001MA*           D#I03     R             34REFFLD(#I03)
M001MA            D#I03          6  0     34
     A                                      EDTWRD('  /  /  ')
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<SOA014>>--->報表結束'
