     A*%%TS  SD  19920930  083351  D910121     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : MTI024D                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 82/01/07                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MTI024                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :停止出貨產品查詢                          *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*  91/05/13  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R SFLSR1                    SFL
     A*%%TS  SD  19920925  135532  D910121     REL-V2R1M0  5738-PW1
     A            RRN1           4S 0H
     A            MA01      R        O  7  6
     A            MA03      R        O  7 17
     A            MA29      R        O  7 38EDTCDE(J)
     A            MA30      R        O  7 52EDTCDE(J)
     A            MA54      R        O  7 65
     A            MA07      R        O  7 73
     A*  91/05/13  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19920930  083351  D910121     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0015)
     A                                      ROLLUP(25 '下一頁')
     A                                      ROLLDOWN(26 '上一頁')
     A                                      CA03(03)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A                                      CSRLOC(D#ROW      D#COL)
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'MTI024'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'停止出貨產品查詢'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  5'產品代號 簡稱        -
     A                                           完稅庫存量 -
     A                                       保稅庫存量 禮盒 -
     A                                       歸屬'
     A                                      DSPATR(UL)
     A            DBGN1     R        B  6  6REFFLD(MA01)
     A                                      DSPATR(HI)
     A*  81/01/21  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19920925  140424  D910121     REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2030 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2040 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
