     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : MTR055P                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 82/10/27                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MTR055                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :主檔                                      *
     A*    REMARK       :客戶搭贈清冊                              *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(001)
     A                                    51
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
     A                                    58
     A                                      '客戶搭贈清冊'
     A                                     1
     A                                      '通　路'
     A                                    11
     A                                      ':'
     A            DMD07S    R        O    +1
     A                                      REFFLD(MD07)
     A                                    19
     A                                      '～'
     A            DMD07E    R        O    +0
     A                                      REFFLD(MD07)
     A                                      SPACEA(001)
     A                                     1
     A                                      '型　態'
     A                                    11
     A                                      ':'
     A            DMD08S    R        O    +1
     A                                      REFFLD(MD08)
     A                                    19
     A                                      '～'
     A            DMD08E    R        O    +0
     A                                      REFFLD(MD08)
     A                                      SPACEA(001)
     A                                     1
     A                                      '地　區'
     A                                    11
     A                                      ':'
     A            DME07S    R        O    +1
     A                                      REFFLD(ME07)
     A                                    19
     A                                      '～'
     A            DME07E    R        O    +0
     A                                      REFFLD(ME07)
     A                                    96
     A                                      '日期:'
     A            $EGMDY         6  0O   103
     A                                      EDTCDE(Y)
     A                                   113
     A                                      '頁次:'
     A                                   120
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1
     A                                      '業務員'
     A                                    11
     A                                      ':'
     A            DME15S    R        O    +1
     A                                      REFFLD(ME15)
     A                                    19
     A                                      '～'
     A            DME15E    R        O    +0
     A                                      REFFLD(ME15)
     A                                    96
     A                                      '時間:'
     A                                   103
     A                                      TIME
     A                                      SPACEA(001)
     A                                     1
     A                                      '客戶代號'
     A                                    11
     A                                      ':'
     A            DME01S    R        O    +1
     A                                      REFFLD(ME01)
     A                                    19
     A                                      '～'
     A            DME01E    R        O    +0
     A                                      REFFLD(ME01)
     A                                    96
     A                                      ' USER :'
     A            $USER         10   O   103
     A                                   116
     A                                      '<MTR055>'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A
     A                                      SPACEA(001)
     A                                     1
     A                                      '|客戶'
     A                                     8
     A                                      '|客戶全稱'
     A                                    55
     A                                      '|通路|'
     A                                    63
     A                                      '型態|'
     A                                    70'業務員'
     A                                    78'|'
     A                                    80'搭贈'
     A                                    87'|'
     A                                    89'搭贈'
     A                                    96'|'
     A                                    98'搭贈'
     A                                   105'|'
     A                                   107'搭贈'
     A                                   114'|'
     A                                   116'搭贈'
     A                                   123'|'
     A                                      SPACEA(001)
     A                                     1'|代號'
     A                                     8
     A                                      '|客戶簡稱'
     A                                    27
     A                                      '統一編號'
     A                                    55
     A                                      '|地區|'
     A                                    63
     A                                      '區域|'
     A                                    70
     A                                      '姓名'
     A                                    78'|'
     A                                    79
     A                                      '方式１|'
     A                                    88
     A                                      '方式２|'
     A                                    97
     A                                      '方式３|'
     A                                   106
     A                                      '方式４|'
     A                                   115
     A                                      '方式５|'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A                                     1'|'
     A            MD01      R     O        2
     A                                     8'|'
     A            ME03      R     O        9
     A                                    55'|'
     A            MD07      R             58
     A                                    62'|'
     A            MD08      R             66
     A                                    69'|'
     A            ME15      R             71
     A                                    78'|'
     A                                    87'|'
     A                                    96'|'
     A                                   105'|'
     A                                   114'|'
     A                                   123'|'
     A                                      SPACEA(001)
     A                                     1'|'
     A                                     8'|'
     A            ME04      R              9
     A            MD17      R             27
     A                                    55'|'
     A            ME07      R             58
     A                                    62'|'
     A            ME08      R             66
     A                                    69'|'
     A            MC02      R             71
     A                                    78'|'
     A                                    87'|'
     A                                    96'|'
     A                                   105'|'
     A                                   114'|'
     A                                   123'|'
     A                                      SPACEA(001)
     A                                     1
     A                                      '|------|---------------------------
     A                                      --------------------|------|------|-
     A                                      --------|--------|--------|---------
     A                                      |--------|--------|'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     2
     A                                      '***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<MTR055A>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
