     A*===============================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 01.01.31 |增加大區域選項
     F*----------------------------------------------------------------
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    67MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    71'業務員輪調客戶報表'
     A                                      SPACEA(1)
     A                                    75'（業務員）'
     A                                      SPACEA(1)
M001AA                                     1'大區域:'
M001AA            D#L01S    R        O    +1REFFLD(#D01)
M001AA                                    +1'-'
M001AA            D#L01E    R        O    +1REFFLD(#D01)
     A                                   131'日期:'
     A            $EGMDY         6  0O   139EDTCDE(Y)
     A                                   148'頁次:'
     A                                   156PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'組別　:'
     A            DMC03S    R        O    +1REFFLD(MC03)
     A                                    +1'-'
     A            DMC03E    R        O    +1REFFLD(MC03)
     A                                   131'時間:'
     A                                   139TIME
     A                                   150'<MTR047AP>'
     A                                      SPACEA(1)
     A                                     1'業務員:'
     A            DME15S    R        O    +1REFFLD(ME15)
     A                                    +1'-'
     A            DME15E    R        O    +1REFFLD(ME15)
     A                                   131' USER :'
     A            $USER         10A  O   139
     A                                      SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===================='
     A                                   181'=================='
     A                                      SPACEA(1)
     A                                     1'業務員代號／姓名'
     A                                    19'通路'
     A                                    52'型態'
     A                                    76'地區'
     A                                   100'區域'
     A                                   114'客戶代號／簡稱'
     A                                   145'客戶地址'
     A                                   179'業務員代號／姓名'
     A                                      SPACEA(1)
     A                                     1'--------------------'
     A                                    21'--------------------'
     A                                    41'--------------------'
     A                                    61'--------------------'
     A                                    81'--------------------'
     A                                   101'--------------------'
     A                                   121'--------------------'
     A                                   141'--------------------'
     A                                   161'--------------------'
     A                                   181'------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        ME15      R              2
     A N30        MC02      R              8
     A N31        MD07      R             20
     A N31        #A03      R             21
     A N32        MD08      R             53
     A N32        #C03      R             55
     A N33        ME07      R             77
     A N33        #D02      R             79
     A N34        ME08      R            101
     A N34        #E03      R            103
     A            ME01      R            115
     A            ME02      R            121
     A            ME04      R            125
     A            ME056     R        O   145
     A                                      REFFLD(ME05)
     A            UL1       R            180REFFLD(ME15)
     A                                      UNDERLINE
     A            UL2       R            187REFFLD(MC02)
     A                                      UNDERLINE
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===================='
     A                                   181'=================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===================='
     A                                   181'=================='
     A                                      SPACEA(1)
     A                                     2'<<MTR047AP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
