     A*%%TS  SD  19930209  105941  D910074     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : MTR044D                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/01/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MTR044                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :基本資料子系統                            *
     A*    REMARK       :客戶明細表                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19930209  105941  D910074     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF04(04 'F4 HELP')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'MTR044'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'客戶信用明細表'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6 26'通路　　  :'
     A                                      DSPATR(HI)
     A            DMD07S    R        B  6 40REFFLD(MD0/MD07 *LIBL/MTMDPF)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A N62                                  DSPATR(HI)
     A                                  6 47'-'
     A            DMD07E    R        B  6 49REFFLD(MD0/MD07 *LIBL/MTMDPF)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A N63                                  DSPATR(HI)
     A                                  8 26'地區　　  :'
     A                                      DSPATR(HI)
     A            DME07S    R        B  8 40REFFLD(ME0/ME07 *LIBL/MTMEPF)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A N64                                  DSPATR(HI)
     A                                  8 47'-'
     A            DME07E    R        B  8 49REFFLD(ME0/ME07 *LIBL/MTMEPF)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A N65                                  DSPATR(HI)
     A                                 10 26'組別　　  :'
     A                                      DSPATR(HI)
     A            DMC03S    R        B 10 40REFFLD(MC0/MC03 *LIBL/MTMCPF)
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A N69                                  DSPATR(HI)
     A                                 10 47'-'
     A            DMC03E    R        B 10 49REFFLD(MC0/MC03 *LIBL/MTMCPF)
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A N70                                  DSPATR(HI)
     A                                 12 26'業務員　  :'
     A                                      DSPATR(HI)
     A            DME15S    R        B 12 40REFFLD(RERFR/ME15 *LIBL/RERF)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A N66                                  DSPATR(HI)
     A                                 12 47'-'
     A            DME15E    R        B 12 49REFFLD(RERFR/ME15 *LIBL/RERF)
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A N67                                  DSPATR(HI)
     A                                 13 26'客戶代號'
     A                                      DSPATR(HI)
     A                                 13 38':'
     A            DMD01S    R        B 13 40REFFLD(MD0/MD01 *LIBL/MTMDPF)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                 13 47'-'
     A            DMD01E    R        B 13 49REFFLD(MD0/MD01 *LIBL/MTMDPF)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                 14 26'往來狀態  :'
     A            DME20     R        B 14 40REFFLD(ME0/ME20 *LIBL/MTMEPF)
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A                                 14 42'(A-往來I-不往來空白表示全部)'
     A                                 16 26'執行環境'
     A                                 16 38':'
     A            $EVR           1Y 0B 16 40VALUES(1 2)
     A                                      EDTCDE(3)
     A                                      CHECK(RB)
     A N31                                  DSPATR(UL)
     A  31                                  DSPATR(PR)
     A                                 16 46'(1-即時   2-批次)'
     A                                 17 26'列印份數'
     A                                 17 38':'
     A            $CPY           3Y 0B 17 40EDTCDE(3)
     A                                      CHECK(RB)
     A                                 18 26'列表機'
     A                                      DSPATR(HI)
     A                                 18 38':'
     A            $PRTID         2Y 0B 18 40CHECK(RB)
     A                                      DSPATR(HI)
     A                                      EDTCDE(3)
     A                                 20 26'***請準備８０行報表紙***'
     A                                      DSPATR(HI)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2140 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          50A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
