     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : MTR049D                                   *
     A*    AUTHOR       : D910074 TINA                               *
     A*    CREATE DATE  : 81/09/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MTR049P                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :基本資料子系統                            *
     A*    REMARK       :供應商產一覽表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    48
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    53
     A                                      DFT('供應商產品一覽表')
     A                                      SPACEA(2)
     A                                   101'日期:'
     A            $EGMDY         6  0O   110EDTCDE(Y)
     A                                   120'頁次:'
     A                                   128PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'供應商代號:'
     A            MA12      R        O    +1
     A            MB03      R        O    +2
     A                                   101'時間:'
     A                                   110TIME
     A                                   120'<MTR049>'
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DMA01S    R             +1REFFLD(MA01)
     A                                    +0'-'
     A            DMA01E    R             +0REFFLD(MA01)
     A                                   101' USER :'
     A            $USER         10A  O   110
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    12'中文簡稱'
     A                                    34'英文簡稱'
     A                                    56'種類'
     A                                    63'批發牌格'
     A                                    74'零售牌價'
     A                                    85'庫存單位'
     A                                    96'採購單位'
     A                                   107'單位轉位'
     A                                   118'包裝說明'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            MA01      R        O     2
     A            MA03      R        O    12
     A            MA06      R        O    34
     A            MA09      R        O    58
     A            MA45      R        O    66
     A                                      EDTCDE(1)
     A            MA46      R        O    78
     A                                      EDTCDE(1)
     A            MA13      R        O    88
     A            MA14      R        O    99
     A            MA16      R        O   110
     A                                      EDTCDE(1)
     A            MA17      R        O   119
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'<<MTR049>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
