     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : MTR053D                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 09/07/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MTR053                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :主檔資料系統                              *
     A*    REMARK       :新增客戶一覽表                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF04(04 'F4 HELP')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'MTR053'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  2 32'新增客戶一覽表'
     A                                      DSPATR(HI)
     A                                  5 26'通路　　:'
     A                                      DSPATR(HI)
     A            DMD07S         1A  B  5 38
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A N60                                  DSPATR(HI)
     A                                  5 45'-'
     A            DMD07E         1A  B  5 47
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A N61                                  DSPATR(HI)
     A                                  6 26'型態　　:'
     A                                      DSPATR(HI)
     A            DMD08S         2A  B  6 38
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A N62                                  DSPATR(HI)
     A                                  6 45'-'
     A            DMD08E         2A  B  6 47
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A N63                                  DSPATR(HI)
     A                                  7 26'客戶代號:'
     A                                      DSPATR(HI)
     A            DMD01S    R        B  7 38REFFLD(ME01)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A N64                                  DSPATR(HI)
     A                                  7 45'-'
     A            DMD01E    R        B  7 47REFFLD(ME01)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A N65                                  DSPATR(HI)
     A                                  9 26'地區　　:'
     A                                      DSPATR(HI)
     A            DME07S         2A  B  9 38
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A N66                                  DSPATR(HI)
     A                                  9 45'-'
     A            DME07E         2A  B  9 47
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A N67                                  DSPATR(HI)
     A                                 10 26'區域　　:'
     A                                      DSPATR(HI)
     A            DME08S    R        B 10 38REFFLD(ME08)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A N68                                  DSPATR(HI)
     A                                 10 45'-'
     A            DME08E    R        B 10 47REFFLD(ME08)
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A N69                                  DSPATR(HI)
     A                                 12 26'組別　　:'
     A                                      DSPATR(HI)
     A            DMC03S    R        B 12 38REFFLD(MC03)
     A  70                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A N70                                  DSPATR(HI)
     A                                 12 45'-'
     A            DMC03E    R        B 12 47REFFLD(MC03)
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A N71                                  DSPATR(HI)
     A                                 13 26'業務員　:'
     A                                      DSPATR(HI)
     A            DME15S    R        B 13 38REFFLD(ME15)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A N72                                  DSPATR(HI)
     A                                 13 45'-'
     A            DME15E    R        B 13 47REFFLD(ME15)
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A N73                                  DSPATR(HI)
     A                                 14 26'建檔日期:'
M001MA*           DME19S    R        B 14 38REFFLD(ME19)
M001MA            DME19S         6  0B 14 38
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A N74                                  DSPATR(HI)
     A                                      EDTWRD('  /  /  ')
     A                                 14 47'-'
M001MA*           DME19E    R        B 14 49REFFLD(ME19)
M001MA            DME19E         6  0B 14 49
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A N75                                  DSPATR(HI)
     A                                      EDTWRD('  /  /  ')
     A                                 14 58'(MM/DD/YY)'
     A                                 16 26'執行環境:'
     A            $EVR           1Y 0B 16 38VALUES(1 2)
     A                                      EDTCDE(3)
     A                                      CHECK(RB)
     A N31                                  DSPATR(UL)
     A  31                                  DSPATR(PR)
     A                                 16 43'(1-即時 2-批次)'
     A                                 17 26'列印份數:'
     A            $CPY           3Y 0B 17 38EDTCDE(3)
     A                                      CHECK(RB)
     A                                 18 26'列表機　:'
     A                                      DSPATR(HI)
     A            $PRTID         2Y 0B 18 38CHECK(RB)
     A                                      DSPATR(HI)
     A                                      EDTCDE(3)
     A                                 20 27'***請準備１３２行報表紙***'
     A                                      DSPATR(HI)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2140 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          50A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR8          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
