     A*%%TS  SD  19931115  104843  D910121     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : MTR043D                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/02/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MTR043                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :主檔                                      *
     A*    REMARK       :客戶清冊                                  *
     F*================================================================
     F*  M001     | 01.01.29 |增加大區域選項
     F*----------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'MTR048'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 33'客戶簡明表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5 25'通路　　 :'
     A            DMD07S    R        O  5 38REFFLD(RERFR/MD07 *LIBL/RERF)
     A                                  5 45'-'
     A            DMD07E    R        O  5 47REFFLD(RERFR/MD07 *LIBL/RERF)
     A                                  6 25'型態　　 :'
     A            DMD08S    R        O  6 38REFFLD(MD08)
     A                                  6 45'-'
     A            DMD08E    R        O  6 47REFFLD(MD08)
M001AA                                  7 25'大區域　 :'
M001AA            D#L01S    R        O  7 38REFFLD(#D01)
M001AA                                  7 45'-'
M001AA            D#L01E    R        O  7 47REFFLD(#D01)
     A                                  8 25'地區　　 :'
     A            DME07S    R        O  8 38REFFLD(ME0/ME07 *LIBL/MTMEPF)
     A                                  8 45'-'
     A            DME07E    R        O  8 47REFFLD(ME0/ME07 *LIBL/MTMEPF)
     A                                  9 25'區域　　 :'
     A            DME08S    R        O  9 38REFFLD(ME0/ME08 *LIBL/MTMEPF)
     A                                  9 45'-'
     A            DME08E    R        O  9 47REFFLD(ME0/ME08 *LIBL/MTMEPF)
     A                                 11 25'業務員　 :'
     A            DME15S    R        O 11 38REFFLD(RERFR/ME15 *LIBL/RERF)
     A                                 11 45'-'
     A            DME15E    R        O 11 47REFFLD(RERFR/ME15 *LIBL/RERF)
     A                                 13 25'客戶代號'
     A                                 13 36':'
     A            DME01S    R        O 13 38REFFLD(ME0/ME01 *LIBL/MTMEPF)
     A                                 13 45'-'
     A            DME01E    R        O 13 47REFFLD(ME0/ME01 *LIBL/MTMEPF)
     A                                 14 20'不往來客戶列印:'
     A            DSEL           1A  O 14 38
     A                                 14 42'( Y=列印  N=不列印 )'
     A                                 16 25'執行環境'
     A                                 16 36':'
     A            $EVR           1  0O 16 38
     A                                      EDTCDE(3)
     A                                 16 42'(1-即時   2-批次)'
     A                                 17 25'列印份數'
     A                                 17 36':'
     A            $CPY           3  0O 17 38EDTCDE(3)
     A                                 18 25'列表機'
     A                                 18 36':'
     A            $PRTID         2  0O 18 38EDTCDE(3)
     A                                 20 26'***請準備８０行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
