     A*%%TS  SD  20120303  215052  SCPGMR      REL-V5R1M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPC1
     A*%%TS  SD  20120303  215052  SCPGMR      REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A                                  1  2'NOM000'
     A                                  1 25MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'¤é´Á:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2 62'®É¶¡:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                 13  2'  B  BBBBBBB       I  I       RRRR-
     A                                      RRRRRRR     T      T        H H   H-
     A                                         H H '
     A                                 14  2'BBBB B     B      I   I       R   -
     A                                            R     T      T       HHH   HH-
     A                                      H HHH  '
     A                                 15  2'  B  B     B     IIIIIIIII    R   -
     A                                            R   T T   TTTTTTTTT   H H  HH-
     A                                      H  H H '
     A                                 16  2' BB  BBBBBBB    I     I       RRRR-
     A                                      RRRRRRR   T TTT    T    T  HHHHH HH-
     A                                      H HHHHH'
     A                                 17  2'B B B  B B         IIIIIII    R   -
     A                                            R   T T   TTTTTTTTT   HHHHHHH-
     A                                      HHHHHH '
     A                                 18  2'  B   B   B           I       R   -
     A                                            R     T     T T           H H-
     A                                       H     '
     A                                 19  2'  B  B     B B   IIIIIIIIIII  RRRR-
     A                                      RRRRRRR     T    T    T        H  H-
     A                                         H   '
     A            SU02          10A  O  3 13DSPATR(RI)
     A                                 21 29'¨¯­W°Õ¡I°½¶¢¤@¤U¦Y³J¿|'
     A                                 23 30'¹q¸£«Ç¥Ã»·³­¦ñ±z¨­®Ç'
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                 24  2'½Ð«ö°õ¦æÁäÄ~Äò¾Þ§@....'
     A                                  3 24'ªø§À¤Ú°Õ¡I'
     A                                  5 30'#'
     A                                  5 32'#'
     A                                  5 34'|'
     A                                  5 36'|'
     A                                  5 38'|'
     A                                  5 40'|'
     A                                  5 42'#'
     A                                  5 44'#'
     A                                  7 29'##'
     A                                  7 44'##'
     A                                  8 29'#'
     A                                  8 32'#'
     A                                  8 34'#'
     A                                  8 36'#'
     A                                  8 38'#'
     A                                  8 40'#'
     A                                  8 42'#'
     A                                  8 45'#'
     A                                  9 29'#'
     A                                  9 45'#'
     A                                 10 29'#'
     A                                 10 45'#'
     A                                 11 31'#'
     A                                 11 33'#'
     A                                 11 35'#'
     A                                 11 37'#'
     A                                 11 39'#'
     A                                 11 41'#'
     A                                 11 43'#'
     A                                  6 29'#'
     A                                  6 34'|'
     A                                  6 45'#'
     A                                  6 36'| |'
     A                                  6 40'|'
     A                                  4 34'!'
     A                                      DSPATR(BL)
     A                                  4 36'!'
     A                                      DSPATR(BL)
     A                                  4 38'!'
     A                                      DSPATR(BL)
     A                                  4 40'!'
     A                                      DSPATR(BL)
     A                                  3  2'®¥¶P¨g¶P'
     A                                  4 12'!'
     A                                      DSPATR(BL)
     A                                  4 14'!'
     A                                      DSPATR(BL)
     A                                  4 16'!'
     A                                      DSPATR(BL)
     A                                  4 18'!'
     A                                      DSPATR(BL)
     A                                  5  8'#'
     A                                  5 10'#'
     A                                  5 12'|'
     A                                  5 14'|'
     A                                  5 16'|'
     A                                  5 18'|'
     A                                  5 20'#'
     A                                  5 22'#'
     A                                  6  7'#'
     A                                  6 12'|'
     A                                  6 14'| |'
     A                                  6 18'|'
     A                                  6 23'#'
     A                                  7  7'##'
     A                                  7 22'##'
     A                                  8  7'#'
     A                                  8 10'#'
     A                                  8 12'#'
     A                                  8 14'#'
     A                                  8 16'#'
     A                                  8 18'#'
     A                                  8 20'#'
     A                                  8 23'#'
     A                                  9  7'#'
     A                                  9 23'#'
     A                                 10  7'#'
     A                                 10 23'#'
     A                                 11  9'#'
     A                                 11 11'#'
     A                                 11 13'#'
     A                                 11 15'#'
     A                                 11 17'#'
     A                                 11 19'#'
     A                                 11 21'#'
     A                                  4 55'!'
     A                                      DSPATR(BL)
     A                                  4 57'!'
     A                                      DSPATR(BL)
     A                                  4 59'!'
     A                                      DSPATR(BL)
     A                                  4 61'!'
     A                                      DSPATR(BL)
     A                                  5 51'#'
     A                                  5 53'#'
     A                                  5 55'|'
     A                                  5 57'|'
     A                                  5 59'|'
     A                                  5 61'|'
     A                                  5 63'#'
     A                                  5 65'#'
     A                                  6 50'#'
     A                                  6 55'|'
     A                                  6 57'| |'
     A                                  6 61'|'
     A                                  6 66'#'
     A                                  7 50'##'
     A                                  7 65'##'
     A                                  8 50'#'
     A                                  8 53'#'
     A                                  8 55'#'
     A                                  8 57'#'
     A                                  8 59'#'
     A                                  8 61'#'
     A                                  8 63'#'
     A                                  8 66'#'
     A                                  9 50'#'
     A                                  9 66'#'
     A                                 10 50'#'
     A                                 10 66'#'
     A                                 11 52'#'
     A                                 11 54'#'
     A                                 11 56'#'
     A                                 11 58'#'
     A                                 11 60'#'
     A                                 11 62'#'
     A                                 11 64'#'
     A            YEAR1          3Y 0O  7 12EDTCDE(1)
     A            YEAR2          3Y 0O  7 34EDTCDE(1)
     A            YEAR3          3Y 0O  7 55EDTCDE(1)
     A                                  7 38'·³'
     A                                  7 16'·³'
     A                                  7 59'·³'
     A          R DSPC2
     A*%%TS  SD  20120303  215052  SCPGMR      REL-V5R1M0  5722-WDS
     A                                      OVERLAY
     A                                  1  2'NOM000'
     A                                  1 25MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'¤é´Á:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2 62'®É¶¡:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                 14  2'N     N   O O        S S S   M    -
     A                                       M   O O   K     K  IIIII  N     N -
     A                                        G G G'
     A                                 15  2'N N   N O     O    S         M M M-
     A                                       M O     O K   K      I    N N   N -
     A                                      G      '
     A                                 16  2'N  N  N O     O     S S S    M  M -
     A                                       M O     O K K        I    N  N  N -
     A                                      G   G G'
     A                                 17  2'N   N N O     O           S  M    -
     A                                       M O     O K   K      I    N   N N -
     A                                      G       G'
     A                                 18  2'N     N   O O        S S S   M    -
     A                                       M   O O   K     K  IIIII  N     N -
     A                                        G G G'
     A                                 21 23'¡@¡@½Ð¡@¡@¡@¤Å¡@¡@¡@§l¡@¡@¡@·Ï¡@+
     A                                      ¡@'
     A                                      DSPATR(BL)
     A                                 20 21'                                  -
     A                                            '
     A                                      DSPATR(RI)
     A                                 21 21' '
     A                                      DSPATR(RI)
     A                                 22 21'                                  -
     A                                            '
     A                                      DSPATR(RI)
     A                                 21 60' '
     A                                      DSPATR(RI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  4 33'O'
     A                                  4 35'O'
     A                                  4 37'O'
     A                                  4 39'O'
     A                                  4 41'O'
     A                                  4 43'O'
     A                                  4 45'O'
     A                                  4 47'O'
     A                                  5 31'O'
     A                                  5 49'O'
     A                                  6 30'O'
     A                                  6 50'O'
     A                                  7 29'O'
     A                                  7 51'O'
     A                                  8 28'O'
     A                                  8 52'O'
     A                                  9 29'O'
     A                                  9 51'O'
     A                                 10 30'O'
     A                                 10 50'O'
     A                                 11 31'O'
     A                                 11 49'O'
     A                                 12 33'O'
     A                                 12 35'O'
     A                                 12 37'O'
     A                                 12 39'O'
     A                                 12 41'O'
     A                                 12 43'O'
     A                                 12 45'O'
     A                                 12 47'O'
     A                                  5 42'///'
     A                                  5 47')'
     A                                      DSPATR(BL)
     A                                  6 41'///'
     A                                  6 47'('
     A                                      DSPATR(BL)
     A                                  7 40'///'
     A                                  7 47'|'
     A                                      DSPATR(BL)
     A                                  9 38'///'
     A                                 10 37'///'
     A                                 11 36'///'
     A                                 24  2'½Ð«ö°õ¦æÁäÄ~Äò¾Þ§@....'
     A                                  4  7'½Ð¤Å§l·Ï'
     A                                  5  9'½Ð¤Å§l·Ï'
     A                                  6 11'½Ð¤Å§l·Ï'
     A                                  7 13'½Ð¤Å§l·Ï'
     A                                  8 15'½Ð¤Å§l·Ï'
     A                                  9 13'½Ð¤Å§l·Ï'
     A                                 10 11'½Ð¤Å§l·Ï'
     A                                 11  9'½Ð¤Å§l·Ï'
     A                                 12  7'½Ð¤Å§l·Ï'
     A                                  8 56'½Ð¤Å§l·Ï'
     A                                  7 58'½Ð¤Å§l·Ï'
     A                                  6 60'½Ð¤Å§l·Ï'
     A                                  5 62'½Ð¤Å§l·Ï'
     A                                  4 64'½Ð¤Å§l·Ï'
     A                                  9 58'½Ð¤Å§l·Ï'
     A                                 10 60'½Ð¤Å§l·Ï'
     A                                 11 62'½Ð¤Å§l·Ï'
     A                                 12 64'½Ð¤Å§l·Ï'
     A                                  8 69'½Ð¤Å§l·Ï'
     A                                  7 69'½Ð¤Å§l·Ï'
     A                                  9 69'½Ð¤Å§l·Ï'
     A                                  8  2'½Ð¤Å§l·Ï'
     A                                  7  2'½Ð¤Å§l·Ï'
     A                                  9  2'½Ð¤Å§l·Ï'
     A                                 16 79'G'
     A                                  8 31'   '
     A                                      DSPATR(RI)
     A                                  8 35'    ///      '
     A                                      DSPATR(RI)
