     A*%%TS  SD  19920602  125434  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : PAA007D                                    *
     A*    AUTHOR       : 910079 JUDY LEE                            *
     A*    CREATE DATE  : 06/09/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PAA007                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :基本資料建檔子系統                        *
     A*    REMARK       :規則代碼數字資料建立 (A/U/D/I)            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R SFLSR                     SFL
     A*%%TS  SD  19920528  081759  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN            4S 0H
     A            DOPT1          1A  B  9  4VALUES(' ' '2' '4' '5')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            #H02      R        O  9  9REFFLD(RERFR/#H02 *LIBL/RERF)
     A            #H03      R        O  9 25REFFLD(RERFR/#H03 *LIBL/RERF)
     A                                      EDTCDE(3)
     A          R SFLCR                     SFLCTL(SFLSR)
     A*%%TS  SD  19920602  125434  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CF06(06)
     A                                      CF09(09)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  97                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           4S 0H      SFLRCDNBR
     A                                  1  2'PAA007'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A            #103      R        O  2 24REFFLD(RERFR/#103 *LIBL/RERF)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'輸入作業選擇:'
     A                                  5  5'2=修改'
     A                                  5 15'4=刪除'
     A                                  5 25'5=查詢'
     A                                  7  4'A'
     A                                      DSPATR(UL)
     A            D#102         14A  O  7  8DSPATR(UL)
     A                                  7 25'代碼數字                      '
     A                                      DSPATR(UL)
     A            DBGN1         10A  B  8  9
     A          R DSPC11
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F6 =新增'
     A                                    +2'F9 =列印'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          60A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR4          60A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  28        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A          R DSPC2
     A*%%TS  SD  19920127  161001  REPGMR      REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                      CF12(12)
     A                                  1  2'PAA007'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR007'
     A            #103      R        O  2 24REFFLD(RERFR/#103 *LIBL/RERF)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A            D#102         14A  O  4  2
     A                                  4 17':'
     A            D#H02     R        B  4 19REFFLD(RERFR/#H02 *LIBL/RERF)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A                                  6  2'代碼數字     :'
     A            D#H03     R        B  6 19REFFLD(RERFR/#H03 *LIBL/RERF)
     A                                      EDTCDE(3)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                  8  2'代碼長度     :'
     A            #105      R        O  8 19REFFLD(RERFR/#105 *LIBL/RERF)
     A                                 10  2'代碼數字長度 :'
     A            #106      R        O 10 19REFFLD(RERFR/#106 *LIBL/RERF)
     A                                 19  1'異動日期:'
     A            D#HXX     R        O 19 13REFFLD(#BXX)
     A                                      EDTCDE(Y)
     A                                 19 22'(MM/DD/YY)'
     A                                 20  1'異動時間:'
     A            D#HYY     R        O 20 13REFFLD(#BYY)
     A                                      EDTWRD('  :  :  ')
     A                                 21  1'使用者　:'
     A            D#HZZ     R        O 21 13REFFLD(#BZZ)
     A                                 22  2'執行'
     A  28        DMSG          78A  O 22  2DSPATR(HI)
     A                                 23  2'F3 =回主畫面'
     A                                 23 18'F12=回前畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          60A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          60A  O 24  2MSGID(URE 0019 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
