     A*%%TS  SD  19950324  091928  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : PAM000D                                    *
     A*    AUTHOR       : A1005   ROGER CHIEN                        *
     A*    CREATE DATE  : 80/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PAM000C                                    *
     A*    SYSTEM       :人頭馬匯東基本資料維護                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A*===============================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M003     | 00.12.19 |增加大區域選項
     F*----------------------------------------------------------------
     F*  M004     | 01.03.15 |增加地理別選項
     F*----------------------------------------------------------------
     F*  M005     | 01.05.29 |增加新產品種類代碼
     F*----------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19950324  091928  D910074     REL-V2R2M0  5738-PW1
     A                                      OVERLAY
     A                                  1  2'PAM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'代碼資料維護主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  3 32'              '
     A                                      DSPATR(RI)
     A                                  6  2'01.公司別資料'
     A                                      DSPATR(UL)
     A                                 12 29'31.銷售通路資料'
     A                                      DSPATR(UL)
     A                                  4 32' '
     A                                      DSPATR(RI)
     A                                  4 34'資料維護'
     A                                  4 45' '
     A                                      DSPATR(RI)
     A                                  7  2'02.部門組別資料'
     A                                      DSPATR(UL)
M001MA*                                 6 47'32.銷售通路型態資料'
M001MA                                 13 29'32.銷售通路型態碼資料'
     A                                      DSPATR(UL)
     A                                  5 32'              '
     A                                      DSPATR(RI)
     A                                  8  2'03.物流點資料'
     A                                      DSPATR(UL)
M001MA*                                 7 47'33.銷售地區資料'
M001MA                                 14 29'33.銷售地區碼資料'
     A                                      DSPATR(UL)
     A                                  9  2'04.部門品牌對照資料'
     A                                      DSPATR(UL)
M001MA*                                 8 47'34.銷售地區區域資料'
M001MA                                 15 29'34.銷售地區區域碼資料'
     A                                      DSPATR(UL)
     A                                 12  2'11.產品識別碼資料'
     A                                      DSPATR(UL)
     A                                 13  2'12.產品種類資料'
     A                                      DSPATR(UL)
     A                                  6 55'40.試飲原因資料'
     A                                      DSPATR(UL)
M001MA*                                 7 55'41.試飲Ａ＆Ｐ對照資料'
M001MA                                  7 53'X 41.試飲Ａ＆Ｐ對照資料'
     A                                      DSPATR(UL)
     A                                 14  2'13.產品品牌資料'
     A                                      DSPATR(UL)
     A                                  8 55'42.退貨原因資料'
     A                                      DSPATR(UL)
     A                                 15  2'14.產品容積資料'
     A                                      DSPATR(UL)
     A                                  9 55'43.存貨調整原因資料'
     A                                      DSPATR(UL)
     A                                 16  2'15.品牌標準容積'
     A                                      DSPATR(UL)
     A                                 10 55'44.價差原因資料'
     A                                      DSPATR(UL)
     A                                  6 29'21.幣別資料'
     A                                      DSPATR(UL)
     A                                  7 29'22.付款條件資料'
     A                                      DSPATR(UL)
     A                                  8 29'23.報價方式資料'
     A                                      DSPATR(UL)
     A                                  9 29'24.運輸方式資料'
     A                                      DSPATR(UL)
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('  ' '01' '02' '03' '11' '12+
     A                                      ' '13' '14' '15' '16' '21' '22' '23+
     A                                      ' '24' '31' '32' '33' '34'  '42+
     A                                      ' '43' '44' '51' '52' '53' '54' '40+
                                            ' '35' '04' '17' '45' '36' '37' +
M004AA                                      '38' '39' '18' '46' '47')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                 15 55'51.收款種類資料'
     A                                      DSPATR(UL)
     A                                 16 55'52.聯屬公司供應商'
     A                                      DSPATR(UL)
     A                                 17 55'53.不作帳國內供應商'
     A                                      DSPATR(UL)
     A                                 18 55'54.人工發票代碼資料'
     A                                      DSPATR(UL)
     A                                 17  2'16.專櫃部門代號維護'
     A                                      DSPATR(UL)
     A                                 11 55'45.部門成本中心對照資料'
     A                                      DSPATR(UL)
     A                                 12 55'46.ＡＭＰ代碼維護'
     A                                      DSPATR(UL)
     A                                 13 55'47.試飲ＡＭＰ對照'
     A                                      DSPATR(UL)
     A                                 18  2'17.業務員部門對照資料'
     A                                      DSPATR(UL)
M005AA                                 19  2'18.新產品種類代碼資料'
M005AA                                      DSPATR(UL)
     A                                 16 29'35.客戶集團代號資料'
     A                                      DSPATR(UL)
M003AA                                 17 29'36.銷售大區域碼資料'
     A                                      DSPATR(UL)
M003AA                                 18 29'37.銷售大區域地區碼資料'
     A                                      DSPATR(UL)
M004AA                                 19 29'38.地理區代碼資料'
     A                                      DSPATR(UL)
M004AA                                 20 29'39.地理區地區代碼資料'
     A                                      DSPATR(UL)
