     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : PIB001D                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 03/04/94                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PIB001                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :盤點系統                                  *
     A*    REMARK       :人手終成本庫存備存　　　　　              *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF14(14 '處理作業')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'PIB001'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'年終成本庫存備份'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  8 28'年終年月:'
M001MA            DIX11          4  0B  8 40
     A                                      EDTWRD('  /  ')
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  8 48'(MM/YY)'
     A                                 11 22'+----------------------------------
     A                                      -------+'
     A                                 12 22'|'
     A                                 12 63'|'
     A                                 13 22'| 此作業將備份成本檔及庫存檔之所+
     A                                      有資料 |'
     A                                 14 22'| 請按F3放棄此作業或F14執行+
     A                                      此作業  |'
     A                                 15 22'|'
     A                                 15 63'|'
     A                                 16 22'+----------------------------------
     A                                      -------+'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F14=處理作業'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 24  2MSGID(URE 0137 REMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR10         50A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR11         50A  O 24  2MSGID(URE 0069 REMF)
     A                                      DSPATR(HI)
     A  89        ERR12         50A  O 24  2MSGID(URE 0068 REMF)
     A                                      DSPATR(HI)
     A  88        ERR13         50A  O 24  2MSGID(URE 0070 REMF)
     A                                      DSPATR(HI)
     A  87        ERR14         50A  O 24  2MSGID(URE 0072 REMF)
     A                                      DSPATR(HI)
     A  86        ERR15         50A  O 24  2MSGID(URE 0122 REMF)
     A                                      DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
