     A*%%TS  SD  19940711  100853  D910121     REL-V2R2M0  5738-PW1
     A*  80/11/15  13:46:08    REPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : PIM000D                                    *
     A*    AUTHOR       : A1005   ROGER CHIEN                        *
     A*    CREATE DATE  : 80/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PIM000C                                    *
     A*    SYSTEM       :人頭馬匯東盤點作業系統                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A*===============================================================
     A* MODI CODE |  AUTHOR  |   DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*  M001     | MICHELLE | 990810  | PIB0XX NO USE
     A*===============================================================
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A*  80/11/15  13:50:09    REPGMR      REL-R03M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19940711  100853  D910121     REL-V2R2M0  5738-PW1
     A                                      OVERLAY
     A                                  1  2'PIM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'盤點作業系統主畫面'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  5  2'              '
     A                                      DSPATR(RI)
     A                                  5 35'              '
     A                                      DSPATR(RI)
     A                                  6  2' '
     A                                      DSPATR(RI)
     A                                  6  4'資料維護'
     A                                  6 15' '
     A                                      DSPATR(RI)
     A                                  6 35' '
     A                                      DSPATR(RI)
     A                                  6 37'報表列印'
     A                                  6 48' '
     A                                      DSPATR(RI)
     A                                  7  2'              '
     A                                      DSPATR(RI)
     A                                  7 35'              '
     A                                      DSPATR(RI)
     A                                  5 17'01.盤點單產生'
     A                                      DSPATR(UL)
     A                                  5 50'41.盤點單'
     A                                      DSPATR(UL)
     A                                  6 17'02.盤點資料輸入'
     A                                      DSPATR(UL)
     A                                  6 50'42.盤點清冊'
     A                                      DSPATR(UL)
     A                                  7 17'03.盤點資料更新'
     A                                      DSPATR(UL)
     A                                  7 50'43.盤盈虧表'
     A                                      DSPATR(UL)
     A                                  8 17'04.盤點資料清除'
     A                                      DSPATR(UL)
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('  ' '01' '02' '03' '04' '05+
     A                                      ' '06' '41' '42' '43' '44' '21' '45+
     A                                      ' '46' '22'                     '23+
     A                                      ' '47' '48' '49' '50' '90')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                  9 17'05.盤點基準資料產生'
     A                                      DSPATR(UL)
     A                                  8 50'44.物流點盤點明細表'
     A                                      DSPATR(UL)
     A                                 15  2'              '
     A                                      DSPATR(RI)
     A                                 16  2' '
     A                                      DSPATR(RI)
     A                                 16  4'查詢作業'
     A                                 16 15' '
     A                                      DSPATR(RI)
     A                                 15 17'21.最近盤點單查詢'
     A                                      DSPATR(UL)
     A                                 17  2'              '
     A                                      DSPATR(RI)
M001MA*                                 9 50'45.盤點庫存檢核表'
M001MA                                  9 50'45.盤點庫存檢查報表'
     A                                      DSPATR(UL)
M001MA*                                10 50'46.年終成本庫存列印'
M001MA                                 10 50'46.年終成本數量列印'
     A                                      DSPATR(UL)
M001MA*                                16 17'22.年終成本庫存查詢'
M001MA                                 16 17'22.年終成本數量查詢'
     A                                      DSPATR(UL)
     A                                 10 17'06.年終成本庫存備份'
     A                                      DSPATR(UL)
     A                                 11 15'X 07.專櫃年終－成本調整'
     A                                      DSPATR(UL)
     A                                 12 15'X 08.專櫃年終－銷售更新'
     A                                      DSPATR(UL)
     A                                 13 15'X 09.專櫃年終－盤點更新'
     A                                      DSPATR(UL)
     A                                 14 15'X 10.專櫃月底－採購更新'
     A                                      DSPATR(UL)
     A                                 17 17'23.盤點更新查詢　'
     A                                      DSPATR(UL)
     A                                 11 50'47.單位成本移動平均變動表'
     A                                      DSPATR(UL)
     A                                 12 50'48.存貨明細帳'
     A                                      DSPATR(UL)
     A                                 13 50'49.年終成本標準箱數彙總表'
     A                                      DSPATR(UL)
     A                                 14 50'50.年終庫存物流彙總表'
     A                                      DSPATR(UL)
