     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : PIR047D                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 11/22/94                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PIR047                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :盤點系統                                  *
     A*    REMARK       :年終成本標準箱數表　                    *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'PIR047'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'年終成本標準箱數表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6 26'年終年月:'
M001DA*           DIX11     R        O  6 38REFFLD(IX11)
M001AA            DIX11          4  0O  6 38
     A                                      EDTWRD('  /  ')
     A                                  6 46'(MM/YY)'
     A                                  8 26'物流點　:'
     A            DIY02S    R        O  8 38REFFLD(IY02)
     A                                  8 44'-'
     A            DIY02E    R        O  8 46REFFLD(IY02)
     A                                 10 26'產品代號:'
     A            DIX01S    R        O 10 38REFFLD(IX01)
     A                                 10 48'-'
     A            DIX01E    R        O 10 50REFFLD(IX01)
     A                                 16 26'執行環境:'
     A            $EVR           1  0O 16 38
     A                                      EDTCDE(3)
     A                                 16 43'(1-即時 2-批次)'
     A                                 17 26'列印份數:'
     A            $CPY           3  0O 17 38EDTCDE(3)
     A                                 18 26'列表機　:'
     A            $PRTID         2  0O 18 38
     A                                      EDTCDE(3)
     A                                 20 28'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
