     A*%%TS  SD  19920618  111535  REPGMRP     REL-V2R1M0  5738-PW1
     A*  80/11/19  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : POA003D                                    *
     A*    AUTHOR       : A1092  TAYLOR                              *
     A*    CREATE DATE  : 81/01/19                                   *
     A*    UPDATE DATE  : 81/04/16 PHILIP                            *
     A*    PROGRAM NAME : POA003                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :                        *
     A*    REMARK       :國外採購到貨處理 (A/U/D/I)                *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*  91/05/13  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R SFLSR1                    SFL
     A*%%TS  SD  19920604  171417  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            HPD24          1A  H
     A            DOPT1          1A  B 10  3VALUES(' ' '2' '4' '5' '6')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            PD02      R        O 10 16
     A            PD05      R        O 10 30
M001MA*           PD04      R        O 10  6EDTWRD('  /  /  ')
M001MA            LPD04          6  0O 10  6EDTWRD('  /  /  ')
     A            PD07      R        O 10 41
     A            PD06      R        O 10 75REFFLD(RERFR/PD06 *LIBL/RERF)
     A            MB03      R        O 10 53
     A*  91/05/13  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19920604  171417  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CF06(06)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A                                  1  2'POA003'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'國外採購到貨處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  1'輸入作業選擇:'
     A                                  5  4'2=修改'
     A                                  5 14'4=刪除'
     A                                  5 24'5=查詢'
     A                                  5 34'6=到貨明細'
     A                                  7  5'(MM/DD/YY)'
     A            DRRN1          4S 0H      SFLRCDNBR
     A            DBGN1     R        B  9 16REFFLD(PD02)
     A            DBGN0          6Y 0B  9  6EDTCDE(Y)
     A                                  8  3'A 到貨日期到貨單號    參考單+
     A                                      號 供應商　   供應商簡稱     -
     A                                         保稅倉'
     A                                      DSPATR(UL)
     A*
     A*  80/11/19  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19920127  162226  REPGMR      REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F6 =新增'
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR7          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR8          63A  O 24  2MSGID(URE 0063 REMF)
     A                                      DSPATR(HI)
     A  90        ERR10         63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A  80                             24  2'驗收單號'
     A                                      DSPATR(HI)
     A  80        DPD02     R             +1REFFLD(PD02)
     A  80                                  DSPATR(RI)
     A  80                                +1'新增成功'
     A                                      DSPATR(HI)
     A          R DSPD2
     A*%%TS  SD  19920618  111535  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CA12(12)
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A            HPD06     R        H      REFFLD(PD06)
     A                                  1  2'POA003'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 31'國外採購到貨處理　'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司代號  :'
     A            DPD01     R        B  4 16REFFLD(PD01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            #B03      R        O  4 19
     A                                  5  2'驗收單號  :'
     A            DPD02     R        O  5 16REFFLD(PD02)
     A                                  5 47'單別:'
     A            DPD03     R        O  5 55REFFLD(PD03)
     A            #203      R        O  5 58
     A                                  6  2'進貨日期  :'
M001MA            DPD04          6  0O  6 16
     A                                      EDTWRD('  /  /  ')
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  6 25'(MM/DD/YY)'
     A                                  7  2'參考單號  :'
     A            DPD05     R        B  7 16REFFLD(PD05)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                  8  2'進貨物流點:'
     A                                      DSPATR(HI)
     A            DPD06     R        B  8 16REFFLD(PD06)
     A N63                                  DSPATR(HI)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            D#A032        22A  O  8 22
     A                                 10  2'供應商代號:'
     A                                      DSPATR(HI)
     A            DPD07     R        B 10 16REFFLD(PD07)
     A N64                                  DSPATR(HI)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            MB02      R        O 10 22
     A                                 11  8'幣別:'
     A                                      DSPATR(HI)
     A            DPD08     R        B 11 16REFFLD(PD08)
     A N65                                  DSPATR(HI)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            D#A033        22A  O 11 20
     A                                 11 47'匯率:'
     A            DPD09     R        B 11 55REFFLD(PD09)
     A                                      EDTCDE(2)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 12  2'原幣F.O.B.:'
     A            DPD10     R        B 12 16REFFLD(PD10)
     A                                      EDTCDE(2)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 12 39'原幣FREIGHT :'
     A            DPD11     R        B 12 55REFFLD(PD11)
     A                                      EDTCDE(2)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 13  2'完稅報關費:'
     A            DPD14     R        B 13 16REFFLD(PD14)
     A                                      EDTCDE(2)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 13 43'調撥運費:'
     A            DPD15     R        B 13 55REFFLD(PD15)
     A                                      EDTCDE(2)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 14  2'保稅報關費:'
     A            DPD16     R        B 14 16REFFLD(PD16)
     A                                      EDTCDE(2)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 14 45'保險費:'
     A            DPD17     R        B 14 55REFFLD(PD17)
     A                                      EDTCDE(2)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 15  4'空運運費:'
     A            DPD18     R        B 15 16REFFLD(PD18)
     A                                      EDTCDE(2)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 17  2'進口方式  :'
     A*           DPD19     R        B 17 16REFFLD(PD19)
     A            DPD19          1   B 17 16VALUES('1' '2' '3')
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 17 18'(1散裝2小櫃3大櫃)'
     A                                 17 42'船名:'
     A            DPD20     R        B 17 50REFFLD(PD20)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 18  2'實際到港日:'
M001MA            DPD21          6  0B 18 16
     A                                      EDTWRD('  /  /  ')
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 18 25'(MM/DD/YY)'
     A                                 19  2'備註　    :'
     A            DPD22     R        B 19 16REFFLD(PD22)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DPD23     R        B 20 16REFFLD(PD23)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 22 42'F5 =參考資料'
     A                                 22 58'F12=回前畫面'
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR7          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR8          63A  O 24  2MSGID(URE 0009 REMF)
     A                                      DSPATR(HI)
     A  87        ERR9          63A  O 24  2MSGID(URE 0016 REMF)
     A                                      DSPATR(HI)
     A  86        ERR11         63A  O 24  2MSGID(URE 0064 REMF)
     A                                      DSPATR(HI)
     A  85        ERR12         63A  O 24  2MSGID(URE 0141 REMF)
     A                                      DSPATR(HI)
     A  84        ERR13         63A  O 24  2MSGID(URE 0014 REMF)
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A          R DSPC3
     A*%%TS  SD  19920127  162226  REPGMR      REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 22 42'F5 =參考資料'
     A                                 22 58'F12=回前畫面'
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR7          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR8          63A  O 24  2MSGID(URE 0010 REMF)
     A                                      DSPATR(HI)
     A  87        ERR9          63A  O 24  2MSGID(URE 0011 REMF)
     A                                      DSPATR(HI)
     A  86        ERR11         63A  O 24  2MSGID(URE 0012 REMF)
     A                                      DSPATR(HI)
     A  85        ERR12         63A  O 24  2MSGID(URE 0013 REMF)
     A                                      DSPATR(HI)
     A  84        ERR13         63A  O 24  2MSGID(URE 0014 REMF)
     A                                      DSPATR(HI)
     A  83        ERR14         63A  O 24  2MSGID(URE 0036 REMF)
     A                                      DSPATR(HI)
     A  82        ERR15         63A  O 24  2MSGID(URE 0041 REMF)
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A          R SFLSR2                    SFL
     A*%%TS  SD  19920615  150421  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN2           4S 0H
     A            DOPT2          1A  B 13  2VALUES(' ' '1' '2' '4')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            DPE03     R        B 13  5REFFLD(PE03)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A N61                                  DSPATR(HI)
     A            DPE04     R        B 13 18REFFLD(PE04)
     A N62                                  DSPATR(HI)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A            DPC06     R        O 13 28REFFLD(PC06)
     A                                      EDTCDE(2)
     A            DPC11     R        O 13 36REFFLD(PC11)
     A                                      EDTCDE(2)
     A            DPE06     R        B 13 44REFFLD(PE06)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  34                                  DSPATR(UL)
     A N34                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A            HPE06     R        H      REFFLD(PE06)
     A            HPC12     R        H      REFFLD(PC12)
     A            UPE07         10  2B 13 52
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A                                      EDTCDE(2)
     A                                 14 17'單位轉換:'
     A            DPC10     R        O 14 30REFFLD(PC10)
     A            DPE07     R        O 14 51REFFLD(PE07)
     A                                      EDTCDE(2)
     A            HPE07     R        H      REFFLD(PE07)
     A            DPE08     R        O 13 66REFFLD(PE08)
     A                                      EDTCDE(2)
     A            HPE08     R        H      REFFLD(PE08)
     A            DPE09     R        O 13 74REFFLD(PE09)
     A                                      EDTCDE(4)
     A            HPE09     R        H      REFFLD(PE09)
     A            DCHK           1A  H
     A*                                     'Y' -已存檔中--> UPD
     A*                                     ' ' -不存檔中--> ADD
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*%%TS  SD  19920127  111739  REPGMR      REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0004)
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CA12(12)
     A                                      OVERLAY
     A  37                                  FRCDTA
     A  37                                  LOCK
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN2          4S 0H      SFLRCDNBR
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'POA003'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR003'
     A                                  2 31'國外採購到貨處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司代號  :'
     A            DPD01     R        O  4 16REFFLD(PD01)
     A            #B03      R        O  4 19
     A                                  4 40'單別:'
     A            DPD03     R        O  4 48REFFLD(PD03)
     A            #203      R        O  4 51
     A                                  5  2'供應商代號:'
     A            DPD07     R        O  5 16REFFLD(PD07)
     A            MB02      R        O  5 22
     A                                  6  2'驗收單號  :'
     A            DPD02     R        O  6 16REFFLD(PD02)
     A                                  6 36'進貨日期:'
M001MA            DPD04          6  0O  6 48
     A                                      EDTWRD('  /  /  ')
     A                                  7  2'進貨物流點:'
     A            DPD06     R        O  7 16REFFLD(PD06)
     A            D#A032        22A  O  7 22
     A                                  7 62'幣別:'
     A            DPD08     R        O  7 70REFFLD(PD08)
     A                                  8  2'原幣F.O.B.:'
     A            DPD10     R        O  8 16REFFLD(PD10)
     A                                      EDTCDE(2)
     A                                  8 32'原幣FREIGHT:'
     A            DPD11     R        O  8 47REFFLD(PD11)
     A                                      EDTCDE(2)
     A                                  8 62'匯率:'
     A            DPD09     R        O  8 70REFFLD(PD09)
     A                                      EDTCDE(2)
     A                                  9  2'台幣F.O.B.:'
     A            DPD12     R        O  9 16REFFLD(PD12)
     A                                      EDTCDE(2)
     A                                  9 32'台幣FREIGHT:'
     A            DPD13     R        O  9 47REFFLD(PD13)
     A                                      EDTCDE(2)
     A                                  9 62'HANDLE :'
     A            DHAND     R        O  9 71REFFLD(PE09)
     A                                      EDTCDE(2)
     A            HHAND     R        H      REFFLD(PE09)
     A                                 10  4'1=新增'
     A                                 10 14'2=修改'
     A                                 10 24'4=刪除'
     A                                 11 52'原幣F.O.B.'
     A                                 12  2'A 採購單號   產品代號 採購量+
     A                                      　已收量　到貨量台幣F.O.B. F-
     A                                      REIGHT  HANDLE'
     A                                      DSPATR(UL)
