     A*%%TS  SD  19920703  113920  REPGMRP     REL-V2R1M0  5738-PW1
     A*  80/11/19  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : POA004D                                    *
     A*    AUTHOR       : A1118  PHILIP TSAI                         *
     A*    CREATE DATE  : 81/01/20                                   *
     A*    UPDATE DATE  : 81/04/16                                   *
     A*    PROGRAM NAME : POA004                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購資料建檔子系統                        *
     A*    REMARK       :國外採購完稅處理 (A/U/D/I)                *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*  91/05/13  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R SFLSR1                    SFL
     A*%%TS  SD  19920608  114152  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            HPF13          1A  H
     A            DOPT1          1A  B 10  3VALUES(' ' '2' '4' '5' '6')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            PF02      R        O 10 16
     A            PF05      R        O 10 30
M001MA*           PF04      R        O 10  6EDTWRD('  /  /  ')
M001MA            LPF04          6  0O 10  6EDTWRD('  /  /  ')
     A            PF06      R        O 10 44
     A            PF07      R        O 10 52
     A            PF10      R        O 10 59EDTCDE(2)
M001MA            DPF11          6  0O 10 71
     A                                      EDTCDE(Y)
     A*  91/05/13  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19920608  114152  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CF06(06)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A                                  1  2'POA004'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'國外採購完稅處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  1'輸入作業選擇:'
     A                                  5  4'2=修改'
     A                                  5 14'4=刪除'
     A                                  5 24'5=查詢'
     A                                  5 34'6=完稅明細'
     A            DRRN1          4S 0H      SFLRCDNBR
     A            DBGN1     R        B  9 16REFFLD(PF02)
     A            DBGN0          6Y 0B  9  6EDTCDE(Y)
     A                                  7  5'(MM/DD/YY)                        -
     A                                          保　稅　完　稅'
     A                                  7 71'倉　庫'
     A                                  8  3'A 完稅日期驗收單號    參考單+
     A                                      號    物流點物流點 公賣利益+
     A                                      　確認日期'
     A                                      DSPATR(UL)
     A*  81/01/21  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19920127  174335  REPGMRP     REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F6 =新增'
     A  80                             24  2'驗收單號'
     A                                      DSPATR(HI)
     A  80        DPF02     R             +1REFFLD(PF02)
     A                                      DSPATR(RI)
     A  80                                +1'新增成功'
     A                                      DSPATR(HI)
     A*
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR7          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR8          63A  O 24  2MSGID(URE 0018 REMF)
     A                                      DSPATR(HI)
     A  87        ERR11         63A  O 24  2MSGID(URE 0063 REMF)
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A          R DSPD2
     A*%%TS  SD  19920127  174335  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CA12(12)
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A            HPF06     R        H      REFFLD(PF06)
     A                                  1  2'POA004'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 31'國外採購完稅處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司代號  :'
     A            DPF01     R        B  4 16REFFLD(PF01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            #B03      R        O  4 21
     A                                  6  2'驗收單號  :'
     A            DPF02     R        O  6 16REFFLD(PF02)
     A                                  6 43'參考單號:'
     A            DPF05     R        B  6 55REFFLD(PF05)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                  8  2'單別      :'
     A            DPF03     R        O  8 16REFFLD(PF03)
     A            #2031         22O  O  8 19
     A                                  8 43'公賣利益:'
     A            DPF10     R        O  8 55REFFLD(PF10)
     A                                      EDTCDE(2)
     A                                 10  2'完稅日期  :'
M001MA            DPF04          6  0B 10 16
     A                                      EDTWRD('  /  /  ')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 10 25'(MM/DD/YY)'
     A                                 12  2'倉庫確認日:'
M001MA            DPF11          6  0O 12 16
     A                                      EDTWRD('  /  /  ')
     A                                 12 25'(MM/DD/YY)'
     A                                 14  2'保稅物流點:'
     A                                      DSPATR(HI)
     A            DPF06     R        B 14 16REFFLD(PF06)
     A N63                                  DSPATR(HI)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            #A031         22O  O 14 24
     A                                 15  2'完稅物流點:'
     A                                      DSPATR(HI)
     A            DPF07     R        B 15 16REFFLD(PF07)
     A N64                                  DSPATR(HI)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            #A032         22O  O 15 24
     A                                 17  2'備註      :'
     A            DPF08     R        B 17 16REFFLD(PF08)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DPF09     R        B 18 16REFFLD(PF09)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 22 42'F5 =參考資料'
     A                                 22 58'F12=回前畫面'
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR7          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR11         63A  O 24  2MSGID(URE 0016 REMF)
     A                                      DSPATR(HI)
     A  87        ERR12         63A  O 24  2MSGID(URE 0009 REMF)
     A                                      DSPATR(HI)
     A  86        ERR13         63A  O 24  2MSGID(URE 0015 REMF)
     A                                      DSPATR(HI)
     A  85        ERR14         63A  O 24  2MSGID(URE 0014 REMF)
     A                                      DSPATR(HI)
     A  84        ERR15         63A  O 24  2MSGID(URE 0064 REMF)
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A          R DSPC3
     A*%%TS  SD  19920117  145955  REPGMR      REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F4 =視窗查詢'
     A                                    +2'F5 =參考資料'
     A                                    +2'F12=回前畫面'
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR7          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR11         63A  O 24  2MSGID(URE 0014 REMF)
     A                                      DSPATR(HI)
     A  87        ERR12         63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A          R SFLSR2                    SFL
     A*%%TS  SD  19920703  113920  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN2           4S 0H
     A            DOPT2          1A  B 11  2VALUES(' ' '1' '2' '4')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            DPG03     R        B 11  6REFFLD(PG03)
     A N61                                  DSPATR(HI)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A            MA06      R        O 11 17
     A            MA13      R        O 11 35
     A            IA10      R        O 11 43EDTCDE(K)
     A            DPG05     R        B 11 52REFFLD(PG05)
     A                                      EDTCDE(2)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            HPG05     R        H      REFFLD(PG05)
     A            DPG06     R        B 11 61REFFLD(PG06)
     A                                      EDTCDE(2)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            MA16      R        O 11 75EDTCDE(3)
     A            DCHK           1A  H
     A*                                     'Y' -已存檔中--> UPD
     A*                                     ' ' -不存檔中--> ADD
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*%%TS  SD  19920703  113920  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0160)
     A                                      SFLPAG(0008)
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CA12(12)
     A                                      OVERLAY
     A  37                                  FRCDTA
     A  37                                  LOCK
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN2          4S 0H      SFLRCDNBR
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'POA004'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR003'
     A                                  2 31'國外採購完稅處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司代號:'
     A            DPF01     R        O  4 16REFFLD(PF01)
     A            #B03      R        O  4 19
     A                                  4 37'單別      :'
     A            DPF03     R        O  4 51REFFLD(PF03)
     A            #2031         22O  O  4 55
     A                                  5  2'驗收單號  :'
     A            DPF02     R        O  5 16REFFLD(PF02)
     A                                  5 37'保稅物流點:'
     A            DPF06     R        O  5 51REFFLD(PF06)
     A            #A031         22O  O  5 57
     A                                  6  2'倉庫確認日:'
M001MA            DPF11          6  0O  6 16
     A                                      EDTWRD('  /  /  ')
     A                                  6 37'完稅物流點:'
     A            DPF07     R        O  6 51REFFLD(PF07)
     A            #A032         22O  O  6 57
     A                                  8  4'1=新增'
     A                                  8 14'2=修改'
     A                                  8 24'4=刪除'
     A                                  9 73'單位'
     A                                 10  2'A  產品代號／名稱              -
     A                                      單位  保稅量完稅量   公賣利+
     A                                      益 轉換'
     A                                      DSPATR(UL)
     A                                  7 35'公賣利益總額:'
     A            XPF10     R        O  7 51REFFLD(RERFR/PF10 *LIBL/RERF)
     A                                      EDTCDE(1)
     A            HPF10     R        H      REFFLD(RERFR/PF10 *LIBL/RERF)
