     A*%%TS  SD  19920608  141119  REPGMRP     REL-V2R1M0  5738-PW1
     A*  81/01/21  17:53:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : POA006D                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/01/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POA006                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :基本資料建檔子系統                        *
     A*    REMARK       :採購單人工結案                            *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.10 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A*
     A          R SFLSR1                    SFL
     A*%%TS  SD  19920608  141119  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B 10  3VALUES(' ' '2' '5')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DPB04          6  0O 10  6EDTWRD('  /  /  ')
     A            PB05      R        O 10 39
     A            MB03      R        O 10 48
     A            PB19      R        O 10 70
     A            PB02      R        O 10 16
     A            PB01      R        O 10 32
     A*------------------------------------------------------------
     A*
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19920608  141119  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'POA006'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'採購單人工結案'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'輸入作業選擇:'
     A                                  5  5'2=結案'
     A                                  5 16'5=查詢'
     A                                  7  5'(MM/DD/YY)'
     A            DBGN      R        B  9 16REFFLD(PB02)
     A                                  8  3'A 採購日期採購單號     公司 -
     A                                       代　號 簡　稱             結+
     A                                      案'
     A                                      DSPATR(UL)
     A                                  7 38'供應商 供應商'
     A            DBGN0          6Y 0B  9  6EDTCDE(Y)
     A*------------------------------------------------------------
     A*
     A          R DSPC1
     A*%%TS  SD  19920127  162736  REPGMR      REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*------------------------------------------------------------
     A*
     A*                                     CSRLOC(D#ROW      D#COL)
     A          R DSPD2
     A*%%TS  SD  19920127  162736  REPGMR      REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      CF14(14)
     A                                  1  2'POA006'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 32'採購單人工結案'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司代號  :'
     A            PB01      R        O  4 16
     A            #B03      R        O  4 19
     A                                  5  2'採購單號  :'
     A            PB02      R        O  5 16
     A                                  6  2'單別　　  :'
     A            PB03      R        O  6 16
     A            DOC           20A  O  6 19
     A                                  7  2'採購日期  :'
M001MA*           PB04      R        O  7 16EDTWRD('  /  /  ')
M001MA            DPB042         6  0O  7 16EDTWRD('  /  /  ')
     A                                  7 25'(MM/DD/YY)'
     A                                  7 41'預計交貨日:'
M001MA*           PB06      R        O  7 55EDTWRD('  /  /  ')
M001MA            DPB06          6  0O  7 55EDTWRD('  /  /  ')
     A                                  7 64'(MM/DD/YY)'
     A                                  9  2'供應商代號:'
     A            PB05      R        O  9 16
     A            MB02      R        O  9 22
     A                                 10  2'幣別      :'
     A            PB07      R        O 10 16
     A            DCURR         20A  O 10 20
     A                                 10 43'總金額　:'
     A            PB08      R        O 10 55EDTCDE(1)
     A                                 11  2'付款條件  :'
     A            PB09      R        O 11 16
     A            DPAY          20A  O 11 20
     A                                 11 43'價格條件:'
     A            PB10      R        O 11 55
     A            DPRICE        20A  O 11 58
     A                                 12  2'運輸方式  :'
     A            PB12      R        O 12 16
     A            DELIV         20A  O 12 20
     A                                 12 43'採購備註:'
     A            PB13      R        O 12 55
     A                                 14  2'參考單號　:'
     A            PB11      R        O 14 16
     A                                 15  2'裝船日EDT :'
M001MA*           PB14      R        O 15 16EDTWRD('  /  /  ')
M001MA            DPB14          6  0O 15 16EDTWRD('  /  /  ')
     A                                 15 25'(MM/DD/YY)'
     A                                 16  2'到貨日ETA :'
M001MA*           PB15      R        O 16 16EDTWRD('  /  /  ')
M001MA            DPB15          6  0O 16 16EDTWRD('  /  /  ')
     A                                 16 25'(MM/DD/YY)'
     A                                 17  3'I/P        :'
     A            PB16      R        O 17 16
     A                                 18  3'P-INVOICE  :'
     A            PB17      R        O 18 16
     A                                 19  3'INSURANCE  :'
     A            PB18      R        O 19 16
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F12=回前畫面'
     A                                 22 42'F14=整張結案'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*------------------------------------------------------------
     A          R DSPC3
     A*
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F12=回前畫面'
     A                                    +2'F14=整張結案'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*------------------------------------------------------------
     A          R SFLSR2                    SFL
     A*
     A  54                                  SFLNXTCHG
     A            RRN2           4S 0H
     A            DOPT2          1A  B 11  3VALUES(' ' '2' '4')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            PC03      R        O 11  6
     A            MA06      R        O 11 16
     A            PC09      R        O 11 33
     A            PC06      R        O 11 41EDTCDE(1)
     A            PC11      R        O 11 51EDTCDE(1)
     A            DRENO          6  0O 11 61EDTCDE(1)
     A            PC12      R        O 11 73
     A*                                     'V' 已結案
     A*                                     ' ' 未結案
     A*------------------------------------------------------------
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A*                                     ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      CF14(14)
     A                                      OVERLAY
     A* 37                                  FRCDTA
     A* 37                                  LOCK
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN2          4S 0H      SFLRCDNBR
     A                                  1  2'POA006'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR003'
     A                                  2 32'採購單人工結案'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司代號  :'
     A            PB01      R        O  4 16
     A            #B03      R        O  4 19
     A                                  4 38'單別  :'
     A            PB03      R        O  4 48
     A            DOC           20A  O  4 51
     A                                  5  2'採購單號  :'
     A            PB02      R        O  5 16
     A                                  5 36'採購日期:'
M001MA*           PB04      R        O  5 48EDTWRD('  /  /  ')
M001MA            DPB04          6  0O  5 48EDTWRD('  /  /  ')
     A                                  5 57'預計交貨日:'
M001MA*           PB06      R        O  5 71EDTWRD('  /  /  ')
M001MA            DPB06          6  0O  5 71EDTWRD('  /  /  ')
     A                                  6  2'供應商代號:'
     A            PB05      R        O  6 16
     A            MB02      R        O  6 22
     A                                  6 65'幣別:'
     A            PB07      R        O  6 73
     A                                  7  2'輸入作業選擇:'
     A                                  8  5'2=結案'
     A                                  8 15'4=結案取消'
     A                                 10  3'A 產品代號／名稱           單+
                                            位 採購數量　已收數量　未收+
     A                                      數量 結案'
     A                                      DSPATR(UL)
