     A*%%TS  SD  19920805  111020  REPGMRP     REL-V2R1M0  5738-PW1
     A*  81/01/21  17:53:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : POA006D                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/01/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POA006                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :基本資料建檔子系統                        *
     A*    REMARK       :採購單人工結案                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A*
     A          R SFLSR1                    SFL
     A*%%TS  SD  19920528  130913  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B 10  3VALUES(' ' '5' '6')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            PB01      R        O 10  7
     A            PB02      R        O 10 12
M001DA*           PB04      R        O 10 26EDTWRD('  /  /  ')
M001AA            DPB04          6  0O 10 26EDTWRD('  /  /  ')
     A            PB05      R        O 10 38
     A            MB03      R        O 10 47
     A*------------------------------------------------------------
     A*
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19920608  180050  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'POI024'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 33'採購歷史資料'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'輸入作業選擇:'
     A                                  5  5'5=查詢'
     A                                  5 16'6=採購明細'
     A                                  7 25'(MM/DD/YY)'
     A                                  8  3'A 公司　採購單號　　　採購日期　+
     A                                      供應商代號　供應商名稱     　　-
     A                                      '
     A                                      DSPATR(UL)
     A            DBGN      R        B  9 12REFFLD(PB02)
     A*------------------------------------------------------------
     A*
     A          R DSPC1
     A*%%TS  SD  19920127  163306  REPGMR      REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*------------------------------------------------------------
     A*
     A*                                     CSRLOC(D#ROW      D#COL)
     A          R DSPD2
     A*%%TS  SD  19920402  150819  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      CF14(14)
     A                                  1  2'POI024'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 33'採購歷史資料'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司代號  :'
     A            PB01      R        O  4 16
     A            #B03      R        O  4 19
     A                                  5  2'採購單號  :'
     A            PB02      R        O  5 16
     A                                  6  2'單別　　  :'
     A            PB03      R        O  6 16
     A            #203      R        O  6 19
     A                                  7  2'採購日期  :'
M001DA*           PB04      R        O  7 16EDTWRD('  /  /  ')
M001AA            DPB04          6  0O  7 16EDTWRD('  /  /  ')
     A                                  7 25'(MM/DD/YY)'
     A                                  7 41'預計交貨日:'
M001DA*           PB06      R        O  7 55EDTWRD('  /  /  ')
M001AA            DPB06          6  0O  7 55EDTWRD('  /  /  ')
     A                                  7 64'(MM/DD/YY)'
     A                                  9  2'供應商代號:'
     A            PB05      R        O  9 16
     A            MB02      R        O  9 22
     A                                 10  2'幣別      :'
     A            PB07      R        O 10 16
     A            #A031         22A  O 10 20
     A                                 10 43'總金額　:'
     A            PB08      R        O 10 55EDTCDE(1)
     A                                 11  2'付款條件  :'
     A            PB09      R        O 11 16
     A            #A032         22A  O 11 20
     A                                 11 43'價格條件:'
     A            PB10      R        O 11 55
     A            #A034         22A  O 11 58
     A                                 12  2'運輸方式  :'
     A            PB12      R        O 12 16
     A            #A033         22A  O 12 20
     A                                 12 43'採購備註:'
     A            PB13      R        O 12 55
     A                                 14  2'參考單號　:'
     A            PB11      R        O 14 16
     A                                 15  2'裝船日EDT :'
M001DA*           PB14      R        O 15 16EDTWRD('  /  /  ')
M001AA            DPB14          6  0O 15 16EDTWRD('  /  /  ')
     A                                 15 25'(MM/DD/YY)'
     A                                 16  2'到貨日ETA :'
M001DA*           PB15      R        O 16 16EDTWRD('  /  /  ')
M01A A            DPB15          6  0O 16 16EDTWRD('  /  /  ')
     A                                 16 25'(MM/DD/YY)'
     A                                 17  3'I/P        :'
     A            PB16      R        O 17 16
     A                                 18  3'P-INVOICE  :'
     A            PB17      R        O 18 16
     A                                 19  3'INSURANCE  :'
     A            PB18      R        O 19 16
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F12=回前畫面'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*------------------------------------------------------------
     A*
     A          R DSPC3
     A*%%TS  SD  19920402  150819  REPGMRP     REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F12=回前畫面'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*------------------------------------------------------------
     A*
     A          R SFLSR2                    SFL
     A*%%TS  SD  19920128  103728  REPGMR      REL-V2R1M0  5738-PW1
     A            RRN2           4S 0H
     A            PC03      R        O 11  6
     A            MA06      R        O 11 16
     A            PC09      R        O 11 33
     A            PC06      R        O 11 41EDTCDE(1)
     A            PC07      R        O 11 50REFFLD(RERFR/PC07 *LIBL/RERF)
     A                                      EDTCDE(1)
     A            PC11      R        O 11 61EDTCDE(1)
     A*                                     'V' 已結案
     A*                                     ' ' 未結案
     A*------------------------------------------------------------
     A*
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*%%TS  SD  19920805  111020  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      CA03(03)
     A                                      CA12(12)
     A                                      CF14(14)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN2          4S 0H      SFLRCDNBR
     A                                  1  2'POI024'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR003'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司代號  :'
     A            PB01      R        O  4 16
     A            #B03      R        O  4 19
     A                                  4 38'單別  :'
     A            PB03      R        O  4 48
     A                                  5  2'採購單號  :'
     A            PB02      R        O  5 16
     A                                  5 36'採購日期:'
M001DA*           PB04      R        O  5 48REFFLD(PB04)
M001AA            DPB04          6  0O  5 48
     A                                      EDTWRD('  /  /  ')
     A                                  5 57'預計交貨日:'
M001DA*           PB06      R        O  5 71REFFLD(PB06)
M001AA            DPB06          6  0O  5 71
     A                                      EDTWRD('  /  /  ')
     A                                  6  2'供應商代號:'
     A            PB05      R        O  6 16
     A            MB02      R        O  6 22
     A                                  6 65'幣別:'
     A            PB07      R        O  6 73
     A                                 10  3'A 產品代號／名稱           單+
     A                                      位 　採購量　　　　單價　已收量-
     A                                       　　'
     A                                      DSPATR(UL)
     A                                  2 33'採購歷史資料'
     A                                      DSPATR(HI)
     A            #203      R        O  4 52REFFLD(RERFR/#203 *LIBL/RERF)
