     A*%%TS  SD  19961105  105524  D910454     REL-V3R1M0  5763-PW1
     A*  80/11/15  13:46:08    REPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : POM000D                                    *
     A*    AUTHOR       : A1005   ROGER CHIEN                        *
     A*    CREATE DATE  : 80/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POM000C                                    *
     A*    SYSTEM       :人頭馬匯東採購管理系統                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A*  80/11/15  13:50:09    REPGMR      REL-R03M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19961105  105524  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'POM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'採購管理系統主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  4  2'              '
     A                                      DSPATR(RI)
     A                                  4 17'01.供應商產品報價設定'
     A                                      DSPATR(UL)
     A                                  4 55'21.採購狀況－依產品'
     A                                      DSPATR(UL)
     A                                  5  2' '
     A                                      DSPATR(RI)
     A                                  5  4'資料維護'
     A                                  5 15' '
     A                                      DSPATR(RI)
     A                                  5 17'02.採購單資料維護'
     A                                      DSPATR(UL)
     A                                  5 40'              '
     A                                      DSPATR(RI)
     A                                  5 55'22.採購狀況－依供應商'
     A                                      DSPATR(UL)
     A                                  6  2'              '
     A                                      DSPATR(RI)
     A                                  6 17'03.國外採購到貨處理'
     A                                      DSPATR(UL)
     A                                  6 40' '
     A                                      DSPATR(RI)
     A                                  6 42'查詢作業'
     A                                  6 53' '
     A                                      DSPATR(RI)
     A                                  6 55'23.採購狀況－依採購單'
     A                                      DSPATR(UL)
     A                                  7 17'04.國外採購完稅處理'
     A                                      DSPATR(UL)
     A                                  7 40'              '
     A                                      DSPATR(RI)
     A                                  7 55'24.採購歷史狀況'
     A                                      DSPATR(UL)
     A                                  8 17'05.國內採購驗收處理'
     A                                      DSPATR(UL)
     A                                  8 55'25.供應商產品報價'
     A                                      DSPATR(UL)
     A                                  9 17'06.採購單人工結案'
     A                                      DSPATR(UL)
     A                                  9 55'26.產品存貨狀況'
     A                                      DSPATR(UL)
     A                                 10 17'07.採購單備註資料'
     A                                      DSPATR(UL)
     A                                 10 55'27.採購單／驗收單查詢　'
     A                                      DSPATR(UL)
     A                                 11 17'08.採購單批次結案'
     A                                      DSPATR(UL)
M001MA                                 12 53'X 61.採購單轉歷史檔'
     A                                      DSPATR(UL)
     A                                 15 55'13.採購報表系統　'
     A                                      DSPATR(UL)
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('01' '02' '03' '04' '05' '06-
     A                                      ' '07' '08' '21' '22' '23' '24' '25-
M001MA                                      ' '27' '13' '61' '26')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
