     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : POR048D                                    *
     A*    AUTHOR       : A1005  ROGER CHIEN                         *
     A*    CREATE DATE  : 80/11/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POR0481                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購資料子系統                            *
     A*    REMARK       :採購完稅明細表                            *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.12.16 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    43MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    49'採購完稅明細表'
     A                                      SPACEA(1)
     A                                     1'公司別:'
     A            DPF01S         2        +1
     A                                    +1'-'
     A            DPF01E         2        +1
     A                                    85'日期:'
     A            $EGMDY         6  0O    +1EDTCDE(Y)
     A                                    +1'頁次:'
     A                                    +1PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'供應商代號:'
     A            DMA12S    R             +1REFFLD(MA12)
     A                                    +1'-'
     A            DMA12E    R             +1REFFLD(MA12)
     A                                    85'時間:'
     A                                    +1TIME
     A                                      SPACEA(1)
     A                                     1'完稅日期　:'
M001MA*           DPF04S    R             +1REFFLD(PF04)
M001MA            DPF04S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
M001MA*           DPF04E    R             +1REFFLD(PF04)
M001MA            DPF04E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    85' USER :'
     A            $USER         10   O    +1
     A                                    +2'<POR048AP>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                     1'完稅日期'
     A                                    +0'驗收單號'
     A                                    +3'參考單號'
     A                                    +2'入庫日期'
     A                                    +0'保稅倉'
     A                                    54'完稅倉'
     A                                    +0'產品代號／名稱'
     A                                    88'單位'
     A                                    98'數量'
     A                                    +1'公賣利益'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
M001MA*N30        PPF04     R              2EDTWRD('  /  /  ')
M001MA N30        PPF04          6  0      2EDTWRD('  /  /  ')
     A*M001D                                REFFLD(PF04)
     A N31        PF02      R             +2
     A N31        PF05      R             +1
M001MA*N31        PPF11     R             +1EDTWRD('  /  /  ')
M001MA N31        PPF11          6  0     +1EDTWRD('  /  /  ')
     A*M001D                                REFFLD(PF11)
     A N31        PF06      R             +2
     A N31        PF07      R             +3
     A            PG03      R             +3
     A            MA06      R             +1
     A            MA13      R             +1
     A            PG05      R             +2EDTCDE(J)
     A            PG06      R             +1EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    62'驗收單小計+
     A                                      --------------------------->'
     A            SPG06          9  0     +2EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A                                    62'完稅日合計+
     A                                      --------------------------->'
     A            DPG06          9  0     +2EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                    62'總　　　計+
     A                                      --------------------------->'
     A            TPG06          9  0     +2EDTCDE(J)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =============='
     A                                      SPACEA(2)
     A                                     2'<<POR048AP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
