     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : POR055D                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 05/14/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POR0551                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購資料子系統                            *
     A*    REMARK       :供應商到貨完稅狀況表                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    70MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    75'供應商到貨完稅狀況表'
     A                                      SPACEA(1)
     A                                     2'供應商'
     A                                    12':'
     A            WF7301    R             14REFFLD(MA12)
     A            MB03      R             +1REFFLD(MB03)
     A                                   145'日期:'
     A            $EGMDY         6  0O   153EDTCDE(Y)
     A                                   164'頁次:'
     A                                   172PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     2'年月:'
     A                                    12':'
     A            DPD04S         4  0     14
     A                                      EDTWRD('  /  ')
     A                                    +1'-'
     A            DPD04E         4  0     +1
     A                                      EDTWRD('  /  ')
     A                                   145'時間:'
     A                                   153TIME
     A                                      SPACEA(1)
     A                                     2'產品代號:'
     A            DPE04S    R             14REFFLD(PG03)
     A                                    +1'-'
     A            DPE04E    R             +1REFFLD(PG03)
     A                                   145' USER :'
     A            $USER         10   O   153
     A                                   165'<POR055P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                    39'單位'
     A                                    46'標準'
     A                                    53'前期未完稅'
     A                                    68'----------'
     A                                    78'本期到貨'
     A                                    88'---------'
     A                                   100'------------------'
     A                                   118'本期完稅'
     A                                   128'-----------------'
     A                                   148'-----------'
     A                                   159'未完稅'
     A                                   167'----------'
     A                                      SPACEA(1)
     A                                     1'產品代號／簡稱'
     A                                    29'包裝說明'
     A                                    39'轉換'
     A                                    46'容積'
     A                                    54'量（瓶）'
     A                                    69'數量'
     A                                    76'實際箱數'
     A                                    87'標準箱數'
     A                                   101'數量'
     A                                   110'公升數'
     A                                   121'標準箱數'
     A                                   134'公賣利益'
     A                                   149'數量'
     A                                   156'實際箱數'
     A                                   167'標準箱數'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  21                                 1'   '
     A  21                                  SPACEA(1)
     A            WF7302    R              2REFFLD(MA01)
     A            MA03      R             11REFFLD(MA03)
     A            MA17      R             30REFFLD(MA17)
     A            WF7315    R             41REFFLD(MA16)
     A                                      EDTCDE(J)
     A            WF7318         5  2     46EDTCDE(J)
     A            WF7303         6  0     56EDTCDE(J)
     A            WF7304         6  0     68EDTCDE(J)
     A            WF7305         6  0     78EDTCDE(J)
     A            WF7306         6  0     89EDTCDE(J)
     A            WF7307         6  0    100EDTCDE(J)
     A            WF7308         8  2    109EDTCDE(J)
     A            WF7309         6  0    122EDTCDE(J)
     A            WF7310        11  2    131EDTCDE(J)
     A            WF7311         6  0    148EDTCDE(J)
     A            WF7312         6  0    158EDTCDE(J)
     A            WF7313         6  0    169EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            WF7316         6        30
     A                                    37'小計----------->'
     A            T07303         6  0     56EDTCDE(J)
     A            T07304         6  0     68EDTCDE(J)
     A            T07305         6  0     78EDTCDE(J)
     A            T07306         6  0     89EDTCDE(J)
     A            T07307         6  0    100EDTCDE(J)
     A            T07308         8  2    109EDTCDE(J)
     A            T07309         6  0    122EDTCDE(J)
     A            T07310        11  2    131EDTCDE(J)
     A            T07311         6  0    148EDTCDE(J)
     A            T07312         6  0    158EDTCDE(J)
     A            T07313         6  0    169EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    29'總　　　計------------->'
     A            T17303         6  0     56EDTCDE(J)
     A            T17304         6  0     68EDTCDE(J)
     A            T17305         6  0     78EDTCDE(J)
     A            T17306         6  0     89EDTCDE(J)
     A            T17307         6  0    100EDTCDE(J)
     A            T17308         8  2    109EDTCDE(J)
     A            T17309         6  0    122EDTCDE(J)
     A            T17310        11  2    131EDTCDE(J)
     A            T17311         6  0    148EDTCDE(J)
     A            T17312         6  0    158EDTCDE(J)
     A            T17313         6  0    169EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(2)
     A                                     2'<<POR055P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
