     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : POR051D                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/07/08                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POR051                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購系統                                  *
     A*    REMARK       :產品低於安全庫存量報表                    *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    46MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    48'產品低於安全庫存量報表'
     A                                      SPACEA(1)
     A                                    90'日期:'
     A            $EGMDY         6  0O    98EDTCDE(Y)
     A                                   107'頁次:'
     A                                   115PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DMA01S    R        O    +1REFFLD(MA01)
     A                                    +1'-'
     A            DMA01E    R        O    +1REFFLD(MA01)
     A                                    90'時間:'
     A                                    98TIME
     A                                      SPACEA(1)
     A                                     1'選擇類別:'
     A            DATA           1        +1
     A N71                                16'全部'
     A  71                                16'低於安全量者'
     A                                    90' USER :'
     A            $USER         10   O    98
     A                                   109'<POR051P>'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================')
     A                                      SPACEA(1)
     A                                    52'--安全量--'
     A                                    70'--庫存量--'
     A                                    88'供應商'
     A                                   100'供應商'
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    12'英文簡稱'
     A                                    28'中文簡稱'
     A                                    51'保稅'
     A                                    59'完稅'
     A                                    69'保稅'
     A                                    77'完稅'
     A                                    88'代　號'
     A                                   100'簡　稱'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      -------------------')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            MA01      R              2
     A            MA06      R             12
     A            MA03      R             28
     A            MA37      R             48EDTCDE(J)
     A            MA38      R             56EDTCDE(J)
     A            MA29      R             66EDTCDE(J)
     A            MA30      R             74EDTCDE(J)
     A            MA12      R             89
     A            MB03      R            100
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================')
     A                                      SPACEB(1)
     A                                     2'***續下頁***'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================')
     A                                      SPACEB(1)
     A                                     2'<<POR051P>>--->報表結束'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================')
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE9                       SPACEB(1)
     A                                     3'もも此範圍無資料もも'
