     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : POR058D                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 10/23/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POR058                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購資料子系統                            *
     A*    REMARK       :國內供應商進貨明細表                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    45MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    49'國內供應商進貨明細'
     A                                      SPACEA(2)
     A                                     1'供應商　　:'
     A            DPH06S    R             15REFFLD(PH06)
     A                                    +1'-'
     A            DPH06E    R             +1REFFLD(PH06)
     A                                      SPACEA(1)
     A                                     1'產品代號　:'
     A            DPI04S    R             15REFFLD(PI04)
     A                                    +1'-'
     A            DPI04E    R             +1REFFLD(PI04)
     A                                    97'日期:'
     A            $EGMDY         6  0O    +1EDTCDE(Y)
     A                                    +1'頁次:'
     A                                    +1PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'進貨物流點:'
     A            DPH05S    R             15REFFLD(PH05)
     A                                    +1'-'
     A            DPH05E    R             +1REFFLD(PH05)
     A                                    97'時間:'
     A                                    +1TIME
     A                                      SPACEA(1)
     A                                     1'進貨日期　:'
     A            DPH04S         4  0     15EDTWRD('  /  ')
     A                                    +1'-'
     A            DPH04E         4  0     +1EDTWRD('  /  ')
     A                                    97' USER :'
     A            $USER         10   O    +1
     A                                    +2'<POR058P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     1'進貨物流點'
     A                                    31'供應商代號／簡稱'
     A                                    56'產品代號／簡稱'
     A                                    84'進貨月份'
     A                                    94'單位'
     A                                   101'驗收數量'
     A                                   120'金　額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        WF9101    R              2REFFLD(PH05)
     A N30        ME04      R             +1REFFLD(ME04)
     A N31        WF9102    R             32REFFLD(PH06)
     A N31        MB03          18        38
     A N32        WF9103    R             57REFFLD(PI04)
     A N32        MA03          18        67
     A            D9104          4  0     86EDTWRD('  /  ')
     A            MA14      R             93REFFLD(MA14)
     A            WF9106         8  0    100EDTCDE(J)
     A  34        WF9107        13  2    113EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    85'小計------->'
     A            T0T06          8  0    100EDTCDE(J)
     A  34        T0T07         13  2    113EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==========='
     A                                      SPACEA(1)
     A                                     2'<<POR058P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
