     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : POR042P                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/01/21                                   *
     A*    UPDATE DATE  : 81/01/27                                   *
     A*    PROGRAM NAME : POR042                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購系統                                  *
     A*    REMARK       :產品報價比較表列印　                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    55MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    61'產品報價比較表'
     A                                      SPACEA(1)
     A                                   104'日期:'
     A            $EGMDY         6  0O   111EDTCDE(Y)
     A                                   123'頁次:'
     A                                   130PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'供應商類別'
     A                                    14':'
     A            DPA01     R    1        +1REFFLD(PA01)
     A            P#A030         6   O    +2
     A                                   104'時間:'
     A                                   111TIME
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    14':'
     A            DPA03S    R             +1REFFLD(PA03)
     A                                    +0'～'
     A            DPA03E    R             +0REFFLD(PA03)
     A                                   104' USER :'
     A            $USER         10   O   111
     A                                   123'<POR042>'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===========-
     A                                      ===========================')
     A                                      SPACEA(1)
     A                                     1'產品代號／名稱'
     A                                    27'單位'
     A                                    34'供應商／名稱'
     A                                    60'報價條件'
     A                                    87'單價'
     A                                    95'生效日期'
     A                                   105'截止日期'
     A                                   115'付款條件'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------
     A                                      ---------------------------')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            PA03      R              2
     A            MA06      R             12
     A            MA14      R             28
     A            PA01      R             35
     A            MB03      R             41
     A            PA10      R             60
     A            P#A031        18        63
     A            PA08      R             82
     A            PA09      R             85
     A                                      EDTCDE(J)
M001DA*           PA04      R             96
M001AA            DPA04          6  0     96
     A                                      EDTWRD('  /  /  ')
M001DA*           PA06      R            106
M001AA            DPA06          6  0    106
     A                                      EDTWRD('  /  /  ')
     A            PA07      R            116
     A            P#A032        20       119
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===========-
     A                                      ===========================')
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===========-
     A                                      ===========================')
     A                                      SPACEA(1)
     A                                     2'<<POR042>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
