     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : POR041P                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/01/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POR041                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購系統                                  *
     A*    REMARK       :供應商報價明細表列印                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    55MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    60'供應商報價明細表'
     A                                      SPACEA(1)
     A                                     1'供應商類別'
     A                                    13':'
     A            DPA01     R    1        +1REFFLD(PA01)
     A            P#A030         6   O    +2
     A                                   105'日期:'
     A            $EGMDY         6  0O   115EDTCDE(Y)
     A                                   125'頁次:'
     A                                   132PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'供應商代號'
     A                                    13':'
     A            PA01      R             +1
     A            MB03      R             +2
     A                                   105'時間:'
     A                                   115TIME
     A                                      SPACEA(1)
     A                                     1'列印內容'
     A                                    13':'
     A            PDETAL         6   O    +1
     A                                   105' USER :'
     A            $USER         10   O   115
     A                                   126'<POR041>'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======')
     A                                      SPACEA(1)
     A                                     1'產品代號／名稱'
     A                                    27'供應商產品'
     A                                    40'單位'
     A                                    46'報價價格條件'
     A                                    78'單價'
     A                                    85'生效日期'
     A                                    95'截止日期'
     A                                   105'付款條件'
     A                                   128'報價單號'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            PA03      R              2
     A            MA06      R             12
     A            PA05      R             27
     A            MA14      R             40
     A            PA10      R             47
     A            P#A031        22        50
     A            PA08      R             72
     A            PA09      R             75
     A                                      EDTCDE(J)
M001DA*           PA04      R             86
M001AA            DPA04          6  0     86
     A                                      EDTWRD('  /  /  ')
M001DA*           PA06      R             96
M001AA            DPA06          6  0     96
     A                                      EDTWRD('  /  /  ')
     A            PA07      R            105
     A            P#A032        20       108
     A            PA02      R            129
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======')
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======')
     A                                      SPACEA(1)
     A                                     2'<<POR041>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
