     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : POR062P                                    *
     A*    AUTHOR       :                                            *
     A*    CREATE DATE  : 11/02/96                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POR0622                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購系統                                  *
     A*    REMARK       :國內進貨報價明細表　                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    75MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    80'國外採購成本差異表'
     A                                      SPACEA(1)
     A                                   144'日期:'
     A            $EGMDY         6  0O   154EDTCDE(Y)
     A                                   164'頁次:'
     A                                   171PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                   144'時間:'
     A                                   154TIME
     A                                      SPACEA(1)
     A                                     1'到貨日期:'
     A            DPD04          6  0     14EDTCDE(Y)
     A                                   144' USER :'
     A            $USER         10   O   154
     A                                   167'<POR062>'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===========-
     A                                      ============================')
     A                                      SPACEA(1)
     A                                    75''
     A                                    82'---本次採購---'
     A                                   106''
     A                                   119'--------  上次採購　--------'
     A                                   155''
     A                                      SPACEA(1)
     A                                     1'供應商代號'
     A                                    15'供應商簡稱'
     A                                    38'產品代號'
     A                                    50'產品簡稱'
     A                                    75''
     A                                    77'驗收單號'
     A*                                   78'進貨日期'
     A                                    94'平均成本'
     A                                   106''
     A                                   111'驗收單號'
     A                                   129'進貨日期'
     A                                   144'平均成本'
     A                                   155''
     A                                   163'成本差異'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------
     A                                      ----------------------------')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF904     R              2REFFLD(WF904 *LIBL/REW109)
     A            MB03      R             16REFFLD(MB03)
     A            WF905     R             39REFFLD(WF905 *LIBL/REW109)
     A            MA03      R             50REFFLD(MA03)
     A            WF902     R             77REFFLD(WF902 *LIBL/REW109)
     A*           WF903     R             77REFFLD(WF903 *LIBL/REW109)
     A*                                     EDTWRD('  /  /  ')
     A            WF908     R             92REFFLD(WF908 *LIBL/REW109)
     A                                      EDTCDE(N)
     A            PF902     R            112REFFLD(WF902 *LIBL/REW109)
M001MA*           PF903     R            130REFFLD(WF903 *LIBL/REW109)
M001MA            PF903          6  0    130
     A                                      EDTWRD('  /  /  ')
     A            PF908     R            142REFFLD(WF908 *LIBL/REW109)
     A                                      EDTCDE(N)
     A            TEMP           7  2    162EDTCDE(N)
     A*----------------------------------------------------------------
     A          R PD2
     A                                      SPACEB(2)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===========-
     A                                      ============================')
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===========-
     A                                      ============================')
     A                                      SPACEA(1)
     A                                     2'<<POR062>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
