     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : POR043P                                    *
     A*    AUTHOR       : A1118  PHILIP                              *
     A*    CREATE DATE  : 81/04/23                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POR043                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :採購資料子系統                            *
     A*    REMARK       :採購單                                    *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(02)
     A                                     1' '
     A                                      SPACEA(7)
     A*                                   26MSGCON(030 URE9999 REMF)
     A*                                     SPACEA(1)
     A*                                   30'採購單'
     A*                                     SPACEA(2)
     A*                                   51'SUPPLIER'
     A            MB02      R              3
     A            PB02      R             91
     A                                      SPACEA(1)
     A            MB06      R              3
     A            MB041     R              3REFFLD(MB04)
     A            WPB04         13        91SPACEA(1)
     A            MB07      R              3
     A            MB042     R              3REFFLD(MB04)
     A            WPAGE          3  0     91
     A                                      SPACEA(1)
     A            MB08      R              3
     A            MB043     R              3REFFLD(MB04)
     A            #A033     R             91REFFLD(#A03)
     A                                      SPACEA(1)
     A            MB09      R              3
     A            MB044     R              3REFFLD(MB04)
     A            #A031     R             91REFFLD(#A03)
     A                                      SPACEA(1)
     A            MB10      R              3
     A            MB045     R              3REFFLD(MB04)
     A            #A032     R             91REFFLD(#A03)
     A                                      SPACEA(1)
     A            MB046     R              3REFFLD(MB04)
     A            #A034     R             91REFFLD(#A03)
     A                                      SPACEA(1)
     A            WPB14         13        91SPACEA(1)
     A            WPB15         13        91SPACEA(1)
     A                                    79'PRINTER    :'
     A            PB21      R             91
     A                                      SPACEA(4)
     A*                                   +2'<POR043P>'
     A*                                     SPACEA(1)
     A*                                    1'====================+
     A*                                      ====================+
     A*                                      ====================+
     A*                                      ===================='
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            PC03      R              3
     A            MA024     R             16REFFLD(MA02)
     A            MA17      R             55
     A            PC09      R             69
     A            PC06      R             80EDTCDE(1)
     A            PC07      R             91EDTCDE(1)
     A            PC08      R            108EDTCDE(1)
     A                                      SPACEA(1)
     A  30        MA05      R             16
     A                                    52' '
     A*----------------------------------------------------------------
     A*         R PD2
     A*                                    1'====================+
     A*                                      ====================+
     A*                                      ====================+
     A*                                      ===================='
     A*                                     SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1                       SKIPB(61)
     A                                    48'-- CONTINUE --'
     A                                      SPACEA(2)
     A*----------------------------------------------------------------
     A          R PE2                       SKIPB(42)
     A  80                                55'TOTAL  TAX  :'
     A  80        PB22      R            109EDTCDE(1)
     A  80                                  SPACEA(1)
     A                                    55'TOTAL       :'
     A            WQTY      R             80REFFLD(PC06)
     A                                      EDTCDE(1)
     A            WAMT      R            108REFFLD(PB08)
     A                                      EDTCDE(1)
     A                                      SPACEA(3)
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A            PJ03      R              3
     A*----------------------------------------------------------------
     A          R PE4                       SKIPB(61)
     A                                    52'-- END --'
     A                                      SPACEA(2)
