     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : POR059P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/05                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POR059                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品銷售統計表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    81
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
     A                                    87
     A                                      '國外到貨統計年表'
     A                                      SPACEA(002)
     A                                     1
     A                                      '公　　司:'
     A            WF0201    R        O    +1
     A                                      REFFLD(WF0201 *LIBL/REWF02)
     A            #B03      R        O    +1
     A                                   166
     A                                      '日期:'
     A            $EGMDY         6  0O   173
     A                                      EDTCDE(Y)
     A                                   183
     A                                      '頁次:'
     A                                   190
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1
     A                                      '供應商　:'
     A            WF0202    R        O    +1
     A                                      REFFLD(WF0202 *LIBL/REWF02)
     A            MB03      R        O    +1
     A                                   166
     A                                      '時間:'
     A                                   173
     A                                      TIME
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號:'
     A            DPE04S    R        O    +1
     A                                      REFFLD(PE04)
     A                                    +1
     A                                      '-'
     A            DPE04E    R        O    +1
     A                                      REFFLD(PE04)
M001AA                                    84'***數量以標準箱數計***'
     A                                   166
     A                                      ' USER :'
     A            $USER         10   O   173
     A                                   185
     A                                      '<POR059>'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================'
     A                                      SPACEA(001)
     A                                    30'單位'
     A                                    38'採購'
M001MA*                                   49'包裝'
M001MA                                    46'包裝'
M001AA                                    57'標準'
     A                                      SPACEA(001)
     A                                     1'產品代號'
     A                                    11'產品簡稱'
     A                                    30'轉換'
     A                                    38'單位'
M001MA*                                   49'說明'
M001MA                                    46'說明'
M001AA                                    57'容積'
     A            MM01           2  0O    66
     A                                      EDTCDE(1)
     A                                    68'/'
     A            YY01           2  0O    69
     A                                      EDTCDE(1)
     A            MM02           2  0O    76
     A                                      EDTCDE(1)
     A                                    78
     A                                      '/'
     A            YY02           2  0O    79
     A                                      EDTCDE(1)
     A            MM03           2  0O    86
     A                                      EDTCDE(1)
     A                                    88
     A                                      '/'
     A            YY03           2  0O    89
     A                                      EDTCDE(1)
     A            MM04           2  0O    96
     A                                      EDTCDE(1)
     A                                    98
     A                                      '/'
     A            YY04           2  0O    99
     A                                      EDTCDE(1)
     A            MM05           2  0O   106
     A                                      EDTCDE(1)
     A                                   108
     A                                      '/'
     A            YY05           2  0O   109
     A                                      EDTCDE(1)
     A            MM06           2  0O   116
     A                                      EDTCDE(1)
     A                                   118
     A                                      '/'
     A            YY06           2  0O   119
     A                                      EDTCDE(1)
     A            MM07           2  0O   126
     A                                      EDTCDE(1)
     A                                   128
     A                                      '/'
     A            YY07           2  0O   129
     A                                      EDTCDE(1)
     A            MM08           2  0O   136
     A                                      EDTCDE(1)
     A                                   138
     A                                      '/'
     A            YY08           2  0O   139
     A                                      EDTCDE(1)
     A            MM09           2  0O   146
     A                                      EDTCDE(1)
     A                                   148
     A                                      '/'
     A            YY09           2  0O   149
     A                                      EDTCDE(1)
     A            MM10           2  0O   156
     A                                      EDTCDE(1)
     A                                   158
     A                                      '/'
     A            YY10           2  0O   159
     A                                      EDTCDE(1)
     A            MM11           2  0O   166
     A                                      EDTCDE(1)
     A                                   168
     A                                      '/'
     A            YY11           2  0O   169
     A                                      EDTCDE(1)
     A            MM12           2  0O   175
     A                                      EDTCDE(1)
     A                                   177
     A                                      '/'
     A            YY12           2  0O   178
     A                                      EDTCDE(1)
     A                                   189
     A                                      '總計'
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------------------'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A N30        WF0203    R        O     2
     A                                      REFFLD(WF0203 *LIBL/REWF02)
     A N30        MA03      R        O    +0
M001MA*           WF0216    R        O    +3
M001MA*                                     REFFLD(WF0216 *LIBL/REWF02)
M001MA            MA16      R        O    +3
     A                                      EDTCDE(1)
M001MA*           WF0217    R        O    +3
M001MA*                                     REFFLD(WF0217 *LIBL/REWF02)
M001MA            MA14      R        O    +3
     A            MA17      R        O    +2
M001AA            W#H03          6  2     +2EDTCDE(4)
     A            WF0204    R        O    64
     A                                      REFFLD(WF0204 *LIBL/REWF02)
     A                                      EDTCDE(3)
     A            WF0205    R        O    72
     A                                      REFFLD(WF0205 *LIBL/REWF02)
     A                                      EDTCDE(3)
     A            WF0206    R        O    81
     A                                      REFFLD(WF0206 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            WF0207    R        O    91
     A                                      REFFLD(WF0207 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            WF0208    R        O   101
     A                                      REFFLD(WF0208 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            WF0209    R        O   111
     A                                      REFFLD(WF0209 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            WF0210    R        O   121
     A                                      REFFLD(WF0210 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            WF0211    R        O   131
     A                                      REFFLD(WF0211 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            WF0212    R        O   141
     A                                      REFFLD(WF0212 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            WF0213    R        O   151
     A                                      REFFLD(WF0213 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            WF0214    R        O   161
     A                                      REFFLD(WF0214 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            WF0215    R        O   171
     A                                      REFFLD(WF0215 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            TOTAL         11  0O   181
     A                                      EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PT1
     A                                      SPACEA(001)
     A                                    11
     A                                      '產品小計---------------------+
     A                                      ---------------->'
     A            T1TOT1    R        O    61
     A                                      REFFLD(WF0204 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TOT2    R        O    71
     A                                      REFFLD(WF0205 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TOT3    R        O    81
     A                                      REFFLD(WF0206 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TOT4    R        O    91
     A                                      REFFLD(WF0207 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TOT5    R        O   101
     A                                      REFFLD(WF0208 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TOT6    R        O   111
     A                                      REFFLD(WF0209 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TOT7    R        O   121
     A                                      REFFLD(WF0210 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TOT8    R        O   131
     A                                      REFFLD(WF0211 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TOT9    R        O   141
     A                                      REFFLD(WF0212 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TO10    R        O   151
     A                                      REFFLD(WF0213 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TO11    R        O   161
     A                                      REFFLD(WF0214 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TO12    R        O   171
     A                                      REFFLD(WF0215 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T1TO13        11  0O   181
     A                                      EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PT2
     A                                      SPACEA(001)
     A                                    11
     A                                      '供應商合計　-----------------+
     A                                      ---------------->'
     A            T2TOT1    R        O    61
     A                                      REFFLD(WF0204 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TOT2    R        O    71
     A                                      REFFLD(WF0205 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TOT3    R        O    81
     A                                      REFFLD(WF0206 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TOT4    R        O    91
     A                                      REFFLD(WF0207 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TOT5    R        O   101
     A                                      REFFLD(WF0208 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TOT6    R        O   111
     A                                      REFFLD(WF0209 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TOT7    R        O   121
     A                                      REFFLD(WF0210 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TOT8    R        O   131
     A                                      REFFLD(WF0211 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TOT9    R        O   141
     A                                      REFFLD(WF0212 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TO10    R        O   151
     A                                      REFFLD(WF0213 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TO11    R        O   161
     A                                      REFFLD(WF0214 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TO12    R        O   171
     A                                      REFFLD(WF0215 *LIBL/REWF02)
     A                                      EDTCDE(1)
     A            T2TO13        11  0O   181
     A                                      EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================'
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================'
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<POR059>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                      SPACEA(001)
     A                                     3
     A                                      'もも此範圍無資料もも'
