     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : POR065P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 09/09/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POR065                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :建議產品採購表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    41MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    40'建議產品採購表含完稅可用量'
     A                                      SPACEA(1)
     A                                    48'もも含禮盒もも'
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DMA01S    R             +1REFFLD(MA01)
     A                                    +1'-'
     A            DMA01E    R             +1REFFLD(MA01)
     A                                      SPACEA(1)
     A                                     1'銷售計算月數:'
     A            DSEL1          2  0O    +1
     A                                    91'日期:'
     A            $EGMDY         6  0O    99EDTCDE(Y)
     A                                   107'頁次:'
     A                                   115PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'安全庫存量保留月數:'
     A            DSEL2          2  0O    +1
     A                                    91'時間:'
     A                                    99TIME
     A                                      SPACEA(1)
     A*                                    1'是否含INACTIVE:'
     A*           DMA58          1   O    +1
     A*                                     SPACEA(1)
     A                                     1'是否含試飲:'
     A            DSEL3          1   O    +1
     A                                    51'單位：瓶'
     A                                    92'USER :'
     A            $USER         10   O    99
     A                                   110'<POR065>'
     A                                      SPACEA(1)
     A                                     1'=====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     1'產品代號／名稱'
     A                                    29'目前庫存量'
     A                                    41'壞品量'
     A                                    51'平均每月出貨量'
     A                                    67'採購在途量'
     A                                    80'推算安全庫存量'
     A                                    97'建議採購量'
     A                                   110'採購註記'
     A                                   121'可用量加未送貨量W0005'
     A                                      SPACEA(1)
     A                                     1'---------------------+
     A                                       ---------------------+
     A                                       ---------------------+
     A                                       ---------------------+
     A                                       ---------------------+
     A                                       ---------------------+
     A                                       -------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF8501    R              2REFFLD(WF8501 *LIBL/REWFC7)
     A            MA03      R             +1
     A            WF8502    R             32REFFLD(WF8502 *LIBL/REWFC7)
     A                                      EDTCDE(J)
     A            PIA08     R             40REFFLD(IA08 *LIBL/IMIAPF)
     A                                      EDTCDE(J)
     A            AVE1           9  0     55
     A                                      EDTCDE(J)
     A            WF8504    R             67REFFLD(WF8504 *LIBL/REWFC7)
     A                                      EDTCDE(J)
     A            TOT1          10  0     81
     A                                      EDTCDE(J)
     A            TOT2          10  0     95
     A                                      EDTCDE(J)
     A            MARK           1       113
     A            WF8506    R            126REFFLD(WF8506 *LIBL/REWFC7)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     2'總　　　計------------->'
     A            TOT001    R             32REFFLD(WF8502 *LIBL/REWFC7)
     A                                      EDTCDE(J)
     A            TOT002    R             40REFFLD(IA08 *LIBL/IMIAPF)
     A                                      EDTCDE(J)
     A            TOT003    R             67REFFLD(WF8504 *LIBL/REWFC7)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'=====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'=====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       =====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'<<POR057>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
