     A*****************************************************************
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*------|------|----------------------------|--------------------|
     A*  01  |PT#APF|成本中心資料檔            |#A01                |
     A*  02  |PT#BPF|公司基本資料檔            |#B01                |
    @A*  03  |PT#CPF|客戶基本資料檔            |#C01+#C02           |
    @A*  04  |PT#DPF|廠商基本資料檔            |#D01+#D02           |
    @A*  05  |PT#EPF|員工基本資料檔            |#E01+#E02           |
     A*  06  |PT#FPF|客戶餘額資料檔            |#F01+#F02           |
     A*  07  |PT#GPF|廠商餘額資料檔            |#G01+#G02           |
     A*  24  |PT#XPF|參數基本資料檔            |#X01+#X02           |
     A*  25  |PT#YPF|代碼基本資料檔            |#Y01+#Y02           |
     A*  26  |PT#ZPF|代碼欄位資料檔　          |#Z01                |
     A*****************************************************************
     A          R PTRFR
     A*****************************************************************
     A* 01      PT#APF 成本中心資料檔
     A* PKEY .... #A01                      NO-DUP
     A*****************************************************************
     A            #A01           6          COLHDG('成本中心')
     A            #A02          14O         COLHDG('中文簡稱')
     A            #A03          14O         COLHDG('英文簡稱')
     A            #A04          12          COLHDG('主管電話')
     A            #A05           3P 0       COLHDG('編制人力')
     A            #A06           1          COLHDG('費用別')
     A*                                     '1'  -> 管理
     A*                                     '2'  -> 推銷
     A*                                     '3'  -> 研發
     A*                                     '4'  -> 製造
     A*
     A            #A07          62O         COLHDG('所在位置')
     A            #A08          12          COLHDG('電話號碼')
     A            #A09          12          COLHDG('傳真號碼')
     A            #A10           1          COLHDG('類別')
     A*                                     '1'  -> 正式
     A*                                     '2'  -> 虛擬
     A*
     A            #A11           1          COLHDG('性質')
     A*                                     產品線，部門別
     A            #A97           6S 0       COLHDG('異動時間')
     A            #A98           8S 0       COLHDG('異動日期')
     A            #A99          10          COLHDG('異動人員')
     A*****************************************************************
     A* 02      PT#BPF 公司基本資料檔
     A* PKEY .... #B01                      NO-DUP
     A*****************************************************************
     A            #B01           2          COLHDG('公司編號')
     A            #B02          12O         COLHDG('公司簡稱')
     A            #B03          32O         COLHDG('公司中文全名')
     A            #B04           8          COLHDG('統一編號')
     A            #B05          10          COLHDG('稅籍編號')
     A            #B06          12          COLHDG('公司電話１')
     A            #B07          12          COLHDG('公司電話２')
     A            #B08          12          COLHDG('工廠電話１')
     A            #B09          12          COLHDG('工廠電話２')
     A            #B10          62O         COLHDG('公司地址')
     A            #B11          62O         COLHDG('工廠地址')
     A            #B12           1          COLHDG('類別')
     A*                                     '1'  -> 正式
     A*                                     '2'  -> 虛擬
     A            #B13          14O         COLHDG('所得扣繳義務人')
     A            #B14           4          COLHDG('所得扣繳媒體單位')
     A            #B15          32O         COLHDG('公司英文全名')
     A            #B16          32O         COLHDG('公司中文全名－中點')
     A            #B17          32O         COLHDG('公司英文全名－中點')
     A*
     A            #B97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #B98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #B99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 03      PT#CPF 客戶基本資料檔
     A* PKEY .... #C01+#C02                 NO-DUP
     A*****************************************************************
     A            #C01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            #C02          10          COLHDG('客戶代號')
     A            #C03          10O         COLHDG('客戶簡稱')
     A            #C04          42O         COLHDG('客戶名稱')
     A            #C05          62O         COLHDG('發票地址')
     A            #C06      R               COLHDG('送貨地址')
     A                                      REFFLD(#C05)
     A            #C07          14O         COLHDG('負責人')
     A            #C08      R               COLHDG('聯絡人一')
     A                                      REFFLD(#C07)
     A            #C09          15          COLHDG('電話一')
     A            #C10      R               COLHDG('聯絡人二')
     A                                      REFFLD(#C07)
     A            #C11      R               COLHDG('電話二')
     A                                      REFFLD(#C09)
     A            #C12      R               COLHDG('傳真號碼')
     A                                      REFFLD(#C09)
     A            #C13           1          COLHDG('國內外別')
     A*                                     '1'  -> 國內
     A*                                     '2'  -> 國外
     A            #C14           8          COLHDG('應收票據科目')
     A            #C21           8A         COLHDG('統一編號')
     A            #C22      R               COLHDG('總公司編號')
     A                                      REFFLD(#C02)
     A            #C23          10          COLHDG('業務員編號')
     A            #C24           2  0       COLHDG('對帳日期')
     A            #C90          62O         COLHDG('備註')
     A*
     A            #C97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #C98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #C99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 04      PT#DPF 廠商基本資料檔
     A* PKEY .... #D01+#D02                 NO-DUP
     A*****************************************************************
     A            #D01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            #D02      R               COLHDG('廠商代號')
     A                                      REFFLD(#C02)
     A            #D03      R               COLHDG('廠商簡稱')
     A                                      REFFLD(#C03)
     A            #D04      R               COLHDG('廠商名稱')
     A                                      REFFLD(#C04)
     A            #D05      R               COLHDG('廠商地址１')
     A                                      REFFLD(#C05)
     A            #D06      R               COLHDG('廠商地址２')
     A                                      REFFLD(#C05)
     A            #D07      R               COLHDG('負責人')
     A                                      REFFLD(#C07)
     A            #D08      R               COLHDG('聯絡人一')
     A                                      REFFLD(#C07)
     A            #D09      R               COLHDG('電話一')
     A                                      REFFLD(#C09)
     A            #D10      R               COLHDG('聯絡人二')
     A                                      REFFLD(#C07)
     A            #D11      R               COLHDG('電話二')
     A                                      REFFLD(#C09)
     A            #D12      R               COLHDG('傳真號碼')
     A                                      REFFLD(#C09)
     A            #D13      R               COLHDG('國內外別')
     A                                      REFFLD(#C13)
     A            #D14      R               COLHDG('應付票據科目')
     A                                      REFFLD(#C14)
     A            #D15           3  0       COLHDG('票據郵寄金額')
     A            #D90      R               COLHDG('備註')
     A                                      REFFLD(#C90)
     A*
     A            #D97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #D98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #D99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 05      PT#EPF 員工基本資料檔
     A* PKEY .... #E01+#E02                 NO-DUP
     A*****************************************************************
     A            #E01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            #E02          10          COLHDG('員工代號')
     A            #E03      R               COLHDG('員工姓名')
     A                                      REFFLD(#C07)
     A            #E04          20          COLHDG('英文姓名')
     A            #E05           2          COLHDG('血型')
     A            #E06          11          COLHDG('身份証號')
     A            #E07           1          COLHDG('性別')
     A*                                     'F' -女
     A*                                     'M' -男
     A            #E08           8  0       COLHDG('出生日期')
     A            #E09      R               COLHDG('通訊地址')
     A                                      REFFLD(#C05)
     A            #E10      R               COLHDG('戶籍地址')
     A                                      REFFLD(#C05)
     A            #E11      R               COLHDG('通訊電話')
     A                                      REFFLD(#C09)
     A            #E12      R               COLHDG('戶籍電話')
     A                                      REFFLD(#C09)
     A            #E13      R               COLHDG('連絡人')
     A                                      REFFLD(#C07)
     A            #E14      R               COLHDG('連絡人電話')
     A                                      REFFLD(#C07)
     A            #E90      R               COLHDG('備註')
     A                                      REFFLD(#C90)
     A*
     A            #E97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #E98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #E99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 06      PT#FPF 客戶基本資料檔
     A* PKEY .... #F01+#F02                 NO-DUP
     A*****************************************************************
     A            #F01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            #F02      R               COLHDG('客戶代號')
     A                                      REFFLD(#C02)
     A            #F03           9  0       COLHDG('應收帳款餘額')
     A            #F04      R               COLHDG('應收票據餘額')
     A                                      REFFLD(#F03)
     A            #F05      R               COLHDG('已收未沖餘額')
     A                                      REFFLD(#F03)
     A            #F06      R               COLHDG('信用額度金額')
     A                                      REFFLD(#F03)
     A*
     A            #F97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #F98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #F99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 07      PT#GPF 廠商基本資料檔
     A* PKEY .... #G01+#G02                 NO-DUP
     A*****************************************************************
     A            #G01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            #G02      R               COLHDG('廠商代號')
     A                                      REFFLD(#D02)
     A            #G03      R               COLHDG('應付帳款餘額')
     A                                      REFFLD(#F03)
     A            #G04      R               COLHDG('應付票據餘額')
     A                                      REFFLD(#F03)
     A            #G05      R               COLHDG('已付未沖餘額')
     A                                      REFFLD(#F03)
     A            #G06      R               COLHDG('信用額度金額')
     A                                      REFFLD(#F03)
     A*
     A            #G97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #G98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #G99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 24      PT#XPF 系統參數資料檔
     A* PKEY .... #X01+#X02                 NO-DUP
     A*****************************************************************
     A            #X01           2          COLHDG('參數類別')
     A*                                     'CK' -> 票據
     A            #X02      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            #X03         256O         COLHDG('內容')
     A*
     A            #X97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #X98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #X99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 25      PT#YPF 代碼基本資料檔
     A* PKEY .... #Y01+#Y02                 NO-DUP
     A*****************************************************************
     A            #Y01          10          COLHDG('代碼欄位')
     A            #Y02          10          COLHDG('代碼編號')
     A            #Y03          32O         COLHDG('代碼說明')
     A            #Y04           1          COLHDG('維護碼')
     A*                                     'Y' -可由使用者維護
     A*                                     ELSE-須由系統維護
     A*
     A            #Y97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #Y98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #Y99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
     A*****************************************************************
     A* 26      PT#ZPF 代碼欄位資料檔
     A* PKEY .... #Z01                      NO-DUP
     A*****************************************************************
     A            #Z01      R               COLHDG('代碼欄位')
     A                                      REFFLD(#Y01)
     A            #Z02          22O         COLHDG('代碼名稱')
     A            #Z03           3P 0       COLHDG('代碼長度')
     A            #Z04           3P 0       COLHDG('說明長度')
     A            #Z05           1          COLHDG('維護碼')
     A*                                     'Y' -可由使用者維護
     A*                                     ELSE-須由系統維護
     A*
     A            #Z97      R               COLHDG('異動時間')
     A                                      REFFLD(#A97)
     A            #Z98      R               COLHDG('異動日期')
     A                                      REFFLD(#A98)
     A            #Z99      R               COLHDG('異動人員')
     A                                      REFFLD(#A99)
