     A*%%TS  SD  19961101  134249  D910454     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : REM000D                                    *
     A*    AUTHOR       : A1005   ROGER CHIEN                        *
     A*    CREATE DATE  : 80/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : REM000C                                    *
     A*    SYSTEM       :人頭馬匯東管理資訊系統                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPC1
     A*%%TS  SD  19961101  134249  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'REM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'進銷存收系統主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  5 12'01.代碼資料作業'
     A                                      DSPATR(UL)
     A                                  5 45'1A.促銷預算系統'
     A                                      DSPATR(UL)
     A                                  6 12'02.主檔資料作業'
     A                                      DSPATR(UL)
     A                                  7 12'03.採購系統作業'
     A                                      DSPATR(UL)
     A                                  7 45'13.採購系統報表二'
     A                                      DSPATR(UL)
     A                                  8 12'04.銷售訂單作業'
     A                                      DSPATR(UL)
     A                                  8 45'14.銷售訂單報表二'
     A                                      DSPATR(UL)
     A                                  9 12'05.銷售分析作業'
     A                                      DSPATR(UL)
     A                                  9 45'15.銷售分析報表二'
     A                                      DSPATR(UL)
     A                                 10 12'06.庫存系統作業'
     A                                      DSPATR(UL)
     A                                 10 45'16.庫存系統報表二'
     A                                      DSPATR(UL)
     A                                 11 12'07.盤點系統作業'
     A                                      DSPATR(UL)
     A                                 12 12'08.應收帳款作業'
     A                                      DSPATR(UL)
     A                                 12 45'18.應收帳款報表二'
     A                                      DSPATR(UL)
M002AA                                 13 45'19.媒體申報主畫面'
     A                                      DSPATR(UL)
     A                                 13 12'09.月報系統作業'
     A                                      DSPATR(UL)
M001MA                                 14 10'* 10.普銷系統作業'
     A                                      DSPATR(UL)
     A                                 16 12'21.產生傳票作業'
     A                                      DSPATR(UL)
M001MA                                 17 10'* 31.客戶管理系統'
     A                                      DSPATR(UL)
     A                                 18 32'80.安全管制作業'
     A                                      DSPATR(UL)
     A                                 19 32'90.結束系統作業'
     A                                      DSPATR(UL)
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('01' '02' '03' '04' '05' '06-
     A                                      ' '07' '08' '09' '14' '15' '16' '18-
     A                                      ' '1A' '13' '80' '90' '19' '21'    -
     A                                        ' ')
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
