     A******************************************************************
     A* Copyright   Remy Eastward Ltd.            1992
     A******************************************************************
     A*
     A*  DISPLAY FILE ID     -    POA001
     A*  DISPLAY FILE NAME   -    supplier quotation maint
     A*  DATE CREATED        -    Jan 10, 1992
     A*
     A******************************************************************
     A                                      PRINT
     A                                      CHGINPDFT
     A                                      INDARA
     A          R SCR001
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            PGM           10   O  1  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                  1 26'  Remy Eastward Ltd.          '
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  1 70DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                  2 26'supplier quotation maint      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                  2 70TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A            USER          10   O  3 70
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                  5  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  6  4'2=Revise'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  6 14'4=Delete'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A                                  6 24'5=Display'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A                                  6 35'6=POPAPF'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A                                  8  2'Action'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A                                  8 42'報價單號'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A          R SCR001S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            FL0001         1  0B  9  2
     A  80
     AO 01                                  DSPATR(PC)
     A  02                                  DSPATR(UL)
     A*                                     COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(RI)
     A            XA01      R        O  9 10REFFLD(PA01 POPALF)
     A*                                     DLTEDT
     A*                                     COLOR(BLU)
     A            FL0002        18   O  9 22
     A*                                     COLOR(BLU)
     A            XA02      R        O  9 42REFFLD(PA02 POPALF)
     A*                                     DLTEDT
     A*                                     COLOR(BLU)
     A            HRC01          9  0H
     A            HA01      R        H      REFFLD(PA01 POPALF)
     A                                      ALIAS(ALIAS00001)
     A            HA02      R        H      REFFLD(PA02 POPALF)
     A                                      ALIAS(ALIAS00002)
     A            HA03      R        H      REFFLD(PA03 POPALF)
     A                                      ALIAS(ALIAS00003)
     A            HB01      R        H      REFFLD(MB01 MTMBPF)
     A                                      ALIAS(ALIAS00004)
     A          R SCR001C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR001S1)
     A  64                                  SFLDSP
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(11)
     A                                      SFLSIZ(11)
     A                                      CF01 INDTXT(01 'Help')
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF06 INDTXT(06 'Create')
     A                                      CF07 INDTXT(07 'Bkwd')
     A                                      CF08 INDTXT(08 'Fwd')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            PS0101         5   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A*                                     COLOR(GRN)
     A  03                                  DSPATR(PR)
     A            PS0102        10   B 21 25
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A*                                     COLOR(GRN)
     A  04                                  DSPATR(PR)
     A            PS0103         9   B 21 37
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A*                                     COLOR(GRN)
     A  05                                  DSPATR(PR)
     A                                 23  2'Enter  F1=Help  F3=Exit  F6=Create-
     A                                        F7=Bkwd  F8=Fwd  F12=Cancel  '
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            RRN1           4S 0H      SFLRCDNBR
     A          R SCR002
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      OVERLAY
     A                                      CF01 INDTXT(01 'Help')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      CF14 INDTXT(14 'Process')
     A            PGM           10   O  1  2
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                  1 26'  Remy Eastward Ltd.          '
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  1 70DATE EDTCDE(Y)
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                  2 26'supplier quotation maint      '
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                  2 70TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A            USER          10   O  3 70
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                  4  2'供應商代號 . . . :'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            XA01      R        O  4 24REFFLD(PA01 POPALF)
     A*                                     DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  5  2'報價單號 . . . . :'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            XA02      R        O  5 24REFFLD(PA02 POPALF)
     A*                                     DLTEDT
     A*                                     COLOR(BLU)
     A                                      OVRDTA
     A                                      OVRATR
     A                                  6  2'生效日期 . . . . .'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A            XA04      R        B  6 24REFFLD(PA04 POPALF)
     A*                                     DLTEDT
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A*                                     COLOR(GRN)
     A                                      OVRDTA
     A                                      OVRATR
     A                                      EDTCDE(L)
     A  01                                  DSPATR(PR)
     A                                  7  2'幣別 . . . . . . .'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A            XA08      R        B  7 24REFFLD(PA08 POPALF)
     A*                                     DLTEDT
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(GRN)
     A  04                                  DSPATR(PR)
     A                                  8  2'付款條件 . . . . .'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A            XA07      R        B  8 24REFFLD(PA07 POPALF)
     A*                                     DLTEDT
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(GRN)
     A  03                                  DSPATR(PR)
     A                                  9  2'報價價格條件 . . .'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A            XA10      R        B  9 24REFFLD(PA10 POPALF)
     A*                                     DLTEDT
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(GRN)
     A  05                                  DSPATR(PR)
     A                                 10  2'交易價格條件 . . .'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A            XA11      R        B 10 24REFFLD(PA11 POPALF)
     A*                                     DLTEDT
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(GRN)
     A  06                                  DSPATR(PR)
     A                                 11  2'截止日期 . . . . .'
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A            XA06      R        B 11 24REFFLD(PA06 POPALF)
     A*                                     DLTEDT
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(GRN)
     A  02                                  DSPATR(PR)
     A                                 23  2'Enter  F1=Help  F12=Cancel  F14=Pr-
     A                                      ocess  '
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A          R SCR003
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A  99                                  OVERLAY
     A            PGM           10   O  1  2
     A                                      DSPATR(HI)
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  1 26'  Remy Eastward Ltd.          '
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A                                  1 70DATE EDTCDE(Y)
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A                                  2 26'supplier quotation maint      '
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                      OVRATR
     A                                  2 70TIME
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A            USER          10   O  3 70
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(HI)
     A*                                     COLOR(BLU)
     A                                  4  2'供應商代號 . . :'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            XA01      R        O  4 22REFFLD(PA01 POPALF)
     A*                                     DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  5  2'供應商簡稱 . . :'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            XB03      R        O  5 22REFFLD(MB03 MTMBPF)
     A*                                     DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  6  2'報價單號 . . . :'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            XA02      R        O  6 22REFFLD(PA02 POPALF)
     A*                                     DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  7  2'生效日期 . . . :'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            XA04      R        O  7 22REFFLD(PA04 POPALF)
     A*                                     DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                      EDTCDE(L)
     A                                  8  2'幣別 . . . . . :'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            XA08      R        O  8 22REFFLD(PA08 POPALF)
     A*                                     DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  9  2'付款條件 . . . :'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            XA07      R        O  9 22REFFLD(PA07 POPALF)
     A*                                     DLTEDT
     A                                      OVRDTA
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                 11  2'Type one or more action codes. The-
     A                                      n Enter.                           -
     A                                               '
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                 12  4'1=Create'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                 12 14'2=Revise'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                 12 24'4=Delete'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                 14  2'Action'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                 14 10'產品代號'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                 14 38'單價'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A          R SCR003S1
     A                                      SFL
     A  65                                  SFLNXTCHG
     A            WRK002    R        H      REFFLD(PA02 POPAPF)
     A            WRK001    R        H      REFFLD(PA01 POPAPF)
     A            FL0003         1  0B 15  2
     A  80
     AO 01                                  DSPATR(PC)
     A  02                                  DSPATR(UL)
     A*                                     COLOR(GRN)
     A                                      EDTCDE(Z)
     A  01                                  DSPATR(RI)
     A            XA03      R        B 15 10REFFLD(PA03 POPAPF)
     A*                                     DLTEDT
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A*                                     COLOR(GRN)
     A            XA05      R        B 15 22REFFLD(PA05 POPAPF)
     A*                                     DLTEDT
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A*                                     COLOR(GRN)
     A            XA09      R        B 15 38REFFLD(PA09 POPAPF)
     A*                                     DLTEDT
     A  80                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A*                                     COLOR(GRN)
     A            HRC03          9  0H
     A            HID001    R        H      REFFLD(PA01 POPAPF)
     A                                      ALIAS(ALIAS00005)
     A            HID002    R        H      REFFLD(PA02 POPAPF)
     A                                      ALIAS(ALIAS00006)
     A            HID003    R        H      REFFLD(PA03 POPAPF)
     A                                      ALIAS(ALIAS00007)
     A          R SCR003C1
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      SFLCTL(SCR003S1)
     A  64                                  SFLDSP
     A  63                                  SFLDSPCTL
     A N63                                  SFLCLR
     A  66                                  SFLINZ
     A N67                                  SFLEND
     A                                      OVERLAY
     A                                      SFLPAG(5)
     A                                      SFLSIZ(5)
     A                                      CF01 INDTXT(01 'Help')
     A                                      CF03 INDTXT(03 'Exit')
     A                                      CF07 INDTXT(07 'Bkwd')
     A                                      CF08 INDTXT(08 'Fwd')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                      ROLLDOWN(62 'Bkwd')
     A                                      ROLLUP(61 'Fwd')
     A                                 21  2'Position to . .'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            PS0301         9   B 21 18
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A*                                     COLOR(GRN)
     A                                 23  2'Enter  F1=Help  F3=Exit  F7=Bkwd  -
     A                                      F8=Fwd  F12=Cancel  '
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A            RRN2           4S 0H      SFLRCDNBR
     A          R SCR004
     A N79                                  PUTOVR
     A                                      SETOFF(79)
     A                                      PROTECT
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      CF01 INDTXT(01 'Help')
     A                                      CF12 INDTXT(12 'Cancel')
     A                                  3  3'                                '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  4  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  4  5'       '
     A                                  4 13'Exit Options'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  4 26'       '
     A                                  4 34' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  5  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  5  5'                            '
     A                                  5 34' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  6  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A            EXFLAG         1  0B  6  6
     A                                      OVRDTA
     A                                      OVRATR
     A                                      DSPATR(UL)
     A*                                     COLOR(GRN)
     A                                      EDTCDE(Z)
     A                                  6  8'1. Exit Program'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  6 24'         '
     A                                  6 34' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  7  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  7  5'  '
     A                                  7  8'2. Sign off'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  7 20'             '
     A                                  7 34' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  8  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  8  5'  '
     A                                  8  8'3. Resume'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                  8 18'               '
     A                                  8 34' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  9  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                  9  5'                            '
     A                                  9 34' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                 10  3' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                 10  6'Enter  F1=Help  F12=Cancel'
     A                                      OVRATR
     A*                                     COLOR(BLU)
     A                                 10 34' '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A                                 11  3'                                '
     A                                      OVRATR
     A                                      DSPATR(RI)
     A*                                     COLOR(TRQ)
     A*********************************************************************
     A          R PSSR0001                  CLRL(*NO) OVERLAY
     A                                  1 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  2 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  2 15'PSSR0001'
     A                                  2 24'       Execution Error Handler    -
     A                                                '
     A                                      DSPATR(HI)
     A                                  2 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  3 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  3 15'                                  -
     A                                                         '
     A                                  3 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  4 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  4 15'Job . . . . :'
     A            WSID          10A  O  4 29COLOR(WHT)
     A                                  4 40'  Program  . . :'
     A            PGM           10A  O  4 57COLOR(WHT)
     A                                  4 69' ' DSPATR(RI) COLOR(TRQ)
     A                                  5 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  5 15'User  . . . :'
     A            USER          10A  O  5 29COLOR(WHT)
     A                                  5 40'  Library  . . :'
     A            ULIB          10A  O  5 57COLOR(WHT)
     A                                  5 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  6 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  6 15'Number  . . :'
     A            UJOBN          6S 0O  6 29COLOR(WHT)
     A                                  6 36'      Compiled . . :'
     A            UCDAT          6Y 0O  6 57EDTCDE(Y)
     A*                                     COLOR(WHT)
     A                                  6 66'  '
     A                                  6 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  7 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  7 15'Routine . . :'
     A            UROUTN         8A  O  7 29COLOR(WHT)
     A                                  7 38'                  '
     A            UCTIM          6Y 0O  7 57EDTWRD('  :  :  ')
     A*                                     COLOR(WHT)
     A                                  7 66'  '
     A                                  7 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  8 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  8 15'Status Code :'
     A            USTAT4         4A  O  8 29COLOR(WHT)
     A                                  8 34'        Source Line. :'
     A            USRCLN         8A  O  8 57COLOR(WHT)
     A                                  8 66'  '
     A                                  8 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  9 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                  9 15'Message ID  :'
     A            MSGID          7A  O  9 29COLOR(WHT)
     A                                  9 37'     File Name  . :'
     A            UFILE          8A  O  9 57COLOR(WHT)
     A                                  9 66'  '
     A                                  9 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 10 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 10 15'                                  -
     A                                                         '
     A                                 10 42'Source Line  :'
     A                                 10 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 11 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A            UMESG1        51A  O 11 15DSPATR(HI) COLOR(RED)
     A                                 11 67' '
     A                                 11 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 12 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A            UMESG2        51A  O 12 15DSPATR(HI) COLOR(RED)
     A                                 12 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 13 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A            UMESG3        30A  O 13 15DSPATR(HI) COLOR(RED)
     A                                 13 46'                      '
     A                                 13 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 14 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 14 15'                                  -
     A                                                         '
     A                                 14 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 15 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 15 15'Select one of the following option-
     A                                      s. Then Enter.     '
     A                                 15 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 16 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 16 15'                                  -
     A                                                         '
     A                                 16 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 17 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A            UEROPT         1A  B 17 15DSPATR(UL HI)
     A                                      VALUES('1' '2' '3')
     A                                 17 17' 1. Continue at the beginning of p-
     A                                      rogram           '
     A                                 17 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 18 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 18 15'   2. Cancel the processing of the-
     A                                       program           '
     A                                 18 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 19 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 19 15'   3. Return control to the system-
     A                                       error handler     '
     A                                 19 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 20 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 20 15'                                  -
     A                                                         '
     A                                 20 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 21 13' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 21 15'Enter                             -
     A                                                         '
     A                                      DSPATR(HI)
     A                                 21 69' '
     A                                      DSPATR(RI) COLOR(TRQ)
     A                                 22 13'                                  -
     A                                                             '
     A                                      DSPATR(RI) COLOR(TRQ)
     A*********************************************************************
     A          R MSGRCD                    TEXT('MSG SFL RECORD')
     A                                      SFL
     A                                      SFLMSGRCD(24)
     A            MSGKEY                    SFLMSGKEY
     A            PGM                       SFLPGMQ
     A*********************************************************************
     A          R MSGCTL                    TEXT('MSG SFL CONTROL')
     A                                      OVERLAY SFLCTL(MSGRCD) SFLSIZ(10)
     A                                      SFLPAG(1) SFLDSPCTL SFLDSP SFLINZ
     A N98                                  SFLEND
     A            PGM                       SFLPGMQ
     A*
