     A*%%TS  SD  19920406  190516  REPGMRP     REL-V2R1M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R DSPD1
     A*%%TS  SD  19920406  190516  REPGMRP     REL-V2R1M0  5738-PW1
     A            FLD001         8A  O  1  3
     A                                  1 30'學生主檔維護'
     A                                  1 64'日期:'
     A            FLD002         6Y 0O  1 72EDTWRD('  /  /  ')
     A                                  4  6'學號:'
     A            FLD003         3Y 0B  4 14EDTCDE(4)
     A                                  6  6'姓名:'
     A            FLD005        10A  B  6 14
     A                                 12  6'分數:'
     A            FLD006         3Y 0B 12 14EDTCDE(3)
     A                                 10  6'班別:'
     A            FLD007         2A  B 10 14
     A                                 21  4'訊　息:'
     A            FLD009        60A  O 21 14
     A                                 23  4'功能鍵:'
     A                                 23 14'F3 : 結束'
     A                                 23 26'F13 : 新增'
     A                                 23 39'F15'
     A                                 23 43':'
     A                                 23 53'F17'
     A                                 23 57':'
     A                                 23 66'F19'
     A                                 23 70':'
     A                                 23 45'查詢'
     A                                 23 59'刪除'
     A                                 23 72'更新'
     A                                  8  6'生日:'
     A            FLD010         6Y 0B  8 14EDTWRD('  /  /  ')
