     A*%%TS  SD  19920820  112728  REPGMRP     REL-V2R1M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R SCR000
     A*%%TS  SD  19920820  112728  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                  7 26'原始使用者:'
     A                                 10 26'目的使用者:'
     A                                  1  3'S#CP01D'
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                 23  3'F3 :跳出'
     A            DBGN1         10A  B  7 42
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DBGN2         10A  B 10 42
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  98        ERR1          60O  O 23  2MSGID(URE 0093 REMF)
     A                                      DSPATR(HI)
     A  97        ERR2          60O  O 23  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          60O  O 23  2MSGID(URE 0094 REMF)
     A                                      DSPATR(HI)
     A                                  1 29'拷備使用者安全管制資料'
     A                                      DSPATR(HI)
