     A*%%TS  SD  19920820  131639  REPGMRP     REL-V2R1M0  5738-PW1
     A*  90/07/16  09:35:03    A1062       REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : S#M000CD                                   *
     A*    AUTHOR       : A1062   JEANNY LIN                         *
     A*    CREATE DATE  : 79/06/26                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : S#M000C                                    *
     A*    SYSTEM       :程式安全管制系統                          *
     A*    REMARK       :程式安全管制系統主畫面                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(22)
     A                                      PRINT
     A*  90/07/16  09:35:03    A1062       REL-R02M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19920820  131639  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      OVERLAY
     A                                  1  2'<S#M000D>'
     A                                  1 30'程式安全管制系統'
     A                                  1 62'日期:'
     A            DDATE          6Y 0O  1 70EDTCDE(Y)
     A            USERN         10O  O  2  3
     A                                  4 23'01. 使用者基本資料維護'
     A                                  4 50'(S#A110 )'
     A                                  5 23'02. 使用者管制資料維護'
     A                                  5 50'(S#A120 )'
     A                                  7 23'03. 程式基本資料維護　'
     A                                  7 50'(S#A140 )'
     A                                  8 23'04. 程式管制資料維護　'
     A                                  8 50'(S#A130 )'
     A                                 10 23'05. 依使用者列印管制資料'
     A                                 10 50'(S#R410 )'
     A                                 11 23'06. 依程式列印管制資料'
     A                                 11 50'(S#R420 )'
     A                                 12 23'07. 授權清冊　　　　　'
     A                                 12 50'(S#R430 )'
     A                                 17 23'80. 系統狀況查詢　　　'
     A                                 17 50'(ATN01  )'
     A                                 18 23'90. 結束　　　　　　　'
     A                                 20 27'請輸入選擇項目:'
     A            DOPT           2A  B 20 45
     A  98        ERR1          70A  O 22  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 67'【泛太資訊】'
     A                                 14 23'08. 使用者管制資料拷備　 (S#CP01-
     A                                       )'
     A                                 15 23'09. 程式管制資料拷備'
     A                                 15 50'(S#CP02 )'
