     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PRTF NAME    : S#R430P                                    *
     A*    AUTHOR       : A1062   JEANNY LIN                         *
     A*    CREATE DATE  : 79/07/14                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : S#R430                                     *
     A*    SYSTEM       :程式安全管制系統                          *
     A*    PURPOSE      :授權清冊                                  *
     A****************************************************************
     A                                      REF(*LIBL/S#RF)
     A*----------------------------------------------------------------
     A          R PH1                       SKIPB(2)
     A                                    28'程式安全管制系統'
     A                                      SPACEA(1)
     A                                    32'授權清冊'
     A                                      SPACEA(1)
     A                                    47'日期:'
     A            DDATE          6  0     55EDTCDE(Y)
     A                                    64'頁次:'
     A                                    71PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                    47'時間:'
     A                                    55TIME
     A                                      EDTCDE(Y)
     A                                    65'< S#R430 >'
     A                                      SPACEA(1)
     A                                     2'==============================+
     A                                       ==============================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                     2'授權者編號 授權者名稱'
     A                                    28'使用者編號 使用者名稱'
     A                                    54'使用者備註'
     A                                      SPACEA(1)
     A                                     2'==============================+
     A                                       ==============================+
     A                                       =============='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  38        PSU03     R              3REFFLD(SU03)
     A  38        PSU032    R             15REFFLD(SU02)
     A            PSU01     R             29REFFLD(SU01)
     A            PSU02     R             41REFFLD(SU02)
     A            PSU06     R             54REFFLD(SU06)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     2'==============================+
     A                                       ==============================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                    22'========== 接下頁 =========='
     A          R PE2
     A                                     2'==============================+
     A                                       ==============================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                    21'========== 報表結束 =========='
