     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PRTF NAME    : S#R4201P                                   *
     A*    AUTHOR       : A1062   JEANNY LIN                         *
     A*    CREATE DATE  : 79/07/03                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : S#R420                                     *
     A*    SYSTEM       :程式安全管制系統                          *
     A*    PURPOSE      :依程式列印管制資料                        *
     A****************************************************************
     A                                      REF(*LIBL/S#RF)
     A*----------------------------------------------------------------
     A          R PH1                       SKIPB(2)
     A                                    28'程式安全管制系統'
     A                                      SPACEA(1)
     A                                    27'依程式列印管制資料'
     A                                      SPACEA(1)
     A                                     1'程式編號:'
     A            SD02      R             13
     A                                    47'日期:'
     A            DDATE          6  0     55EDTCDE(Y)
     A                                    64'頁次:'
     A                                    71PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'程式名稱:'
     A            SP02      R             13
     A                                    47'時間:'
     A                                    55TIME
     A                                      EDTCDE(Y)
     A                                    65'< S#R420 >'
     A                                      SPACEA(1)
     A                                     1'程式類別:'
     A            DSP03          8        13
     A                                      SPACEA(1)
     A                                     1'備註欄１:'
     A            SP04      R             13
     A                                    28'備註欄２:'
     A            SP05      R             40
     A                                    54'備註欄３:'
     A            SP06      R             66
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     1'使用者編號　使用者名稱'
     A                                    26'ADD UPD DLT INQ MK1 MK2 MK3'
     A                                    54'使用者備註'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            SD01      R              2
     A            SU02      R             14
     A            SD03      R             27
     A            SD04      R             31
     A            SD05      R             35
     A            SD06      R             39
     A            SD07      R             43
     A            SD08      R             47
     A            SD09      R             51
     A            SU06      R             54
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                    22'========== 接下頁 =========='
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                    21'========== 報表結束 =========='
