     A*%%TS  SD  19920609  110200  REPGMRP     REL-V2R1M0  5738-PW1
     A*  80/11/19  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : SAA002D                                    *
     A*    AUTHOR       : A1084  CHARLES                             *
     A*    CREATE DATE  : 81/05/02                                   *
     A*    PROGRAM NAME : SAA002                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :專櫃目標達成率設定 (A/U/D/I)              *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*  91/05/13  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R SFLSR1                    SFL
     A*%%TS  SD  19920502  084025  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B 10  2VALUES(' ' '2' '4' '5')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            SL01      R        O 10  5
     A            ME04      R        O 10 11
M001MA*           SL02      R        O 10 32EDTCDE(1)
M001MA            X02            2  0O 10 32EDTCDE(1)
     A            SL03      R        O 10 37
     A            D#A03         22O  O 10 40
     A            SL04      R        O 10 68EDTCDE(1)
     A*  91/05/13  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19920609  110200  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CF06(06)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'SAA002'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'專櫃目標達成率設定'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A            DBGN1     R        B  9  5REFFLD(SL01)
M001MA*           DBGN2     R        B  9 32REFFLD(SL02)
M001MA            DBGN2          2  0B  9 32EDTCDE(1)
     A*M001D                                EDTCDE(2)
     A            DBGN3     R        B  9 37REFFLD(SL03)
     A                                  6  2'輸入作業選擇:'
     A                                  6 18'2=修改'
     A                                  6 28'4=刪除'
     A                                  6 38'5=查詢'
     A                                  8  2'A 專櫃                   年度 -
     A                                      產品識別                    銷+
     A                                      售目標金額'
     A                                      DSPATR(UL)
     A*
     A*  80/11/19  10:53:16    REPGMR      REL-R02M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19920501  110550  REPGMRP     REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F6 =新增'
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A  80                             24  2'訂單號碼'
     A                                      DSPATR(HI)
M001MA* 80        DSL02     R        O 24 13REFFLD(SL02)
M001MA  80        DSL02          2  0O 24 13
     A  80                                  DSPATR(RI)
     A  80                             24 26'新增成功'
     A                                      DSPATR(HI)
     A          R DSPD2
     A*%%TS  SD  19920519  082548  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CA12(12)
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'SAA002'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 30'專櫃目標達成率設定'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6  1'專櫃代號:'
     A            DSL01     R        B  6 13REFFLD(SL01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A N60                                  DSPATR(HI)
     A            ME04      R        O  6 19
     A                                  6 49'年度:'
M001MA*           DSL02     R        B  6 57REFFLD(SL02)
M001MA            DSL02          2  0B  6 57EDTCDE(1)
     A*M001D                                EDTCDE(2)
     A                                      CHECK(RB)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A                                  8  1'產品識別:'
     A            DSL03     R        B  8 13REFFLD(SL03)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A N62                                  DSPATR(HI)
     A            D#A03         22O  O  8 19
     A                                  8 45'銷售金額:'
     A            DSL04     R        O  8 57REFFLD(SL04)
     A                                      EDTCDE(2)
     A                                 12 12'4 /'
M001MA*           SL021     R        O 12 16REFFLD(SL02)
M001MA            SL021          2  0O 12 16
     A                                 12 24'5 /'
M001MA*           SL022     R        O 12 28REFFLD(SL02)
M001MA            SL022          2  0O 12 28
     A                                 12 36'6 /'
M001MA*           SL023     R        O 12 40REFFLD(SL02)
M001MA            SL023          2  0O 12 40
     A                                 12 47'7 /'
M001MA*           SL024     R        O 12 51REFFLD(SL02)
M001MA            SL024          2  0O 12 51
     A                                 12 60'8 /'
M001MA*           SL025     R        O 12 64REFFLD(SL02)
M001MA            SL025          2  0O 12 64
     A                                 12 72'9 /'
M001MA*           SL026     R        O 12 76REFFLD(SL02)
M001MA            SL026          2  0O 12 76
     A                                 13  1'金額'
     A            DSL05     R        B 13 10REFFLD(SL05)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL06     R        B 13 22REFFLD(SL06)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL07     R        B 13 34REFFLD(SL07)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL08     R        B 13 46REFFLD(SL08)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL09     R        B 13 58REFFLD(SL09)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL10     R        B 13 70REFFLD(SL10)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 16 11'10 /'
M001MA*           SL027     R        O 16 16REFFLD(SL02)
M001MA            SL027          2  0O 16 16
     A                                 16 23'11 /'
M001MA*           SL028     R        O 16 28REFFLD(SL02)
M001MA            SL028          2  0O 16 28
     A                                 16 35'12 /'
M001MA*           SL029     R        O 16 40REFFLD(SL02)
M001MA            SL029          2  0O 16 40
     A                                 16 47'1 /'
M001MA*           SL0210    R        O 16 51REFFLD(SL02)
M001MA            SL0210         2  0O 16 51
     A                                 16 60'2 /'
M001MA*           SL0211    R        O 16 64REFFLD(SL02)
M001MA            SL0211         2  0O 16 64
     A                                 16 72'3 /'
M001MA*           SL0212    R        O 16 76REFFLD(SL02)
M001MA            SL0212         2  0O 16 76
     A                                 17  1'金額'
     A            DSL11     R        B 17 10REFFLD(SL11)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL12     R        B 17 22REFFLD(SL12)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL13     R        B 17 34REFFLD(SL13)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL14     R        B 17 46REFFLD(SL14)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL15     R        B 17 58REFFLD(SL15)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSL16     R        B 17 70REFFLD(SL16)
     A                                      EDTCDE(2)
     A                                      CHECK(RB)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 22 42'F5 =參考資料'
     A                                 22 58'F12=回前畫面'
     A  96        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          63A  O 24  2MSGID(URE 0044 REMF)
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
