     A*%%TS  SD  19960328  142123  DERLERN     REL-V3R1M0  5763-PW1
     A*  80/11/15  13:46:08    REPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : SAM000D                                    *
     A*    AUTHOR       : A1005   ROGER CHIEN                        *
     A*    CREATE DATE  : 80/11/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAM000C                                    *
     A*    SYSTEM       :人頭馬匯東銷售分析系統                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A*  80/11/15  13:50:09    REPGMR      REL-R03M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19960328  142123  DERLERN     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'SAM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'銷售分析系統主畫面'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  5  2'              '
     A                                      DSPATR(RI)
     A                                 11  2'              '
     A                                      DSPATR(RI)
     A                                  6  2' '
     A                                      DSPATR(RI)
     A                                  6  4'資料維護'
     A                                  6 15' '
     A                                      DSPATR(RI)
     A                                 12  2' '
     A                                      DSPATR(RI)
     A                                 12  4'報表列印'
     A                                 12 15' '
     A                                      DSPATR(RI)
     A                                  7  2'              '
     A                                      DSPATR(RI)
     A                                 13  2'              '
     A                                      DSPATR(RI)
     A                                  5 17'01.銷售目標達成率設定'
     A                                      DSPATR(UL)
     A                                  6 17'02.專櫃目標達成率設定'
     A                                      DSPATR(UL)
     A                                  7 17'03.預估銷售目標資料維護'
     A                                      DSPATR(UL)
     A*                                11 17'41.地區達成率分析表'
     A*                                12 17'42.通路達成率分析表'
     A                                 13 17'43.通路地區達成率分析表'
     A                                      DSPATR(UL)
     A                                 14 17'44.月客戶銷售（退）統計'
     A                                      DSPATR(UL)
     A                                 15 17'45.月產品銷售（退）統計'
     A                                      DSPATR(UL)
     A                                 16 17'46.產品成長率分析表'
     A                                      DSPATR(UL)
     A                                 17 15'X 47.試飲分析表'
     A                                      DSPATR(UL)
     A                                 18 17'48.搭贈分析表'
     A                                      DSPATR(UL)
     A                                 11 46'53.客戶毛利金額排行榜'
     A                                      DSPATR(UL)
     A                                 13 46'55.久未交易客戶報表'
     A                                      DSPATR(UL)
     A                                 14 46'56.產品客戶銷售排行榜'
     A                                      DSPATR(UL)
     A                                 15 46'57.客戶最近成交一覽表'
     A                                      DSPATR(UL)
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('  ' '01' '02' '03' '43-
     A                                      ' '44' '45' '46' '47' '48' '49' '50-
     A                                      ' '51' '52' '53' '54' '55' '56' '57-
     A                                      ' '58')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
M001MA*                                16 46'58.品牌達成率同期比較分析表'
M001MA                                 16 46'58.品牌／客戶達成率同期比較表'
     A                                      DSPATR(UL)
