     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    84MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    84'客戶產品銷售管理目標追蹤表'
     A                                      SPACEA(1)
     A            GROUP         10   O    95
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            WF870A         1A  O    +1
     A            COMPC          6O  O    +1
     A                                      SPACEA(1)
     A                                     1'業務組別:'
     A            DSC28S    R        O    15REFFLD(SC28)
     A                                    20'-'
     A            DSC28E    R        O    22REFFLD(SC28)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S    R        O    15REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R        O    +1REFFLD(SD03)
     A                                      SPACEA(1)
     A                                     1'通　路　:'
     A            DSC33S    R        O    13REFFLD(SC33)
     A                                    15'-'
     A            DSC33E    R        O    17REFFLD(SC33)
     A                                      SPACEA(1)
     A                                     1'型　態　:'
     A            DSC34S    R        O    13REFFLD(SC34)
     A                                    16'-'
     A            DSC34E    R        O    18REFFLD(SC34)
     A                                   167'日期:'
     A            $EGMDY         6  0O   175EDTCDE(Y)
     A                                   184'頁次:'
     A                                   193PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DSC04S         5   O    13
     A                                    23'-'
     A            DSC04E         5   O    25
     A                                   167'時間:'
     A                                   175TIME
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
M001MA*N20        DSC08S    R        O    13REFFLD(SC39)
M001MA N20        DSC08S         6  0O    13
     A                                      EDTWRD('  /  /  ')
M001MA* 20        DSC39S    R        O    13REFFLD(SC39)
M001MA  20        DSC39S         6  0O    13
     A                                      EDTWRD('  /  /  ')
     A                                    21'-'
M001MA*N20        DSC08E    R        O    22REFFLD(SC39)
M001MA N20        DSC08E         6  0O    22
     A                                      EDTWRD('  /  /  ')
M001MA* 20        DSC39E    R        O    22REFFLD(SC39)
M001MA  20        DSC39E         6  0O    22
     A                                      EDTWRD('  /  /  ')
     A                                   168'USER :'
     A            $USER         10   O   175
     A                                   186'<SAR075>'
     A                                      SPACEA(1)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(1)
     A                                    58'--------'
     A                                    66'去年同期'
     A                                    76'--------'
     A                                    90'--------'
     A                                    98'上　　月'
     A                                   108'--------'
     A                                   122'--------'
     A                                   130'本　　期'
     A                                   140'--------'
     A                                   154'--------'
     A                                   162'ＹＴＤ　'
     A                                   172'--------'
     A                                      SPACEA(1)
     A                                     1'客戶代號／簡稱'
     A                                    29'產品代號／名稱'
     A                                    60'訂購'
     A                                    70'搭贈'
     A                                    82'金額'
     A                                    92'訂購'
     A                                   102'搭贈'
     A                                   114'金額'
     A                                   124'訂購'
     A                                   134'搭贈'
     A                                   146'金額'
     A                                   156'訂購'
     A                                   166'搭贈'
     A                                   178'金額'
     A                                   188'目標量'
     A                                      SPACEA(001)
     A            LYMDS          6  0     63EDTWRD('  /  /  ')
     A                                    72'-'
     A            LYMDE          6  0     74EDTWRD('  /  /  ')
     A            AYMDS          6  0     95EDTWRD('  /  /  ')
     A                                   104'-'
     A            AYMDE          6  0    106EDTWRD('  /  /  ')
     A            YMDS           6  0    127EDTWRD('  /  /  ')
     A                                   136'-'
     A            YMDE           6  0    138EDTWRD('  /  /  ')
     A            TYMDS          6  0    159EDTWRD('  /  /  ')
     A                                   168'-'
     A            TYMDE          6  0    170EDTWRD('  /  /  ')
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------------------------')
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A  21                                 1
     A                                      DFT(' ')
     A                                      SPACEA(001)
     A N30        WF8701    R        O     2
     A                                      REFFLD(WF8701 *LIBL/REW104)
     A N30        ME04      R        O    +0
     A            WF8702    R        O    +0
     A                                      REFFLD(WF8702 *LIBL/REW104)
     A            MA03      R        O    +0
     A            WF8704    R        O    56EDTCDE(J)
     A                                      REFFLD(WF8704 *LIBL/REW104)
     A            WF8705    R        O    66EDTCDE(J)
     A                                      REFFLD(WF8705 *LIBL/REW104)
     A            WF8706    R        O    76EDTCDE(J)
     A                                      REFFLD(WF8706 *LIBL/REW104)
     A            WF8707    R        O    88EDTCDE(J)
     A                                      REFFLD(WF8707 *LIBL/REW104)
     A            WF8708    R        O    98EDTCDE(J)
     A                                      REFFLD(WF8708 *LIBL/REW104)
     A            WF8709    R        O   108EDTCDE(J)
     A                                      REFFLD(WF8709 *LIBL/REW104)
     A            WF8710    R        O   120EDTCDE(J)
     A                                      REFFLD(WF8710 *LIBL/REW104)
     A            WF8711    R        O   130EDTCDE(J)
     A                                      REFFLD(WF8711 *LIBL/REW104)
     A            WF8712    R        O   140EDTCDE(J)
     A                                      REFFLD(WF8712 *LIBL/REW104)
     A            WF8713    R        O   152EDTCDE(J)
     A                                      REFFLD(WF8713 *LIBL/REW104)
     A            WF8714    R        O   162EDTCDE(J)
     A                                      REFFLD(WF8714 *LIBL/REW104)
     A            WF8715    R        O   172EDTCDE(J)
     A                                      REFFLD(WF8715 *LIBL/REW104)
     A                                   186'____________'
     A*----------------------------------------------------------------
     A          R PT1
     A                                      SPACEA(001)
     A                                    33
     A                                      DFT('產品組別------------>')
     A            T1TOT4    R        O    56EDTCDE(J)
     A                                      REFFLD(WF8704 *LIBL/REW104)
     A            T1TOT5    R        O    66EDTCDE(J)
     A                                      REFFLD(WF8705 *LIBL/REW104)
     A            T1TOT6    R        O    76EDTCDE(J)
     A                                      REFFLD(WF8706 *LIBL/REW104)
     A            T1TOT7    R        O    88EDTCDE(J)
     A                                      REFFLD(WF8707 *LIBL/REW104)
     A            T1TOT8    R        O    98EDTCDE(J)
     A                                      REFFLD(WF8708 *LIBL/REW104)
     A            T1TOT9    R        O   108EDTCDE(J)
     A                                      REFFLD(WF8709 *LIBL/REW104)
     A            T1TO10    R        O   120EDTCDE(J)
     A                                      REFFLD(WF8710 *LIBL/REW104)
     A            T1TO11    R        O   130EDTCDE(J)
     A                                      REFFLD(WF8711 *LIBL/REW104)
     A            T1TO12    R        O   140EDTCDE(J)
     A                                      REFFLD(WF8712 *LIBL/REW104)
     A            T1TO13    R        O   152EDTCDE(J)
     A                                      REFFLD(WF8713 *LIBL/REW104)
     A            T1TO14    R        O   162EDTCDE(J)
     A                                      REFFLD(WF8714 *LIBL/REW104)
     A            T1TO15    R        O   172EDTCDE(J)
     A                                      REFFLD(WF8715 *LIBL/REW104)
     A*----------------------------------------------------------------
     A          R PT2
     A                                      SPACEA(001)
     A                                    33
     A                                      DFT('客戶小計------------>')
     A            T2TOT4    R        O    56EDTCDE(J)
     A                                      REFFLD(WF8704 *LIBL/REW104)
     A            T2TOT5    R        O    66EDTCDE(J)
     A                                      REFFLD(WF8705 *LIBL/REW104)
     A            T2TOT6    R        O    76EDTCDE(J)
     A                                      REFFLD(WF8706 *LIBL/REW104)
     A            T2TOT7    R        O    88EDTCDE(J)
     A                                      REFFLD(WF8707 *LIBL/REW104)
     A            T2TOT8    R        O    98EDTCDE(J)
     A                                      REFFLD(WF8708 *LIBL/REW104)
     A            T2TOT9    R        O   108EDTCDE(J)
     A                                      REFFLD(WF8709 *LIBL/REW104)
     A            T2TO10    R        O   120EDTCDE(J)
     A                                      REFFLD(WF8710 *LIBL/REW104)
     A            T2TO11    R        O   130EDTCDE(J)
     A                                      REFFLD(WF8711 *LIBL/REW104)
     A            T2TO12    R        O   140EDTCDE(J)
     A                                      REFFLD(WF8712 *LIBL/REW104)
     A            T2TO13    R        O   152EDTCDE(J)
     A                                      REFFLD(WF8713 *LIBL/REW104)
     A            T2TO14    R        O   162EDTCDE(J)
     A                                      REFFLD(WF8714 *LIBL/REW104)
     A            T2TO15    R        O   172EDTCDE(J)
     A                                      REFFLD(WF8715 *LIBL/REW104)
     A*----------------------------------------------------------------
     A          R PT3
     A                                      SPACEA(001)
     A                                    33
     A                                      DFT('辦事處小計---------->')
     A            T3TOT4    R        O    56EDTCDE(J)
     A                                      REFFLD(WF8704 *LIBL/REW104)
     A            T3TOT5    R        O    66EDTCDE(J)
     A                                      REFFLD(WF8705 *LIBL/REW104)
     A            T3TOT6    R        O    76EDTCDE(J)
     A                                      REFFLD(WF8706 *LIBL/REW104)
     A            T3TOT7    R        O    88EDTCDE(J)
     A                                      REFFLD(WF8707 *LIBL/REW104)
     A            T3TOT8    R        O    98EDTCDE(J)
     A                                      REFFLD(WF8708 *LIBL/REW104)
     A            T3TOT9    R        O   108EDTCDE(J)
     A                                      REFFLD(WF8709 *LIBL/REW104)
     A            T3TO10    R        O   120EDTCDE(J)
     A                                      REFFLD(WF8710 *LIBL/REW104)
     A            T3TO11    R        O   130EDTCDE(J)
     A                                      REFFLD(WF8711 *LIBL/REW104)
     A            T3TO12    R        O   140EDTCDE(J)
     A                                      REFFLD(WF8712 *LIBL/REW104)
     A            T3TO13    R        O   152EDTCDE(J)
     A                                      REFFLD(WF8713 *LIBL/REW104)
     A            T3TO14    R        O   162EDTCDE(J)
     A                                      REFFLD(WF8714 *LIBL/REW104)
     A            T3TO15    R        O   172EDTCDE(J)
     A                                      REFFLD(WF8715 *LIBL/REW104)
     A*----------------------------------------------------------------
     A          R PT4
     A                                      SPACEA(001)
     A                                    33
     A                                      DFT('總　　計------------>')
     A            T4TOT4    R        O    56EDTCDE(J)
     A                                      REFFLD(WF8704 *LIBL/REW104)
     A            T4TOT5    R        O    66EDTCDE(J)
     A                                      REFFLD(WF8705 *LIBL/REW104)
     A            T4TOT6    R        O    76EDTCDE(J)
     A                                      REFFLD(WF8706 *LIBL/REW104)
     A            T4TOT7    R        O    88EDTCDE(J)
     A                                      REFFLD(WF8707 *LIBL/REW104)
     A            T4TOT8    R        O    98EDTCDE(J)
     A                                      REFFLD(WF8708 *LIBL/REW104)
     A            T4TOT9    R        O   108EDTCDE(J)
     A                                      REFFLD(WF8709 *LIBL/REW104)
     A            T4TO10    R        O   120EDTCDE(J)
     A                                      REFFLD(WF8710 *LIBL/REW104)
     A            T4TO11    R        O   130EDTCDE(J)
     A                                      REFFLD(WF8711 *LIBL/REW104)
     A            T4TO12    R        O   140EDTCDE(J)
     A                                      REFFLD(WF8712 *LIBL/REW104)
     A            T4TO13    R        O   152EDTCDE(J)
     A                                      REFFLD(WF8713 *LIBL/REW104)
     A            T4TO14    R        O   162EDTCDE(J)
     A                                      REFFLD(WF8714 *LIBL/REW104)
     A            T4TO15    R        O   172EDTCDE(J)
     A                                      REFFLD(WF8715 *LIBL/REW104)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('***續下頁***')
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('<<SAR075>>--->報表結束')
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
