     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR061P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR061                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品標準箱數彙總表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    79MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    83'產品標準箱數彙總表'
     A                                      SPACEA(1)
     A            GROUP         10   O    88
     A                                      SPACEA(1)
     A                                     1'產品代號　　:'
     A            DSD03S    R             +1REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R             +1REFFLD(SD03)
     A                                   148'日期:'
     A            $EGMDY         6  0O   156EDTCDE(Y)
     A                                   166'頁次:'
     A                                   173PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'確認日期　　:'
M001DA*           DSC39S    R             +1REFFLD(SC39)
M001AA            DSC39S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
M001DA*           DSC39E    R             +1REFFLD(SC39)
M001AA            DSC39E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                   148'時間:'
     A                                   156TIME
     A                                      SPACEA(1)
     A                                     1'分析方式    :'
     A            DSEL2          1A       +1
     A N22                                20'禮盒不拆'
     A                                      SPACEA(1)
     A  22                                20'禮盒拆單瓶'
     A                                      SPACEA(1)
     A                                     1'國內／國外  :'
     A            DSELC          6O       +1
     A                                   148'USER :'
     A            $USER         10   O   156
     A                                   166'<SAR061>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                    31'--------'
     A                                    39'訂購'
     A                                    45'--------'
     A                                    57'--------'
     A                                    66'銷退'
     A                                    72'--------'
     A                                    82'------------'
     A                                    94'實際'
     A                                   100'------------'
     A                                   115'單位'
     A                                   124'標準'
     A                                   148'----------'
     A                                   158'標準箱數'
     A                                   168'----------'
     A                                      SPACEA(1)
     A                                     1'產品／簡稱'
     A                                    31'訂購'
     A                                    40'搭贈'
     A                                    48'試飲'
     A                                    58'訂購'
     A                                    66'搭贈'
     A                                    73'試飲'
     A                                    82'訂購'
     A                                    90'搭贈'
     A                                    99'試飲'
     A                                   107'合計'
     A                                   115'容積'
     A                                   124'容積'
     A                                   134'容積總數'
     A                                   150'訂購'
     A                                   158'搭贈'
     A                                   166'試飲'
     A                                   174'合計'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
     A            WF4501    R              2REFFLD(WF4501 *LIBL/REWF45)
     A            MA03      R             +1
     A            WF4502    R             30REFFLD(WF4502 *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            W4502A    R             38REFFLD(W4502A *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            W4502B    R             46REFFLD(W4502B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            WF4503    R             56REFFLD(WF4503 *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            W4503A    R             64REFFLD(W4503A *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            W4503B    R             72REFFLD(W4503B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            QTY1      R             82REFFLD(WF4503 *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            QTY2      R             90REFFLD(W4503A *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            QTY3      R             98REFFLD(W4503B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            QTY4      R            106REFFLD(W4503B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            MA15      R            115EDTCDE(J)
     A                                    +0'L'
     A            DCASE          5  2    122EDTCDE(J)
     A                                    +0'L'
     A            LITER         11  3    131EDTCDE(J)
     A                                   146'L'
     A            CASE1          6  0    148EDTCDE(J)
     A            CASE2          6  0    156EDTCDE(J)
     A            CASE3          6  0    164EDTCDE(J)
     A            CASE4          6  0    172EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            WF4505    R              2REFFLD(WF4505 *LIBL/REWF45)
     A                                    +0'小計------------->'
     A            T1TOT1    R             30REFFLD(WF4502 *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T1TOT2    R             38REFFLD(W4502A *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T1TOT3    R             46REFFLD(W4502B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T1TOT4    R             56REFFLD(WF4503 *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T1TOT5    R             64REFFLD(W4503A *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T1TOT6    R             72REFFLD(W4503B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T1TOT7         6  0     82EDTCDE(J)
     A            T1TOT8         6  0     90EDTCDE(J)
     A            T1TOT9         6  0     98EDTCDE(J)
     A            T1TO10         6  0    106EDTCDE(J)
     A            LITER1        11  3    131EDTCDE(J)
     A                                   146'L'
     A            T1TO11         6  0    148EDTCDE(J)
     A            T1TO12         6  0    156EDTCDE(J)
     A            T1TO13         6  0    164EDTCDE(J)
     A            T1TO14         6  0    172EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A            WF4504    R              2REFFLD(WF4504 *LIBL/REWF45)
     A                                    +0'  小計------------->'
     A            T2TOT1    R             30REFFLD(WF4502 *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T2TOT2    R             38REFFLD(W4502A *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T2TOT3    R             46REFFLD(W4502B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T2TOT4    R             56REFFLD(WF4503 *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T2TOT5    R             64REFFLD(W4503A *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T2TOT6    R             72REFFLD(W4503B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T2TOT7         6  0     82EDTCDE(J)
     A            T2TOT8         6  0     90EDTCDE(J)
     A            T2TOT9         6  0     98EDTCDE(J)
     A            T2TO10         6  0    106EDTCDE(J)
     A            LITER2        11  3    131EDTCDE(J)
     A                                   146'L'
     A            T2TO11         6  0    148EDTCDE(J)
     A            T2TO12         6  0    156EDTCDE(J)
     A            T2TO13         6  0    164EDTCDE(J)
     A            T2TO14         6  0    172EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     8'總計------------->'
     A            T3TOT1    R             30REFFLD(WF4502 *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T3TOT2    R             38REFFLD(W4502A *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T3TOT3    R             46REFFLD(W4502B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T3TOT4    R             56REFFLD(WF4503 *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T3TOT5    R             64REFFLD(W4503A *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T3TOT6    R             72REFFLD(W4503B *LIBL/REWF45)
     A                                      EDTCDE(J)
     A            T3TOT7         6  0     82EDTCDE(J)
     A            T3TOT8         6  0     90EDTCDE(J)
     A            T3TOT9         6  0     98EDTCDE(J)
     A            T3TO10         6  0    106EDTCDE(J)
     A            LITER3        11  3    131EDTCDE(J)
     A                                   146'L'
     A            T3TO11         6  0    148EDTCDE(J)
     A            T3TO12         6  0    156EDTCDE(J)
     A            T3TO13         6  0    164EDTCDE(J)
     A            T3TO14         6  0    172EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     2'<<SAR061>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
