     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR055P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR055                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :客戶毛利金額排行榜                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    25MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    29'客戶毛利金額排行榜'
     A                                      SPACEA(1)
     A                                    50'日期:'
     A            $EGMDY         6  0O    57EDTCDE(Y)
     A                                    67'頁次:'
     A                                    75PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'公司　　:'
     A            WF2601    R             +1REFFLD(WF2601 *LIBL/REWF26)
     A            #B03      R             +1
     A                                    50'時間:'
     A                                    57TIME
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
     A N20        DSC08S         6  0O    13EDTCDE(Y)
     A N20                                +1'-'
     A N20        DSC08E         6  0O    +1EDTCDE(Y)
     A  20        DSC39S         6  0O    13EDTCDE(Y)
     A  20                                +1'-'
     A  20        DSC39E         6  0O    +1EDTCDE(Y)
     A                                    50' USER :'
     A            $USER         10   O    57
     A                                    72'<SAR055>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'客戶代號／簡稱'
     A                                    27'銷售金額'
     A                                    40'毛利金額'
     A                                    52'毛利率%'
     A                                    63'名次'
     A                                    69'毛利率名次'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF2602    R              2REFFLD(WF2602 *LIBL/REWF26)
     A            ME04      R             +0
     A            WF2603    R             25REFFLD(WF2603 *LIBL/REWF26)
     A                                      EDTCDE(J)
     A            WF2604    R             37REFFLD(WF2604 *LIBL/REWF26)
     A                                      EDTCDE(J)
     A            WF2605    R             55REFFLD(WF2605 *LIBL/REWF26)
     A                                      EDTCDE(J)
     A            SORT           4  0     64EDTCDE(2)
     A            WF2606    R             73REFFLD(WF2606 *LIBL/REWF26)
     A                                      EDTCDE(2)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<SAR055>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
