     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR057D                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/05/19                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR057                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :久未交易客戶報表                          *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    37MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    42'久未交易客戶報表'
     A                                      SPACEA(2)
     A                                     1'通　路　　:'
     A            DMD07S         1        +1
     A                                    +2'-'
     A            DMD07E         1        +1
     A                                      SPACEA(1)
     A                                     1'型　態　　:'
     A            DMD08S         2        +1
     A                                    +1'-'
     A            DMD08E         2        +1
     A                                    71'日期:'
     A            $EGMDY         6  0O    +1EDTCDE(Y)
     A                                    88'頁次:'
     A                                    96PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'地　區　　:'
     A            DME07S         2        +1
     A                                    +1'-'
     A            DME07E         2        +1
     A                                    71'時間:'
     A                                    +1TIME
     A                                    90'<SAR057P>'
     A                                      SPACEA(1)
     A                                     1'最後交易日:'
     A            DSC07          6  0     +1EDTCDE(Y)
     A                                    71' USER :'
     A            $USER         10A  O    +1
     A                                      SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                      SPACEA(1)
     A                                     1'客戶代號'
     A                                    13'客戶簡稱'
     A                                    27'最後交易日'
     A                                    40'通路'
     A                                    61'型態'
     A                                    82'地區'
     A                                      SPACEA(1)
     A                                     1'--------------------'
     A                                    21'--------------------'
     A                                    41'--------------------'
     A                                    61'--------------------'
     A                                    81'--------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            ME01      R              1
     A            ME02      R              7
     A            ME04      R             11
M001MA*           SC07      R             29EDTCDE(Y)
M001MA            PSC07          6  0     29EDTCDE(Y)
     A            #A03      R             38
     A            #C03      R             59
     A            #D02      R             80
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                      SPACEA(1)
     A                                     2'<<SAR057P>>--->報表結束 '
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A*         R PE2                       SPACEA(1)
     A*                                    1'===================='
     A*                                   21'===================='
     A*                                   41'===================='
     A*                                   61'===================='
     A*                                   81'===================='
     A*                                     SPACEA(1)
     A*                                    2'<<SAR057P>>--->報表結束 '
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
