     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SAR070D                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 83/05/12                                   *
     A*    PROGRAM NAME : SAR070                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品銷售分析週報表－依辦事處              *
     A****************************************************************
     A*%%EC
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SAR070'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 26'產品銷售分析週報表－依辦事處'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A     3 70
     A                                  4 26'公司別'
     A                                  4 36':'
     A            DMA07          1A     4 38
     A                                  4 41'(R-匯東 C-康齡 W-匯齡)'
     A                                  5 26'辦事處　:'
     A            COMP           1A     5 38
     A                                  5 40'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  6 26'產品種類:'
     A            DMA11          1A     6 38
     A                                  6 41'(1-白蘭地2-威士忌3-葡萄酒)'
     A                                  7 26'產品代號:'
     A            DMA01S         9A     7 38
     A                                  7 48'-'
     A            DMA01E         9A     7 50
     A                                  8 26'當期　　:'
     A*           DATES     R           8 38REFFLD(SC39)
     A            DATES          6  0   8 38
     A                                      EDTWRD('  /  /  ')
     A                                  8 48'-'
     A*           DATEE     R           8 50REFFLD(SC39)
     A            DATEE          6  0   8 50
     A                                      EDTWRD('  /  /  ')
     A                                  8 61'(MM/DD/YY)'
     A                                  9 26'當月　　:'
     A*           D01S      R           9 38REFFLD(SC39)
     A            D01S           6  0   9 38
     A                                      EDTWRD('  /  /  ')
     A                                  9 48'-'
     A*           D01E      R           9 50REFFLD(SC39)
     A            D01E           6  0   9 50
     A                                      EDTWRD('  /  /  ')
     A                                  9 61'(MM/DD/YY)'
     A                                 10 26'當年　　:'
     A*           D02S      R          10 38REFFLD(SC39)
     A            D02S           6  0  10 38
     A                                      EDTWRD('  /  /  ')
     A                                 10 48'-'
     A*           D02E      R          10 50REFFLD(SC39)
     A            D02E           6  0  10 50
     A                                      EDTWRD('  /  /  ')
     A                                 10 61'(MM/DD/YY)'
     A                                 11 26'去年　　:'
     A            D03S           4  0  11 38EDTWRD('  /  ')
     A                                 11 48'-'
     A            D03E           4  0  11 50EDTWRD('  /  ')
     A                                 11 61'(MM/YY)'
     A                                 13 26'含試飲　:'
     A            DSEL1          1A    13 38
     A                                 13 40'(N/Y)'
     A                                 14 24'　分析方式:'
     A            DSEL2          1A    14 38
     A                                 14 41'A-禮盒不拆'
     A                                 15 41'B-禮盒拆單瓶'
     A                                 17 26'執行環境 :'
     A            $EVR           1  0  17 39EDTCDE(3)
     A                                 17 41'(1-即時   2-批次)'
     A                                 18 26'列印份數'
     A                                 18 37':'
     A            $CPY           3  0  18 39EDTCDE(3)
     A                                 19 26'列表機'
     A                                 19 37':'
     A            $PRTID         2  0  19 39
     A                                 21 27'***請準備１３２行報表紙***'
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A                                 23 25'F4 =視窗查詢'
     A                                 23 40'F5 =參考資料'
