     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR047D                                    *
     A*    AUTHOR       : A1084  CHARLES                             *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    PROGRAM NAME : SAR047                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品銷售統計表                            *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SAR047'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0   1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'產品銷售統計表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4 28'辦事處　:'
     A            COMP           1A     4 40
     A                                  4 42'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  5 28'通路　　　:'
     A            DSC33S         1A     5 42
     A                                  5 49'-'
     A            DSC33E         1A     5 51
     A                                  6 28'型態　　　:'
     A            DSC34S         2A     6 42
     A                                  6 49'-'
     A            DSC34E         2A     6 51
     A                                  7 28'組別　　　:'
     A            DSC28S    R           7 42REFFLD(SC28)
     A                                  7 49'-'
     A            DSC28E    R           7 51REFFLD(SC28)
     A                                  8 28'產品代號:'
     A            DSD03S    R           8 40REFFLD(SD03)
     A                                  8 50'-'
     A            DSD03E    R           8 52REFFLD(SD03)
     A                                  9 28'送貨年月:'
     A            DSC08          4  0   9 40
     A                                      EDTWRD('  /  ')
     A                                  9 46'(MM/YY)'
     A                                 10 28'確認年月:'
     A            DSC39          4  0  10 40
     A                                 10 46'(MM/YY)'
     A                                 11 28'統計內容:'
     A            DSEL1          1A    11 40
     A                                 12 28'( 1=銷售2=銷售含搭贈3=+
     A                                      銷售含試飲4=全部)'
     A                                 13 28'列印方式:'
     A            DSEL2          1A    13 40
     A                                 13 42'( 1=分通路2=不分通路)'
     A                                 14 28'分析方式:'
     A            DSEL           1A    14 40
     A                                 14 42'( A-禮盒不拆B-禮盒拆單瓶'
     A                                 16 28'執行環境:'
     A            $EVR           1  0  16 41
     A                                      EDTCDE(3)
     A                                 16 43'(1-即時   2-批次)'
     A                                 17 28'列印份數'
     A                                 17 39':'
     A            $CPY           3  0  17 41EDTCDE(3)
     A                                 18 28'列表機'
     A                                 18 39':'
     A            $PRTID         2  0  18 41
     A                                      EDTCDE(3)
     A                                 20 29'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
