     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR062P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR062                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :通路產品銷售週報表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    40MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    44'通路產品銷售週報表'
     A                                      SPACEA(2)
     A                                     1'辦事處　:'
     A            COMP           1A       +1
     A            COMPC          6O       +1
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S    R             +1REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R             +1REFFLD(SD03)
     A                                    66'日期:'
     A            $EGMDY         6  0O    74EDTCDE(Y)
     A                                    84'頁次:'
     A                                    91PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'確認日期:'
M001DA*           DSC39S    R             +1REFFLD(SC39)
M001AA            DSC39S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
M001DA*           DSC39E    R             +1REFFLD(SC39)
M001AA            DSC39E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    66'時間:'
     A                                    74TIME
     A                                      SPACEA(1)
     A                                     1'通路　　:'
     A            WF4701    R             +1REFFLD(WF4701 *LIBL/REWF47)
     A            #A03      R             +1
     A                                    67'USER :'
     A            $USER         10   O    74
     A                                    84'<SAR062>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     1'產品／簡稱'
     A                                    33'銷售數量'
     A                                    48'銷退數量'
     A                                    64'實際銷售量'
     A                                    84'實際銷售金額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ----------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
     A            WF4703    R              2REFFLD(WF4703 *LIBL/REWF47)
     A            MA03      R             +1
     A            WF4704    R             35REFFLD(WF4704 *LIBL/REWF47)
     A                                      EDTCDE(1)
     A            WF4705    R             50REFFLD(WF4705 *LIBL/REWF47)
     A                                      EDTCDE(1)
     A            WFTOT     R             68REFFLD(WF4705 *LIBL/REWF47)
     A                                      EDTCDE(J)
     A            WFTOT1    R             80REFFLD(WF4706 *LIBL/REWF47)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            WF4702    R              2REFFLD(WF4702 *LIBL/REWF47)
     A                                     8'小計-------------------+
     A                                      ->'
     A            T14704    R             35REFFLD(WF4704 *LIBL/REWF47)
     A                                      EDTCDE(1)
     A            T14705    R             50REFFLD(WF4705 *LIBL/REWF47)
     A                                      EDTCDE(1)
     A            T1TOT     R             68REFFLD(WF4705 *LIBL/REWF47)
     A                                      EDTCDE(J)
     A            T1TOT1    R             80REFFLD(WF4706 *LIBL/REWF47)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                     8'通路小計---------------+
     A                                      ->'
     A            T24704    R             35REFFLD(WF4704 *LIBL/REWF47)
     A                                      EDTCDE(1)
     A            T24705    R             50REFFLD(WF4705 *LIBL/REWF47)
     A                                      EDTCDE(1)
     A            T2TOT     R             68REFFLD(WF4705 *LIBL/REWF47)
     A                                      EDTCDE(J)
     A            T2TOT1    R             80REFFLD(WF4706 *LIBL/REWF47)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'<<SAR062>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
