     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR082P                                    *
     A*    AUTHOR       : MICHELLE                                   *
     A*    CREATE DATE  : 00/01/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR082                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品銷售分析週報－國外                    *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                     1'MARKET:'
     A                                    12'TAIWAN'
     A                                      SPACEA(1)
     A                                     1'COMPANY:'
     A                                    12MSGCON(030 URE9994 REMF)
     A                                   178'DATE:'
     A            $EGMDY         6  0O   184EDTCDE(Y)
     A*                                  184'PAGE:'
     A*                                  190PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'SUBJECT:'
     A                                    12'WEEKLY SALES REPORT'
     A*                                  168'TIME:'
     A*                                  174TIME
     A                                      SPACEA(1)
     A                                     1'VOLUME:'
     A                                    12'IN STD. CASES'
     A*                                  168'USER:'
     A*           $USER         10   O   174
     A*                                  184'<SAR082>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                    45'-----------'
     A                                    57'YTD'
     A                                    61'-----------'
     A                                    81'--------'
     A                                    90'CURRENT WEEK'
     A                                   104'--------'
     A                                   122'--------'
     A                                   131'CUMULATIVE WEEK'
     A                                   148'--------'
     A                                   163'-----------'
     A                                   176' YTD  '
     A                                   184'-----------'
     A                                      SPACEA(1)
     A            D04SY          2  0     38
     A                                    40'/'
     A            D04EY          2  0     41
     A            D03S           6  0     45EDTWRD('  /  /  ')
     A                                    53'-'
     A            D03E           6  0     54EDTWRD('  /  /  ')
     A            D02S1          6  0     63EDTWRD('  /  /  ')
     A                                    71'-'
     A            D02E1          6  0     72EDTWRD('  /  /  ')
     A            DATES          6  0     85EDTWRD('  /  /  ')
     A                                    95'-'
     A            DATEE          6  0     97EDTWRD('  /  /  ')
     A            D01S           6  0    127EDTWRD('  /  /  ')
     A                                   137'-'
     A            D01E           6  0    139EDTWRD('  /  /  ')
     A            D02S           6  0    168EDTWRD('  /  /  ')
     A                                   178'-'
     A            D02E           6  0    180EDTWRD('  /  /  ')
     A                                      SPACEA(1)
     A                                     3'PRODUCT'
     A                                    38'BUDGET'
     A                                    53'ACTUAL'
     A                                    66'ACTUAL'
     A                                    83'BUD'
     A                                    95'ACT'
     A                                   109'VAR'
     A                                   124'BUD'
     A                                   137'ACT'
     A                                   150'VAR'
     A                                   165'BUD'
     A                                   178'ACT'
     A                                   191'VAR'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            D#A03         22         2
     A            FC603          9  0     35EDTCDE(N)
     A            FC604          9  0     48EDTCDE(N)
     A            FC605          9  0     61EDTCDE(N)
     A            FC606          9  0     76EDTCDE(N)
     A            FC607          9  0     89EDTCDE(N)
     A            F0607          9  0    102EDTCDE(N)
     A            FC608          9  0    117EDTCDE(N)
     A            FC609          9  0    130EDTCDE(N)
     A            F0809          9  0    143EDTCDE(N)
     A            FC610          9  0    158EDTCDE(N)
     A            FC611          9  0    171EDTCDE(N)
     A            F1011          9  0    184EDTCDE(N)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A N77        T1#A03        22         2
     A  77                                 4'SUB-TOTAL REMY MARTIN'
     A            T1TOT1         9  0     35EDTCDE(N)
     A            T1TOT2         9  0     48EDTCDE(N)
     A            T1TOT3         9  0     61EDTCDE(N)
     A            T1TOT4         9  0     76EDTCDE(N)
     A            T1TOT5         9  0     89EDTCDE(N)
     A            T1TOT6         9  0    102EDTCDE(N)
     A            T1TOT7         9  0    117EDTCDE(N)
     A            T1TOT8         9  0    130EDTCDE(N)
     A            T1TOT9         9  0    143EDTCDE(N)
     A            T1TO10         9  0    158EDTCDE(N)
     A            T1TO11         9  0    171EDTCDE(N)
     A            T1TO12         9  0    184EDTCDE(N)
     A  77                                  SPACEA(1)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(2)
     A                                     4'SUB-TOT'
     A            T2#A03        22        12
     A            T2TOT1         9  0     35EDTCDE(N)
     A            T2TOT2         9  0     48EDTCDE(N)
     A            T2TOT3         9  0     61EDTCDE(N)
     A            T2TOT4         9  0     76EDTCDE(N)
     A            T2TOT5         9  0     89EDTCDE(N)
     A            T2TOT6         9  0    102EDTCDE(N)
     A            T2TOT7         9  0    117EDTCDE(N)
     A            T2TOT8         9  0    130EDTCDE(N)
     A            T2TOT9         9  0    143EDTCDE(N)
     A            T2TO10         9  0    158EDTCDE(N)
     A            T2TO11         9  0    171EDTCDE(N)
     A            T2TO12         9  0    184EDTCDE(N)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(2)
     A                                     2'TOTAL'
     A            T3#A03        22         8
     A            T3TOT1         9  0     35EDTCDE(N)
     A            T3TOT2         9  0     48EDTCDE(N)
     A            T3TOT3         9  0     61EDTCDE(N)
     A            T3TOT4         9  0     76EDTCDE(N)
     A            T3TOT5         9  0     89EDTCDE(N)
     A            T3TOT6         9  0    102EDTCDE(N)
     A            T3TOT7         9  0    117EDTCDE(N)
     A            T3TOT8         9  0    130EDTCDE(N)
     A            T3TOT9         9  0    143EDTCDE(N)
     A            T3TO10         9  0    158EDTCDE(N)
     A            T3TO11         9  0    171EDTCDE(N)
     A            T3TO12         9  0    184EDTCDE(N)
     A*----------------------------------------------------------------
     A          R PT4                       SPACEA(1)
     A                                     2'GRAND TOTAL(ALL PRODUCTS)'
     A            T4TOT1         9  0     35EDTCDE(N)
     A            T4TOT2         9  0     48EDTCDE(N)
     A            T4TOT3         9  0     61EDTCDE(N)
     A            T4TOT4         9  0     76EDTCDE(N)
     A            T4TOT5         9  0     89EDTCDE(N)
     A            T4TOT6         9  0    102EDTCDE(N)
     A            T4TOT7         9  0    117EDTCDE(N)
     A            T4TOT8         9  0    130EDTCDE(N)
     A            T4TOT9         9  0    143EDTCDE(N)
     A            T4TO10         9  0    158EDTCDE(N)
     A            T4TO11         9  0    171EDTCDE(N)
     A            T4TO12         9  0    184EDTCDE(N)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'(*)INCLUDE SALES TO WINE SHOP'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'(*)INCLUDE SALES TO WINE SHOP'
     A*                                     SPACEA(1)
     A*                                    2'<<SAR082>>---> END OF REPORT'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'      NO DATA'
