     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SAR074D                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 83/05/12                                   *
     A*    PROGRAM NAME : SAR072                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :品牌／客戶達成率同期比較表　              *
     A****************************************************************
     A*%%EC
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SAR074'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 25'品牌／客戶達成率同期比較表　'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A     3 70
     A                                  5 26'辦事處　:'
     A            COMP           1A     5 38
     A                                  5 40'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  6 26'產品類別:'
     A            DMA11          2A     6 38
     A                                  8 26'當期　　:'
M001MA*           DATES     R           8 38REFFLD(SC39)
M001MA            DATES          6  0   8 38
     A                                      EDTWRD('  /  /  ')
     A                                  8 48'-'
M001MA*           DATEE     R           8 50REFFLD(SC39)
M001MA            DATEE          6  0   8 50
     A                                      EDTWRD('  /  /  ')
     A                                  8 61'(MM/DD/YY)'
     A                                 14 24'　分析方式:'
     A            DSEL2          1A    14 38
     A                                 14 41'A-禮盒不拆'
     A                                 15 41'B-禮盒拆單瓶'
     A                                 17 26'執行環境 :'
     A            $EVR           1  0  17 39EDTCDE(3)
     A                                 17 41'(1-即時   2-批次)'
     A                                 18 26'列印份數'
     A                                 18 37':'
     A            $CPY           3  0  18 39EDTCDE(3)
     A                                 19 26'列表機'
     A                                 19 37':'
     A            $PRTID         2  0  19 39
     A                                 21 27'***請準備１３２行報表紙***'
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A                                 23 25'F4 =視窗查詢'
     A                                 23 40'F5 =參考資料'
