     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR060P                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/10/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR060                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :客戶最近成交一覽表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    37MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    41'客戶最近成交一覽表'
     A                                      SPACEA(1)
     A                                     1'通　路　:'
     A            DSC33S    R             +1REFFLD(SC33)
     A                                    +2'-'
     A            DSC33E    R             +1REFFLD(SC33)
     A                                      SPACEA(1)
     A                                     1'型　態　:'
     A            DSC34S    R             +1REFFLD(SC34)
     A                                    +1'-'
     A            DSC34E    R             +1REFFLD(SC34)
     A                                      SPACEA(1)
     A                                     1'地　區　:'
     A            DSC31S    R             +1REFFLD(SC31)
     A                                    +1'-'
     A            DSC31E    R             +1REFFLD(SC31)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DSC45S         9A  O    +1
     A                                    +1'-'
     A            DSC45E         9A  O    +1
     A                                    77'日期:'
     A            $EGMDY         6  0O    85EDTCDE(Y)
     A                                    93'頁次:'
     A                                   101PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S    R        O    +1REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R        O    +1REFFLD(SD03)
     A                                    77'時間:'
     A                                    85TIME
     A                                    93'<SAR060>'
     A                                      SPACEA(1)
     A                                     1'交易期間:'
M001MA*           DSC08S    R        O    +1REFFLD(SC08)
M001MA            DSC08S         6  0O    +1
     A                                      EDTCDE(Y)
     A                                    +2'-'
M001MA*           DSC08E    R        O    +1REFFLD(SC08)
M001MA            DSC08E         6  0O    +1
     A                                      EDTCDE(Y)
     A                                    77' USER :'
     A            $USER         10        85
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============')
     A                                      SPACEA(1)
     A                                     1'通路型態／名稱'
     A                                    30'地　區／名稱'
     A                                    60'客戶代號／簡稱'
     A                                    89'最近交易日'
     A                                   102'訂單號碼'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            SC33      R              2
     A            SC34      R              4
     A            #C03      R              7
     A            SC31      R             31
     A            #D02      R             34
     A            SC04      R             61
     A            SC05      R             67
     A            ME04      R             +1
M001MA*           PSC08     R             91REFFLD(SC08)
M001MA            PSC08          6  0     91
     A                                      EDTCDE(Y)
     A            SC02      R            103
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                     1'型態小計----------+
     A                                       ------------------->'
     A            RANK1          7  0     +1EDTCDE(J)
     A                                    +1'(家)'
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A                                     1'通路小計----------+
     A                                       ------------------->'
     A            RANK2          7  0     +1EDTCDE(J)
     A                                    +1'(家)'
     A*----------------------------------------------------------------
     A          R PD4                       SPACEA(1)
     A                                     1'總　計　----------+
     A                                       ------------------->'
     A            TOT            7  0     +1EDTCDE(J)
     A                                    +1'(家)'
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============')
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============')
     A                                      SPACEA(1)
     A                                     2'<<SAR060>>--->報表結束'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ==================================')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE4                       SPACEA(1)
     A                                     1' '
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
