     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : SAR071D                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 83/05/23                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR071                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析作業                              *
     A*    REMARK       :業務員售售（退）業績報表                  *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SAR071'
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                 16 26'執行環境:'
     A            $EVR           1  0O 16 38
     A                                      EDTCDE(3)
     A                                 16 43'(1-即時 2-批次)'
     A                                 17 26'列印份數:'
     A            $CPY           3  0O 17 38EDTCDE(3)
     A                                 18 26'列表機　:'
     A            $PRTID         2  0O 18 38
     A                                      EDTCDE(3)
     A                                 20 27'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                  2 27'業務員銷售（退）業績報表'
     A                                  4 26'組別　　:'
     A            DSC28S         4A  O  4 38
     A                                  4 45'-'
     A            DSC28E         4A  O  4 47
     A                                  6 26'業務員　:'
     A            DSC27S         6A  O  6 38
     A                                  6 45'-'
     A            DSC27E         6A  O  6 47
     A                                  8 26'送貨日期:'
     A            DSC07          6  0O  8 38EDTWRD('  /  /  ')
     A                                  8 49'(MM/DD/YY)'
     A                                 13 26'分析方式:'
     A            DATA           1A  O 13 38
     A                                 13 42'A-禮盒不拆'
     A                                 14 42'B-禮盒拆單瓶'
     A                                 10 26'確認日期:'
     A            DSC39          6  0O 10 38EDTWRD('  /  /  ')
     A                                 10 49'(MM/DD/YY)'
