     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR063P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR063                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品銷售毛利合併報表                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    88MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    91'產品銷售毛利合併報表'
     A                                      SPACEA(2)
     A                                     1'產品代號　:'
     A            DSD03S    R             +1REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R             +1REFFLD(SD03)
     A                                   164'日期:'
     A            $EGMDY         6  0O   173EDTCDE(Y)
     A                                   183'頁次:'
     A                                   192PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'確認日期　:'
M001DA*           DSC39S    R             +1REFFLD(SC39)
M001AA            DSC39S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'-'
M001DA*           DSC39E    R             +1REFFLD(SC39)
M001AA            DSC39E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +2'客戶代號: '
     A            DSC04S    R             +1REFFLD(SC04)
     A            DSC05S    R             +1REFFLD(SC05)
     A                                    +1'-'
     A            DSC04E    R             +1REFFLD(SC04)
     A            DSC05E    R             +1REFFLD(SC05)
     A                                   164'時間:'
     A                                   173TIME
     A                                      SPACEA(1)
     A                                     1'國內／國外:'
     A            DSELC          6O       +1
     A                                    +2'通路    : '
     A            DSC33S    R             +1REFFLD(SC33)
     A                                    +1'-'
     A            DSC33E    R             +1REFFLD(SC33)
     A                                    +2'品牌    : '
     A            DMA10S    R             +1REFFLD(MA10 MTMAPF)
     A                                    +1'-'
     A            DMA10E    R             +1REFFLD(MA10 MTMAPF)
     A                                   165'USER :'
     A            $USER         10   O   173
     A                                   183'<SAR063BP>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                    76'ＤＵＴＹ'
     A                                    91'ＤＵＴＹ'
     A                                   105'Ｆ．Ｏ．Ｂ'
     A                                   120'Ｆ．Ｏ．Ｂ'
     A                                   135'Ｆ．Ｈ．Ｉ'
     A                                   150'Ｆ．Ｈ．Ｉ'
     A                                   166'銷貨成本'
     A                                      SPACEA(1)
     A                                     1'產品／簡稱'
     A                                    33'銷貨收入'
     A                                    47'銷退金額'
     A                                    61'收入淨額'
     A                                    76'訂　　購'
     A                                    91'搭　　贈'
     A                                   106'訂　　購'
     A                                   121'搭　　贈'
     A                                   136'訂　　購'
     A                                   151'搭　　贈'
     A                                   166'合　　計'
     A                                   181'淨貢獻'
     A                                      SPACEA(1)
     A                                    76'----------'
     A                                    91'----------'
     A                                   106'----------'
     A                                   121'----------'
     A                                   136'----------'
     A                                   151'----------'
     A                                      SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ----------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
     A            WF4802    R              1REFFLD(WF4802 *LIBL/REWF48)
     A            MA03      R             +0
     A            WF4803    R             29REFFLD(WF4803 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            WF4804    R             43REFFLD(WF4804 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            WF0304    R             57REFFLD(WF4803 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            WF4807    R             71REFFLD(WF4807 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            WF4810    R             86REFFLD(WF4810 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            WF4805    R            101REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            WF4808    R            116REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            WF4806    R            131REFFLD(WF4808 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            WF4809    R            146REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            WF0510    R            161REFFLD(WF4806 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            NETSAL    R            176REFFLD(WF4809 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            WF481A    R              1REFFLD(WF481A *LIBL/REWF48)
     A                                    +0'小計--------------->'
     A            T1TOT1    R             29REFFLD(WF4803 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T1TOT2    R             43REFFLD(WF4804 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T1TOT3    R             57REFFLD(WF4807 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T1TOT4    R             71REFFLD(WF4807 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T1TOT5    R             86REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T1TOT6    R            101REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T1TOT7    R            116REFFLD(WF4808 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T1TOT8    R            131REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T1TOT9    R            146REFFLD(WF4806 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T1TO10    R            161REFFLD(WF4809 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T1TO11    R            176REFFLD(WF4809 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A            WF4801    R              1REFFLD(WF4801 *LIBL/REWF48)
     A                                    +2'小計--------------->'
     A            T2TOT1    R             29REFFLD(WF4803 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T2TOT2    R             43REFFLD(WF4804 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T2TOT3    R             57REFFLD(WF4807 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T2TOT4    R             71REFFLD(WF4807 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T2TOT5    R             86REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T2TOT6    R            101REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T2TOT7    R            116REFFLD(WF4808 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T2TOT8    R            131REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T2TOT9    R            146REFFLD(WF4806 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T2TO10    R            161REFFLD(WF4809 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T2TO11    R            176REFFLD(WF4809 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     1'總　　計  --------------->'
     A            T3TOT1    R             29REFFLD(WF4803 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T3TOT2    R             43REFFLD(WF4804 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T3TOT3    R             57REFFLD(WF4807 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T3TOT4    R             71REFFLD(WF4807 *LIBL/REWF48)
     A                                      EDTCDE(M)
     A            T3TOT5    R             86REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T3TOT6    R            101REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T3TOT7    R            116REFFLD(WF4808 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T3TOT8    R            131REFFLD(WF4805 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T3TOT9    R            146REFFLD(WF4806 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T3TO10    R            161REFFLD(WF4809 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A            T3TO11    R            176REFFLD(WF4809 *LIBL/REWF48)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'<<SAR063>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
