     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR041D                                    *
     A*    AUTHOR       :                                            *
     A*    CREATE DATE  : 81/05/05                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR047                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :客戶退貨明細表                            *
     A*===============================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE FOR Y2K
     F*----------------------------------------------------------------
     F*  M002     | 99.11.11 | ADD CUSGRP OPTION
     F*================================================================
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    80
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
     A                                    86
     A                                      '客戶退貨明細表'
     A                                      SPACEA(001)
     A                                     1
     A                                      '辦事處　:'
     A            COMP           4        +1
     A                                    86
     A                                      '（銷貨退回）'
     A                                      SPACEA(001)
     A                                     1
     A                                      '組別代號:'
     A            DSG12S         4        +1
     A                                    +4
     A                                      '-'
     A            DSG12E         4        +1
     A                                      SPACEA(001)
     A                                     1
     A                                      '業務代號:'
     A            DSG11S         6        +1
     A                                    +4
     A                                      '-'
     A            DSG11E         6        +1
     A                                      SPACEA(001)
     A                                     1
     A                                      '客戶代號:'
     A            DSG04S         5        +1
     A                                    +4
     A                                      '-'
     A            DSG04E         5        +1
     A                                   159
     A                                      '日期:'
     A            $EGMDY         6  0O   166
     A                                      EDTCDE(Y)
     A                                   176
     A                                      '頁次:'
     A                                   183
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號:'
     A            DSH03S         9        +1
     A                                    +4
     A                                      '-'
     A            DSH03E         9        +1
     A                                   +20
     A                                      '集　　團：'
     A            DMD06S         2        +1
     A            D#A03S        32O       +2
     A                                   159
     A                                      '時間:'
     A                                   166
     A                                      TIME
     A                                      SPACEA(001)
     A  20                                 1
     A                                      '打單日期:'
     A  20        DSG06S         6  0O    +1
     A                                      EDTCDE(Y)
     A  20                                23
     A                                      '-'
     A  20        DSG06E         6  0O    +1
     A                                      EDTCDE(Y)
     A N20                                 1
     A                                      '確認日期:'
     A N20        DSG26S         6  0O    +1
     A                                      EDTCDE(Y)
     A N20                                23
     A                                      '-'
     A N20        DSG26E         6  0O    +1
     A                                      EDTCDE(Y)
     A                                   +34
     A                                      '-'
     A            DMD06E         2        +2
     A            D#A03E        32O       +2
     A                                   160
     A                                      'USER :'
     A            $USER         10   O   166
     A                                   177
     A                                      '<SAR041A>'
     A                                      SPACEA(001)
     A                                     1
     A                                      '===================='
     A                                    21
     A                                      '===================='
     A                                    41
     A                                      '===================='
     A                                    61
     A                                      '===================='
     A                                    81
     A                                      '===================='
     A                                   101
     A                                      '===================='
     A                                   121
     A                                      '===================='
     A                                   141
     A                                      '===================='
     A                                   161
     A                                      '===================='
     A                                   181
     A                                      '================'
     A                                      SPACEA(001)
     A  34                               146
     A                                      '-----轉　帳　銷　退　成　本-----'
     A  34                               188
     A                                      '轉帳銷退'
     A                                      SPACEA(001)
     A                                     1
     A                                      '業務員'
     A                                    12
     A                                      '客戶代號'
     A                                    25
     A                                      '客戶簡稱'
     A                                    43
     A                                      '退貨單號'
     A                                    53
     A                                      '退貨日期'
     A                                    63
     A                                      '產品代號'
     A                                    73
     A                                      '產品簡稱'
     A                                    91
     A                                      '數量'
     A                                   100
     A                                      '單價'
     A                                   113
     A                                      '退貨金額'
     A  34                               127
     A                                      '退貨成本'
     A  34                               145
     A                                      'F.O.B.'
     A  34                               160
     A                                      'F.H.I.'
     A  34                               177
     A                                      'DUTY'
     A  34                               189
     A                                      '總成本'
     A                                      SPACEA(001)
     A N34                               189
     A                                      ' '
     A                                      SPACEA(001)
     A                                     1
     A                                      '--------------------'
     A                                    21
     A                                      '--------------------'
     A                                    41
     A                                      '--------------------'
     A                                    61
     A                                      '--------------------'
     A                                    81
     A                                      '--------------------'
     A                                   101
     A                                      '--------------------'
     A                                   121
     A                                      '--------------------'
     A                                   141
     A                                      '--------------------'
     A                                   161
     A                                      '--------------------'
     A                                   181
     A                                      '----------------'
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEB(001)
     A N30        MC02      R              1
     A N31        SG04      R             13
     A N31N33                             +1
     A                                      '-'
     A N31        SG05      R             +1
     A N31        ME04      R             25
     A N32        SG02      R             43
M001DA*N32        PSG06     R             57REFFLD(SG06)
     A N32        PSG06          6  0     56
     A                                      EDTCDE(Y)
     A            SH03      R             64
     A            MA03      R             73
     A            SH06      R             91
     A                                      EDTCDE(J)
     A            PPRC      R             98
     A                                      EDTCDE(J)
     A                                      REFFLD(SD06)
     A            SH07      R            111
     A                                      EDTCDE(J)
     A  34        SH08      R            123
     A                                      EDTCDE(J)
     A  34        SH17      R            138
     A                                      EDTCDE(J)
     A  34        SH18      R            153
     A                                      EDTCDE(J)
     A  34        SH19      R            168
     A                                      EDTCDE(J)
     A  34        SH20      R            183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD2
     A                                      SPACEB(001)
     A                                    68
     A                                      '客戶　小計-------->'
     A            CTSH06         5  0     91
     A                                      EDTCDE(J)
     A*           CTPPRC         5  0     98EDTCDE(J)
     A            CTSH07         9  0    110
     A                                      EDTCDE(J)
     A  34        CTSH08        11  2    123
     A                                      EDTCDE(J)
     A  34        CTSH17        11  2    138
     A                                      EDTCDE(J)
     A  34        CTSH18        11  2    153
     A                                      EDTCDE(J)
     A  34        CTSH19        11  2    168
     A                                      EDTCDE(J)
     A  34        CTSH20        11  2    183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3
     A                                      SPACEB(001)
     A                                    68
     A                                      '業務員小計-------->'
     A            STSH06         5  0     91
     A                                      EDTCDE(J)
     A*           STPPRC         5  0     98EDTCDE(J)
     A            STSH07         9  0    111
     A                                      EDTCDE(J)
     A  34        STSH08        11  2    123
     A                                      EDTCDE(J)
     A  34        STSH17        11  2    138
     A                                      EDTCDE(J)
     A  34        STSH18        11  2    153
     A                                      EDTCDE(J)
     A  34        STSH19        11  2    168
     A                                      EDTCDE(J)
     A  34        STSH20        11  2    183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD4
     A                                      SPACEB(001)
     A                                    68
     A                                      '期間　總計-------->'
     A            RTSH06         5  0     91
     A                                      EDTCDE(J)
     A*           RTPPRC         5  0     98EDTCDE(J)
     A            RTSH07         9  0    111
     A                                      EDTCDE(J)
     A  34        RTSH08        11  2    123
     A                                      EDTCDE(J)
     A  34        RTSH17        11  2    138
     A                                      EDTCDE(J)
     A  34        RTSH18        11  2    153
     A                                      EDTCDE(J)
     A  34        RTSH19        11  2    168
     A                                      EDTCDE(J)
     A  34        RTSH20        11  2    183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                      SPACEB(001)
     A                                     1
     A                                      '===================='
     A                                    21
     A                                      '===================='
     A                                    41
     A                                      '===================='
     A                                    61
     A                                      '===================='
     A                                    81
     A                                      '===================='
     A                                   101
     A                                      '===================='
     A                                   121
     A                                      '===================='
     A                                   141
     A                                      '===================='
     A                                   161
     A                                      '===================='
     A                                   181
     A                                      '================'
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                      SPACEB(001)
     A                                     1
     A                                      '===================='
     A                                    21
     A                                      '===================='
     A                                    41
     A                                      '===================='
     A                                    61
     A                                      '===================='
     A                                    81
     A                                      '===================='
     A                                   101
     A                                      '===================='
     A                                   121
     A                                      '===================='
     A                                   141
     A                                      '===================='
     A                                   161
     A                                      '===================='
     A                                   181
     A                                      '================'
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<SAR041A>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                      SPACEB(001)
     A                                     3
     A                                      'もも此範圍無資料もも'
