     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR043D                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/05/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR043                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :業務員業績報表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    66MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    71'業務員業績報表'
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
     A N20        DSC07          6  0O    13EDTCDE(Y)
     A  20        DSC39          6  0O    13EDTCDE(Y)
     A                                   130'日期:'
     A            $EGMDY         6  0O   137EDTCDE(Y)
     A                                   147'頁次:'
     A                                   155PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'組別:'
     A            WF1201    R             +1REFFLD(SC28)
     A            #A03      R             +1
     A                                   130'時間:'
     A                                   137TIME
     A                                      SPACEA(1)
     A                                     1'禮盒組拆:'
     A            DATA           1A  O    12
     A N22                                14'禮盒不拆'
     A  22                                14'禮盒拆單瓶'
     A                                   130' USER :'
     A            $USER         10   O   137
     A                                   149'<SAR043>'
     A                                      SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                      SPACEA(1)
     A                                     1'業務員'
     A                                    23'產品代號'
     A                                    33'產品簡稱'
     A                                    50'當日銷量'
     A                                    62'當日搭贈'
     A                                    74'當日試飲'
     A                                    86'當日銷售金額'
     A                                   100'月累計銷量'
     A                                   114'月累計搭贈'
     A                                   128'月累計試飲'
     A                                   142'月累計銷售金額'
     A                                      SPACEA(1)
     A                                     1'--------------------'
     A                                    21'--------------------'
     A                                    41'--------------------'
     A                                    61'--------------------'
     A                                    81'--------------------'
     A                                   101'--------------------'
     A                                   121'--------------------'
     A                                   141'--------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N21                                 1' '
     A N21                                  SPACEA(1)
     A N30        WF1202    R              2REFFLD(MC01)
     A N30        MC02      R             10
     A            WF1204         9        24
     A            MA03      R             33
     A            WF1205         5  0     53EDTCDE(J)
     A            WF1209    R             66REFFLD(SD05)
     A                                      EDTCDE(J)
     A            WF1210    R             77REFFLD(SD04)
     A                                      EDTCDE(J)
     A            WF1206         9  0     89EDTCDE(3)
     A            WF1207         7  0    102EDTCDE(J)
     A            WF1211    R            120REFFLD(SD05)
     A                                      EDTCDE(J)
     A            WF1212    R            133REFFLD(SD04)
     A                                      EDTCDE(J)
     A            WF1208         9  0    146EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    23'產品識別小計-------------->'
     A            T11205         5  0     53EDTCDE(J)
     A            T11209    R             66REFFLD(SD05)
     A                                      EDTCDE(J)
     A            T11210    R             77REFFLD(SD04)
     A                                      EDTCDE(J)
     A            T11206         9  0     89EDTCDE(J)
     A            T11207         7  0    102EDTCDE(J)
     A            T11211    R            120REFFLD(SD05)
     A                                      EDTCDE(J)
     A            T11212    R            133REFFLD(SD04)
     A                                      EDTCDE(J)
     A            T11208         9  0    146EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    23'業務員　合計-------------->'
     A            T21205         5  0     53EDTCDE(J)
     A            T21209    R             66REFFLD(SD05)
     A                                      EDTCDE(J)
     A            T21210    R             77REFFLD(SD04)
     A                                      EDTCDE(J)
     A            T21206         9  0     89EDTCDE(J)
     A            T21207         7  0    102EDTCDE(J)
     A            T21211    R            120REFFLD(SD05)
     A                                      EDTCDE(J)
     A            T21212    R            133REFFLD(SD04)
     A                                      EDTCDE(J)
     A            T21208         9  0    146EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    23'組別　　總計-------------->'
     A            T31205         5  0     53EDTCDE(J)
     A            T31209    R             66REFFLD(SD05)
     A                                      EDTCDE(J)
     A            T31210    R             77REFFLD(SD04)
     A                                      EDTCDE(J)
     A            T31206         9  0     89EDTCDE(J)
     A            T31207         7  0    102EDTCDE(J)
     A            T31211    R            120REFFLD(SD05)
     A                                      EDTCDE(J)
     A            T31212    R            133REFFLD(SD04)
     A                                      EDTCDE(J)
     A            T31208         9  0    146EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                      SPACEA(1)
     A                                     2'<<SAR043>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
