     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR050D                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/05/19                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR050                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :搭贈分析表                                *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    59MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    67'搭贈分析表'
     A                                      SPACEA(1)
     A                                     1'公　司　:'
     A            DSC01S         2   O    +1
     A                                    +7'-'
     A            DSC01E         2   O    +1
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
     A N20        DSC07S         6  0O    13EDTCDE(Y)
     A N20                                +1'-'
     A N20        DSC07E         6  0O    +1EDTCDE(Y)
     A  20        DSC39S         6  0O    13EDTCDE(Y)
     A  20                                +1'-'
     A  20        DSC39E         6  0O    +1EDTCDE(Y)
     A                                   131'日期:'
     A            $EGMDY         6  0O   138EDTCDE(Y)
     A                                   148'頁次:'
     A                                   156PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S         9   O    13
     A                                    +1'-'
     A            DSD03E         9   O    +1
     A                                   131'時間:'
     A                                   138TIME
     A                                      SPACEA(1)
     A                                     1'選　擇　:'
     A                                    +1'A客戶'
     A                                   131' USER :'
     A            $USER         10   O   138
     A                                   150'<SAR050AP>'
     A                                      SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===='
     A                                      SPACEA(1)
     A                                    74'訂購'
     A                                    82'搭贈'
     A                                    99'搭贈'
     A                                   156'搭贈'
     A                                      SPACEA(1)
     A                                     1'客戶代號'
     A                                    14'客戶簡稱'
     A                                    31'產品代號'
     A                                    41'產品簡稱'
     A                                    58'訂單號碼'
     A                                    74'數量'
     A                                    82'數量'
     A                                    99'折讓'
     A                                   110'  F.O.B.'
     A                                   125'  F.H.I.'
     A                                   140'    DUTY'
     A                                   155'總成本'
     A                                      SPACEA(1)
     A                                     1'--------------------'
     A                                    21'--------------------'
     A                                    41'--------------------'
     A                                    61'--------------------'
     A                                    81'--------------------'
     A                                   101'--------------------'
     A                                   121'--------------------'
     A                                   141'--------------------'
     A                                   161'----'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        SC04      R              2
     A N30N37                              8'-'
     A N30        SC05      R             10
     A N30        ME04      R             14
     A N31        SD03      R             32
     A N31        MA03      R             41
     A            SD02      R             59
     A            SD04      R             73EDTCDE(J)
     A            SD05      R             82EDTCDE(J)
     A N38        AMT1          11  2     90EDTCDE(J)
     A N38        AMT21         11  2    105EDTCDE(J)
     A N38        AMT22         11  2    120EDTCDE(J)
     A N38        AMT23         11  2    135EDTCDE(J)
     A N38        AMT2          11  2    150EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    58'產品小計-->'
     A            PSUM1          6  0     72EDTCDE(M)
     A            PSUM2          5  0     81EDTCDE(M)
     A N38        PSUM3         12  2     88EDTCDE(M)
     A N38        PSUM41        12  2    103EDTCDE(M)
     A N38        PSUM42        12  2    118EDTCDE(M)
     A N38        PSUM43        12  2    133EDTCDE(M)
     A N38        PSUM4         12  2    148EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEA(1)
     A                                    58'客戶小計-->'
     A            CSUM1          6  0     72EDTCDE(M)
     A            CSUM2          5  0     81EDTCDE(M)
     A N38        CSUM3         12  2     88EDTCDE(M)
     A N38        CSUM41        12  2    103EDTCDE(M)
     A N38        CSUM42        12  2    118EDTCDE(M)
     A N38        CSUM43        12  2    133EDTCDE(M)
     A N38        CSUM4         12  2    148EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                    58'總　　計-->'
     A            TSUM1          6  0     72EDTCDE(M)
     A            TSUM2          5  0     81EDTCDE(M)
     A N38        TSUM3         12  2     88EDTCDE(M)
     A N38        TSUM41        12  2    103EDTCDE(M)
     A N38        TSUM42        12  2    118EDTCDE(M)
     A N38        TSUM43        12  2    133EDTCDE(M)
     A N38        TSUM4         12  2    148EDTCDE(M)
     A                                   132' '
     A                                      SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===='
     A                                      SPACEA(1)
     A                                     2'<<SAR050AP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===='
     A                                      SPACEA(1)
     A                                     2'<<SAR050AP>>--->報表結束'
