     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR052P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR052                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :期間專櫃銷售分析表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    33MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    36'期間專櫃銷售分析表'
     A                                      SPACEA(1)
     A                                     1'專櫃代號:'
     A            WF2301    R             +1REFFLD(WF2301 *LIBL/REWF23)
     A            ME04      R             +1
     A                                    66'日期:'
     A            $EGMDY         6  0O    73EDTCDE(Y)
     A                                    83'頁次:'
     A                                    91PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'年月　　:'
M001DA*           DSC39S    R             +1REFFLD(SC39)
M001AA            DSC39S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +0'-'
M001DA*           DSC39E    R             +0REFFLD(SC39)
M001AA            DSC39E         6  0     +0
     A                                      EDTWRD('  /  /  ')
     A                                    66'時間:'
     A                                    73TIME
     A                                      SPACEA(1)
     A                                     1'禮盒組拆:'
     A            DSEL           1A  O    13
     A N22                                15'禮盒不拆'
     A  22                                15'禮盒拆單瓶'
     A                                    66' USER :'
     A            $USER         10   O    73
     A                                    88'<SAR052>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    11'產品簡稱'
     A                                    33'期間銷售量'
     A                                    47'期間銷售金額'
     A                                    63'期間銷售成本'
     A                                    79'期間銷售毛利'
     A                                      SPACEA(1)
     A                                    31'月累計銷售量'
     A                                    45'月累計銷售金額'
     A                                    61'月累計銷售成本'
     A                                    77'月累計銷售毛利'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ----------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  30                                 1' '
     A                                      SPACEA(1)
     A            WF2303    R              2REFFLD(WF2303 *LIBL/REWF23)
     A            MA03      R             11
     A            WF2304    R             35REFFLD(WF2304 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            WF2305    R             49REFFLD(WF2305 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            WF2306    R             62REFFLD(WF2306 *LIBL/REWF23)
     A                                      EDTCDE(J)
      *WF2305-WF2306
     A            WF2356    R             78REFFLD(WF2306 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A            WF2307    R             35REFFLD(WF2307 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            WF2308    R             49REFFLD(WF2308 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            WF2309    R             62REFFLD(WF2309 *LIBL/REWF23)
     A                                      EDTCDE(J)
      *WF2308-WF2309
     A            WF2389    R             78REFFLD(WF2309 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    16'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------------'
     A                                      SPACEA(1)
     A                                    16'產品識別小計'
     A            T12304    R             35REFFLD(WF2304 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T12305    R             49REFFLD(WF2305 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T12306    R             62REFFLD(WF2306 *LIBL/REWF23)
     A                                      EDTCDE(J)
      *T12305-T12306
     A            T12356    R             78REFFLD(WF2306 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A            T12307    R             35REFFLD(WF2307 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T12308    R             49REFFLD(WF2308 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T12309    R             62REFFLD(WF2309 *LIBL/REWF23)
     A                                      EDTCDE(J)
      *T12308-T12309
     A            T12389    R             78REFFLD(WF2309 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A                                    16'月目標額'
     A            T1SLMM    R             33REFFLD(SL05)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A                                    16'期間達成率'
     A            RATER          3  0     37
     A                                      EDTCDE(J)
     A                                    +0'%'
     A                                      SPACEA(1)
     A                                    16'月達成率'
     A            RATEM          3  0     37
     A                                      EDTCDE(J)
     A                                    +0'%'
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    16'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------------'
     A                                      SPACEA(1)
     A                                    16'專櫃小計　　'
     A            T22304    R             35REFFLD(WF2304 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T22305    R             49REFFLD(WF2305 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T22306    R             62REFFLD(WF2306 *LIBL/REWF23)
     A                                      EDTCDE(J)
      *T12305-T12306
     A            T22356    R             78REFFLD(WF2306 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A            T22307    R             35REFFLD(WF2307 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T22308    R             49REFFLD(WF2308 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T22309    R             62REFFLD(WF2309 *LIBL/REWF23)
     A                                      EDTCDE(J)
      *T12308-T12309
     A            T22389    R             78REFFLD(WF2309 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    16'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------------'
     A                                      SPACEA(1)
     A                                    16'總　　計　　'
     A            T32304    R             35REFFLD(WF2304 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T32305    R             49REFFLD(WF2305 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T32306    R             62REFFLD(WF2306 *LIBL/REWF23)
     A                                      EDTCDE(J)
      *T12305-T12306
     A            T32356    R             78REFFLD(WF2306 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A            T32307    R             35REFFLD(WF2307 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T32308    R             49REFFLD(WF2308 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A            T32309    R             62REFFLD(WF2309 *LIBL/REWF23)
     A                                      EDTCDE(J)
      *T12308-T12309
     A            T32389    R             78REFFLD(WF2309 *LIBL/REWF23)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'<<SAR052>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
