     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
     A*                                                              *
     A*    DSPF NAME    : SAR072P                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 83/05/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR072                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品銷售分析週報表－依辦事處              *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    80MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    79'產品銷售分析週報表－依辦事處'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            DMA07          1A       +1
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            WF8712         1A       +1
     A            COMPC          6   O    +1
     A                                      SPACEA(1)
     A                                     1'產品種類:'
     A            DMA11          1A       +1
     A            TEXT          10A       +1
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DMA01S         9A       +1
     A                                    +1'-'
     A            DMA01E         9A       +1
     A                                      SPACEA(1)
     A                                     1'含試飲　:'
     A            DSEL1          1A       +1
     A                                      SPACEA(1)
     A                                     1'分析方式:'
     A            DSEL2          1A       +1
     A N20                                15'禮盒不拆'
     A  20                                15'禮盒拆單瓶'
     A                                   166'日期:'
     A            $EGMDY         6  0O   174EDTCDE(Y)
     A                                   184'頁次:'
     A                                   191PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'內　　容:'
     A            DSEL3          1A       +1
     A N21                                15'含專櫃'
     A  21                                15'不含專櫃'
     A                                   166'時間:'
     A                                   174TIME
     A                                      SPACEA(1)
     A                                     1'通　　路:'
     A            DSEL4          1A       +1
     A  22                                15'含D'
     A  23                                15'不含D'
     A  24                                15' ONLY D'
     A                                    82'****數量以標準箱數計****'
     A                                   167'USER :'
     A            $USER         10   O   174
     A                                   184'<SAR072>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                    40'-----------'
     A                                    53'當期'
     A                                    61'-----------'
     A                                    81'-----------'
     A                                    94'當月'
     A                                   102'-----------'
     A                                   122'-----------'
     A                                   135'當年'
     A                                   143'-----------'
     A                                   163'-----------'
     A                                   176'去年'
     A                                   184'-----------'
     A                                      SPACEA(1)
     A            DATES          6  0     45EDTWRD('  /  /  ')
     A                                    55'-'
     A            DATEE          6  0     57EDTWRD('  /  /  ')
     A            D01S           6  0     85EDTWRD('  /  /  ')
     A                                    95'-'
     A            D01E           6  0     97EDTWRD('  /  /  ')
     A            D02S           6  0    127EDTWRD('  /  /  ')
     A                                   137'-'
     A            D02E           6  0    139EDTWRD('  /  /  ')
     A            D03S           4  0    168EDTWRD('  /  ')
     A                                   178'-'
     A            D03E           4  0    180EDTWRD('  /  ')
     A                                      SPACEA(1)
     A                                     1'產品／簡稱'
     A                                    40'訂購'
     A                                    53'搭贈'
     A                                    66'合計'
     A                                    81'訂購'
     A                                    94'搭贈'
     A                                   107'合計'
     A                                   122'訂購'
     A                                   135'搭贈'
     A                                   149'合計'
     A                                   163'訂購'
     A                                   176'搭贈'
     A                                   189'合計'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF8703    R              2REFFLD(WF8703 *LIBL/REWF87)
     A            MA03      R             +1
     A            F8704          9  0     35EDTCDE(J)
     A            F8705          9  0     48EDTCDE(J)
     A            F0405          9  0     61EDTCDE(J)
     A            F8706          9  0     76EDTCDE(J)
     A            F8707          9  0     89EDTCDE(J)
     A            F0607          9  0    102EDTCDE(J)
     A            F8708          9  0    117EDTCDE(J)
     A            F8709          9  0    130EDTCDE(J)
     A            F0809          9  0    143EDTCDE(J)
     A            F8710          9  0    158EDTCDE(J)
     A            F8711          9  0    171EDTCDE(J)
     A            F1011          9  0    184EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            WF8702    R              2REFFLD(WF8702 *LIBL/REWF87)
     A                                     8'小計-------------------+
     A                                      ->'
     A            T1TOT1         9  0     35EDTCDE(J)
     A            T1TOT2         9  0     48EDTCDE(J)
     A            T1TOT3         9  0     61EDTCDE(J)
     A            T1TOT4         9  0     76EDTCDE(J)
     A            T1TOT5         9  0     89EDTCDE(J)
     A            T1TOT6         9  0    102EDTCDE(J)
     A            T1TOT7         9  0    117EDTCDE(J)
     A            T1TOT8         9  0    130EDTCDE(J)
     A            T1TOT9         9  0    143EDTCDE(J)
     A            T1TO10         9  0    158EDTCDE(J)
     A            T1TO11         9  0    171EDTCDE(J)
     A            T1TO12         9  0    184EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A            WF8701    R              2REFFLD(WF8701 *LIBL/REWF87)
     A                                     8'小計-------------------+
     A                                      ->'
     A            T2TOT1         9  0     35EDTCDE(J)
     A            T2TOT2         9  0     48EDTCDE(J)
     A            T2TOT3         9  0     61EDTCDE(J)
     A            T2TOT4         9  0     76EDTCDE(J)
     A            T2TOT5         9  0     89EDTCDE(J)
     A            T2TOT6         9  0    102EDTCDE(J)
     A            T2TOT7         9  0    117EDTCDE(J)
     A            T2TOT8         9  0    130EDTCDE(J)
     A            T2TOT9         9  0    143EDTCDE(J)
     A            T2TO10         9  0    158EDTCDE(J)
     A            T2TO11         9  0    171EDTCDE(J)
     A            T2TO12         9  0    184EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     8'辦事處小計-------------+
     A                                      ->'
     A            T3TOT1         9  0     35EDTCDE(J)
     A            T3TOT2         9  0     48EDTCDE(J)
     A            T3TOT3         9  0     61EDTCDE(J)
     A            T3TOT4         9  0     76EDTCDE(J)
     A            T3TOT5         9  0     89EDTCDE(J)
     A            T3TOT6         9  0    102EDTCDE(J)
     A            T3TOT7         9  0    117EDTCDE(J)
     A            T3TOT8         9  0    130EDTCDE(J)
     A            T3TOT9         9  0    143EDTCDE(J)
     A            T3TO10         9  0    158EDTCDE(J)
     A            T3TO11         9  0    171EDTCDE(J)
     A            T3TO12         9  0    184EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT4                       SPACEA(1)
     A                                     8'總計-------------------+
     A                                      ->'
     A            T4TOT1         9  0     35EDTCDE(J)
     A            T4TOT2         9  0     48EDTCDE(J)
     A            T4TOT3         9  0     61EDTCDE(J)
     A            T4TOT4         9  0     76EDTCDE(J)
     A            T4TOT5         9  0     89EDTCDE(J)
     A            T4TOT6         9  0    102EDTCDE(J)
     A            T4TOT7         9  0    117EDTCDE(J)
     A            T4TOT8         9  0    130EDTCDE(J)
     A            T4TOT9         9  0    143EDTCDE(J)
     A            T4TO10         9  0    158EDTCDE(J)
     A            T4TO11         9  0    171EDTCDE(J)
     A            T4TO12         9  0    184EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                     2'<<SAR072>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
