     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR048P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR048                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品成長率分析表                          *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    26MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    31'產品成長率分析表'
     A                                      SPACEA(2)
     A                                     1'通路　　:'
     A            WF2801    R             +1REFFLD(WF2801 *LIBL/REWF28)
     A            #A03      R             +1
     A                                      SPACEA(1)
     A                                     1'型態　　:'
     A            WF2802    R             +1REFFLD(WF2802 *LIBL/REWF28)
     A            #C03      R             +1
     A                                      SPACEA(1)
     A                                     1'地區　　:'
     A            WF2803    R             +1REFFLD(WF2803 *LIBL/REWF28)
     A            #D02      R             +1
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            WF2804    R             +1REFFLD(WF2804 *LIBL/REWF28)
     A                                    51'日期:'
     A            $EGMDY         6  0O    58EDTCDE(Y)
     A                                    68'頁次:'
     A                                    75PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品簡稱:'
     A            MA03      R             +1
     A                                    51'時間:'
     A                                    58TIME
     A                                      SPACEA(1)
     A                                     1'禮盒組拆:'
     A            DSEL           1A  O    11
     A N22                                13'禮盒不拆'
     A  22                                13'禮盒拆單瓶'
     A                                    51' USER :'
     A            $USER         10   O    58
     A                                    70'<SAR048>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'年月'
     A                                    10'銷售數量'
     A                                    21'成長率'
     A                                    30'年累計銷售數量'
     A                                    46'年成長率'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(2)
M001MA*           WF2805    R              2REFFLD(WF2805 *LIBL/REWF28)
M001MA            W4S            4  0      2
     A                                      EDTWRD('  /  ')
     A            WF2806    R             12REFFLD(WF2806 *LIBL/REWF28)
     A                                      EDTCDE(J)
      *(WF2806-WF2808)/WF2808
     A            RATE1          3  0     24
     A                                      EDTCDE(J)
     A                                    +0'%'
     A            WF2807    R             35REFFLD(WF2807 *LIBL/REWF28)
     A                                      EDTCDE(J)
      *(WF2807-WF2809)/WF2809
     A            RATE2          3  0     52
     A                                      EDTCDE(J)
     A                                    +0'%'
     A                                      SPACEA(1)
M001MA*           W28051    R              2REFFLD(WF2805 *LIBL/REWF28)
M001MA            W4S1           4  0      2
     A                                      EDTWRD('  /  ')
     A                                    11'('
     A            WF2808    R             12REFFLD(WF2808 *LIBL/REWF28)
     A                                      EDTCDE(J)
     A                                    +0')'
     A                                    34'('
     A            WF2809    R             35REFFLD(WF2809 *LIBL/REWF28)
     A                                      EDTCDE(J)
     A                                    +0')'
     A*----------------------------------------------------------------
     A          R PT1                       SPACEB(2)
     A                                     1'零售價:'
     A            MA416     R             32REFFLD(MA41)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<SAR048>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
