     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR049D                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/05/18                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR0492                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :試飲分析表                                *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    70MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    78'試飲分析表'
     A                                      SPACEA(1)
     A            GROUP         10   O    80
     A                                      SPACEA(1)
     A                                     1'公　司　:'
     A            DSC01S         2   O    +1
     A                                    +7'-'
     A            DSC01E         2   O    +1
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
     A N20        DSC07S         6  0O    13EDTCDE(Y)
     A N20                                +1'-'
     A N20        DSC07E         6  0O    +1EDTCDE(Y)
     A  20        DSC39S         6  0O    13EDTCDE(Y)
     A  20                                +1'-'
     A  20        DSC39E         6  0O    +1EDTCDE(Y)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S         9   O    13
     A                                    +1'-'
     A            DSD03E         9   O    +1
     A                                   150'日期:'
     A            $EGMDY         6  0O   157EDTCDE(Y)
     A                                   167'頁次:'
     A                                   175PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'選　擇　:'
     A                                    +1'B業務員'
     A                                   150'時間:'
     A                                   157TIME
     A                                      SPACEA(1)
     A                                     1'禮盒組拆:'
     A            DSEL1          1A  O    11
     A                                    13'禮盒不拆'
     A                                   150' USER :'
     A            $USER         10   O   157
     A                                   169'<SAR049BP>'
     A                                      SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===================='
     A                                      SPACEA(1)
     A                                     1'業務員'
     A                                    12'原因／說明'
     A                                    34'品牌'
     A                                    40'客戶代號'
     A                                    53'客戶簡稱'
     A                                    70'產品代號'
     A                                    80'產品簡稱'
     A                                    99'數量'
     A                                   110'折讓'
     A                                   126'  F.O.B.'
     A                                   141'  F.H.I.'
     A                                   156'    DUTY'
     A                                   172'總成本'
     A                                      SPACEA(1)
     A                                     1'--------------------'
     A                                    21'--------------------'
     A                                    41'--------------------'
     A                                    61'--------------------'
     A                                    81'--------------------'
     A                                   101'--------------------'
     A                                   121'--------------------'
     A                                   141'--------------------'
     A                                   161'--------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        MC02      R              1
     A N31        SC10      R             13
     A N31        #A03      R             17
     A N32        MA10      R             37
     A N33        SC04      R             41
     A N33N34                             +1'-'
     A N33        SC05      R             +1
     A N33        ME04      R             53
     A            SD03      R             71
     A            MA03      R             80
     A            AMT1           5  0     99EDTCDE(J)
     A N35        AMT2          11  2    105EDTCDE(J)
     A N35        AMT31         11  2    120EDTCDE(J)
     A N35        AMT32         11  2    135EDTCDE(J)
     A N35        AMT33         11  2    150EDTCDE(J)
     A N35        AMT3          11  2    165EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'總計--------------'
     A                                    21'--------------------'
     A                                    41'--------------------'
     A                                    61'--------------------'
     A                                    81'--------------->'
     A            QTY            5  0     98EDTCDE(M)
     A N35        TOT           12  2    103EDTCDE(M)
     A N35        TOT11         12  2    118EDTCDE(M)
     A N35        TOT12         12  2    133EDTCDE(M)
     A N35        TOT13         12  2    148EDTCDE(M)
     A N35        TOT1          12  2    163EDTCDE(M)
     A                                   132' '
     A                                      SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===================='
     A                                      SPACEA(1)
     A                                     2'<<SAR049BP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'===================='
     A                                   161'===================='
     A                                      SPACEA(1)
     A                                     2'<<SAR049BP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE4                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
