     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR047P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/05                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR047                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品銷售統計表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    81MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    87'產品銷售統計表'
     A                                      SPACEA(2)
     A                                     1'辦事處  :'
     A            COMP           1   O    +1
     A            COMPC          6   O    +1
     A                                      SPACEA(1)
     A                                     1'通路　:'
     A            DSC33S    R        O    +1REFFLD(SC33)
     A                                    +1'-'
     A            DSC33E    R        O    +1REFFLD(SC33)
     A                                      SPACEA(1)
     A                                     1'型態　:'
     A            DSC34S    R        O    +1REFFLD(SC34)
     A                                    +1'-'
     A            DSC34E    R        O    +1REFFLD(SC34)
     A                                      SPACEA(1)
     A                                     1'組別　:'
     A            DSC28S    R        O    +1REFFLD(SC28)
     A                                    +1'-'
     A            DSC28E    R        O    +1REFFLD(SC28)
     A                                      SPACEA(1)
     A                                     1'統計內容:'
     A            TITE          16        +1
     A  20                                30'確認日期'
     A N20                                30'送貨日期'
     A                                   166'日期:'
     A            $EGMDY         6  0O   173EDTCDE(Y)
     A                                   183'頁次:'
     A                                   190PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S    R             +1REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R             +1REFFLD(SD03)
     A                                   166'時間:'
     A                                   173TIME
     A                                      SPACEA(1)
     A                                     1'禮盒組拆:'
     A            DSLE           1        +1
     A N22                                16'禮盒不拆'
     A  22                                16'禮盒拆單瓶'
     A                                   166' USER :'
     A            $USER         10   O   173
     A                                   185'<SAR047>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    11'產品簡稱'
     A N25                                28'通路／型態'
     A            MM01           2  0     45EDTCDE(1)
     A                                    47'/'
     A            YY01           2  0     48EDTCDE(1)
     A            MM02           2  0     57EDTCDE(1)
     A                                    59'/'
     A            YY02           2  0     60EDTCDE(1)
     A            MM03           2  0     69EDTCDE(1)
     A                                    71'/'
     A            YY03           2  0     72EDTCDE(1)
     A            MM04           2  0     81EDTCDE(1)
     A                                    83'/'
     A            YY04           2  0     84EDTCDE(1)
     A            MM05           2  0     93EDTCDE(1)
     A                                    95'/'
     A            YY05           2  0     96EDTCDE(1)
     A            MM06           2  0    105EDTCDE(1)
     A                                   107'/'
     A            YY06           2  0    108EDTCDE(1)
     A            MM07           2  0    117EDTCDE(1)
     A                                   119'/'
     A            YY07           2  0    120EDTCDE(1)
     A            MM08           2  0    129EDTCDE(1)
     A                                   131'/'
     A            YY08           2  0    132EDTCDE(1)
     A            MM09           2  0    141EDTCDE(1)
     A                                   143'/'
     A            YY09           2  0    144EDTCDE(1)
     A            MM10           2  0    153EDTCDE(1)
     A                                   155'/'
     A            YY10           2  0    156EDTCDE(1)
     A            MM11           2  0    165EDTCDE(1)
     A                                   167'/'
     A            YY11           2  0    168EDTCDE(1)
     A            MM12           2  0    177EDTCDE(1)
     A                                   179'/'
     A            YY12           2  0    180EDTCDE(1)
     A                                   191'總計'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  30                                 1' '
     A                                      SPACEA(1)
     A N21        WF1702    R              2REFFLD(WF1702 *LIBL/REWF17)
     A N21        MA03      R             +0
     A            WF1703    R             32REFFLD(WF1703 *LIBL/REWF17)
     A            WF1704    R             34REFFLD(WF1704 *LIBL/REWF17)
     A            WF1706    R             42REFFLD(WF1706 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1708    R             54REFFLD(WF1708 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1710    R             66REFFLD(WF1710 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1712    R             78REFFLD(WF1712 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1714    R             90REFFLD(WF1714 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1716    R            102REFFLD(WF1716 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1718    R            114REFFLD(WF1718 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1720    R            126REFFLD(WF1720 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1722    R            138REFFLD(WF1722 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1724    R            150REFFLD(WF1724 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1726    R            162REFFLD(WF1726 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1728    R            174REFFLD(WF1728 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WFTOT1    R            188REFFLD(WF1728 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A            WF1707    R             38REFFLD(WF1707 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1709    R             50REFFLD(WF1709 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1711    R             62REFFLD(WF1711 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1713    R             74REFFLD(WF1713 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1715    R             86REFFLD(WF1715 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1717    R             98REFFLD(WF1717 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1719    R            110REFFLD(WF1719 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1721    R            122REFFLD(WF1721 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1723    R            134REFFLD(WF1723 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1725    R            146REFFLD(WF1725 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1727    R            158REFFLD(WF1727 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WF1729    R            170REFFLD(WF1729 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            WFTOT2        10  0    184EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PT0                       SPACEA(1)
     A                                    11'通路小計------------------->'
     A            T01706    R             42REFFLD(WF1706 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01708    R             54REFFLD(WF1708 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01710    R             66REFFLD(WF1710 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01712    R             78REFFLD(WF1712 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01714    R             90REFFLD(WF1714 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01716    R            102REFFLD(WF1716 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01718    R            114REFFLD(WF1718 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01720    R            126REFFLD(WF1720 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01722    R            138REFFLD(WF1722 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01724    R            150REFFLD(WF1724 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01726    R            162REFFLD(WF1726 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01728    R            174REFFLD(WF1728 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T0TOT1    R            188REFFLD(WF1728 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A            T01707    R             38REFFLD(WF1707 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01709    R             50REFFLD(WF1709 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01711    R             62REFFLD(WF1711 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01713    R             74REFFLD(WF1713 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01715    R             86REFFLD(WF1715 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01717    R             98REFFLD(WF1717 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01719    R            110REFFLD(WF1719 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01721    R            122REFFLD(WF1721 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01723    R            134REFFLD(WF1723 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01725    R            146REFFLD(WF1725 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01727    R            158REFFLD(WF1727 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T01729    R            170REFFLD(WF1729 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T0TOT2        10  0    184EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    12'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----'
     A                                      SPACEA(1)
     A                                    11'產品代號小計--------------->'
     A            T11706    R             42REFFLD(WF1706 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11708    R             54REFFLD(WF1708 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11710    R             66REFFLD(WF1710 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11712    R             78REFFLD(WF1712 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11714    R             90REFFLD(WF1714 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11716    R            102REFFLD(WF1716 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11718    R            114REFFLD(WF1718 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11720    R            126REFFLD(WF1720 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11722    R            138REFFLD(WF1722 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11724    R            150REFFLD(WF1724 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11726    R            162REFFLD(WF1726 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11728    R            174REFFLD(WF1728 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T1TOT1    R            188REFFLD(WF1728 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A            T11707    R             38REFFLD(WF1707 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11709    R             50REFFLD(WF1709 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11711    R             62REFFLD(WF1711 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11713    R             74REFFLD(WF1713 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11715    R             86REFFLD(WF1715 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11717    R             98REFFLD(WF1717 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11719    R            110REFFLD(WF1719 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11721    R            122REFFLD(WF1721 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11723    R            134REFFLD(WF1723 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11725    R            146REFFLD(WF1725 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11727    R            158REFFLD(WF1727 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T11729    R            170REFFLD(WF1729 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T1TOT2        10  0    184EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    12'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----'
     A                                      SPACEA(1)
     A                                    11'產品識別合計--------------->'
     A            T21706    R             42REFFLD(WF1706 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21708    R             54REFFLD(WF1708 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21710    R             66REFFLD(WF1710 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21712    R             78REFFLD(WF1712 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21714    R             90REFFLD(WF1714 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21716    R            102REFFLD(WF1716 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21718    R            114REFFLD(WF1718 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21720    R            126REFFLD(WF1720 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21722    R            138REFFLD(WF1722 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21724    R            150REFFLD(WF1724 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21726    R            162REFFLD(WF1726 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21728    R            174REFFLD(WF1728 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T2TOT1    R            188REFFLD(WF1728 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A                                      SPACEA(1)
     A            T21707    R             38REFFLD(WF1707 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21709    R             50REFFLD(WF1709 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21711    R             62REFFLD(WF1711 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21713    R             74REFFLD(WF1713 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21715    R             86REFFLD(WF1715 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21717    R             98REFFLD(WF1717 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21719    R            110REFFLD(WF1719 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21721    R            122REFFLD(WF1721 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21723    R            134REFFLD(WF1723 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21725    R            146REFFLD(WF1725 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21727    R            158REFFLD(WF1727 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T21729    R            170REFFLD(WF1729 *LIBL/REWF17)
     A                                      EDTCDE(M)
     A            T2TOT2        10  0    184EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'<<SAR047>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
