     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR059BP                                   *
     A*    AUTHOR       : 0070  JUDY                                 *
     A*    CREATE DATE  : 81/09/23                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR059                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品客戶銷售（退）金額排行榜              *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    70MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    70'產品客戶銷售（退）金額排行榜'
     A                                      SPACEA(2)
     A                                     1'客戶：'
     A            DSC04S    R             +1REFFLD(SC04)
     A                                    +1'-'
     A            DSC04E    R             +1REFFLD(SC04)
     A                                      SPACEA(1)
     A                                     1'地區：'
     A            DSC31S    R             +1REFFLD(SC31)
     A                                    +1'-'
     A            DSC31E    R             +1REFFLD(SC31)
     A                                      SPACEA(1)
     A                                     1'通路型態：'
     A            DSC33S    R             +1REFFLD(SC33)
     A            DSC34S    R             +1REFFLD(SC34)
     A                                    +1'-'
     A            DSC33E    R             +1REFFLD(SC33)
     A            DSC34E    R             +1REFFLD(SC34)
     A                                   132'日期:'
     A            $EGMDY         6  0O   139EDTCDE(Y)
     A                                   149'頁次:'
     A                                   157PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S         9   O    +1
     A                                    +1 '-'
     A            DSD03E         9   O    +1
     A                                   132'時間:'
     A                                   139TIME
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
     A N20        DSC08S         6  0O    13EDTCDE(Y)
     A N20                                +2'-'
     A N20        DSC08E         6  0O    +1EDTCDE(Y)
     A  20        DSC39S         6  0O    13EDTCDE(Y)
     A  20                                +2'-'
     A  20        DSC39E         6  0O    +1EDTCDE(Y)
     A                                   132' USER :'
     A            $USER         10   O   139
     A                                   151'<SAR059BP>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====='
     A                                      SPACEA(1)
     A                                     1'客戶代號／簡稱'
     A                                    31'------------------'
     A                                    49'金額'
     A                                    56'-----------------'
     A                                    80'-------------'
     A                                    93'瓶數'
     A                                   100'-------------'
     A                                   116'------------------'
     A                                   137'公升數'
     A                                   146'-------------------'
     A                                      SPACEA(1)
     A                                    37'銷售'
     A                                    51'銷退'
     A                                    65'淨額'
     A                                    73'名次'
     A                                    84'訂購'
     A                                    96'退訂'
     A                                   106'訂－退'
     A                                   125'訂購'
     A                                   142'退訂'
     A                                   157'訂－退'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF4001    R              2REFFLD(WF4001 *LIBL/REWF40)
     A            ME04      R              9
     A            WF4003    R             31REFFLD(WF4003 *LIBL/REWF40)
     A                                      EDTCDE(J)
     A            WF4006    R             45REFFLD(WF4003 *LIBL/REWF40)
     A                                      EDTCDE(J)
     A            WF4009    R             59REFFLD(WF4003 *LIBL/REWF40)
     A                                      EDTCDE(J)
     A            SORT           4  0     73EDTCDE(2)
     A            WF4002    R             80REFFLD(WF4002 *LIBL/REWF40)
     A                                      EDTCDE(J)
     A            WF4005    R             92REFFLD(WF4002 *LIBL/REWF40)
     A                                      EDTCDE(J)
     A            WF4008    R            104REFFLD(WF4002 *LIBL/REWF40)
     A                                      EDTCDE(J)
     A            WF4004    R            116REFFLD(WF4004 *LIBL/REWF40)
     A                                      EDTCDE(J)
     A            WF4007    R            133REFFLD(WF4004 *LIBL/REWF40)
     A                                      EDTCDE(J)
     A            WF4010    R            150REFFLD(WF4004 *LIBL/REWF40)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====='
     A                                      SPACEA(1)
     A                                     2'<<SAR059AP>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
