     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR056P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR056                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品專櫃達成率分析表                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    50MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    53'產品專櫃達成率分析表'
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S    R             +1REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R             +1REFFLD(SD03)
     A                                    86'日期:'
     A            $EGMDY         6  0O    93EDTCDE(Y)
     A                                   103'頁次:'
     A                                   111PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'專櫃代號:'
     A            DSC04S    R             +1REFFLD(SC04)
     A                                    +1'-'
     A            DSC04E    R             +1REFFLD(SC04)
     A                                    86'時間:'
     A                                    93TIME
     A                                      SPACEA(1)
     A                                     1'年月　　:'
     A            DSC39          4  0     +1
     A                                      EDTWRD('  /  ')
     A                                    86' USER :'
     A            $USER         10   O    93
     A                                   108'<SAR056>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =========='
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    11'產品簡稱'
     A                                    30'單價'
     A                                    36'專櫃名稱'
     A                                    59'當月數量'
     A                                    72'當月金額'
     A                                    88'當月成本'
     A                                   104'當月毛利'
     A                                   116'當月目標額'
     A                                      SPACEA(1)
     A                                    57'年累計數量'
     A                                    70'年累計金額'
     A                                    86'年累計成本'
     A                                   102'年銷售毛利'
     A                                   118'年目標額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ----------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  30                                 1' '
     A                                      SPACEA(1)
     A N31        WF2702    R              2REFFLD(WF2702 *LIBL/REWF27)
     A N31        MA03      R             11
     A N31        MA416     R             29REFFLD(MA41)
     A                                      EDTCDE(M)
     A            ME04      R             37
     A            WF2704    R             59REFFLD(WF2704 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            WF2705    R             69REFFLD(WF2705 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            WF2706    R             83REFFLD(WF2706 *LIBL/REWF27)
     A                                      EDTCDE(J)
      *WF2705-WF2706
     A            WF2756    R             99REFFLD(WF2706 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A            WF2707    R             59REFFLD(WF2707 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            WF2708    R             69REFFLD(WF2708 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            WF2709    R             83REFFLD(WF2709 *LIBL/REWF27)
     A                                      EDTCDE(J)
      *WF2708-WF2709
     A            WF2789    R             99REFFLD(WF2709 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    36'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ------------'
     A                                      SPACEA(1)
     A                                    35'產品識別小計'
     A            T12204    R             59REFFLD(WF2704 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            T12205    R             69REFFLD(WF2705 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            T12206    R             83REFFLD(WF2706 *LIBL/REWF27)
     A                                      EDTCDE(J)
      *T12205-T12206
     A            T12256    R             99REFFLD(WF2706 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            T1SLMM    R            116REFFLD(SL05)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A            T12207    R             59REFFLD(WF2707 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            T12208    R             69REFFLD(WF2708 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            T12209    R             83REFFLD(WF2709 *LIBL/REWF27)
     A                                      EDTCDE(J)
      *T12208-T12209
     A            T12289    R             99REFFLD(WF2709 *LIBL/REWF27)
     A                                      EDTCDE(J)
     A            T1SLYY    R            116REFFLD(SL04)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A                                    36'當月達成率'
     A            RATEM          3  0     64
     A                                      EDTCDE(J)
     A                                    +0'%'
     A                                      SPACEA(1)
     A                                    36'年達成率'
     A            RATEY          3  0     64
     A                                      EDTCDE(J)
     A                                    +0'%'
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =========='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEB(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =========='
     A                                      SPACEA(1)
     A                                     2'<<SAR056>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
