     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR042D                                    *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/05/05                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR042                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :產品退貨彙總表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    63MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    69'產品退貨彙總表'
     A                                      SPACEA(1)
     A                                    69'（銷貨退回）'
     A                                      SPACEA(1)
     A            GROUP         10   O    71
     A                                      SPACEA(1)
     A                                     1'公　　司:'
     A            DSG01          2   O    +1
     A                                      SPACEA(1)
     A                                     1'物流點　:'
     A            DSG07S    R        O    +1REFFLD(SG07)
     A                                    +1'-'
     A            DSG07E    R        O    +1REFFLD(SG07)
     A                                   121'日期:'
     A            $EGMDY         6  0O   128EDTCDE(Y)
     A                                   138'頁次:'
     A                                   146PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSH03S         9   O    +1
     A                                    +1'-'
     A            DSH03E         9   O    +1
     A                                   121'時間:'
     A                                   128TIME
     A                                   140'<SAR042A>'
     A                                      SPACEA(1)
     A  20                                 1'打單日期:'
     A  20        DSG06S         6  0O    +1EDTCDE(Y)
     A  20                                23'-'
     A  20        DSG06E         6  0O    +1EDTCDE(Y)
     A N20                                 1'確認日期:'
     A N20        DSG26S         6  0O    +1EDTCDE(Y)
     A N20                                23'-'
     A N20        DSG26E         6  0O    +1EDTCDE(Y)
     A                                   121' USER :'
     A            $USER         10A  O   128
     A                                      SPACEA(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'=========='
     A                                      SPACEA(1)
     A                                    96'-----轉　帳　銷　退　成　本-+
     A                                       ----'
     A                                   138'轉帳銷退'
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    11'產品簡稱'
     A                                    31'公司'
     A                                    51'數量'
     A                                    62'退貨金額'
     A                                    80'退貨成本'
     A                                    93'  F.O.B.'
     A                                   108'  F.H.I.'
     A                                   123'    DUTY'
     A                                   139'總成本'
     A                                      SPACEA(1)
     A                                     1'--------------------'
     A                                    21'--------------------'
     A                                    41'--------------------'
     A                                    61'--------------------'
     A                                    81'--------------------'
     A                                   101'--------------------'
     A                                   121'--------------------'
     A                                   141'----------'
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A N21        WF5402    R        O     2
     A                                      REFFLD(SH03)
     A N21        MA03      R        O    11
     A                                      REFFLD(MA03)
     A            WF5401    R        O    30
     A                                      REFFLD(SH01)
     A            #B03      R        O    +1
     A            WF5403    R        O    50EDTCDE(J)
     A                                      REFFLD(SH04)
     A            WF5404    R        O    60EDTCDE(J)
     A                                      REFFLD(SH07)
     A            WF5405    R        O    75EDTCDE(J)
     A                                      REFFLD(SH08)
     A            WF5407    R        O    90EDTCDE(J)
     A                                      REFFLD(SH17)
     A            WF5408    R        O   105EDTCDE(J)
     A                                      REFFLD(SH18)
     A            WF5409    R        O   120EDTCDE(J)
     A                                      REFFLD(SH19)
     A            WF5410    R        O   135EDTCDE(J)
     A                                      REFFLD(SH20)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEB(1)
     A                                    30'產品合計-----> '
     A            CT03           5  0     50EDTCDE(J)
     A            CT04           9  0     60EDTCDE(J)
     A            CT05          11  2     75EDTCDE(J)
     A            CT07          11  2     90EDTCDE(J)
     A            CT08          11  2    105EDTCDE(J)
     A            CT09          11  2    120EDTCDE(J)
     A            CT10          11  2    135EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3                       SPACEB(1)
     A                                    30'總　　計-----> '
     A            TT03           5  0     50EDTCDE(J)
     A            TT04           9  0     60EDTCDE(J)
     A            TT05          11  2     75EDTCDE(J)
     A            TT07          11  2     90EDTCDE(J)
     A            TT08          11  2    105EDTCDE(J)
     A            TT09          11  2    120EDTCDE(J)
     A            TT10          11  2    135EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'=========='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEB(1)
     A                                     1'===================='
     A                                    21'===================='
     A                                    41'===================='
     A                                    61'===================='
     A                                    81'===================='
     A                                   101'===================='
     A                                   121'===================='
     A                                   141'=========='
     A                                      SPACEA(1)
     A                                     2'<<SAR042A>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEB(1)
     A                                     3'もも此範圍無資料もも'
