     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
     A*                                                              *
     A*    DSPF NAME    : SAR072P                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 83/05/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR072                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :品牌／客戶達成率同期比較表                *
     A****************************************************************
     A                                      REF(REW103)
     A          R PH1                       SKIPB(2)
     A                                    59MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    59'品牌／客戶達成率同期比較表　'
     A                                      SPACEA(2)
     A                                     1'地區別　:'
     A            COMP           1A       +1
     A            COMPC          6   O    +1
     A                                      SPACEA(1)
     A                                     1'品牌　　:'
     A            DMA10          2A       +1
     A            TEXT          20A       +1
     A                                      SPACEA(1)
     A                                     1'產品　　:'
     A            DMA01          6A       +1
     A            ITEM          20O       +1
     A                                   104'日期:'
     A            $EGMDY         6  0O   112EDTCDE(Y)
     A                                   122'頁次:'
     A                                   129PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                   104'時間:'
     A                                   112TIME
     A                                      SPACEA(1)
     A                                     1'分析方式:'
     A            DSEL2          1A       +1
     A N20                                20'禮盒不拆'
     A  20                                20'禮盒拆單瓶'
     A                                    60'****數量以標準瓶數計****'
     A                                   105'USER :'
     A            $USER         10   O   111
     A                                   122'<SAR074>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                    50'***'
     A                                    54'本期:'
     A            DATES          6  0     62EDTWRD('  /  /  ')
     A                                    72'-'
     A            DATEE          6  0     74EDTWRD('  /  /  ')
     A                                    83'***'
     A                                    91''
     A                                   105'ＹＴＤ'
     A                                   115'***'
     A                                   119'今年:'
     A            YTDS           6  0    127EDTWRD('  /  /  ')
     A                                   137'-'
     A            YTDE           6  0    139EDTWRD('  /  /  ')
     A                                   149'***'
     A                                      SPACEA(1)
     A                                     1'經銷商／通路'
     A                                    34'去年同期'
     A                                    52'本期數量'
     A                                    65'本期目標'
     A                                    76'本期達成率％'
     A                                    91''
     A                                    99'去年同期'
     A                                   116'今年數量'
     A                                   129'今年目標'
     A                                   140'今年達成率％'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1
     A            WF8702    R              2
     A            WF8703    R             +1
     A            WF8704    R             30EDTCDE(J)
     A            WF8705    R             47EDTCDE(J)
     A            WF8706    R             63EDTCDE(J)
     A            WF870Z         5  2     81EDTCDE(J)
     A            WF8708    R             94EDTCDE(J)
     A            WF8709    R            111EDTCDE(J)
     A            WF8710    R            127EDTCDE(J)
     A            WF871Z         5  2    145EDTCDE(J)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PT1
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------------'
     A                                      SPACEA(1)
     A                                     5'もも　經銷商小計.....:'
     A            TOT11     R             30EDTCDE(J)
     A                                      REFFLD(WF8704)
     A            TOT12     R             47EDTCDE(J)
     A                                      REFFLD(WF8705)
     A            TOT13     R             63EDTCDE(J)
     A                                      REFFLD(WF8706)
     A            TOT14          5  2     81EDTCDE(J)
     A            TOT15     R             94EDTCDE(J)
     A                                      REFFLD(WF8708)
     A            TOT16     R            111EDTCDE(J)
     A                                      REFFLD(WF8709)
     A            TOT17     R            127EDTCDE(J)
     A                                      REFFLD(WF8710)
     A            TOT18          5  2    145EDTCDE(J)
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PT2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'總計.....:'
     A            TOT21     R             30EDTCDE(J)
     A                                      REFFLD(WF8704)
     A            TOT22     R             47EDTCDE(J)
     A                                      REFFLD(WF8705)
     A            TOT23     R             63EDTCDE(J)
     A                                      REFFLD(WF8706)
     A            TOT24          5  2     81EDTCDE(J)
     A            TOT25     R             94EDTCDE(J)
     A                                      REFFLD(WF8708)
     A            TOT26     R            111EDTCDE(J)
     A                                      REFFLD(WF8709)
     A            TOT27     R            127EDTCDE(J)
     A                                      REFFLD(WF8710)
     A            TOT28          5  2    145EDTCDE(J)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PT3
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'<<SAR074>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
