     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SAR064P                                    *
     A*    AUTHOR       : AN MNIG HSIA                               *
     A*    CREATE DATE  : 81/12/17                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR064                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :客戶往來產品表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    87MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    93'客戶往來產品表'
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DSC45S         9A  O    +1
     A                                    +1'-'
     A            DSC45E         9A  O    +1
     A                                   164'日期:'
     A            $EGMDY         6  0O   172EDTCDE(Y)
     A                                   180'頁次:'
     A                                   188PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S    R        O    +1REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R        O    +1REFFLD(SD03)
     A                                   164'時間:'
     A                                   172TIME
     A                                      SPACEA(1)
     A                                     1'送貨日期:'
M001DA*           DSC08S    R        O    +1REFFLD(SC08)
M001AA            DSC08S         6  0O    +1
     A                                      EDTCDE(Y)
     A                                    +2'-'
M001DA*           DSC08E    R        O    +1REFFLD(SC08)
M001AA            DSC08E         6  0O    +1
     A                                      EDTCDE(Y)
     A                                   164' USER :'
     A            $USER         10       172
     A                                   183'<SAR064>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                    85'-------------------'
     A                                   105'最近一次出貨'
     A                                   120'-----------------'
     A                                   140'-------------------'
     A                                   160'最近二次出貨'
     A                                   175'-----------------'
     A                                      SPACEA(1)
     A                                     1'通路型態／名稱'
     A                                    28'客戶代號／簡稱'
     A                                    56'產品代號／簡稱'
     A                                    85'送貨日'
     A                                    93'訂購數量'
     A                                   105'售價'
     A                                   112'搭贈'
     A                                   119'業務員'
     A                                   140'送貨日'
     A                                   148'訂購數量'
     A                                   160'售價'
     A                                   167'搭贈'
     A                                   174'業務員'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N30        WF5702    R              2REFFLD(SC33)
     A N30        WF5703    R              4REFFLD(SC34)
     A N30        #C03      R              7
     A N32        WF5704    R             29REFFLD(SC04)
     A N32        WF5705    R             34REFFLD(SC05)
     A N32        ME04      R             +0
     A            WF5706    R             56REFFLD(SD03)
     A            MA03      R             66
M001DA*           D5707     R             85REFFLD(SC08)
M001AA            D5707          6  0     85
     A                                      EDTCDE(Y)
     A            WF5709    R             97REFFLD(SD04)
     A                                      EDTCDE(J)
     A            WF5711    R            105REFFLD(SD06)
     A                                      EDTCDE(J)
     A            WF5710    R            113REFFLD(SD05)
     A                                      EDTCDE(J)
     A N31        WF5713    R            120REFFLD(SC27)
     A N31        MC02A     R            126REFFLD(MC02)
M001DA*N34        D5714     R            140REFFLD(SC08)
M001AA N34        D5714          6  0    140
     A                                      EDTCDE(Y)
     A N34        WF5715    R            152REFFLD(SD04)
     A                                      EDTCDE(J)
     A N34        WF5717    R            160REFFLD(SD06)
     A                                      EDTCDE(J)
     A N34        WF5716    R            168REFFLD(SD05)
     A                                      EDTCDE(J)
     A N34        WF5719    R            175REFFLD(SC27)
     A N34        MC02B     R            181REFFLD(MC02)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =============='
     A                                      SPACEA(1)
     A                                     2'<<SAR064>>--->報表結束'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
