     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SAR067P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 09/01/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR067                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :試飲分析彙總表                            *
     A*==============================================================*
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*--------------------------------------------------------------
     A* M001 |MICHELLE|03.02.10| ADD COLUMN: COSTCODE
     A*--------------------------------------------------------------
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    53MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    59'試飲分析彙總表'
     A                                      SPACEA(2)
     A                                     1'公　司　:'
     A            DSC01S         2   O    +1
     A                                    +7'-'
     A            DSC01E         2   O    +1
     A                                   110'日期:'
     A            $EGMDY         6  0O   117EDTCDE(Y)
     A                                   128'頁次:'
     A                                   135PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
     A N20        DSC07S         6  0O    13EDTCDE(Y)
     A N20                                +1'-'
     A N20        DSC07E         6  0O    +1EDTCDE(Y)
     A  20        DSC39S         6  0O    13EDTCDE(Y)
     A  20                                +1'-'
     A  20        DSC39E         6  0O    +1EDTCDE(Y)
     A                                   110'時間:'
     A                                   117TIME
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S         9   O    13
     A                                    +1'-'
     A            DSD03E         9   O    +1
     A                                   110' USER :'
     A            $USER         10   O   117
     A                                   130'<SAR067P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
M001AA                                       ======+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'品牌'
     A                                    28'原因／說明'
     A                                    44'產品代號'
     A                                    54'產品簡稱'
     A                                    75'數量'
     A                                    85'  F.O.B.'
     A                                    99'  F.H.I.'
     A                                   113'    DUTY'
     A                                   129'總成本'
M001AA                                   139'COSTCODE'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
M001AA                                       ------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  21                                 1' '
     A  21                                  SPACEA(1)
     A N30        WF8401    R              2REFFLD(MA10)
     A N30        WF8402    R              5REFFLD(WF8402 REWF84)
     A            WF8404    R             28REFFLD(WF8404 REWF84)
     A            WF8405    R             31REFFLD(WF8405 REWF84)
     A            WF8406    R             44REFFLD(SD03)
     A            MA03      R             54
     A            WF8408    R             74EDTCDE(J)
     A                                      REFFLD(WF8408 REWF84)
     A N34        WF8411    R             82EDTCDE(J)
     A                                      REFFLD(WF8411 REWF84)
     A N34        WF8412    R             96EDTCDE(J)
     A                                      REFFLD(WF8412 REWF84)
     A N34        WF8413    R            110EDTCDE(J)
     A                                      REFFLD(WF8413 REWF84)
     A N34        TOT0          10  2    124EDTCDE(J)
M001AA            WF8414    R            141REFFLD(WF8414 REWF84)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            WF8403         6        55
     A                                    62'合計--->'
     A            T18408         6  0     73EDTCDE(J)
     A N34        T18411        11  2     81EDTCDE(J)
     A N34        T18412        11  2     97EDTCDE(M)
     A N34        T18413        11  2    111EDTCDE(M)
     A N34        TOT1          11  2    125EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A            WF8401         2        55
     A                                    58'品牌合計--->'
     A            T28408         6  0     73EDTCDE(J)
     A N34        T28411        11  2     81EDTCDE(J)
     A N34        T28412        11  2     97EDTCDE(M)
     A N34        T28413        11  2    111EDTCDE(M)
     A N34        TOT2          11  2    125EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    54'總計----------->'
     A            T38408         6  0     73EDTCDE(J)
     A N34        T38411        11  2     81EDTCDE(J)
     A N34        T38412        11  2     97EDTCDE(M)
     A N34        T38413        11  2    111EDTCDE(M)
     A N34        TOT3          11  2    125EDTCDE(M)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
M001AA                                       ======+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
M001AA                                       ======+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<SAR067P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
