     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SAR068P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 09/01/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR068                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :搭贈分析彙總表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    42MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    48'搭贈分析彙總表'
     A                                      SPACEA(2)
     A                                     1'公　司　:'
     A            DSC01          1   O    +1
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            DCOMP          6   O    +1
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
     A N20        DSC07S         6  0O    13EDTCDE(Y)
     A N20                                +1'-'
     A N20        DSC07E         6  0O    +1EDTCDE(Y)
     A  20        DSC39S         6  0O    13EDTCDE(Y)
     A  20                                +1'-'
     A  20        DSC39E         6  0O    +1EDTCDE(Y)
     A                                    90'日期:'
     A            $EGMDY         6  0O    97EDTCDE(Y)
     A                                   107'頁次:'
     A                                   115PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S         9   O    13
     A                                    +1'-'
     A            DSD03E         9   O    +1
     A                                    90'時間:'
     A                                    97TIME
     A                                      SPACEA(1)
     A                                     1'轉帳　　:'
     A            TEXT           8   O    13
     A                                    90' USER :'
     A            $USER         10   O    97
     A                                   110'<SAR068P>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'品牌'
     A                                    28'產品代號'
     A                                    39'產品簡稱'
     A                                    56'數量'
     A*                                   68'折讓'
     A                                    66'  F.O.B.'
     A                                    80'  F.H.I.'
     A                                    94'    DUTY'
     A                                   110'總成本'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  21                                 1' '
     A  21                                  SPACEA(1)
     A N30        WF8401    R              2REFFLD(MA10)
     A N30        WF8402    R              5REFFLD(WF8402 REWF84)
     A            WF8406    R             28REFFLD(SD03)
     A            MA03      R             37
     A            WF8409    R             55EDTCDE(J)
     A                                      REFFLD(WF8409 REWF84)
     A*N34        WF8410    R             63EDTCDE(J)
     A*                                     REFFLD(WF8410 REWF84)
     A N34        WF8411    R             63EDTCDE(J)
     A                                      REFFLD(WF8411 REWF84)
     A N34        WF8412    R             77EDTCDE(J)
     A                                      REFFLD(WF8412 REWF84)
     A N34        WF8413    R             91EDTCDE(J)
     A                                      REFFLD(WF8413 REWF84)
     A N34        TOT0          11  2    105EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            WF8403         6        38
     A                                    45'合計--->'
     A            T18409         5  0     55EDTCDE(J)
     A*N34        T18410        10  2     62EDTCDE(J)
     A N34        T18411        10  2     63EDTCDE(J)
     A N34        T18412        10  2     77EDTCDE(J)
     A N34        T18413        10  2     91EDTCDE(J)
     A N34        TOT1          11  2    105EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A            WF8401         2        38
     A                                    41'品牌合計--->'
     A            T28409         5  0     55EDTCDE(J)
     A*N34        T28410        10  2     62EDTCDE(J)
     A N34        T28411        10  2     63EDTCDE(J)
     A N34        T28412        10  2     77EDTCDE(J)
     A N34        T28413        10  2     91EDTCDE(J)
     A N34        TOT2          11  2    105EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    37'總計----------->'
     A            T38409         5  0     55EDTCDE(J)
     A*N34        T38410        10  2     62EDTCDE(J)
     A N34        T38411        10  2     63EDTCDE(J)
     A N34        T38412        10  2     77EDTCDE(J)
     A N34        T38413        10  2     91EDTCDE(J)
     A N34        TOT3          11  2    105EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<SAR068P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
