     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SAR077D                                    *
     A*    AUTHOR       :                                            *
     A*    CREATE DATE  : 81/05/05                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SAR047                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收帳款作業                              *
     A*    REMARK       :康齡銷貨折讓差異調整表                *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    25MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    29'康齡銷貨折讓調整表'
     A                                      SPACEA(1)
     A                                    56'日期:'
     A            $EGMDY         6  0O    63EDTCDE(Y)
     A                                    73'頁次:'
     A                                    80PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'專櫃代號:'
     A            DSG18S         5        +1
     A                                    +4'-'
     A            DSG18E         5        +1
     A                                    56'時間:'
     A                                    63TIME
     A                                      SPACEA(1)
     A                                     1'折讓日期:'
     A            DSG26S         6  0O    +1EDTCDE(Y)
     A                                    23'-'
     A            DSG26E         6  0O    +1EDTCDE(Y)
     A                                    57'USER :'
     A            $USER         10   O    63
     A                                    73'<SAR077A>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                      ====================+
     A                                      ====================+
     A                                      ===================='
     A                                      SPACEA(1)
     A                                     1'退貨單號'
     A                                    13'產品代號＼簡稱'
     A                                    40'匯東金額'
     A                                    55'康齡成本'
     A                                    70'差異金額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                      --------------------+
     A                                      --------------------+
     A                                      --------------------'
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A N30        SG02      R              1
     A            SH03      R             13
     A            MA03      R             22
     A            SH07      R             40EDTCDE(K)
     A            SH08      R             52EDTCDE(K)
     A            FIELD         11  2     67EDTCDE(K)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEB(1)
     A            T1TOT1         9  0     40EDTCDE(K)
     A            T1TOT2        11  2     52EDTCDE(K)
     A            T1TOT3        11  2     67EDTCDE(K)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     1'====================+
     A                                      ====================+
     A                                      ====================+
     A                                      ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEB(1)
     A                                     1'====================+
     A                                      ====================+
     A                                      ====================+
     A                                      ===================='
     A                                      SPACEA(1)
     A                                     2'<<SAR077A>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEB(1)
     A                                     3'もも此範圍無資料もも'
