     A*===============================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE FOR Y2K
     F*----------------------------------------------------------------
     F*  M002     | 99.11.11 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SAR041'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0   1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'客戶退貨明細表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A     3 70
     A                                  5 26'辦事處　:'
     A            COMP           1A     5 38
     A                                  5 40'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  6 26'組別代號:'
     A            DSG12S         4A     6 38
     A                                  6 47'-'
     A            DSG12E         4A     6 49
     A                                  7 26'業務員　:'
     A            DSG11S         6A     7 38
     A                                  7 47'-'
     A            DSG11E         6A     7 49
     A                                  8 26'客戶代號:'
     A            DSG04S         5A     8 38
     A                                  8 47'-'
     A            DSG04E         5A     8 49
M002AA                                  9 26'集　　團:'
M002AA            DMD06S         2      9 38
M002AA                                  9 47'-'
M002AA            DMD06E         2      9 49
     A                                 10 26'打單日期:'
     A            DSG06S         6  0  10 38EDTWRD('  /  /  ')
     A                                 10 47'-'
     A            DSG06E         6  0  10 49EDTWRD('  /  /  ')
     A                                 11 26'確認日期:'
     A            DSG26E         6  0  11 49EDTWRD('  /  /  ')
     A            DSG26S         6  0  11 38EDTWRD('  /  /  ')
     A                                 11 47'-'
     A                                 11 58'(MM/DD/YY)'
     A                                 12 26'產品代號:'
     A            DSH03S    R          12 38REFFLD(SH03)
     A                                 12 48'-'
     A            DSH03E    R          12 51REFFLD(SH03)
     A                                 13 26'選擇內容:'
     A            DSG03          1A    13 38
     A                                 13 40'A-銷貨退回'
     A                                 14 40'B-產品收回'
     A            DATA1          1A    14 53
     A                                 14 55'1-含試飲退回'
     A                                 15 55'2-不含試飲退回'
     A                                 16 55'3-僅含試飲退回'
     A                                 17 26'執行環境:'
     A            $EVR           1  0  17 38
     A                                      EDTCDE(3)
     A                                 17 43'(1-即時 2-批次)'
     A                                 18 26'列印份數:'
     A            $CPY           3  0  18 38EDTCDE(3)
     A                                 19 26'列表機　:'
     A            $PRTID         2  0  19 38
     A                                      EDTCDE(3)
     A                                 20 27'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                  9 58'(MM/DD/YY)'
