     A*%%TS  SD  19950517  160935  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SAR075D                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 84/05/17                                   *
     A*    PROGRAM NAME : SAR075                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :客戶產品銷售管理追蹤表　　　              *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SAR075'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 26'客戶產品銷售管理追蹤表　'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5 25'辦事處　:'
     A            COMP           1A  O  5 38
     A                                  5 40'( 1=台北2=台中3=高雄"*"=全+
     A                                      部)'
     A                                  6 25'通路　　:'
     A            DSC33S    R        O  6 37REFFLD(SC33)
     A                                  6 47'-'
     A            DSC33E    R        O  6 49REFFLD(SC33)
     A                                  7 25'型態　　:'
     A            DSC34S    R        O  7 37REFFLD(SC34)
     A                                  7 47'-'
     A            DSC34E    R        O  7 49REFFLD(SC34)
     A                                  8 25'客戶代號:'
     A            DSC04S         5A  O  8 37
     A                                  8 47'-'
     A            DSC04E         5A  O  8 49
     A                                  9 25'產品組別:'
     A            DMA11          1A  O  9 38
     A                                  9 40'(1-BRANDY 2-WHISKY 3-WINE " "-ALL)'
     A                                 10 25'產品代號:'
     A            DSD03S         9A  O 10 38
     A                                 10 48'-'
     A            DSD03E         9A  O 10 50
     A                                 11 25'送貨日期:'
M001MA*           DSC08S    R        O 11 38REFFLD(SC39)
M001MA            DSC08S         6  0O 11 38
     A                                      EDTWRD('  /  /  ')
     A                                 11 48'-'
M001MA*           DSC08E    R        O 11 50REFFLD(SC39)
M001MA            DSC08E         6  0O 11 50
     A                                      EDTWRD('  /  /  ')
     A                                 11 61'(MM/DD/YY)'
     A                                 12 25'確認日期:'
M001MA*           SC39S     R        O 12 38REFFLD(SC39)
M001MA            SC39S          6  0O 12 38
     A                                      EDTWRD('  /  /  ')
     A                                 12 48'-'
M001MA*           SC39E     R        O 12 50REFFLD(SC39)
M001MA            SC39E          6  0O 12 50
     A                                      EDTWRD('  /  /  ')
     A                                 12 61'(MM/DD/YY)'
     A                                 13 25'分析方式:'
     A            DSEL           1A  O 13 38
     A                                 13 41'A-依總公司'
     A                                 14 41'B-依分公司'
     A                                 17 26'執行環境 :'
     A            $EVR           1  0O 17 39EDTCDE(3)
     A                                 17 41'(1-即時   2-批次)'
     A                                 18 26'列印份數'
     A                                 18 37':'
     A            $CPY           3  0O 18 39EDTCDE(3)
     A                                 19 26'列表機'
     A                                 19 37':'
     A            $PRTID         2  0O 19 39
     A                                      EDTCDE(3)
     A                                 21 27'***請準備１３２行報表紙***'
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A                                 23 25'F4 =視窗查詢'
     A                                 23 40'F5 =參考資料'
