     A*%%TS  SD  19920908  104405  REPGMRP     REL-V2R1M0  5738-PW1
     A*  81/01/21  17:53:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : SOA006D                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/01/29                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOA006                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :訂單／送貨核准發放處理                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/SOSMLF3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A*
     A          R DSPC1
     A*%%TS  SD  19920908  104405  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                  1  2'SOA006'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'訂單／送貨核准處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  7 25'辦事處:'
     A            DSM011    R        B  7 35REFFLD(SM011)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                      VALUES('1' '2' '3' ' ')
     A                                  7 38'( 1=台北2=台中3=高雄)'
     A                                  9 27'通路:'
     A            DSM17     R        B  9 35REFFLD(SM17)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A            #A03      R        O  9 38REFFLD(#A03 *LIBL/PA#APF)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
