     A*%%TS  SD  19930107  092216  D910091     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SOA017XD                                   *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 82/01/07                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOA017XD                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :通路產品報價還原作業                      *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.11 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19930107  092216  D910091     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF04(04 'F4 HELP')
     A                                      CF14(14 '處理作業')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'SOA017X'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 27'通路產品報價拷貝還原作業'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4 26'通路　　:'
     A                                      DSPATR(HI)
     A            DSA02S    R        B  4 38REFFLD(SA02)
     A N60                                  DSPATR(HI)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                  4 40'-'
     A            DSA02E    R        B  4 42REFFLD(SA02)
     A N61                                  DSPATR(HI)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A                                  6 26'型態　　:'
     A                                      DSPATR(HI)
     A            DSA03S    R        B  6 38REFFLD(SA03)
     A N69                                  DSPATR(HI)
     A  69                                  DSPATR(RI)
     A  69                                  DSPATR(PC)
     A                                  6 41'-'
     A            DSA03E    R        B  6 43REFFLD(SA03)
     A N70                                  DSPATR(HI)
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A                                  8 26'產品代號:'
     A                                      DSPATR(HI)
     A            DSA01S    R        B  8 38REFFLD(RERFR/SA01 *LIBL/RERF)
     A N62                                  DSPATR(HI)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A                                  8 48'-'
     A            DSA01E    R        B  8 52REFFLD(RERFR/SA01 *LIBL/RERF)
     A N63                                  DSPATR(HI)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                 10 26'折扣別  :'
     A            DSA04          1A  B 10 38VALUES('N' 'S' 'A')
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                 10 40'(N-普通S-特別A-搭贈)'
     A                                 12 23'生效起始日期'
     A            DSA05          6Y 0B 12 38EDTWRD('  /  /  ')
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                 12 47'訖'
     A            DSA13          6Y 0B 12 52EDTWRD('  /  /  ')
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A                                 12 62'(MM/DD/YY)'
     A                                 16 19'+----------------------------------
     A                                      --------------+'
     A                                 17 19'|'
     A                                 17 67'|'
     A                                 18 19'|請按F14以便處理此作業，否則按-
     A                                      F3結束此作業|'
     A                                 19 19'|'
     A                                 19 67'|'
     A                                 20 19'+----------------------------------
     A                                      --------------+'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 22 42'F14=處理作業'
     A  98        ERR1          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          63A  O 24  2MSGID(UPT 2111 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          63A  O 24  2MSGID(URE 0051 REMF)
     A                                      DSPATR(HI)
     A  95        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          63A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR11         50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR12         50A  O 24  2MSGID(URE 0108 REMF)
     A                                      DSPATR(HI)
     A  87        ERR13         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  86        ERR14         50A  O 24  2MSGID(URE 0064 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
