     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A*
     A          R DSPC1
     A*%%TS  SD  19920829  132036  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                  1  2'SOA011'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 28'全省訂單／送貨核准處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  7 21'選擇項目:'
     A                                  8 33'單價:'
     A            A1        R        B  8 41REFFLD(SC22)
     A                                      VALUES(' ' 'Y')
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                  8 44'(Y)'
     A                                  9 33'額度:'
     A            A2        R        B  9 41REFFLD(SC22)
     A                                      VALUES(' ' 'Y')
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  9 44'(Y)'
     A                                 10 33'逾期:'
     A            A3        R        B 10 41REFFLD(SC22)
     A                                      VALUES(' ' 'Y')
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                 10 44'(Y)'
     A                                 11 33'搭贈:'
     A            A4        R        B 11 41REFFLD(SC22)
     A                                      VALUES(' ' 'Y')
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                 11 44'(Y)'
     A                                 12 33'試飲:'
     A            A5        R        B 12 41REFFLD(SC22)
     A                                      VALUES(' ' 'Y')
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                 12 44'(Y)'
     A                                 13 33'換貨:'
     A            A6        R        B 13 41REFFLD(SC22)
     A                                      VALUES(' ' 'Y')
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A                                 13 44'(Y)'
