     A*%%TS  SD  20021004  092802  REPGMR      REL-V4R4M0  5769-PW1
     A*===============================================================
     A* MODI CODE |  AUTHOR  |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*           |          |          |
     A*---------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A*
     A          R SFLSR1                    SFL
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B 11  2VALUES(' ' '2' '4')
     A            DSD03     R        O 11  4REFFLD(SD03)
     A            MA03      R        O 11 14REFFLD(MA03)
     A            DSD04     R        O 11 34REFFLD(SD04)
     A                                      EDTCDE(3)
     A            DSD05     R        O 11 41REFFLD(SD05)
     A                                      EDTCDE(3)
     A            DSD99     R        O 11 54REFFLD(SD01)
     A            DSD98     R        O 11 63REFFLD(SD17)
     A            SC26      R        O 11 71
     A*------------------------------------------------------------
     A*
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'SOA0113'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 28'全省訂單／送貨核准處理'
     A                                  3 34'試飲核准'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  2'單據號碼:'
     A            DSC02     R        O  5 14REFFLD(SC02)
     A                                  5 41'單別:'
     A            SM03      R        O  5 49REFFLD(SC03)
     A            #203      R        O  5 52
     A                                  6  2'日　　期:'
     A            DSC08          6Y 0O  6 14
     A                                      EDTWRD('  /  /  ')
     A                                  6 41'客戶:'
     A            SM04      R        O  6 49REFFLD(SC04)
     A                                  6 55'-'
     A            SM05      R        O  6 57REFFLD(SC05)
     A            ME04      R        O  6 62
     A                                  7  2'訂單備註:'
     A            SM20      R             +2REFFLD(SC18)
     A                                  8  2'輸入作業選擇:'
     A                                  9  6'2=核准'
     A                                  9 16'4=核准取消'
     A                                 10  2'A產品     名稱               -
     A                                      訂購 搭贈費用種類費用容量 +
     A                                      試飲'
     A                                      DSPATR(UL)
     A*------------------------------------------------------------
     A*
     A          R DSPC1
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F12 =回前畫面'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR11         50A  O 24  2MSGID(URE 0063 REMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
