     A*%%TS  SD  20021003  183124  REPGMR      REL-V4R4M0  5769-PW1
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A* M001      | 98.11.11 | MANUAL MODIFY BY MICHELLE FOR Y2K
     A*---------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A          R SFLSR1                    SFL
     A*%%TS  SD  20021003  183124  REPGMR      REL-V4R4M0  5769-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            DOPT1          1A  B 10  2VALUES(' ' '2' '4')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A            DSD03     R        O 10  4REFFLD(SD03)
     A            MA03      R        O 10 14REFFLD(MA03)
     A            DSD04     R        O 10 34REFFLD(SD04)
     A                                      EDTCDE(1)
     A            DSD05     R        O 10 41REFFLD(SD05)
     A                                      EDTCDE(1)
     A            DSD06     R        O 10 47REFFLD(SD06)
     A                                      EDTCDE(3)
     A            DSD08     R        O 10 58REFFLD(SD08)
     A                                      EDTCDE(3)
     A            DSD09     R        O 10 69REFFLD(SD09)
     A                                      EDTCDE(3)
     A            DSD17     R        O 10 75REFFLD(SD17)
     A            DSD18     R        O 10 77REFFLD(SD18)
     A*------------------------------------------------------------
     A*
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19920914  141353  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      CA03(03)
     A                                      CF12(12)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'SOA006'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR003'
     A                                  2 30'訂單／送貨核准處理'
     A                                  3 32'單價／搭贈核准'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  2'單據號碼:'
     A            DSC02     R        O  5 14REFFLD(SC02)
     A                                  5 41'單別:'
     A            DSC03     R        O  5 49REFFLD(SC03)
     A            #203      R        O  5 52
     A                                  6  2'日　　期:'
M001MA            DSC08          6Y 0O  6 14
     A                                      EDTWRD('  /  /  ')
     A                                  6 41'客戶:'
     A            DSC04     R        O  6 49REFFLD(SC04)
     A                                  6 55'-'
     A            DSC05     R        O  6 57REFFLD(SC05)
     A            ME04      R        O  6 62
     A                                  7  2'輸入作業選擇:'
     A                                  8  6'2=核准'
     A                                  8 16'4=核准取消'
     A                                  8 73'單搭'
     A                                  9  2'A產品     名稱               -
     A                                      訂購 搭贈   單價  單價 搭+
     A                                      贈 價贈'
     A                                      DSPATR(UL)
     A                                  8 59'正常'
     A                                  8 66'正常'
     A*------------------------------------------------------------
     A*
     A          R DSPC1
     A*%%TS  SD  19920127  162736  REPGMR      REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F12 =回前畫面'
     A  97        ERR1          50A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          50A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR5          50A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR7          50A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR11         50A  O 24  2MSGID(URE 0063 REMF)
     A                                      DSPATR(HI)
     A  80        DMSG          78A  O 24  2DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
