     A*%%TS  SD  20021004  093733  REPGMR      REL-V4R4M0  5769-PW1
     A*  81/03/09  11:09:16    REPGMR      REL-R02M00  5728-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : SOA013D                                    *
     A*    AUTHOR       : A1118  PHILIP                              *
     A*    CREATE DATE  : 81/03/09                                   *
     A*    UPDATE DATE  : 81/04/17 PHILIP                            *
     A*    PROGRAM NAME : SOA013                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    REMARK       :試飲收回處理 (A/U/D/I)                    *
     A*===============================================================
     A* MODI CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*  M002     |MICHELLE|01.07.25| A&P增加種類代碼及容量選項AND
     A*           |        |        |原試飲單號，試飲原因
     A*---------------------------------------------------------------
     A*  M003     |MICHELLE|08.23.01|增加原試飲客戶／申請人代號
     A*           |        |        |版面全面修正
     A*---------------------------------------------------------------
     A*  M005     |MICHELLE|01.09.21|增加費用種類／容量到明細檔
     A*           |        |        |修正M002
     A*----------------------------------------------------------------
     A*  M006     |MICHELLE|02.07.30|增加促銷活動代碼及活動客戶的輸入
     A*----------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A*
     A          R SFLSR1                    SFL
     A*%%TS  SD  19920608  165730  REPGMRP     REL-V2R1M0  5738-PW1
     A  54                                  SFLNXTCHG
     A            RRN1           4S 0H
     A            HSN09          1A  H
     A            SN11      R        H
     A            DOPT1          1A  B  9  2VALUES(' ' '2' '4' '5')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
M001MA            DSN05          6Y 0O  9  5
     A                                      EDTWRD('  /  /  ')
     A            SN02      R        O  9 16
     A            SN03      R        O  9 30
     A            ME0411        18A  O  9 36
     A            SN04      R        O  9 56
M001MA            DSN06          6Y 0O  9 70
     A                                      EDTWRD('  /  /  ')
     A*------------------------------------------------------------
     A*
     A          R SFLCR1                    SFLCTL(SFLSR1)
     A*%%TS  SD  19920608  165730  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0010)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA03(03)
     A                                      CF06(06)
     A                                      CF09(09)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN1          4S 0H      SFLRCDNBR
     A                                  1  2'SOA013'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 33'試飲收回處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'輸入作業選擇:'
     A                                  5  6'2=修改'
     A                                  5 16'4=刪除'
     A                                  5 26'5=查詢'
     A                                  6  4'收回日期'
     A                                  7  2'A  MM/DD/YY  單據號碼    費用+
     A                                      單位　              收貨物流點 -
     A                                      實際入庫日'
     A                                      DSPATR(UL)
M001MA            DBGN1          6Y 0B  8  5
     A                                      EDTWRD('  /  /  ')
     A            DBGN2     R        B  8 16REFFLD(SN02)
     A*------------------------------------------------------------
     A*
     A          R DSPC1
     A*%%TS  SD  19920929  115247  D910095     REL-V2R1M0  5738-PW1
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F6 =新增'
     A  70                             24  2'單據號碼'
     A                                      DSPATR(HI)
     A  70        DSN02     R        O 24 13REFFLD(SN02)
     A                                      DSPATR(RI)
     A  70                             24 26'新增成功'
     A                                      DSPATR(HI)
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR9          63A  O 24  2MSGID(URE 0018 REMF)
     A                                      DSPATR(HI)
     A  87        ERR10         63A  O 24  2MSGID(URE 0063 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                 22 38'F9 =列印'
     A*------------------------------------------------------------
     A*
     A          R DSPD2
     A*%%TS  SD  19921005  132703  D910121     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CA12(12)
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A            HSN03     R        H      REFFLD(SN03)
     A                                  1  2'SOA013'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 33'試飲收回處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  2'公司代號　:'
     A            DSN01     R        B  5 16REFFLD(SN01)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  30                                  DSPATR(UL)
     A N30                                  DSPATR(PR)
     A            #B03      R        O  5 19
     A                                  5 42'單據號碼:'
     A            DSN02     R        O  5 54REFFLD(SN02)
M002AA                                  7  2'原試飲單號:'
M002AA            DNX06         12   B  7 16
M002AA  67                                  DSPATR(PC)
M002AA  67                                  DSPATR(RI)
M002AA  31                                  DSPATR(UL)
M002AA N31                                  DSPATR(PR)
M002AA                                 13 42'試飲原因:'
M002AA                                      DSPATR(HI)
M002AA            DNX05          2   B 13 54
M002AA N66                                  DSPATR(HI)
M002AA  66                                  DSPATR(PC)
M002AA  66                                  DSPATR(RI)
M002AA  31                                  DSPATR(UL)
M002AA N31                                  DSPATR(PR)
M002AA            D#A03         22A  O    +1
     A                                 15 42'試飲客戶:'
     A                                      DSPATR(HI)
     A            DNX07          5   B 15 54
     A N68                                  DSPATR(HI)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DNX08          4   B 15 60
     A N68                                  DSPATR(HI)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            CNAME         22A  O    +1
     A*M005D                           17 42'產品種類:'
     A*M005D                                DSPATR(HI)
M002AA*M005D      DNX03          2   B 17 54
M002AA*M005D N64                                  DSPATR(HI)
M002AA*M005D  64                                  DSPATR(PC)
M002AA*M005D  64                                  DSPATR(RI)
M002AA*M005D  31                                  DSPATR(UL)
M002AA*M005D N31                                  DSPATR(PR)
M002AA*M005D            GROUP         22A  O    +1
M002AA*M005D                                 19 42'容量代碼:'
     A*M005D                                DSPATR(HI)
M002AA*M005D      DNX04          1   B 19 54
M002AA*M005D N65                                  DSPATR(HI)
M002AA*M005D  65                                  DSPATR(PC)
M002AA*M005D  65                                  DSPATR(RI)
M002AA*M005D  31                                  DSPATR(UL)
M002AA*M005D N31                                  DSPATR(PR)
M002AA*M005D      SIZE          22A  O    +3
     A                                  7 42'申請員工:'
     A            DNX09          5   B  7 54
     A N69                                  DSPATR(HI)
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DNX10          4   B  7 60
     A N69                                  DSPATR(HI)
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DNAME         22A  O    +1
     A                                  9  2'費用單位　:'
     A                                      DSPATR(HI)
     A            DSN03     R        B  9 16REFFLD(SN03)
     A N61                                  DSPATR(HI)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            DSN11     R        B  9 22REFFLD(SN11)
     A N61                                  DSPATR(HI)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            ME0412        22A  O  9 27
M003DA*M002M 業務員往下移二行，往右移二格
     A                                 13  2'業務員:'
     A                                      DSPATR(HI)
     A            DSN07     R        O 13 12REFFLD(SN07)
     A            DMC02     R        O 13 19REFFLD(MC02)
     A                                 11  2'收貨物流點:'
     A                                      DSPATR(HI)
     A            DSN04     R        B 11 16REFFLD(SN04)
     A N62                                  DSPATR(HI)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A            #A0322        22A  O 11 22
M006AA                                    +1'原促銷活動代碼:'
"    A            DSN22         12   B    +1
"    A N64                                  DSPATR(HI)
"    A  64                                  DSPATR(PC)
"    A  64                                  DSPATR(RI)
"    A  31                                  DSPATR(UL)
M006AA N31                                  DSPATR(PR)
     A            DSN08     R        H      REFFLD(SN08)
     A                                 15  2'收回日期　:'
M001MA            DSN05          6Y 0B 15 16
     A                                      EDTWRD('  /  /  ')
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  31                                  DSPATR(UL)
     A N31                                  DSPATR(PR)
     A                                 15 25'(MM/DD/YY)'
     A                                 17  2'實際入庫日:'
M001MA            DSN06          6Y 0O 17 16
     A                                      EDTWRD('  /  /  ')
     A                                 17 25'(MM/DD/YY)'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 22 42'F5 =參考資料'
     A                                 22 58'F12=回前畫面'
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  87        ERR10         63A  O 24  2MSGID(URE 0015 REMF)
     A                                      DSPATR(HI)
     A  86        ERR11         63A  O 24  2MSGID(URE 0016 REMF)
     A                                      DSPATR(HI)
     A  85        ERR12         63A  O 24  2MSGID(URE 0025 REMF)
     A                                      DSPATR(HI)
     A  84        ERR13         63A  O 24  2MSGID(URE 0064 REMF)
     A                                      DSPATR(HI)
     A  83        ERR14         63A  O 24  2MSGID(URE 0111 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
M002AA  81        ERR16         63A  O 24  2MSGID(UPT 2299 PTMF)
M002AA                                      DSPATR(HI)
M002AA  82        ERR15         63A  O 24  2MSGID(UPT 2300 PTMF)
M002AA                                      DSPATR(HI)
M002AA  80        ERR17         63A  O 24  2MSGID(UPT 4018 PTMF)
M002AA                                      DSPATR(HI)
M006AA  79        ERR18         63A  O 24  2MSGID(UPT 5001 PTMF)
M006AA                                      DSPATR(HI)
M007AA  78        ERR19         63A  O 24  2MSGID(URE 0163 REMF)
M007AA                                      DSPATR(HI)
     A*------------------------------------------------------------
     A          R DSPC3
     A*
     A                                 22  2'執行'
     A                                    +2'F3 =回主畫面'
     A                                    +2'F4 =視窗查詢'
     A                                    +2'F5 =參考資料'
     A                                    +2'F12=回前畫面'
     A*
     A  97        DMSG          78A  O 24  2DSPATR(HI)
     A  96        ERR1          63A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR2          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR3          63A  O 24  2MSGID(UPT 2050 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR6          63A  O 24  2MSGID(UPT 2020 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR7          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  89        ERR8          63A  O 24  2MSGID(UPT 0030 PTMF)
     A                                      DSPATR(HI)
     A  87        ERR9          63A  O 24  2MSGID(UPT 0080 PTMF)
     A                                      DSPATR(HI)
     A  86        ERR10         63A  O 24  2MSGID(URE 0090 REMF)
     A                                      DSPATR(HI)
     A  85        ERR12         63A  O 24  2MSGID(URE 0025 REMF)
     A                                      DSPATR(HI)
     A  84        ERR13         63A  O 24  2MSGID(URE 0113 REMF)
     A                                      DSPATR(HI)
M006AA  83        ERR14         63A  O 24  2MSGID(URE 0028 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*------------------------------------------------------------
     A*
     A          R SFLSR2                    SFL
     A*%%TS  SD  20021004  093733  REPGMR      REL-V4R4M0  5769-PW1
     A  54                                  SFLNXTCHG
     A            RRN2           4S 0H
     A            HMA07          1A  H
     A            DOPT2          1A  B 12  2VALUES(' ' '1' '2' '4' '5')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            DSO03     R        B 12  5REFFLD(SO03)
     A N61                                  DSPATR(HI)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A  32                                  DSPATR(UL)
     A N32                                  DSPATR(PR)
     A            MA03      R        O 12 15
     A            MA13      R        O 12 34
     A            HSO04     R        H      REFFLD(SO04)
     A            DSO06     R        B 12 43REFFLD(SO06)
     A                                      EDTCDE(3)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            DSO07     R        B 12 74REFFLD(SO07)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A            DCHK           1A  H
     A            DSO12     R        O 12 49REFFLD(RERFR/SO12 *LIBL/RERF)
     A                                      EDTCDE(1)
     A            DAMT      R        H      REFFLD(RERFR/SE37 *LIBL/RERF)
     A            DSO99          2A  B 12 65
     A N63                                  DSPATR(HI)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            DSO98          1A  B 12 71
     A N64                                  DSPATR(HI)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A  33                                  DSPATR(UL)
     A N33                                  DSPATR(PR)
     A            HSO16     R        H      REFFLD(SO16)
     A            HSO17     R        H      REFFLD(SO17)
     A            HSO18     R        H      REFFLD(SO18)
     A*                                     'Y' -已存檔中--> UPD
     A*                                     ' ' -不存檔中--> ADD
     A*------------------------------------------------------------
     A*
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*%%TS  SD  19921016  134628  D910121     REL-V2R1M0  5738-PW1
     A                                      SFLSIZ(0160)
     A                                      SFLPAG(0008)
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CA12(12)
     A                                      OVERLAY
     A  37                                  FRCDTA
     A  37                                  LOCK
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  98                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN2          4S 0H      SFLRCDNBR
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'SOA013'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR003'
     A                                  2 33'試飲收回處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A            DFUN           6O  O  3  2DSPATR(RI)
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'公司代號　:'
     A            DSN01     R        O  4 16REFFLD(SN01)
     A            #B03      R        O  4 19
M006AA                                  4 50'原促銷活動代碼:'
"    A            DSN22         12   O    +1
     A                                  5  2'單據號碼　:'
     A            DSN02     R        O  5 16REFFLD(SN02)
     A                                  5 50'業務員　:'
     A            DSN07     R        O  5 62REFFLD(SN07)
     A            DMC02     R        O  5 69REFFLD(MC02)
     A                                  6  2'費用單位　:'
     A            DSN03     R        O  6 16REFFLD(SN03)
     A            DSN11     R        O  6 22REFFLD(SN11)
     A            ME0412        22A  O  6 27
     A                                  6 50'收回日期:'
M001MA            DSN05          6Y 0O  6 62
     A                                      EDTWRD('  /  /  ')
     A                                  6 71'(MM/DD/YY)'
     A                                  7  2'收貨物流點:'
     A            DSN04     R        O  7 16REFFLD(SN04)
     A            #A0322        22A  O  7 22
     A                                  7 50'實際入庫:'
M001MA            DSN06          6Y 0O  7 62
     A                                      EDTWRD('  /  /  ')
     A                                  7 71'(MM/DD/YY)'
     A                                  9  4'1=新增'
     A                                  9 16'2=修改'
     A                                  9 28'4=刪除'
     A                                  9 40'5=庫存查詢'
M005AA                                 10 63'費用　費用'
     A                                 11  2'A 產品代號／名稱              +
M005MA*                                     單位　收回數量  單價   　金　+
M005MA                                      單位　收回數量  單價   　種類+
M005MA*                                     額'
M005MA                                      　容量'
     A                                      DSPATR(UL)
