     A*%%TS  SD  19930908  172144  D910121     REL-V2R2M0  5738-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19930908  172144  D910121     REL-V2R2M0  5738-PW1
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF14(14 '處理作業')
     A                                  1  2'SOA023'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'專櫃轉檔批次'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  7 23'專櫃代號　:'
     A            DST01S    R        B  7 37REFFLD(ST01)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  7 43'-'
     A            DST01E    R        B  7 45REFFLD(ST01)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  9 23'銷售月年　:'
M001MA            DST02          4Y 0B  9 37
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                      EDTWRD('  /  ')
     A                                  9 45'(MM/YY)'
     A                                 12 17'+----------------------------------
     A                                      --------------+'
     A                                 13 17'|'
     A                                 13 65'|'
     A                                 14 17'|請按F14以便處理此作業，否則按-
     A                                      F3結束此作業|'
     A                                 15 17'|'
     A                                 15 65'|'
     A                                 16 17'+----------------------------------
     A                                      --------------+'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F14=處理作業'
     A  97        ERR1          63A  O 24  2MSGID(UPT 2142 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR2          63A  O 24  2MSGID(URE 0025 REMF)
     A                                      DSPATR(HI)
     A  95        ERR3          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR4          63A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  86        PUSER         10A  O 24  2
     A                                      DSPATR(HI)
     A  86                             24 13'仍在專櫃五日輸入中，請連絡'
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
