     A*%%TS  SD  19930419  161950  D910121     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOA020D                                    *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    CREATE DATE  : 81/06/03                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOA020                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :普銷訂單／送貨單批次處理                  *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19930419  161950  D910121     REL-V2R1M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF14(14 '處理作業')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'SOA020'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 27'普銷訂單／送貨單批次處理'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  6 23'公司別　  :'
     A            DSC01     R        B  6 37REFFLD(SC01)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A                                  8 23'訂單日期　:'
     A            DSC07S    R        O  8 37REFFLD(SC07)
     A                                      EDTCDE(Y)
     A  61                                  DSPATR(RI)
     A                                  8 47'-'
     A            DSC07E    R        O  8 49REFFLD(SC08)
     A                                      EDTCDE(Y)
     A  62                                  DSPATR(RI)
     A                                  8 59'(MM/DD/YY)'
     A                                 10 23'客戶代號　:'
     A            DSC04S    R        B 10 37REFFLD(SC04)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                 10 47'-'
     A            DSC04E    R        B 10 49REFFLD(SC04)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A                                 12 23'物流點　　:'
     A            DSC11S    R        B 12 37REFFLD(SC11)
     A  65                                  DSPATR(RI)
     A  65                                  DSPATR(PC)
     A                                 12 47'-'
     A            DSC11E    R        B 12 49REFFLD(SC11)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A                                 14 17'+----------------------------------
     A                                      --------------+'
     A                                 15 17'|'
     A                                 15 65'|'
     A                                 16 17'|請按F14以便處理此作業，否則按-
     A                                      F3結束此作業|'
     A                                 17 17'|'
     A                                 17 65'|'
     A                                 18 17'+----------------------------------
     A                                      --------------+'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F14=處理作業'
     A  98        ERR1          63A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          63A  O 24  2MSGID(UPT 2111 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          63A  O 24  2MSGID(URE 0051 REMF)
     A                                      DSPATR(HI)
     A  95        ERR4          63A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          63A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR6          63A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR11         50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  88        ERR12         50A  O 24  2MSGID(URE 0108 REMF)
     A                                      DSPATR(HI)
     A  87        ERR13         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  75        ERR20         63A  O 24  2MSGID(URE 0107 REMF)
     A                                      DSPATR(HI)
     A  74        ERR23         63A  O 24  2MSGID(URE 0115 REMF)
     A                                      DSPATR(HI)
     A  73        ERR24         63A  O 24  2MSGID(URE 0116 REMF)
     A                                      DSPATR(HI)
     A  72        ERR25         63A  O 24  2MSGID(URE 0117 REMF)
     A                                      DSPATR(HI)
     A  71        ERR26         63A  O 24  2MSGID(URE 0118 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
