     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    30MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    31'專櫃轉檔－可用量不足列印'
     A                                      SPACEA(1)
     A                                     1'專櫃代號:'
     A            DST01S    R        O    +1REFFLD(ST01)
     A                                    +1'-'
     A            DST01E    R        O    +1REFFLD(ST01)
     A                                    61'日期:'
     A            $EGMDY         6  0O    69EDTCDE(Y)
     A                                    78'頁次:'
     A                                    86PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'銷售月年:'
M001MA            DST02          4  0O    +1
     A                                      EDTWRD('  /  ')
     A                                    61'時間:'
     A                                    69TIME
     A                                    80'<SOA023>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'專櫃代號'
     A                                    12'PLU代號'
     A                                    22'產品代號'
     A                                    33'產品簡稱'
     A                                    54'銷售合計'
     A                                    66'庫存可用量'
     A                                    83'差異量'
     A                                    92'狀態'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            ST01      R              2
     A            ST03      R             12
     A            ST04      R             23
     A            MA03      R             33
     A            PTOT1          9  0     51EDTCDE(1)
     A            IA10      R             69EDTCDE(1)
     A            PTOT2          9  0     79EDTCDE(J)
     A            STAT          10        92
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<SOA023>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも無不足可用量もも'
