     A*%%TS  SD  19951123  113519  DERLERN     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : SOM000D                                    *
     A*    AUTHOR       : A1034   STEPHANIE                          *
     A*    CREATE DATE  : 81/01/28                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : POM000C                                    *
     A*    SYSTEM       :人頭馬匯東銷售訂單系統                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19951123  113519  DERLERN     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'SOM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'銷售訂單系統主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  4  1'               '
     A                                      DSPATR(RI)
     A                                  4 17'01.通路型態產品報價設定'
     A                                      DSPATR(UL)
     A                                  5  1' '
     A                                      DSPATR(RI)
     A                                  5  4'資料維護'
     A                                  5 15' '
     A                                      DSPATR(RI)
     A                                  5 17'02.客戶產品報價設定'
     A                                      DSPATR(UL)
     A                                  6  1'               '
     A                                      DSPATR(RI)
     A                                  6 17'03.銷售訂單資料處理'
     A                                      DSPATR(UL)
     A                                  7 17'04.送貨資料處理'
     A                                      DSPATR(UL)
     A                                  8 17'05.銷貨退回資料處理'
     A                                      DSPATR(UL)
     A                                  9 17'06.核准處理－依公司通路'
     A                                      DSPATR(UL)
     A                                 10 17'07.產品收回處理'
     A                                      DSPATR(UL)
M001MA                                 11 15'* 08.經銷商送貨訂單批次'
     A                                      DSPATR(UL)
     A                                 12 17'09.寄賣訂單批次作業'
     A                                      DSPATR(UL)
M001MA                                 14 15'* 11.專櫃訂單批次作業'
     A                                      DSPATR(UL)
     A                                 13 17'10.核准處理－依權限'
     A                                      DSPATR(UL)
     A                                  4 43'              '
     A                                      DSPATR(RI)
     A                                  4 58'21.產品存貨狀況'
     A                                      DSPATR(UL)
     A                                  5 43' '
     A                                      DSPATR(RI)
     A                                  5 45'查詢作業'
     A                                  5 56' '
     A                                      DSPATR(RI)
     A                                  5 58'22.物流點存貨狀況'
     A                                      DSPATR(UL)
     A                                  6 43'              '
     A                                      DSPATR(RI)
     A                                  6 58'23.採購狀況－依產品'
     A                                      DSPATR(UL)
     A                                  7 58'24.應收帳款－依客戶'
     A                                      DSPATR(UL)
     A                                  8 58'25.產品保留量狀況'
     A                                      DSPATR(UL)
     A                                 22 30'請輸入選擇項目:'
     A            DOPID          2A  B 22 48DSPATR(UL)
     A                                      VALUES('  ' '01' '02' '03' '04' '05-
     A                                      ' '06' '07'      '09' '10'      '12-
     A                                      ' '13' '14' '21' '22' '23' '24' '25-
     A                                      ' '31' '32' '33' '34' '35' '36' +
     A                                        '26' '27' '37' '38' )
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                 15 17'12.試飲收回處理'
     A                                      DSPATR(UL)
M001MA                                 16 15'* 13.銷售月檔批次作業'
     A                                      DSPATR(UL)
     A                                 17 17'14.試飲訂單資料處理'
     A                                      DSPATR(UL)
     A                                 13 58'31.客戶報價延長批次'
     A                                      DSPATR(UL)
     A                                 14 58'32.客戶報價延長還原'
     A                                      DSPATR(UL)
     A                                 15 58'33.通路報價延長批次'
     A                                      DSPATR(UL)
     A                                 16 58'34.通路報價延長還原'
     A                                      DSPATR(UL)
     A                                 17 58'35.客戶新增報價拷貝'
     A                                      DSPATR(UL)
     A                                 18 58'36.通路新增報價拷貝'
     A                                      DSPATR(UL)
     A                                 19 58'37.通路報價確認'
     A                                      DSPATR(UL)
     A                                 20 58'38.客戶報價確認'
     A                                      DSPATR(UL)
     A                                 13 43'              '
     A                                      DSPATR(RI)
     A                                 14 43' '
     A                                      DSPATR(RI)
     A                                 14 45'批次作業'
     A                                 14 56' '
     A                                      DSPATR(RI)
     A                                 15 43'              '
     A                                      DSPATR(RI)
     A                                  9 43'              '
     A                                      DSPATR(RI)
     A                                 10 43' '
     A                                      DSPATR(RI)
     A                                 11 43'              '
     A                                      DSPATR(RI)
     A                                 10 56' '
     A                                      DSPATR(RI)
     A                                 10 45'報表作業'
     A                                 10 58'26.產品通路報價表'
     A                                      DSPATR(UL)
     A                                 11 58'27.客戶產品報價表'
     A                                      DSPATR(UL)
