     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SOR082P                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 84/02/17                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR082                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :專櫃部門銷售統計年報                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    85MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    87'專櫃部門銷售統計年報　'
     A                                      SPACEA(2)
     A                                   166'日期:'
     A            $EGMDY         6  0O   173EDTCDE(Y)
     A                                   183'頁次:'
     A                                   190PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                   166'時間:'
     A                                   173TIME
     A                                      SPACEA(1)
     A                                     1'專櫃代號  :'
     A            DST01S         5        +1
     A                                    +1'-'
     A            DST01E         5        +1
     A                                   166' USER :'
     A            $USER         10   O   173
     A                                   185'<SOR082 >'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     1'專櫃代號／簡稱'
     A                                    20'部門代號／簡稱'
     A            MM01           2  0     41EDTCDE(1)
     A                                    43'/'
     A            YY01           2  0     44EDTCDE(1)
     A            MM02           2  0     53EDTCDE(1)
     A                                    55'/'
     A            YY02           2  0     56EDTCDE(1)
     A            MM03           2  0     65EDTCDE(1)
     A                                    67'/'
     A            YY03           2  0     68EDTCDE(1)
     A            MM04           2  0     77EDTCDE(1)
     A                                    79'/'
     A            YY04           2  0     80EDTCDE(1)
     A            MM05           2  0     89EDTCDE(1)
     A                                    91'/'
     A            YY05           2  0     92EDTCDE(1)
     A            MM06           2  0    101EDTCDE(1)
     A                                   103'/'
     A            YY06           2  0    104EDTCDE(1)
     A            MM07           2  0    113EDTCDE(1)
     A                                   115'/'
     A            YY07           2  0    116EDTCDE(1)
     A            MM08           2  0    125EDTCDE(1)
     A                                   127'/'
     A            YY08           2  0    128EDTCDE(1)
     A            MM09           2  0    137EDTCDE(1)
     A                                   139'/'
     A            YY09           2  0    140EDTCDE(1)
     A            MM10           2  0    149EDTCDE(1)
     A                                   151'/'
     A            YY10           2  0    152EDTCDE(1)
     A            MM11           2  0    161EDTCDE(1)
     A                                   163'/'
     A            YY11           2  0    164EDTCDE(1)
     A            MM12           2  0    173EDTCDE(1)
     A                                   175'/'
     A            YY12           2  0    176EDTCDE(1)
     A                                   185'總計'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -----------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A N21        WFB501    R              2REFFLD(WFB501 *LIBL/REWFB5)
     A            WFB502    R             20REFFLD(WFB502 *LIBL/REWFB5)
     A            WFB505    R             39REFFLD(WFB505 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB507    R             51REFFLD(WFB507 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB509    R             63REFFLD(WFB509 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB511    R             75REFFLD(WFB511 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB513    R             87REFFLD(WFB513 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB515    R             99REFFLD(WFB515 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB517    R            111REFFLD(WFB517 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB519    R            123REFFLD(WFB519 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB521    R            135REFFLD(WFB521 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB523    R            147REFFLD(WFB523 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB525    R            159REFFLD(WFB525 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB527    R            171REFFLD(WFB527 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFTOT1         9  0    183
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A N20        ME04      R              1
     A            #A03A         20        19
     A            WFB506    R             39REFFLD(WFB506 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB508    R             50REFFLD(WFB508 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB510    R             62REFFLD(WFB510 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB512    R             74REFFLD(WFB512 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB514    R             86REFFLD(WFB514 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB516    R             98REFFLD(WFB516 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB518    R            110REFFLD(WFB518 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB520    R            122REFFLD(WFB520 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB522    R            134REFFLD(WFB522 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB524    R            146REFFLD(WFB524 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB526    R            158REFFLD(WFB526 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFB528    R            170REFFLD(WFB528 *LIBL/REWFB5)
     A                                      EDTCDE(J)
     A            WFTOT2         9  0    183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(2)
     A                                    19'專櫃小計------->'
     A            T21505         9  0     37
     A                                      EDTCDE(J)
     A            T21507         9  0     49
     A                                      EDTCDE(J)
     A            T21509         9  0     61
     A                                      EDTCDE(J)
     A            T21511         9  0     73
     A                                      EDTCDE(J)
     A            T21513         9  0     85
     A                                      EDTCDE(J)
     A            T21515         9  0     97
     A                                      EDTCDE(J)
     A            T21517         9  0    109
     A                                      EDTCDE(J)
     A            T21519         9  0    121
     A                                      EDTCDE(J)
     A            T21521         9  0    133
     A                                      EDTCDE(J)
     A            T21523         9  0    145
     A                                      EDTCDE(J)
     A            T21525         9  0    157
     A                                      EDTCDE(J)
     A            T21527         9  0    169
     A                                      EDTCDE(J)
     A            T2TOT1         9  0    183
     A                                      SPACEA(1)
     A                                      EDTCDE(J)
     A            T21506         9  0     37
     A                                      EDTCDE(J)
     A            T21508         9  0     49
     A                                      EDTCDE(J)
     A            T21510         9  0     61
     A                                      EDTCDE(J)
     A            T21512         9  0     73
     A                                      EDTCDE(J)
     A            T21514         9  0     85
     A                                      EDTCDE(J)
     A            T21516         9  0     97
     A                                      EDTCDE(J)
     A            T21518         9  0    109
     A                                      EDTCDE(J)
     A            T21520         9  0    121
     A                                      EDTCDE(J)
     A            T21522         9  0    133
     A                                      EDTCDE(J)
     A            T21524         9  0    145
     A                                      EDTCDE(J)
     A            T21526         9  0    157
     A                                      EDTCDE(J)
     A            T21528         9  0    169
     A                                      EDTCDE(J)
     A            T2TOT2         9  0    183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(2)
     A                                    19'總　　　　計--->'
     A            T31505         9  0     37
     A                                      EDTCDE(J)
     A            T31507         9  0     49
     A                                      EDTCDE(J)
     A            T31509         9  0     61
     A                                      EDTCDE(J)
     A            T31511         9  0     73
     A                                      EDTCDE(J)
     A            T31513         9  0     85
     A                                      EDTCDE(J)
     A            T31515         9  0     97
     A                                      EDTCDE(J)
     A            T31517         9  0    109
     A                                      EDTCDE(J)
     A            T31519         9  0    121
     A                                      EDTCDE(J)
     A            T31521         9  0    133
     A                                      EDTCDE(J)
     A            T31523         9  0    145
     A                                      EDTCDE(J)
     A            T31525         9  0    157
     A                                      EDTCDE(J)
     A            T31527         9  0    169
     A                                      EDTCDE(J)
     A            T3TOT1        10  0    181
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A            T31506         9  0     37
     A                                      EDTCDE(J)
     A            T31508         9  0     49
     A                                      EDTCDE(J)
     A            T31510         9  0     61
     A                                      EDTCDE(J)
     A            T31512         9  0     73
     A                                      EDTCDE(J)
     A            T31514         9  0     85
     A                                      EDTCDE(J)
     A            T31516         9  0     97
     A                                      EDTCDE(J)
     A            T31518         9  0    109
     A                                      EDTCDE(J)
     A            T31520         9  0    121
     A                                      EDTCDE(J)
     A            T31522         9  0    133
     A                                      EDTCDE(J)
     A            T31524         9  0    145
     A                                      EDTCDE(J)
     A            T31526         9  0    157
     A                                      EDTCDE(J)
     A            T31528         9  0    169
     A                                      EDTCDE(J)
     A            T3TOT2        10  0    181
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================='
     A                                      SPACEA(1)
     A                                     2'<<SOR082 >>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
