     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR084P                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 82/09/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR084                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    REMARK       :已核准單據明細　                          *
     A****************************************************************
     A                                      REF(*LIBL/SOSMLF01)
     A          R PH1
     A                                      SKIPB(002)
     A                                    39
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
     A                                    48
     A                                      DFT('已核准單據明細')
     A                                      SPACEA(002)
     A                                    82
     A                                      DFT('日期:')
     A                                      SPACEB(001)
     A            $EGMDY         6  0O    89
     A                                      EDTCDE(Y)
     A                                    99
     A                                      DFT('頁次:')
     A                                   107
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     1'通　路　:'
     A                                      SPACEB(001)
     A            DPATHS         1        +1
     A                                    +2'-'
     A            DPATHE         1        +1
     A                                    82
     A                                      DFT('時間:')
     A                                    89
     A                                      TIME
     A                                    99
     A                                      DFT('<SOR084>')
     A                                      SPACEB(001)
     A                                     1'送貨日期'
     A                                    +0':'
     A            DDATES         6  0     +1EDTCDE(Y)
     A                                    +1'-'
     A            DDATEE         6  0     +0EDTCDE(Y)
     A                                    82
     A                                      DFT(' USER :')
     A            $USER         10A  O    89
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========')
     A                                      SPACEB(001)
     A                                    58
     A                                      DFT('送　　貨')
     A                                      SPACEB(001)
     A                                    84
     A                                      DFT('單')
     A                                    88
     A                                      DFT('額')
     A                                    92
     A                                      DFT('逾')
     A                                    96
     A                                      DFT('搭')
     A                                   100
     A                                      DFT('試')
     A                                   104
     A                                      DFT('換')
     A                                     1
     A                                      DFT('單據號碼')
     A                                      SPACEB(001)
     A                                    14
     A                                      DFT('業務員')
     A                                    31
     A                                      DFT('客戶代號')
     A                                    42
     A                                      DFT('簡　　稱')
     A                                    58
     A                                      DFT('日　　期')
     A                                    75
     A                                      DFT('金額')
     A                                    84
     A                                      DFT('價')
     A                                    88
     A                                      DFT('度')
     A                                    92
     A                                      DFT('期')
     A                                    96
     A                                      DFT('贈')
     A                                   100
     A                                      DFT('飲')
     A                                   104
     A                                      DFT('貨')
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========')
     A                                      SPACEB(001)
     A          R PD1
     A                                      SPACEB(001)
     A            SM02      R        O     2
     A            SM16      R        O    15
     A            MC02      R        O    21
     A                                      REFFLD(MC0/MC02 *LIBL/MTMCPF)
     A            SM04      R        O    33
     A            SM05      R        O    38
     A            ME04      R        O    42
     A                                      REFFLD(ME0/ME04 *LIBL/MTMEPF)
M001MA*           PSM06     R        O    60
M001MA            PSM06          6  0O    60
     A*M001D                                REFFLD(SM06)
     A                                      EDTWRD('  /  /  ')
     A            SM15      R        O    70EDTCDE(J)
     A            SM08      R        O    85
     A            SM09      R        O    89
     A            SM10      R        O    93
     A            SM11      R        O    97
     A            SM12      R        O   101
     A            SM13      R        O   105
     A*----------------------------------------------------------------
     A          R PE1
     A                                      SPACEB(001)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========')
     A                                     2
     A                                      DFT('***續下頁***')
     A                                      SPACEB(001)
     A*----------------------------------------------------------------
     A          R PE2
     A                                      SPACEB(001)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========')
     A                                     2
     A                                      DFT('<<SOR084>>--->報表結束')
     A
     A                                      SPACEB(001)
     A*----------------------------------------------------------------
     A          R PE3
     A                                      SPACEB(001)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------')
     A*----------------------------------------------------------------
     A          R PE9                       SPACEB(1)
     A                                     3'もも此範圍無資料もも'
