     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    71MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    71'辦事處通路搭贈／試飲彙總表'
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            COMPS          1A       13
     A                                    15'-'
     A            COMPE          1A       17
     A                                      SPACEA(1)
     A                                     1'通　路　:'
     A            DSC33S    R             13REFFLD(SC33)
     A                                    15'-'
     A            DSC33E    R             17REFFLD(SC33)
     A                                   146'日期:'
     A            $EGMDY         6  0O   154EDTCDE(Y)
     A                                   162'頁次:'
     A                                   171PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S    R             13REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R             +1REFFLD(SD03)
     A                                   146'時間:'
     A                                   154TIME
     A                                      SPACEA(1)
     A                                     1'確認日期:'
M001MA*           DSC39S    R             13REFFLD(SC39)
M001MA            DSC39S         6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'-'
M001MA*           DSC39E    R             24REFFLD(SC39)
M001MA            DSC39E         6  0     24
     A                                      EDTWRD('  /  /  ')
     A                                   147'USER :'
     A            $USER         10   O   154
     A                                   165'<SOR068>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                    26'-----------------------------'
     A                                    55'銷售'
     A                                    61'------------------------------'
     A                                    92'-----------------'
     A                                   109'銷退'
     A                                   115'------------------'
     A                                   134'---------------'
     A                                   149'實際銷售'
     A                                   159'----------------'
     A                                      SPACEA(1)
     A                                     1'辦事處'
     A                                    10'通路'
     A                                    26'訂購'
     A                                    35'搭贈'
     A                                    42'搭贈試飲'
     A                                    52'其他試飲'
     A                                    62'其他試飲金額'
     A                                    81'金額'
     A                                    94'訂購'
     A                                   103'搭贈'
     A                                   112'試飲'
     A                                   121'銷退金額'
     A                                   136'訂購'
     A                                   145'搭贈'
     A                                   154'試飲'
     A                                   166'金額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  21                                 1' '
     A                                      SPACEA(1)
     A N30        WF5801    R              2REFFLD(WF5801 *LIBL/REWF58)
     A N30        COMPC          6O       +0
     A            WF5802    R             10REFFLD(WF5801 *LIBL/REWF58)
     A            D#A03         12O       +0
     A            WF5803    R             24REFFLD(WF5803 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            WF5804    R             33REFFLD(WF5804 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            WF5805    R             43REFFLD(WF5805 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            WF5811    R             53REFFLD(WF5811 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            WF5812    R             62REFFLD(WF5812 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            WF5806    R             77REFFLD(WF5806 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            WF5807    R             92REFFLD(WF5807 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            WF5808    R            101REFFLD(WF5808 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            WF5809    R            110REFFLD(WF5809 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            WF5810    R            119REFFLD(WF5810 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T05801         6  0    134EDTCDE(J)
     A            T05802         6  0    143EDTCDE(J)
     A            T05803         6  0    152EDTCDE(J)
     A            T05804        10  0    161EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     1'辦事處小計--------->'
     A            T15803    R             24REFFLD(WF5803 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T15804    R             33REFFLD(WF5804 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T15805    R             43REFFLD(WF5805 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T15811    R             53REFFLD(WF5811 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T15812    R             62REFFLD(WF5812 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T15806    R             77REFFLD(WF5806 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T15807    R             92REFFLD(WF5807 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T15808    R            101REFFLD(WF5808 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T15809    R            110REFFLD(WF5809 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T15810    R            119REFFLD(WF5810 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T85801         6  0    134EDTCDE(J)
     A            T85802         6  0    143EDTCDE(J)
     A            T85803         6  0    152EDTCDE(J)
     A            T85804        10  0    161EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                     1'總　　計----------->'
     A            T25803    R             24REFFLD(WF5803 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T25804    R             33REFFLD(WF5804 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T25805    R             43REFFLD(WF5805 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T25811    R             53REFFLD(WF5811 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T25812    R             62REFFLD(WF5812 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T25806    R             77REFFLD(WF5806 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T25807    R             92REFFLD(WF5807 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T25808    R            101REFFLD(WF5808 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T25809    R            110REFFLD(WF5809 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T25810    R            119REFFLD(WF5810 *LIBL/REWF58)
     A                                      EDTCDE(J)
     A            T95801         6  0    134EDTCDE(J)
     A            T95802         6  0    143EDTCDE(J)
     A            T95803         6  0    152EDTCDE(J)
     A            T95804        10  0    161EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==============='
     A                                      SPACEA(1)
     A                                     2'備註：'
     A                                    +0'1.搭贈試飲：'
     A                                    +0'試飲原因是'
     A                                    +0'07,08,09,11,12,13'
     A                                      SPACEA(1)
     A                                    10'2.其他試飲：'
     A                                    +0'為不含搭贈試飲之試飲'
     A                                      SPACEA(1)
     A                                     2'<<SOR068>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
