     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SOR058'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0   1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 34'銷售明細表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A     3 70
     A                                  6 26'辦事處　:'
     A            COMP           1A     6 38
     A                                  6 40'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  7 26'轉帳　　:'
     A            DSEL           1A     7 38
     A                                  7 40'( Y=轉帳N=非轉帳)'
     A                                  9 26'送貨日期:'
M001DA*           DSC08S    R           9 38REFFLD(SC39)
M001AA            DSC08S         6  0   9 38
     A                                      EDTWRD('  /  /  ')
     A                                  9 47'-'
M001DA*           DSC08E    R           9 49REFFLD(SC39)
M001AA            DSC08E         6  0   9 49
     A                                      EDTWRD('  /  /  ')
     A                                  9 60'(MM/DD/YY)'
     A                                 10 26'確認日期:'
M001DA*           DSC39S    R          10 38REFFLD(SC39)
M001AA            DSC39S         6  0  10 38
     A                                      EDTWRD('  /  /  ')
     A                                 10 47'-'
M001DA*           DSC39E    R          10 49REFFLD(SC39)
M001AA            DSC39E         6  0  10 49
     A                                      EDTWRD('  /  /  ')
     A                                 10 60'(MM/DD/YY)'
     A                                 12 26'客戶代號:'
     A            DSC04S         9     12 38
     A                                    +1'-'
     A            DSC04E         9        +1
     A                                 13 26'產品代號:'
     A            DSD03S    R          13 38
     A                                      REFFLD(MA01)
     A                                    +1'-'
     A            DSD03E    R             +1
     A                                      REFFLD(MA01)
     A                                 14 26'單別　　:'
     A            DSC03S         2     14 38
     A                                 14 47'-'
     A            DSC03E         2     14 49
     A                                 16 26'執行環境:'
     A            $EVR           1  0  16 38
     A                                      EDTCDE(3)
     A                                 16 42'(1-即時   2-批次)'
     A                                 17 26'列印份數:'
     A            $CPY           3  0  17 38EDTCDE(3)
     A                                 18 26'列表機　:'
     A            $PRTID         2  0  18 38
     A                                      EDTCDE(3)
     A                                 20 27'***請準備８０行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
