     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR054P                                    *
     A*    AUTHOR       : A1084 CHARLES                              *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR054                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品銷售分佈明細表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    66
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
     A                                    70
     A                                      '產品銷售分佈明細表'
     A                                      SPACEA(001)
     A                                   151
     A                                      '日期:'
     A            $EGMDY         6  0O   159
     A                                      EDTCDE(Y)
     A                                   169
     A                                      '頁次:'
     A                                   176
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號:'
     A            WF2901    R             +1
     A                                      REFFLD(WF2901 *LIBL/REWF29)
     A            MA03      R             +1
     A                                   151
     A                                      '時間:'
     A                                   159
     A                                      TIME
     A                                      SPACEA(001)
     A N20                                 1
     A                                      '送貨日期:'
     A  20                                 1
     A                                      '確認日期:'
M001DA*N20        DSC08S    R             +1REFFLD(SC39)
     A N20        DSC08S         6  0     +1
     A                                      EDTWRD('  /  /  ')
M001DA* 20        DSC39S    R             +1REFFLD(SC39)
     A  20        DSC39S         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1
     A                                      '-'
M001DA*N20        DSC08E    R             +1REFFLD(SC39)
     A N20        DSC08E         6  0     +1
     A                                      EDTWRD('  /  /  ')
M001DA* 20        DSC39E    R             +1REFFLD(SC39)
     A  20        DSC39E         6  0     +1
     A                                      EDTWRD('  /  /  ')
     A                                   152
     A                                      ' USER :'
     A            $USER         10   O   159
     A                                   169
     A                                      '<SOR054>'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========='
     A                                      SPACEA(001)
     A                                     1
     A                                      '通路型態'
     A                                      SPACEB(001)
     A                                    30
     A                                      '地區'
     A                                    57
     A                                      '客戶'
     A                                    83
     A                                      '訂單日期'
     A                                    93
     A                                      '訂單號碼'
     A                                   109
     A                                      '訂購'
     A                                   116
     A                                      '搭贈'
     A                                   123
     A                                      '試飲'
     A                                   136
     A                                      '售價'
     A                                   149
     A                                      '金額'
     A                                   155
     A                                      '業務員'
     A                                   173
     A                                      '確認日期'
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A  21                                 1
     A                                      ' '
     A                                      SPACEA(001)
     A N30        WF2902    R              2
     A                                      REFFLD(WF2902 *LIBL/REWF29)
     A N30        WF2903    R             +1
     A                                      REFFLD(WF2903 *LIBL/REWF29)
     A N30        #C03      R             +0
     A N31        WF2904    R             +1
     A                                      REFFLD(WF2904 *LIBL/REWF29)
     A N31        #D02      R             +0
     A N32        WF2905    R             +1
     A                                      REFFLD(WF2905 *LIBL/REWF29)
     A N32        WF2951    R             +1
     A                                      REFFLD(WF2951 *LIBL/REWF29)
     A N32        ME04      R             +0
M001DA*           PSC07     R             +1REFFLD(WF2906 *LIBL/REWF29)
     A            PSC07          6  0     +1
     A                                      EDTWRD('  /  /  ')
     A            WF2907    R             94
     A                                      REFFLD(WF2907 *LIBL/REWF29)
     A            WF2908    R            108
     A                                      REFFLD(WF2908 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            WF2909    R            116
     A                                      REFFLD(WF2909 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            WF2914    R            122
     A                                      REFFLD(WF2914 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            WF2910    R            129
     A                                      REFFLD(WF2910 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            WF2911    R            142
     A                                      REFFLD(WF2911 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            WF2912    R            156
     A                                      REFFLD(WF2912 *LIBL/REWF29)
     A            MC02      R            162
M001DA*           PSC39     R            174REFFLD(WF2913 *LIBL/REWF29)
     A            PSC39          6  0    174
     A                                      EDTWRD('  /  /  ')
     A*----------------------------------------------------------------
     A          R PT1
     A                                      SPACEA(001)
     A                                    80
     A                                      '客戶小計---------------->'
     A            T12908    R            108
     A                                      REFFLD(WF2908 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T12909    R            116
     A                                      REFFLD(WF2909 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T12914    R            122
     A                                      REFFLD(WF2914 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T12910    R            129
     A                                      REFFLD(WF2910 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T12911    R            142
     A                                      REFFLD(WF2911 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PT2
     A*%%***********************************************************************
     A*%%RI 00000 
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                    80
     A                                      '地區小計---------------->'
     A            T22908    R            108
     A                                      REFFLD(WF2908 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T22909    R            116
     A                                      REFFLD(WF2909 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T22914    R            122
     A                                      REFFLD(WF2914 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T22910    R            129
     A                                      REFFLD(WF2910 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T22911    R            142
     A                                      REFFLD(WF2911 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PT3
     A*%%***********************************************************************
     A*%%RI 00000 
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                    80
     A                                      '通路型態小計------------>'
     A            T32908    R            108
     A                                      REFFLD(WF2908 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T32909    R            116
     A                                      REFFLD(WF2909 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T32914    R            122
     A                                      REFFLD(WF2914 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T32910    R            129
     A                                      REFFLD(WF2910 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T32911    R            142
     A                                      REFFLD(WF2911 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PT4
     A*%%***********************************************************************
     A*%%RI 00000 
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                    80
     A                                      '產品合計---------------->'
     A            T42908    R            108
     A                                      REFFLD(WF2908 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T42909    R            116
     A                                      REFFLD(WF2909 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T42914    R            122
     A                                      REFFLD(WF2914 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T42910    R            129
     A                                      REFFLD(WF2910 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A            T42911    R            142
     A                                      REFFLD(WF2911 *LIBL/REWF29)
     A                                      EDTCDE(J)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE1
     A*%%***********************************************************************
     A*%%RI 00000 
     A*%%***********************************************************************
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========='
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE2
     A*%%***********************************************************************
     A*%%RI 00000 
     A*%%***********************************************************************
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========='
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<SOR054>>--->報表結束'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE9
     A*%%***********************************************************************
     A*%%RI 00000 
     A*%%***********************************************************************
     A                                     3
     A                                      'もも此範圍無資料もも'
     A                                      SPACEA(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(REPLIB/SOR054P)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       198      *N     )
     A*%%***********************************************************************
