     A*%%TS  SD  19950923  110433  D910074     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : MTR043D                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/02/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MTR043                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :主檔                                      *
     A*    REMARK       :客戶清冊                                  *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19950923  110433  D910074     REL-V3R1M0  5763-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF04(04 'F4 HELP')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'SOR057'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4 25'通　路　 :'
     A                                      DSPATR(HI)
     A            DSA02S    R        B  4 38REFFLD(RERFR/MD07 *LIBL/RERF)
     A  60                                  DSPATR(RI)
     A  60                                  DSPATR(PC)
     A N60                                  DSPATR(HI)
     A                                  4 48'-'
     A            DSA02E    R        B  4 50REFFLD(RERFR/MD07 *LIBL/RERF)
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A N61                                  DSPATR(HI)
     A            DSA03S    R        B  5 38REFFLD(ME0/ME07 *LIBL/MTMEPF)
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A N62                                  DSPATR(HI)
     A                                  5 48'-'
     A            DSA03E    R        B  5 50REFFLD(ME0/ME07 *LIBL/MTMEPF)
     A  63                                  DSPATR(RI)
     A  63                                  DSPATR(PC)
     A N63                                  DSPATR(HI)
     A                                  6 25'客戶代號'
     A                                  6 36':'
     A            DSB01S    R        B  6 38REFFLD(ME0/ME01 *LIBL/MTMEPF)
     A  64                                  DSPATR(RI)
     A  64                                  DSPATR(PC)
     A                                  9 25'產品代號 :'
     A            DSA01S    R        B  9 38REFFLD(RERFR/SA01 *LIBL/RERF)
     A  66                                  DSPATR(RI)
     A  66                                  DSPATR(PC)
     A                                  9 48'-'
     A            DSA01E    R        B  9 50REFFLD(RERFR/SA01 *LIBL/RERF)
     A  67                                  DSPATR(RI)
     A  67                                  DSPATR(PC)
     A                                 10 25'有效日期 :'
     A            DDATE          6Y 0B 10 38EDTCDE(Y)
     A  68                                  DSPATR(RI)
     A  68                                  DSPATR(PC)
     A                                 16 25'執行環境'
     A                                 16 36':'
     A            $EVR           1Y 0B 16 38VALUES(1 2)
     A                                      EDTCDE(3)
     A                                      CHECK(RB)
     A                                 16 42'(1-即時   2-批次)'
     A                                 17 25'列印份數'
     A                                 17 36':'
     A            $CPY           3Y 0B 17 38EDTCDE(3)
     A                                      CHECK(RB)
     A                                 18 25'列表機'
     A                                      DSPATR(HI)
     A                                 18 36':'
     A                                      DSPATR(HI)
     A            $PRTID         2Y 0B 18 38CHECK(RB)
     A                                      DSPATR(HI)
     A                                      EDTCDE(3)
     A                                 20 26'***請準備　８０行報表紙***'
     A                                      DSPATR(HI)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2140 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          50A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR10         50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                  2 30'客戶搭贈報價明細表'
     A                                      DSPATR(HI)
     A                                 10 50'(MM/DD/YY)'
     A                                 12 25'選　項　 :'
     A            DSEL           1A  B 12 38VALUES(' ' 'A' 'B')
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A                                 12 43'A :最後報價'
     A                                 13 43'B :全部報價'
     A                                  5 25'型　態　 :'
     A                                      DSPATR(HI)
     A                                  7 25'業務員　'
     A                                      DSPATR(HI)
     A            DME15S    R        B  7 38REFFLD(RERFR/ME15 *LIBL/RERF)
     A  70                                  DSPATR(RI)
     A  70                                  DSPATR(PC)
     A                                  7 48'-'
     A            DME15E    R        B  7 50REFFLD(RERFR/ME15 *LIBL/RERF)
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A                                  7 36':'
