     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SOR070P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 82/02/01                                   *
     A*    PROGRAM NAME : SOR070                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品辦事處通路彙總表                      *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    76MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    79'產品辦事處通路彙總表'
     A                                      SPACEA(1)
     A            GROUP         10   O    86
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            COMPS          1A       13
     A                                    15'-'
     A            COMPE          1A       17
     A                                   146'日期:'
     A            $EGMDY         6  0O   154EDTCDE(Y)
     A                                   164'頁次:'
     A                                   171PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'通　路　:'
     A            DSC33S    R             13REFFLD(SC33)
     A                                    15'-'
     A            DSC33E    R             17REFFLD(SC33)
     A                                   146'時間:'
     A                                   154TIME
     A                                      SPACEA(1)
     A  20                                 1'確認日期:'
     A N20                                 1'送貨日期:'
M001MA* 20        DSC39S    R             13REFFLD(SC39)
M001MA  20        DSC39S         6  0     13
     A                                      EDTWRD('  /  /  ')
M001MA*N20        DSC08S    R             13REFFLD(SC08)
M001MA N20        DSC08S         6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'-'
M001MA* 20        DSC39E    R             24REFFLD(SC39)
M001MA  20        DSC39E         6  0     24
     A                                      EDTWRD('  /  /  ')
M001MA*N20        DSC08E    R             24REFFLD(SC08)
M001MA N20        DSC08E         6  0     24
     A                                      EDTWRD('  /  /  ')
     A                                   147'USER :'
     A            $USER         10   O   154
     A                                   165'<SOR070>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================='
     A                                      SPACEA(1)
     A                                    54'------------------'
     A                                    72'銷售'
     A                                    78'------------------'
     A                                    97'-----------------'
     A                                   114'銷退'
     A                                   120'------------------'
     A                                   139'----------------'
     A                                   155'實際銷售'
     A                                   165'----------------'
     A                                      SPACEA(1)
     A                                     1'產品代號／簡稱'
     A                                    31'辦事處'
     A                                    40'通路'
     A                                    56'訂購'
     A                                    65'搭贈'
     A                                    74'試飲'
     A                                    86'金額'
     A                                    99'訂購'
     A                                   108'搭贈'
     A                                   117'試飲'
     A                                   126'銷退金額'
     A                                   142'訂購'
     A                                   151'搭贈'
     A                                   160'試飲'
     A                                   172'金額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ---------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  21                                 1' '
     A                                      SPACEA(1)
     A N30        WF6111    R              1REFFLD(SD03)
     A N30        MA03      R             +1
     A N31        WF6101    R             32REFFLD(WF6101 *LIBL/REWF61)
     A N31        COMPC          6O       +0
     A            WF6102    R             40REFFLD(WF6101 *LIBL/REWF61)
     A            D#A03         12O       +0
     A            WF6103    R             54REFFLD(WF6103 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            WF6104    R             63REFFLD(WF6104 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            WF6105    R             72REFFLD(WF6105 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            WF6106    R             81REFFLD(WF6106 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            WF6107    R             97REFFLD(WF6107 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            WF6108    R            106REFFLD(WF6108 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            WF6109    R            115REFFLD(WF6109 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            WF6110    R            124REFFLD(WF6110 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T06101         6  0    140EDTCDE(J)
     A            T06102         6  0    149EDTCDE(J)
     A            T06103         6  0    158EDTCDE(J)
     A            T06104        10  0    167EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    31'辦事處小計--------->'
     A            T16103    R             54REFFLD(WF6103 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T16104    R             63REFFLD(WF6104 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T16105    R             72REFFLD(WF6105 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T16106    R             81REFFLD(WF6106 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T16107    R             97REFFLD(WF6107 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T16108    R            106REFFLD(WF6108 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T16109    R            115REFFLD(WF6109 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T16110    R            124REFFLD(WF6110 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T86101         6  0    140EDTCDE(J)
     A            T86102         6  0    149EDTCDE(J)
     A            T86103         6  0    158EDTCDE(J)
     A            T86104        10  0    167EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    31'產品小計----------->'
     A            T26103    R             54REFFLD(WF6103 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T26104    R             63REFFLD(WF6104 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T26105    R             72REFFLD(WF6105 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T26106    R             81REFFLD(WF6106 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T26107    R             97REFFLD(WF6107 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T26108    R            106REFFLD(WF6108 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T26109    R            115REFFLD(WF6109 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T26110    R            124REFFLD(WF6110 *LIBL/REWF61)
     A                                      EDTCDE(J)
     A            T96101         6  0    140EDTCDE(J)
     A            T96102         6  0    149EDTCDE(J)
     A            T96103         6  0    158EDTCDE(J)
     A            T96104        10  0    167EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================='
     A                                      SPACEA(1)
     A                                     2'<<SOR070>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
