     A                                      REF(*LIBL/RERF)
     A          R PH1                       SKIPB(2)
     A                                    63MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    69'客戶報價重覆檢核表'
     A                                   126'日期:'
     A            $EGMDY         6  0O   134EDTCDE(Y)
     A                                   143'頁次:'
     A                                   151PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                   126'時間:'
     A                                   134TIME
     A                                   145'<SOR67>'
     A                                   126' USER :'
     A                                      SPACEA(1)
     A            $USER         10A  O   134
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================')
     A                                      SPACEA(1)
     A                                     1'客戶'
     A                                    10'產品代號'
     A                                    26'折扣別'
     A                                    35'生效日期'
     A                                    46'截止日期'
     A                                    58'折扣率'
     A                                    70'比率'
     A                                    82'產品代號'
     A*                                   93'通路'
     A*                                  100'型態'
     A                                   107'折扣別'
     A                                   116'生效日期'
     A                                   127'截止日期'
     A                                   138'折扣率'
     A                                   150'比率'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------------------')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            SB01      R              2
     A            SB02      R             11
     A            SB04      R             29
     A            SB05      R             36EDTWRD('  /  /  ')
     A            SB13      R             47EDTWRD('  /  /  ')
     A            RSB06          4  2     59EDTCDE(1)
     A                                    64'%'
     A            SB07      R             68EDTCDE(1)
     A                                    71'/'
     A            SB08      R             72EDTCDE(1)
      *****
      *產品
     A            FLD1      R             83
     A                                      REFFLD(SB02)
      *客戶或通路
     A            FLD2      R             95
     A                                      REFFLD(SB01)
      *型態
     A            FLD3      R            102
     A                                      REFFLD(SA03)
      *折扣別
     A            FLD4      R            110
     A                                      REFFLD(SA04)
      *生效日
     A            FLD5      R            117EDTWRD('  /  /  ')
     A                                      REFFLD(SA05)
      *截止日
     A            FLD6      R            128EDTWRD('  /  /  ')
     A                                      REFFLD(SA13)
      *比率
     A            FLD7           4  2    138EDTCDE(1)
     A                                   143'%'
      *搭贈
     A            FLD8      R            149EDTCDE(1)
     A                                      REFFLD(SA07)
     A                                   152'/'
     A            FLD9      R            153EDTCDE(1)
     A                                      REFFLD(SA08)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================')
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ======================')
     A                                      SPACEA(1)
     A                                     2'<<SOR67>>--->報表結束'
     A*----------------------------------------------------------------
