     A*%%TS  SD  19941215  142531  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR059D                                    *
     A*    AUTHOR       : A1084  CHARLES                             *
     A*    CREATE DATE  : 81/05/04                                   *
     A*    PROGRAM NAME : SOR059                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :產品銷售分佈彙總表                        *
     /*=============================================================*/
     /*  CODE       AUTHOR.     DATE    DESCRIPTION
     /*-------------------------------------------------------------
     F*  M002     | MICHELLE  | 99.11.10 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     F*  M003     | MICHELLE  | 00.11.13 |增加大區域選項
     F*----------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A*%%TS  SD  19941215  142531  D910074     REL-V2R2M0  5738-PW1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF04(04 'F4 HELP')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'SOR092'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'公司產品銷售彙總表'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4 28'辦事處　:'
     A            COMP           1A  B  4 40VALUES(' ' '1' '2' '3')
     A                                  4 42'(1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  5 28'產品組別:'
     A            DMA11          1A  B  5 40VALUES('1' '2' '3' ' ')
     A  79                                  DSPATR(PC)
     A  79                                  DSPATR(RI)
     A                                  5 42'(1-BRANDY 2-WHISKY 3-WINE " "-ALL)'
M003AA                                  6 28'大區域別:'
M003AA                                      DSPATR(HI)
M003AA            D#L01S         2   B  6 40
M003AA N59                                  DSPATR(HI)
M003AA  59                                  DSPATR(PC)
M003AA  59                                  DSPATR(RI)
M003AA                                  6 50'-'
M003AA            D#L01E         2   B  6 52
M003AA N58                                  DSPATR(HI)
M003AA  58                                  DSPATR(PC)
M003AA  58                                  DSPATR(RI)
     A                                  7 28'產品代號:'
     A                                      DSPATR(HI)
     A            DSD03S    R        B  7 40REFFLD(SD03)
     A N60                                  DSPATR(HI)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                  7 50'-'
     A            DSD03E    R        B  7 52REFFLD(SD03)
     A N61                                  DSPATR(HI)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                  8 28'通　　路:'
     A                                      DSPATR(HI)
     A            DSC33S    R        B  8 40REFFLD(SC33)
     A N62                                  DSPATR(HI)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                  8 50'-'
     A            DSC33E    R        B  8 52REFFLD(SC33)
     A N63                                  DSPATR(HI)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                 11 28'業務員　:'
     A                                      DSPATR(HI)
     A            DSC27S    R        B 11 40REFFLD(SC27)
     A N64                                  DSPATR(HI)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                 11 50'-'
     A            DSC27E    R        B 11 52REFFLD(SC27)
     A N65                                  DSPATR(HI)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                  9 28'型　　態:'
     A                                      DSPATR(HI)
     A            DSC34S    R        B  9 40REFFLD(SC34)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A N66                                  DSPATR(HI)
     A                                  9 50'-'
     A            DSC34E    R        B  9 52REFFLD(SC34)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A N67                                  DSPATR(HI)
     A                                 10 28'地　　區:'
     A                                      DSPATR(HI)
     A            DSC31S    R        B 10 40REFFLD(SC31)
     A N68                                  DSPATR(HI)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A                                 10 50'-'
     A            DSC31E    R        B 10 52REFFLD(SC31)
     A N69                                  DSPATR(HI)
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A                                 12 28'客戶代號:'
     A                                      DSPATR(HI)
     A            DSC45S         9A  B 12 40
     A N74                                  DSPATR(HI)
     A  74                                  DSPATR(PC)
     A  74                                  DSPATR(RI)
     A                                 12 50'-'
     A            DSC45E         9A  B 12 52
     A N75                                  DSPATR(HI)
     A  75                                  DSPATR(PC)
     A  75                                  DSPATR(RI)
M002AA                                 13 28'集　　團:'
M002AA                                      DSPATR(HI)
M002AA            DMD06S         2   B 13 40
M002AA N76                                  DSPATR(HI)
M002AA  76                                  DSPATR(PC)
M002AA  76                                  DSPATR(RI)
M002AA                                 13 50'-'
M002AA            DMD06E         2   B 13 52
M002AA N77                                  DSPATR(HI)
M002AA  77                                  DSPATR(PC)
M002AA  77                                  DSPATR(RI)
     A                                 14 28'送貨日期:'
M001DA*           DSC08S    R        B 14 40REFFLD(SC39)
M001AA            DSC08S         6  0B 14 40
     A                                      EDTWRD('  /  /  ')
     A  70                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A                                 14 50'-'
M001DA*           DSC08E    R        B 14 52REFFLD(SC39)
M001AA            DSC08E         6  0B 14 52
     A                                      EDTWRD('  /  /  ')
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A                                 14 63'(MM/DD/YY)'
     A                                 15 28'確認日期:'
M001DA*           DSC39S    R        B 15 40REFFLD(SC39)
M001AA            DSC39S         6  0B 15 40
     A                                      EDTWRD('  /  /  ')
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A                                 15 50'-'
M001DA*           DSC39E    R        B 15 52REFFLD(SC39)
M001AA            DSC39E         6  0B 15 52
     A                                      EDTWRD('  /  /  ')
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A                                 15 63'(MM/DD/YY)'
     A                                 16 28'分析方式:'
     A            DSEL2          1A  B 16 40VALUES('A' 'B')
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                 16 43'A-禮盒不拆'
     A                                 17 43'B-禮盒拆單瓶'
     A                                 18 28'執行環境:'
     A            $EVR           1Y 0B 18 41VALUES(1 2)
     A                                      EDTCDE(3)
     A                                      CHECK(RB)
     A N31                                  DSPATR(UL)
     A  31                                  DSPATR(PR)
     A                                 18 43'(1-即時   2-批次)'
     A                                 19 28'列印份數'
     A                                 19 39':'
     A            $CPY           3Y 0B 19 41EDTCDE(3)
     A                                      CHECK(RB)
     A                                 20 28'列表機'
     A                                      DSPATR(HI)
     A                                 20 39':'
     A                                      DSPATR(HI)
     A            $PRTID         2Y 0B 20 41CHECK(RB)
     A                                      DSPATR(HI)
     A                                      EDTCDE(3)
     A                                 21 29'***請準備１３２行報表紙***'
     A                                      DSPATR(HI)
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A  98        ERR1          50A  O 24  2MSGID(UPT 2140 PTMF)
     A                                      DSPATR(HI)
     A  97        ERR2          50A  O 24  2MSGID(UPT 2110 PTMF)
     A                                      DSPATR(HI)
     A  96        ERR3          50A  O 24  2MSGID(UPT 2150 PTMF)
     A                                      DSPATR(HI)
     A  95        ERR4          50A  O 24  2MSGID(UPT 0010 PTMF)
     A                                      DSPATR(HI)
     A  94        ERR5          50A  O 24  2MSGID(UPT 2010 PTMF)
     A                                      DSPATR(HI)
     A  93        ERR6          50A  O 24  2MSGID(UPT 0040 PTMF)
     A                                      DSPATR(HI)
     A  92        ERR7          50A  O 24  2MSGID(UPT 1011 PTMF)
     A                                      DSPATR(HI)
     A  91        ERR10         50A  O 24  2MSGID(UPT 0041 PTMF)
     A                                      DSPATR(HI)
     A  90        ERR11         50A  O 24  2MSGID(URE 0081 REMF)
     A                                      DSPATR(HI)
     A  89        ERR12         50A  O 24  2MSGID(UPT 0011 PTMF)
     A                                      DSPATR(HI)
     A  87        ERR8          63A  O 24  2MSGID(URE 0051 REMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
