     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR057P                                   *
     A*    AUTHOR       : ANDY                                       *
     A*    CREATE DATE  : 81/08/31                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR0571                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :主檔                                      *
     A*    REMARK       :客戶搭贈報價明細表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    43MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    47'客戶搭贈報價明細表'
     A                                      SPACEA(1)
     A                                     1'通　路'
     A                                    11':'
     A            DSA02S    R             +1REFFLD(SA02)
     A                                    22'～'
     A            DSA02E    R             +0REFFLD(SA02)
     A                                      SPACEA(1)
     A                                     1'型　態'
     A                                    11':'
     A            DSA03S    R             +1REFFLD(SA03)
     A                                    22'～'
     A            DSA03E    R             +0REFFLD(SA03)
     A                                      SPACEA(1)
     A                                     1'客　戶'
     A                                    11':'
     A            DSB01S    R        O    +1REFFLD(SB01)
     A                                    22'～'
     A            DSB01E    R        O    +0REFFLD(SB01)
     A                                    83'日期:'
     A            $EGMDY         6  0O    91EDTCDE(Y)
     A                                   100'頁次:'
     A                                   107PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'產　品'
     A                                    11':'
     A            DSA01S    R        O    +1REFFLD(SA01)
     A                                    22'～'
     A            DSA01E    R        O    +0REFFLD(SA01)
     A                                    83'時間:'
     A                                    91TIME
     A                                   100'<SOR057P>'
     A                                      SPACEA(1)
     A                                     1'有效日期'
     A                                    11':'
M001MA*           DDATE     R        O    +1REFFLD(SB05)
M001MA            DDATE          6  0O    +1
     A                                      EDTCDE(Y)
     A                                    83' USER :'
     A            $USER         10A  O    91
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============')
     A                                      SPACEA(1)
     A                                     1'產品品牌'
     A                                    12'通路型態／說明'
     A                                    48'---------搭贈／訂購---------'
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    12'客戶代號／簡稱'
     A                                    37'折扣別'
     A                                    47'比率１'
     A                                    59'比率２'
     A                                    71'比率３'
     A                                    83'生效日'
     A                                    93'截止日'
     A                                   103'確認'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF3501    R              2REFFLD(SA01)
     A            CUS            5        12
     A            NAME          18O       +1
     A            DSCNT          8O       37
     A            WF3504    R             46REFFLD(SA07)
     A                                      EDTCDE(3)
     A                                    +0'/'
     A            WF3505    R             +0REFFLD(SA08)
     A                                      EDTCDE(3)
     A            WF3506    R             58REFFLD(SA07)
     A                                      EDTCDE(3)
     A                                    +0'/'
     A            WF3507    R             +0REFFLD(SA08)
     A                                      EDTCDE(3)
     A            WF3508    R             70REFFLD(SA07)
     A                                      EDTCDE(3)
     A                                    +0'/'
     A            WF3509    R             +0REFFLD(SA08)
     A                                      EDTCDE(3)
M001MA*           D3410     R             83REFFLD(SA05)
M001MA            D3410          6  0     83
     A                                      EDTCDE(Y)
M001MA*           D3411     R             93REFFLD(SA13)
M001MA            D3411          6  0     93
     A                                      EDTCDE(Y)
     A            COMF           8O      103
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============')
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============')
     A                                      SPACEA(1)
     A                                     2'<<SOR057P>>--->報表結束'
