     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR074P                                    *
     A*    AUTHOR       : D910074 TINA                               *
     A*    CREATE DATE  : 82/05/18                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR074                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :訂單系統                                  *
     A*    REMARK       :業務員訂單獎金報表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    36MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    41'業務員訂單獎金報表'
     A                                      SPACEA(2)
     A                                     1'通　　路:'
     A            DSC33S    R             13REFFLD(SC33)
                                          17'-'
     A            DSC33E    R             19REFFLD(SC33)
     A                                      SPACEA(1)
     A                                     1'型　　態:'
     A            DSC34S    R             13REFFLD(SC34)
                                          17'-'
     A            DSC34E    R             19REFFLD(SC34)
     A                                      SPACEA(1)
     A                                     1'組　　別:'
     A            #A03      R             13
     A                                    70'日期:'
     A            $EGMDY         6  0O    78EDTCDE(Y)
     A                                    87'頁次:'
     A                                    95PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'業務員　:'
     A            MC02      R             13
     A                                    70'時間:'
     A                                    78TIME
     A                                    89'<SOR074>'
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
M001MA*N20        DSC08S    R             13REFFLD(SC08)
M001MA N20        DSC08S         6  0     13
     A                                      EDTWRD('  /  /  ')
M001MA* 20        DSC39S    R             13REFFLD(SC39)
M001MA  20        DSC39S         6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'-'
M001MA*N20        DSC08E    R             24EDTWRD('  /  /  ')
M001MA N20        DSC08E         6  0     24EDTWRD('  /  /  ')
     A*M001D                                REFFLD(SC39)
M001MA* 20        DSC39E    R             24EDTWRD('  /  /  ')
M001MA  20        DSC39E         6  0     24EDTWRD('  /  /  ')
     A*M001M                                REFFLD(SC39)
     A                                    70' USER:'
     A            $USER         10A  O    78
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'訂單號碼'
     A                                    14'客戶代號／簡稱'
     A                                    47'訂單金額'
     A                                    61'送貨單號'
     A                                    71'發票號碼'
     A                                    82'送貨日期'
     A                                    92'確認日期'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            SC02      R              2
     A            SC04      R             16
     A            SC05      R             21
     A            ME04      R             26
     A            SC12      R             45EDTCDE(J)
     A            SC29      R             58
     A            SC30      R             71
M001MA*           WSC08     R             83REFFLD(SC08)
M001MA            WSC08          6  0     83
     A                                      EDTWRD('  /  /  ')
M001MA*           WSC39     R             93REFFLD(SC39)
M001MA            WSC39          6  0     93
     A                                      EDTWRD('  /  /  ')
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                     2'業務員小計------->'
     A            COUNT          4  0     +0EDTCDE(J)
     A                                    +0'張訂單'
     A            T1TOT1        10  0     43EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<SOR074>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE9
     A                                     3'もも此範圍無資料もも'
     A                                      SPACEA(1)
