     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    68MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    69'普銷訂單／送貨單明細表  '
     A                                      SPACEA(2)
     A                                     1'辦事處　:'
     A            COMPC          6        +1
     A                                   134'日期:'
     A            $EGMDY         6  0O   152EDTCDE(Y)
     A                                   152'頁次:'
     A                                   159PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'物流點　：'
     A            DSC11S    R             +1REFFLD(SC11)
     A                                    +1'-'
     A            DSC11E    R             +1REFFLD(SC11)
     A                                   134'時間:'
     A                                   142TIME
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'訂單日期:'
     A*N20        DSC08S    R             +1REFFLD(SC08)
     A N20        DSC08S         6  0     +1
     A                                      EDTCDE(Y)
     A* 20        DSC07S    R             +1REFFLD(SC07)
     A  20        DSC07S         6  0     +1
     A                                      EDTCDE(Y)
     A                                    +1'-'
     A*N20        DSC08E    R             +1REFFLD(SC08)
     A N20        DSC08E         6  0     +1
     A                                      EDTCDE(Y)
     A* 20        DSC07E    R             +1REFFLD(SC07)
     A  20        DSC07E         6  0     +1
     A                                      EDTCDE(Y)
     A                                   135'USER :'
     A            $USER         10   O   142
     A                                   159'<SOR071>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     1'送貨日期'
     A                                    11'客戶訂單號碼'
     A                                    26'客戶代號'
     A                                    36'客戶簡稱'
     A                                    58'產品代號'
     A                                    70'產品簡稱'
     A                                    86'單位'
     A                                    93'訂購'
     A                                    99'搭贈'
     A                                   105'售價'
     A                                   115'金額'
     A                                   132'狀態'
     A                                   142'物流點'
     A                                   150'送貨單號'
     A                                   162'訂單單號'
     A                                   175'訂單日期'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  29                                 1' '
     A                                      SPACEA(1)
     A*N30        PWF671    R              2REFFLD(SC08)
     A N30        PWF671         6  0      2
     A                                      EDTWRD('  /  /  ')
     A N31        SC06A     R             12REFFLD(SC06)
     A N32        WF6703    R             27REFFLD(SC04)
     A N32                                +1'-'
     A N32        WF6704    R             +1REFFLD(SC05)
     A N32        ME04      R             +1REFFLD(ME04)
     A            WF6705    R             59REFFLD(SD03)
     A            MA03      R             68REFFLD(MA03)
     A            MA13      R             86REFFLD(MA13)
     A            WF6706    R             92EDTCDE(J)
     A                                      REFFLD(SD04)
     A            WF6707    R             99EDTCDE(J)
     A                                      REFFLD(SD05)
     A            WF6708    R            105REFFLD(SD06)
     A                                      EDTCDE(3)
     A            AMT       R            115REFFLD(SD07)
     A                                      EDTCDE(J)
     A            DTYPE         12O      130
     A N31        WF6710    R            143REFFLD(SC11)
     A N31        WF6711    R            149REFFLD(SC29)
     A N31        WF6712    R            162REFFLD(SC02)
     A*N31        DWF671    R            175REFFLD(SC07)
     A N31        DWF671         6  0    175
     A                                      EDTWRD('  /  /  ')
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    70'訂單小計----------->'
     A            T3QTY1         5  0     92EDTCDE(J)
     A            T3QTY2         4  0     99EDTCDE(J)
     A            AMT3          11  2    115EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    70'日期小計----------->'
     A            T1QTY1         5  0     92EDTCDE(J)
     A            T1QTY2         4  0     99EDTCDE(J)
     A            AMT1          11  2    115EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    70'合　　計----------->'
     A            T2QTY1         5  0     92EDTCDE(J)
     A            T2QTY2         4  0     99EDTCDE(J)
     A            AMT2          11  2    115EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A                                     2'<<SOR071>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
