     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
     A*                                                              *
     A*    DSPF NAME    : SOR081D                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 81/02/20                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR081                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :訂單系統                                  *
     A*    REMARK       :通路產品銷售（退）彙總表                  *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SOR081'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0   1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 27'通路產品銷售（退）彙總表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A     3 70
     A                                  5 25'辦事處　'
     A                                  5 36':'
     A            COMP           1A     5 38
     A                                  5 41'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
     A                                  6 25'通　　路'
     A                                  6 36':'
     A            DSC33S    R           6 38REFFLD(SC33)
     A                                  6 48'-'
     A            DSC33E    R           6 50REFFLD(SC33)
     A                                  7 25'型　　態'
     A                                  7 36':'
     A            DSC34S         2A     7 38
     A                                  7 48'-'
     A            DSC34E         2A     7 50
     A                                  8 25'業務組別'
     A                                  8 36':'
     A            DSC28S         4A     8 38
     A                                  8 48'-'
     A            DSC28E         4A     8 50
     A                                  9 25'地　　區'
     A                                  9 36':'
     A            DSC31S    R           9 38REFFLD(SC31)
     A                                  9 48'-'
     A            DSC31E    R           9 50REFFLD(SC31)
     A                                 10 25'客戶代號'
     A                                 10 36':'
     A            DSC45S         9     10 38
     A                                 10 48'-'
     A            DSC45E         9     10 50
     A                                 11 25'產品代號'
     A                                 11 36':'
     A            DSD03S    R          11 38REFFLD(SD03)
     A                                 11 48'-'
     A            DSD03E    R          11 50REFFLD(SD03)
     A                                 13 25'送貨日期'
     A                                 13 36':'
M001DA*           DSC08S    R          13 38REFFLD(SC39)
M001AA            DSC08S         6  0  13 38
     A                                      EDTWRD('  /  /  ')
     A                                 13 48'-'
M001DA*           DSC08E    R          13 50REFFLD(SC39)
M001AA            DSC08E         6  0  13 50
     A                                      EDTWRD('  /  /  ')
     A                                 13 59'(MM/DD/YY)'
     A                                 14 25'確認日期'
     A                                 14 36':'
M001DA*           DSC39S    R          14 38REFFLD(SC39)
M001AA            DSC39S         6  0  14 38
     A                                      EDTWRD('  /  /  ')
     A                                 14 48'-'
M001DA*           DSC39E    R          14 50REFFLD(SC39)
M001AA            DSC39E         6  0  14 50
     A                                      EDTWRD('  /  /  ')
     A                                 14 59'(MM/DD/YY)'
     A                                 16 25'執行環境'
     A                                 16 36':'
     A            $EVR           1  0  16 38
     A                                      EDTCDE(3)
     A                                 16 42'(1-即時   2-批次)'
     A                                 17 25'列印份數'
     A                                 17 36':'
     A            $CPY           3  0  17 38EDTCDE(3)
     A                                 18 25'列表機'
     A                                 18 36':'
     A            $PRTID         2  0  18 38
     A                                      EDTCDE(3)
     A                                 20 26'***請準備８０行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
