     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SOR082                                     *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 05/23/94                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR082                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :月客戶銷售（退）統計表                    *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SOR082 '
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 29'專櫃部門銷售統計年報'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  7 28'專櫃代號:'
     A            DST01S    R        O  7 40REFFLD(ST01)
     A                                  7 46'-'
     A            DST01E    R        O  7 48REFFLD(ST01)
     A                                  9 28'銷售年月:'
     A            DST02          4  0O  9 40
     A                                      EDTWRD('  /  ')
     A                                  9 46'(MM/YY)'
     A                                 16 28'執行環境:'
     A            $EVR           1  0O 16 41
     A                                      EDTCDE(3)
     A                                 16 43'(1-即時   2-批次)'
     A                                 17 28'列印份數'
     A                                 17 39':'
     A            $CPY           3  0O 17 41EDTCDE(3)
     A                                 18 28'列表機'
     A                                 18 39':'
     A            $PRTID         2  0O 18 41
     A                                      EDTCDE(3)
     A                                 20 29'***請準備８０行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
