     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SOR073P                                    *
     A*    AUTHOR       : AN MING HSIA                               *
     A*    CREATE DATE  : 05/22/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR073                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :組別產品銷售彙總表                        *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    40MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    44'組別產品銷售彙總表'
     A                                      SPACEA(2)
     A                                     1'辦事處　:'
     A            COMP           1A       +1
     A            COMPC          6O       +1
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S    R             +1REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R             +1REFFLD(SD03)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DSC04S    R             +1REFFLD(SC04)
     A                                    +1'-'
     A            DSC04E    R             +1REFFLD(SC04)
     A                                      SPACEA(1)
     A  20                                 1'確認日期:'
     A N20                                 1'送貨日期:'
M001DA* 20        DSC39S    R             13REFFLD(SC39)
M001AA  20        DSC39S         6  0     13
M001DA*N20        DSC08S    R             13REFFLD(SC08)
M001AA N20        DSC08S         6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'-'
M001DA* 20        DSC39E    R             24REFFLD(SC39)
M001AA  20        DSC39E         6  0     24
M001DA*N20        DSC08E    R             24REFFLD(SC08)
M001AA N20        DSC08E         6  0     24
     A                                      EDTWRD('  /  /  ')
     A                                    66'日期:'
     A            $EGMDY         6  0O    74EDTCDE(Y)
     A                                    84'頁次:'
     A                                    91PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'組別　　:'
     A            WF7401    R             +1REFFLD(SC28)
     A            #A03      R             +1
     A                                    66'時間:'
     A                                    74TIME
     A                                      SPACEA(1)
     A                                     1'業務員　:'
     A            DSC27S    R             +1REFFLD(SC27)
     A                                    +1'-'
     A            DSC27E    R             +1REFFLD(SC27)
     A                                    67'USER :'
     A            $USER         10   O    74
     A                                    84'<SOR073>'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     1'產品／簡稱'
     A                                    33'銷售數量'
     A                                    48'銷退數量'
     A                                    64'實際銷售量'
     A                                    84'實際銷售金額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       ----------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  21                                 1' '
     A                                      SPACEA(1)
     A            WF7403    R              2REFFLD(WF7403 *LIBL/REWF74)
     A            MA03      R             +1
     A            WF7404    R             35REFFLD(WF7404 *LIBL/REWF74)
     A                                      EDTCDE(1)
     A            WF7405    R             50REFFLD(WF7405 *LIBL/REWF74)
     A                                      EDTCDE(1)
     A            WFTOT     R             68REFFLD(WF7405 *LIBL/REWF74)
     A                                      EDTCDE(J)
     A            WFTOT1    R             80REFFLD(WF7406 *LIBL/REWF74)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A            WF7402    R              2REFFLD(WF7402 *LIBL/REWF74)
     A                                     8'小計-------------------+
     A                                      ->'
     A            T17404    R             35REFFLD(WF7404 *LIBL/REWF74)
     A                                      EDTCDE(1)
     A            T17405    R             50REFFLD(WF7405 *LIBL/REWF74)
     A                                      EDTCDE(1)
     A            T1TOT     R             68REFFLD(WF7405 *LIBL/REWF74)
     A                                      EDTCDE(J)
     A            T1TOT1    R             80REFFLD(WF7406 *LIBL/REWF74)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A            WF742$    R              2REFFLD(WF742$ *LIBL/REWF74)
     A                                     8'小計-------------------+
     A                                      ->'
     A            T27404    R             35REFFLD(WF7404 *LIBL/REWF74)
     A                                      EDTCDE(1)
     A            T27405    R             50REFFLD(WF7405 *LIBL/REWF74)
     A                                      EDTCDE(1)
     A            T2TOT     R             68REFFLD(WF7405 *LIBL/REWF74)
     A                                      EDTCDE(J)
     A            T2TOT1    R             80REFFLD(WF7406 *LIBL/REWF74)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                     8'組別小計---------------+
     A                                      ->'
     A            T37404    R             35REFFLD(WF7404 *LIBL/REWF74)
     A                                      EDTCDE(1)
     A            T37405    R             50REFFLD(WF7405 *LIBL/REWF74)
     A                                      EDTCDE(1)
     A            T3TOT     R             68REFFLD(WF7405 *LIBL/REWF74)
     A                                      EDTCDE(J)
     A            T3TOT1    R             80REFFLD(WF7406 *LIBL/REWF74)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ================'
     A                                      SPACEA(1)
     A                                     2'<<SOR073>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     3'もも此範圍無資料もも'
     A                                      SPACEA(1)
