     A*%%TS  SD  19940622  091833  D910074     REL-V2R2M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR069Z                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 83/06/22                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR069                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :業務員領單登記表                          *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SOR069'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70
     A                                  2  2'SCR001'
     A                                  2 31'業務員領單登記表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5 25'公司　　　:'
     A            DSI01S    R        O  5 39REFFLD(SI01)
     A                                  5 42'-'
     A            DSI01E    R        O  5 44REFFLD(SI01)
     A                                  7 25'通路　　　:'
     A            DSI03S         1A  O  7 39
     A                                  7 42'-'
     A            DSI03E         1A  O  7 44
     A                                  8 25'型態　  :'
     A            DSI04S         2A  O  8 39
     A                                  8 42'-'
     A            DSI04E         2A  O  8 44
     A                                  9 25'客戶代號　:'
     A            CSI23S         9A  O  9 39
     A                                  9 49'-'
     A            CSI23E         9A  O  9 51
     A                                 11 25'送貨日期　:'
     A            DSI06S         6  0O 11 39EDTWRD('  /  /  ')
     A                                 11 49'-'
     A            DSI06E         6  0O 11 51EDTWRD('  /  /  ')
     A                                 13 25'選項　  :'
     A            DSEL           1A  O 13 39
     A                                 13 42'(A-最新業務員)'
     A                                 14 42'(B-交易業務員)'
     A                                 16 26'執行環境　:'
     A            $EVR           1  0O 16 40
     A                                 16 43'(1-即時   2-批次)'
     A                                 17 26'列印份數　:'
     A            $CPY           3  0O 17 40
     A                                 18 26'列表機　　:'
     A            $PRTID         2  0O 18 40
     A                                 20 27'***請準備套版報表紙***  '
     A                                 21 26'***僅含未沖帳完畢資料***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
