     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR041P                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/02/10                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR042                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :產品客戶報價表                            *
     A*===============================================================
     A* MODI CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*  M001     | MICH   | 000824 | DETAIL MODIFY
     A****************************************************************
     A                                      REF(*LIBL/SOSBPF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    53
     A                                      MSGCON(030 URE9999 REMF)
     A                                   113
     A                                      '日期:'
     A            $EGMDY         6  0O   121
     A                                      EDTCDE(Y)
     A                                   130
     A                                      '頁次:'
     A                                   138
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                    59
     A                                      '客戶產品報價表'
     A                                   113
     A                                      '時間:'
     A                                   121
     A                                      TIME
     A                                      SPACEA(001)
     A                                   132
     A                                      '<SOR041>'
     A                                   113
     A                                      ' USER :'
     A            $USER         10A  O   121
     A                                      SPACEA(001)
     A                                     1
     A                                      '客戶代號:'
     A            DMD01S    R             13
     A                                      REFFLD(SB01)
     A                                    20
     A                                      '-'
     A            DMD01E    R             23
     A                                      REFFLD(SB01)
     A                                    31
     A                                      '通路:'
     A            DMD07S    R             43
     A                                      REFFLD(MD07 RERF)
     A                                    48
     A                                      '-'
     A            DMD07E    R             53
     A                                      REFFLD(MD07 RERF)
     A                                    61
     A                                      '型態:'
     A            DMD08S    R             73
     A                                      REFFLD(MD08 RERF)
     A                                    78
     A                                      '-'
     A            DMD08E    R             83
     A                                      REFFLD(MD08 RERF)
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號:'
     A            DSA01S    R             13
     A                                      REFFLD(SB02)
     A                                    24
     A                                      '-'
     A            DSA01E    R             26
     A                                      REFFLD(SB02)
     A                                    61
     A                                      '生效日期:'
     A            DATE           6S 0     73
     A                                      EDTWRD('  /  /  ')
     A                                      SPACEA(002)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------'
     A                                      SPACEA(001)
     A                                    51
     A                                      '正常折扣'
     A                                    76
     A                                      '特別折扣'
     A                                   105
     A                                      '搭　贈'
     A                                      SPACEA(001)
     A                                    49
     A                                      '----------------'
     A                                    73
     A                                      '----------------'
     A                                    95
     A                                      '--------------------------'
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品'
     A                                      SPACEB(001)
     A                                    12
     A                                      '簡稱'
     A                                    38
     A                                      '牌價'
     A                                    49
     A                                      '折扣率　折扣價'
     A                                    73
     A                                      '折扣率　折扣價'
     A                                    95
     A                                      '比率１'
     A                                   105
     A                                      '比率２'
     A                                   115
     A                                      '比率３'
     A                                   124
     A                                      '生效日　　截止日'
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PH2
     A                                    41
     A                                      '客戶代號:'
     A            SB01      R             53
     A            ME04      R             63
     A                                      REFFLD(ME04 *LIBL/RERF)
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A*                                     SPACEA(001)
     A            SB02      R              2
     A            MA03      R             12
     A                                      REFFLD(MA03 RERF)
     A            PRICE          7  0     34
     A                                      EDTCDE(J)
     A            SB06N          6S 4     46
     A                                      EDTCDE(1)
     A                                    53
     A                                      '%'
     A            SB06N$         9  2     55
     A                                      EDTCDE(J)
     A            SB06S          6S 4     70
     A                                      EDTCDE(1)
     A                                    77
     A                                      '%'
     A            SB06S$         9  2     79
     A                                      EDTCDE(J)
     A            SB07      R             95
     A                                      EDTCDE(Z)
     A                                    98
     A                                      '/'
     A            SB08      R             99
     A                                      EDTCDE(Z)
     A            SB09      R            105
     A                                      EDTCDE(Z)
     A                                   108
     A                                      '/'
     A            SB10      R            109
     A                                      EDTCDE(Z)
     A            SB11      R            115
     A                                      EDTCDE(Z)
     A                                   118
     A                                      '/'
     A            SB12      R            119
     A                                      EDTCDE(Z)
M001DA*           SB05P     R            124REFFLD(SB05 RERF)
     A            SB05P          6  0    124
     A                                      EDTWRD('  /  /  ')
M001DA*           SB13P     R            134REFFLD(SB13 RERF)
     A            SB13P          6  0    134
     A                                      EDTWRD('  /  /  ')
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A                                     1
     A                                      '　製表人:___________'
     A                                    23
     A                                      '通路主管:___________'
     A                                    45
     A                                      '地區主管:___________'
     A                                    67
     A                                      '產品主管:___________'
M001MA*                                   89'副總經理:___________'
M001MA*                                  112'電腦室:___________'
     A                                    89
     A                                      '總經理:___________'
     A                                   110
     A                                      '電腦室:_____________'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A                                     1
     A                                      '　製表人:___________'
     A                                    23
     A                                      '通路主管:___________'
     A                                    45
     A                                      '地區主管:___________'
     A                                    67
     A                                      '產品主管:___________'
M001MA*                                   89'副總經理:___________'
M001MA*                                  112'電腦室:___________'
     A                                    89
     A                                      '總經理:___________'
     A                                   110
     A                                      '電腦室:_____________'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<SOR041>>--->報表結束'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PE9
     A                                      SPACEA(001)
     A                                     3
     A                                      'もも此範圍無資料もも'
