     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SOR043D1                                   *
     A*    AUTHOR       : MICHELLE HUANG                             *
     A*    CREATE DATE  : 03/05/99                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR043D1                                   *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售報表系統                              *
     A*    REMARK       :客戶報價單                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A*------------------------------------------------------------
     A*
     A          R SFLSR                     SFL
     A  54                                  SFLNXTCHG
     A            RRN            4S 0H
     A            DOPT           1   B  9  3VALUES(' ' '/')
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                      DSPATR(HI)
     A            MA01      R           9  6
     A            MA03      R           9 16
     A*------------------------------------------------------------
     A*
     A          R SFLCR                     SFLCTL(SFLSR)
     A                                      SFLSIZ(0040)
     A                                      SFLPAG(0020)
                                            SFLLIN(8)
     A                                      ROLLUP(25 '下一頁')
     A                                      CA12(12)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A  97                                  SFLMSGID(CPF5203 *LIBL/PTMF)
     A            DRRN           4S 0H      SFLRCDNBR
     A                                  1  2'SOR043D1'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR002'
     A                                  2 34'客戶報價單'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  2'輸入作業選擇:'
     A                                  6  6'/ =挑選'
     A                                  8  3'A 產品代號/簡稱           '
                                            DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  8 42'A 產品代號/簡稱           '
                                            DSPATR(UL)
     A                                      DSPATR(HI)
     A*------------------------------------------------------------
     A          R DSPC1
     A*
     A                                 22  2'執行'
     A                                 22 10'F12 =回前畫面'
