     A*%%***********************************************************************
     A*%%TS  RD  20021004  134901  REPGMR      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR045P                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 82/09/24                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR045                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售系統                                  *
     A*    REMARK       :待核准單據彙總表                          *
     A****************************************************************
     A                                      REF(*LIBL/SOSMLF01)
     A          R PH1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A                                    65
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
     A                                    66
     A                                      '待核准訂單／送貨單彙總表'
     A                                      SPACEA(003)
     A                                   127
     A                                      '日期:'
     A            $EGMDY         6  0O   134
     A                                      EDTCDE(Y)
     A                                   144
     A                                      '頁次:'
     A                                   152
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                     1
     A                                      '通　路　:'
     A                                      SPACEB(001)
     A            DPATHS         1        +1
     A                                    +2
     A                                      '-'
     A            DPATHE         1        +1
     A                                   127
     A                                      '時間:'
     A                                   134
     A                                      TIME
     A                                   144
     A                                      '<SOR045>'
     A                                      SPACEB(001)
     A                                     1
     A                                      '送貨日期'
     A                                    +0
     A                                      ':'
     A            DDATES         6  0     +1
     A                                      EDTCDE(Y)
     A                                    +1
     A                                      '-'
     A            DDATEE         6  0     +0
     A                                      EDTCDE(Y)
     A                                   127
     A                                      ' USER :'
     A            $USER         10A  O   134
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ================'
     A                                      SPACEB(001)
     A                                    58
     A                                      '送　　貨'
     A                                      SPACEB(001)
     A                                   133
     A                                      '單'
     A                                   137
     A                                      '額'
     A                                   141
     A                                      '逾'
     A                                   145
     A                                      '搭'
     A                                   149
     A                                      '試'
     A                                   153
     A                                      '換'
     A                                     1
     A                                      '單據號碼'
     A                                      SPACEB(001)
     A                                    14
     A                                      '業務員'
     A                                    31
     A                                      '客戶代號'
     A                                    42
     A                                      '客戶簡稱'
     A                                    58
     A                                      '日　　期'
     A                                    69
     A                                      '產品代號'
     A                                    79
     A                                      '產品名稱'
     A                                    96
     A                                      '單位'
     A                                   103
     A                                      '數量'
     A                                   110
     A                                      '單價'
     A                                   121
     A                                      '金額'
     A                                   127
     A                                      '搭贈'
     A                                   133
     A                                      '價'
     A                                   137
     A                                      '度'
     A                                   141
     A                                      '期'
     A                                   145
     A                                      '贈'
     A                                   149
     A                                      '飲'
     A                                   153
     A                                      '貨'
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ================'
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 003
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PD1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A            SM02      R        O     2
     A            SM16      R        O    14
     A            MC02      R        O    20
     A                                      REFFLD(MC0/MC02 *LIBL/MTMCPF)
     A            SM04      R        O    32
     A            SM05      R        O    37
     A            ME04      R        O    41
     A                                      REFFLD(ME0/ME04 *LIBL/MTMEPF)
M001DA*           PSM06     R        O    59
     A            PSM06          6  0O    59
M001DA*                                     REFFLD(SM06)
     A                                      EDTWRD('  /  /  ')
     A            SM08      R        O   135
     A            SM09      R        O   139
     A            SM10      R        O   143
     A            SM11      R        O   147
     A            SM12      R        O   151
     A            SM13      R        O   155
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PD2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A            PSD03     R        O    67
     A                                      REFFLD(SD0/SD03 *LIBL/SOSDPF)
     A            MA03      R        O    76
     A                                      REFFLD(MA0/MA03 *LIBL/MTMAPF)
     A            MA13      R        O    94
     A                                      REFFLD(MA0/MA13 *LIBL/MTMAPF)
     A            PSD04     R        O   100
     A                                      REFFLD(SD0/SD04 *LIBL/SOSDPF)
     A                                      EDTCDE(J)
     A            PSD06     R        O   107
     A                                      REFFLD(SD0/SD06 *LIBL/SOSDPF)
     A                                      EDTCDE(3)
     A            PSD07     R        O   117
     A                                      REFFLD(SD0/SD07 *LIBL/SOSDPF)
     A                                      EDTCDE(3)
     A            PSD05     R        O   129
     A                                      REFFLD(SD0/SD05 *LIBL/SOSDPF)
     A                                      EDTCDE(3)
     A            PSD17     R        O   135
     A                                      REFFLD(SD0/SD17 *LIBL/SOSDPF)
     A            PSD18     R        O   147
     A                                      REFFLD(SD0/SD18 *LIBL/SOSDPF)
     A*%%***********************************************************************
     A*%%SS
     A*%%SN PSD04      99999
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ================'
     A                                     2
     A                                      '***續下頁***'
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ================'
     A                                     2
     A                                      '<<SOR045>>--->報表結束'
     A                                      SPACEB(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------------'
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE9
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                     3
     A                                      'もも此範圍無資料もも'
     A*%%***********************************************************************
     A*%%SS
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(REPLIB/SOR045P)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(66       200      *N     )
     A*%%***********************************************************************
