     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR041P                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/02/10                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR042                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :產品客戶報價表                            *
     A*===============================================================
     A* MODI CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*  M001     | MICH   | 000824 | DETAIL MODIFY
     A****************************************************************
     A                                      REF(*LIBL/SOSBPF)
     A          R PH1                       SKIPB(2)
     A                                    40MSGCON(030 URE9999 REMF)
     A                                    87'日期:'
     A            $EGMDY         6  0O    95EDTCDE(Y)
     A                                   104'頁次:'
     A                                   112PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                    46'客戶產品報價表'
     A                                    87'時間:'
     A                                    95TIME
     A                                      SPACEA(1)
     A                                   106'<SOR041>'
     A                                    87' USER :'
     A            $USER         10A  O    95
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DMD01S    R             13REFFLD(SB01)
     A                                    20'-'
     A            DMD01E    R             23REFFLD(SB01)
     A                                    31'通路:'
     A            DMD07S    R             43REFFLD(MD07 RERF)
     A                                    48'-'
     A            DMD07E    R             53REFFLD(MD07 RERF)
     A                                    61'型態:'
     A            DMD08S    R             73REFFLD(MD08 RERF)
     A                                    78'-'
     A            DMD08E    R             83REFFLD(MD08 RERF)
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSA01S    R             13REFFLD(SB02)
     A                                    24'-'
     A            DSA01E    R             26REFFLD(SB02)
     A                                    61'生效日期:'
     A            DATE           6S 0     73EDTWRD('  /  /  ')
     A                                      SPACEA(2)
     A                                     1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      SPACEA(1)
     A                                    51'正常折扣'
     A                                    70'特別折扣'
     A                                    95'搭　贈'
     A                                      SPACEA(1)
     A                                    49'----------------'
     A                                    68'----------------'
     A                                    85'---------------------------'
     A                                      SPACEA(1)
     A                                     1'產品'
     A                                    12'簡稱'
     A                                    40'牌價'
     A                                    49'折扣率　折扣價'
     A                                    68'折扣率　折扣價'
     A                                    85'比率１'
     A                                    95'比率２'
     A                                   105'比率３'
     A                                   114'生效日　　截止日'
     A                                      SPACEA(1)
     A                                     1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PH2
     A                                    41'客戶代號:'
     A            SB01      R             53
     A            ME04      R             63REFFLD(ME04 *LIBL/RERF)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1
     A            SB02      R              2
     A            MA03      R             12REFFLD(MA03 RERF)
     A            PRICE          7  0     37EDTCDE(J)
     A            SB06N          4S 2     48EDTCDE(1)
     A                                    53'%'
     A            SB06N$         7  0     55EDTCDE(J)
     A            SB06S          4S 2     67EDTCDE(1)
     A                                    72'%'
     A            SB06S$         7  0     74EDTCDE(J)
     A            SB07      R             85EDTCDE(Z)
     A                                    88'/'
     A            SB08      R             89EDTCDE(Z)
     A            SB09      R             95EDTCDE(Z)
     A                                    98'/'
     A            SB10      R             99EDTCDE(Z)
     A            SB11      R            105EDTCDE(Z)
     A                                   108'/'
     A            SB12      R            109EDTCDE(Z)
M001DA*           SB05P     R            114REFFLD(SB05 RERF)
M001AA            SB05P          6  0    114
     A                                      EDTWRD('  /  /  ')
M001DA*           SB13P     R            124REFFLD(SB13 RERF)
M001AA            SB13P          6  0    124
     A                                      EDTWRD('  /  /  ')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==================================+
     A                                      ===================================+
     A                                      ===================================+
     A                                      ==========================='
     A                                      SPACEA(1)
     A                                     1'　製表人:___________'
     A                                    23'通路主管:___________'
     A                                    45'地區主管:___________'
     A                                    67'產品主管:___________'
M001MA*                                   89'副總經理:___________'
M001MA*                                  112'電腦室:___________'
M001MA                                    89'總經理:___________'
M001MA                                   110'電腦室:_____________'
     A                                      SPACEA(1)
     A                                     1'==================================+
     A                                      ===================================+
     A                                      ===================================+
     A                                      ==========================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==================================+
     A                                      ===================================+
     A                                      ===================================+
     A                                      ==========================='
     A                                      SPACEA(1)
     A                                     1'　製表人:___________'
     A                                    23'通路主管:___________'
     A                                    45'地區主管:___________'
     A                                    67'產品主管:___________'
M001MA*                                   89'副總經理:___________'
M001MA*                                  112'電腦室:___________'
M001MA                                    89'總經理:___________'
M001MA                                   110'電腦室:_____________'
     A                                      SPACEA(1)
     A                                     1'==================================+
     A                                      ===================================+
     A                                      ===================================+
     A                                      ==========================='
     A                                      SPACEA(1)
     A                                     2'<<SOR041>>--->報表結束'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'==================================+
     A                                      ===================================+
     A                                      ===================================+
     A                                      ==========================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
