     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266      *
     A*                                                              *
     A*    DSPF NAME    : SOR081P                                    *
     A*    AUTHOR       : MERCURY                                    *
     A*    CREATE DATE  : 83/05/25                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR081                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :訂單系統                                  *
     A*    REMARK       :通路產品銷售（退）彙總表                  *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    38MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    39'通路產品銷售（退）彙總表'
     A                                      SPACEA(1)
     A            GROUP         10   O    50
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
M001DA*N20        DSC08S    R             13EDTWRD('  /  /  ')
M001AA N20        DSC08S         6  0     13EDTWRD('  /  /  ')
M001DA*                                     REFFLD(SC39)
M001DA* 20        DSC39S    R             13EDTWRD('  /  /  ')
M001AA  20        DSC39S         6  0     13EDTWRD('  /  /  ')
M001DA*                                     REFFLD(SC39)
     A                                    21'～'
M001DA*N20        DSC08E    R             25EDTWRD('  /  /  ')
M001AA N20        DSC08E         6  0     25EDTWRD('  /  /  ')
M001DA*                                     REFFLD(SC39)
     A                                      SPACEA(1)
M001DA* 20        DSC39E    R             25EDTWRD('  /  /  ')
M001AA  20        DSC39E         6  0     25EDTWRD('  /  /  ')
M001DA*                                     REFFLD(SC39)
     A                                      SPACEA(1)
     A                                     1'公司代號:'
     A            WFA303    R             13REFFLD(WFA303 *LIBL/REWFA3)
     A            #B03      R             +1
     A                                      SPACEA(1)
     A                                     1'通路　　:'
     A            WFA315    R             13REFFLD(WFA315 *LIBL/REWFA3)
     A            #A03      R             16
     A                                      SPACEA(1)
     A                                     1'型態　　:'
     A            DSC34S    R             13REFFLD(SC34)
     A                                    16'-'
     A            DSC34E    R             18REFFLD(SC34)
     A                                      SPACEA(1)
     A                                     1'地區　　:'
     A            DSC31S    R             13REFFLD(SC34)
     A                                    16'-'
     A            DSC31E    R             18REFFLD(SC34)
     A                                      SPACEA(1)
     A                                     1'組別代號:'
     A            DSC28S    R             13REFFLD(SC28)
     A                                    18'-'
     A            DSC28E    R             20REFFLD(SC28)
     A                                    64'日期:'
     A            $EGMDY         6  0O    71EDTCDE(Y)
     A                                    81'頁次:'
     A                                    89PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DSC45S         9        13
     A                                    23'-'
     A            DSC45E         9        25
     A                                    64'時間:'
     A                                    71TIME
     A                                    82'<SOR081>'
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S         9        13
     A                                    23'-'
     A            DSD03E         9        25
     A                                    64' USER :'
     A            $USER         10A  O    71
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     1'產品代號'
     A                                    11'產品簡稱'
     A                                    33'銷售量'
     A                                    47'贈品'
     A                                    59'試飲'
     A                                    69'折扣金額'
     A                                    82'淨銷售金額'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WFA317    R              2REFFLD(WFA317 *LIBL/REWFA3)
     A            MA03      R             12
     A            PSD041         7  0     31EDTCDE(J)
     A            PSD05          7  0     44EDTCDE(J)
     A            PSD042         7  0     55EDTCDE(J)
     A            PTOT           9  0     67EDTCDE(J)
     A            PSD07     R             82EDTCDE(J)
     A                                      REFFLD(SD07)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    10'產品識別小計---->'
     A            PRTOT3         7  0     31EDTCDE(J)
     A            PRTOT4         7  0     44EDTCDE(J)
     A            PRTOT5         7  0     55EDTCDE(J)
     A            PRTOT1         9  0     67EDTCDE(J)
     A            PRTOT2         9  0     82EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD4                       SPACEA(1)
     A                                    12'通路　合計---->'
     A            SLTOT3         7  0     31EDTCDE(J)
     A            SLTOT4         7  0     44EDTCDE(J)
     A            SLTOT5         7  0     55EDTCDE(J)
     A            SLTOT1         9  0     67EDTCDE(J)
     A            SLTOT2         9  0     82EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD5                       SPACEA(1)
     A                                    12'公司　合計---->'
     A            COMPT3         7  0     31EDTCDE(J)
     A            COMPT4         7  0     44EDTCDE(J)
     A            COMPT5         7  0     55EDTCDE(J)
     A            COMPT1         9  0     67EDTCDE(J)
     A            COMPT2         9  0     82EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A                                     2'<<SOR081>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ============='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE4
     A                                     1'                    +
     A                                                           +
     A                                                           +
     A                                                           +
     A                                                     '
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE9
     A                                     3'もも此範圍無資料もも'
     A                                      SPACEA(1)
