     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR046DP                                   *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/02/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR046                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :核准簽章明細表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    85MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    91'核准簽章明細表'
     A                                      SPACEA(1)
     A  20                                94'(非普銷)'
     A N20                                94'(普　銷)'
     A                                   110' '
     A                                      SPACEA(1)
     A                                    95'(搭贈)'
     A                                      SPACEA(1)
     A                                     1'地　　區:'
     A                                      SPACEB(2)
     A            DSC33S    R        O    14REFFLD(SC33)
     A                                    17'-'
     A            DSC33E    R        O    19REFFLD(SC33)
     A                                   166'日期:'
     A            $EGMDY         6  0O   174EDTCDE(Y)
     A                                   183'頁次:'
     A                                   191PAGNBR EDTCDE(Z)
     A                                     1'通　　路:'
     A                                      SPACEB(1)
     A            DSC31S    R        O    14REFFLD(SC31)
     A                                    17'-'
     A            DSC31E    R        O    19REFFLD(SC31)
     A                                   166'時間:'
     A                                   174TIME
     A                                   185'<SOR046D>'
     A                                     1'截止日期:'
     A                                      SPACEB(1)
     A            DSC08T    R        O    14REFFLD(SC08)
     A                                      EDTWRD('  /  /  ')
     A                                   166' USER:'
     A            $USER         10A  O   174
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A                                    59'送　　貨'
     A                                      SPACEB(1)
     A                                   133'正常'
     A                                   139'單　額　逾　搭　試　換'
     A                                     1'客戶代號'
     A                                      SPACEB(1)
     A                                    12'客戶簡稱'
     A                                    29'日　　期'
     A                                    38'單據號碼'
     A                                    51'業務員'
     A                                    69'產品代號'
     A                                    79'產品名稱'
     A                                    95'單位'
     A                                   101'數量'
     A                                   109'單價'
     A                                   121'金額'
     A                                   127'搭贈'
     A                                   133'搭贈'
     A                                   139'價　度　期　贈　飲　貨'
     A                                   163'備註'
     A                                   188'簽核'
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A  30        DSC04     R              2REFFLD(SC04)
     A  30        DSC05     R              8REFFLD(SC05)
     A  30        ME04      R             12
     A  30        DSC08     R             30REFFLD(SC08)
     A                                      EDTWRD('  /  /  ')
     A  30        DSC02     R             39REFFLD(SC02)
     A  30        DSC27     R             52REFFLD(SC27)
     A  30        DMC02         12A       58
     A            DSD03     R             69REFFLD(SD03)
     A            MA03      R             78
     A            MA13      R             95
     A            DSD04     R            101REFFLD(SD04)
     A                                      EDTCDE(J)
     A            DSD06     R            108REFFLD(SD06)
     A                                      EDTCDE(J)
     A            DSD07     R            115REFFLD(SD07)
     A                                      EDTCDE(J)
     A            DSD05     R            127REFFLD(SD05)
     A                                      EDTCDE(J)
     A            DSD09     R            133REFFLD(SD09)
     A                                      EDTCDE(J)
     A*
     A            DSD17     R            141REFFLD(SD17)
     A            DSC23     R            145REFFLD(SC23)
     A            DSC24     R            149REFFLD(SC24)
     A            DSD18     R            153REFFLD(SD18)
     A            DSC26     R            157REFFLD(SC26)
     A            DSE19     R            161REFFLD(SE19)
     A            DSC21     R            163REFFLD(SC21)
     A                                   189'________'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A                                     2'***續下頁***'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A                                     2'<<SOR046D>>--->報表結束'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE9                       SPACEB(1)
     A                                     3'もも此範圍無資料もも'
