     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR043P                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/04/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR043                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :客戶報價單                                *
     A****************************************************************
     A                                      REF(*LIBL/REWF04)
     A          R PH1                       SKIPB(13)
     A  19        ME03      R        O    16REFFLD(ME03 *LIBL/RERF)
     A            $EGMDY         6  0O   103EDTCDE(Y)
     A                                      SPACEA(1)
     A  19        WF0403    R        O    16
     A            PDATE          6  0O   103EDTWRD('  /  /  ')
     A                                      SPACEA(1)
     A  19        ME15      R        O    16REFFLD(ME15 *LIBL/RERF)
     A  19        MC02      R        O    23REFFLD(MC02 *LIBL/RERF)
     A            PPAGE          3  0O   103EDTCDE(Z)
     A                                      SPACEA(5)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF0404    R              6
     A            MA04      R             21REFFLD(MA04 *LIBL/RERF)
     A            MA17      R             61REFFLD(MA17 *LIBL/RERF)
     A            MA13      R             74REFFLD(MA13 *LIBL/RERF)
     A            PWF416    R             88REFFLD(WF0410)
     A                                      EDTCDE(1)
     A N20                                  SPACEA(1)
     A  20        PMA416    R            108REFFLD(MA41 *LIBL/RERF)
     A                                      EDTCDE(1)
     A                                      SPACEA(1)
     A  20        MA05      R             22REFFLD(MA05 *LIBL/RERF)
     A                                      SPACEA(1)
     A            MA03      R             20REFFLD(MA03 *LIBL/RERF)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1                       SKIPB(56)
     A            PRMK1         80   O    11
     A                                      SPACEA(1)
     A            PRMK2         80   O    11
     A                                      SPACEA(1)
     A            PRMK3         80   O    11
