     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : SOR088P                                     *
     A*    AUTHOR       : SAM                                        *
     A*    CREATE DATE  : 82/02/01                                   *
     A*    PROGRAM NAME : IMR088                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       :康齡退貨庫存量檢表                        *
     A****************************************************************
     A                                      REF(REFLIB/RERF)
     A          R PH1                       SKIPB(2)
     A                                    35MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    39'康齡退貨庫存量檢核表'
     A                                    91'<SOR087>'
     A                                      SPACEA(1)
     A                                    84'日期:'
     A            $EGMDY         6  0O    91EDTCDE(Y)
     A                                      SPACEA(1)
     A                                    84'時間:'
     A                                    91TIME
     A                                      SPACEA(1)
     A                                     1'銷退日期：'
     A*           DSG06S    R             13REFFLD(SG06)
     A            DSG06S         6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'-'
     A*           DSG06E    R             24REFFLD(SG06)
     A            DSG06E         6  0     24
     A                                      EDTWRD('  /  /  ')
     A                                    84' USER :'
     A            $USER         10   O    91
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     1'產品名稱'
     A                                    23'物流點'
     A                                    39'退貨單號'
     A                                    64'退貨數量'
     A                                    78'庫存數量'
     A                                    90'不足數量'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A            WF108D         9A        2
     A            WF108B         5A       24
     A            WF108C        12A       40
     A            WF108E         5  0     64EDTCDE(A)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A                                    52'小計----->'
     A            PTEMP2         6  0     64EDTCDE(A)
     A*                                           ('退貨數量合計')
     A            IA06           6  0     75EDTCDE(A)
     A*                                           ('庫存數量')
     A            PTEMP3         6  0     86EDTCDE(N)
     A*                                           ('不足數量')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       =================='
     A                                      SPACEA(1)
     A                                     2'<<SOR087>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
