     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR046CP                                   *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/02/21                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR046                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :核准簽章明細表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    85MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    91'核准簽章明細表'
     A                                      SPACEA(1)
     A  20                                94'(非普銷)'
     A N20                                94'(普　銷)'
     A                                   110' '
     A                                      SPACEA(1)
     A                                    93'(價格修改)'
     A                                      SPACEA(1)
     A                                     1'地　　區:'
     A                                      SPACEB(2)
     A            DSC33S    R        O    14REFFLD(SC33)
     A                                    17'-'
     A            DSC33E    R        O    19REFFLD(SC33)
     A                                   166'日期:'
     A            $EGMDY         6  0O   174EDTCDE(Y)
     A                                   183'頁次:'
     A                                   191PAGNBR EDTCDE(Z)
     A                                     1'通　　路:'
     A                                      SPACEB(1)
     A            DSC31S    R        O    14REFFLD(SC31)
     A                                    17'-'
     A            DSC31E    R        O    19REFFLD(SC31)
     A                                   166'時間:'
     A                                   174TIME
     A                                   185'<SOR046C>'
     A                                     1'截止日期:'
     A                                      SPACEB(1)
     A            DSC08T    R        O    14REFFLD(SC08)
     A                                      EDTWRD('  /  /  ')
     A                                   166' USER:'
     A            $USER         10A  O   174
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A                                    28'送　　貨'
     A                                      SPACEB(1)
     A                                   114'正常'
     A                                   140'單　額　逾　搭　試　換'
     A                                     1'客戶代號'
     A                                      SPACEB(1)
     A                                    12'客戶簡稱'
     A                                    28'日　　期'
     A                                    38'單據號碼'
     A                                    49'業務員'
     A                                    67'產品代號'
     A                                    79'產品名稱'
     A                                    94'單位'
     A                                   100'數量'
     A                                   108'單價'
     A                                   114'單價'
     A                                   128'金額'
     A                                   134'搭贈'
     A                                   140'價　度　期　贈　飲　貨'
     A                                   164'備註'
     A                                   189'簽核'
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A  30        DSC04     R              2REFFLD(SC04)
     A  30        DSC05     R              7REFFLD(SC05)
     A  30        ME04      R             11
     A  30        DSC08     R             29REFFLD(SC08)
     A                                      EDTWRD('  /  /  ')
     A  30        DSC02     R             37REFFLD(SC02)
     A  30        DSC27     R             49REFFLD(SC27)
     A  30        DMC02         12A       55
     A            DSD03     R             67REFFLD(SD03)
     A            MA03      R             76
     A            MA13      R             94
     A            DSD04     R            100REFFLD(SD04)
     A                                      EDTCDE(3)
     A            DSD06     R            106REFFLD(SD06)
     A                                      EDTCDE(3)
     A            DSD08     R            114REFFLD(SD08)
     A                                      EDTCDE(3)
     A            DSD07     R            122REFFLD(SD07)
     A                                      EDTCDE(3)
     A            DSD05     R            136REFFLD(SD05)
     A                                      EDTCDE(3)
     A*
     A            DSD17     R            142REFFLD(SD17)
     A            DSC23     R            146REFFLD(SC23)
     A            DSC24     R            150REFFLD(SC24)
     A            DSD18     R            154REFFLD(SD18)
     A            DSC26     R            158REFFLD(SC26)
     A            DSE19     R            162REFFLD(SE19)
     A  30        DSC21     R            164REFFLD(SC21)
     A  30                               190'_______'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A                                     2'***續下頁***'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A                                     2'<<SOR046C>>--->報表結束'
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==========================')
     A                                      SPACEB(1)
     A*----------------------------------------------------------------
     A          R PE9                       SPACEB(1)
     A                                     3'もも此範圍無資料もも'
