     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR048P                                    *
     A*    AUTHOR       : A1139 JANE                                 *
     A*    CREATE DATE  : 81/02/15                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR048                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :訂單系統                                  *
     A*    REMARK       :預定送貨明細表                            *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    35MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    41'預定送貨明細表'
     A                                      SPACEA(2)
     A                                    68'日期:'
     A            $EGMDY         6  0O    75EDTCDE(Y)
     A                                    85'頁次:'
     A                                    93PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'業務員　:'
     A            WF3108    R             +1REFFLD(SC27)
     A            MC02      R             +0
     A                                    68'時間:'
     A                                    75TIME
     A                                    86'<SOR048>'
     A                                      SPACEA(1)
     A                                     1'送貨日期:'
M001MA*           DSC08S    R             +1REFFLD(SC08)
M001MA            DSC08S         6  0     +1
     A                                      EDTCDE(Y)
     A                                    +1'-'
M001MA*           DSC08E    R             +1REFFLD(SC08)
M001MA            DSC08E         6  0     +1
     A                                      EDTCDE(Y)
     A                                    68' USER :'
     A            $USER         10A  O    75
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     1'送貨日期'
     A                                    11'客戶代號'
     A                                    24'客戶簡稱'
     A                                    43'訂單單號'
     A                                    56'產品代號'
     A                                    66'產品簡稱'
     A                                    86'單位'
     A                                    94'數量'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       -------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  29                                 1' '
     A                                      SPACEA(1)
M001MA*N30        PWF311    R              2REFFLD(SC08)
M001MA N30        PWF311         6  0      2
     A                                      EDTWRD('  /  /  ')
     A N31        WF3103    R             12REFFLD(SC04)
     A N31                                18'-'
     A N31        WF3104    R             20REFFLD(SC05)
     A N31        ME04      R             24REFFLD(ME04)
     A N32        WF3102    R             44REFFLD(SC02)
     A            WF3105    R             57REFFLD(SD03)
     A            MA03      R             66REFFLD(MA03)
     A            MA13      R             86REFFLD(MA13)
     A            QTY1           5  0     93EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    70'日期小計------------>'
     A            T1QTY1         5  0     93EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    68'業務員合計------------>'
     A            T2QTY1         5  0     93EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    70'總　　計------------>'
     A            T3QTY1         5  0     93EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A                                     2'<<SOR048>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ==================='
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
