     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR053P                                    *
     A*    AUTHOR       : A1139 JANE                                 *
     A*    CREATE DATE  : 81/04/25                                   *
     A*    UPDATE DATE  : 82/06/12  TINA                             *
     A*    PROGRAM NAME : SOR053                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :收款明細表                                *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(7)
     A            WF7601    R             13REFFLD(WF760/WF7601 *LIBL/REWF76)
     A            #B03      R             20
     A N20        DSI06          6  0     78EDTWRD('  /  /  ')
     A N20                                86'止'
     A  20        DSI06S         6  0     78EDTWRD('  /  /  ')
     A  20                                88'-'
     A  20        DSI06E         6  0     90EDTWRD('  /  /  ')
     A                                   100' '
     A                                      SPACEA(1)
     A            WF7602    R             13REFFLD(WF760/WF7602 *LIBL/REWF76)
     A            MC02      R             20
     A                                      SPACEA(4)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A  31        WF7603    R              6REFFLD(WF760/WF7603 *LIBL/REWF76)
     A  31                                11'-'
     A  31        WF7604    R             12REFFLD(WF760/WF7604 *LIBL/REWF76)
     A  31        ME04      R             17
     A  31        MD23      R             38
     A  31        DMD23          6        39
     A  30        D7605          6  0     46EDTWRD('  /  /  ')
     A            D7606          6  0     56EDTWRD('  /  /  ')
     A            WF7607    R             66REFFLD(WF760/WF7607 *LIBL/REWF76)
     A            WF7608    R             78REFFLD(WF760/WF7608 *LIBL/REWF76)
     A                                      EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEB(1)
     A                                    56'客戶合計----------->'
     A            TOT1           9  0     78EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======================'
     A                                      SPACEA(1)
     A                                     2'<<SOR053>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9
     A                                     3'もも此範圍無資料もも'
     A                                      SPACEA(1)
