     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有      TEL:5042266    *
     A*                                                              *
     A*    DSPF NAME    : IMR082P                                     *
     A*    AUTHOR       : SAM                                        *
     A*    CREATE DATE  : 82/02/01                                   *
     A*    PROGRAM NAME : IMR0822                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售分析系統                              *
     A*    REMARK       : ROLLING FORECASE                           *
     A****************************************************************
     A                                      REF(REFLIB/RERF)
     A          R PH1                       SKIPB(2)
     A                                    65MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    69'銷退折讓成本餘數表'
     A                                   139'<SOR087>'
     A                                      SPACEA(1)
     A                                   132'日期:'
     A            $EGMDY         6  0O   139EDTCDE(Y)
     A                                      SPACEA(1)
     A                                     1'公　　司：'
     A            DSG01S         2        13
     A                                    16'-'
     A            DSG01E         2        18
     A                                   132'時間:'
     A                                   139TIME
     A                                      SPACEA(1)
     A                                     1'折讓日期：'
M001DA*           DSG26S    R             13REFFLD(SG26)
M001AA            DSG26S         6  0     13
     A                                      EDTWRD('  /  /  ')
     A                                    22'-'
M001DA*           DSG26E    R             24REFFLD(SG26)
M001AA            DSG26E         6  0     24
     A                                      EDTWRD('  /  /  ')
     A                                   132' USER :'
     A            $USER         10   O   139
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======'
     A                                      SPACEA(1)
     A                                     1'單　　號'
     A                                    18'折讓日期'
     A                                    36'產品名稱'
     A                                    85'數量'
     A                                   106'銷退成本'
     A                                   127'計　　算'
     A                                   142'差額'
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1
     A            SG02      R              1
M001DA*           SG26      R             19EDTCDE(Y)
M001AA            DSG26          6  0     19EDTCDE(Y)
     A            SH03      R             37
     A            MA03      R             51
     A            SH06      R             83EDTCDE(O)
     A            SH08      R            100EDTCDE(N)
     A            PS01          13  2    118EDTCDE(N)
     A            PS02           4  2    141EDTCDE(N)
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'差額總計:'
     A            PS03           5  2    140EDTCDE(N)
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ======'
     A                                      SPACEA(1)
     A                                     2'<<SOR087>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
