     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    40MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    46'產品送貨彙總表'
     A                                      SPACEA(2)
     A                                     1'物流點　:'
     A            DSE07     R             13REFFLD(SE07)
     A            #A03      R             +1
     A                                    89'日期:'
     A            $EGMDY         6  0O    97EDTCDE(Y)
     A                                   105'頁次:'
     A                                   112PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            COMP           1A  O    13
     A            COMPA          6A  O    +1
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DSE04S         9   O    13
     A                                    +1'-'
     A            DSE04E         9   O    +1
     A                                    89'時間:'
     A                                    97TIME
     A                                   105'<SOR063>'
     A                                      SPACEA(1)
     A  20                                 1'確認日期:'
M001MA* 20        DSE24S    R             13REFFLD(SE24)
M001MA  20        DSE24S         6  0     13
     A                                      EDTWRD('  /  /  ')
     A  20                                21'-'
M001MA* 20        DSE24E    R             22REFFLD(SE24)
M001MA  20        DSE24E         6  0     22
     A                                      EDTWRD('  /  /  ')
     A N20                                 1'送貨日期:'
M001MA*N20        DSE06S    R             13REFFLD(SE24)
M001MA N20        DSE06S         6  0     13
     A                                      EDTWRD('  /  /  ')
     A N20                                21'-'
M001MA*N20        DSE06E    R             22REFFLD(SE24)
M001MA N20        DSE06E         6  0     22
     A                                      EDTWRD('  /  /  ')
     A                                    90' USER :'
     A            $USER         10        +1
     A                                      SPACEA(1)
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     1'產品代號／名稱'
     A                                    30'單別'
     A                                    60'訂購'
     A                                    71'搭贈'
     A                                    82'試飲'
     A                                    93'寄賣'
     A                                   104'合計'
     A                                   110'確認否'
     A                                      SPACEA(1)
     A                                     1'--------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------+
     A                                       --------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  21                                 1' '
     A                                      SPACEA(1)
     A            WF3902    R              2REFFLD(WF3902 *LIBL/REWF39)
     A            MA03      R             +0
     A            WF3903    R             31REFFLD(WF3903 *LIBL/REWF39)
     A            #203      R             33
     A            WF3904    R             56REFFLD(WF3904 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            WF3905    R             67REFFLD(WF3905 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            WF3906    R             78REFFLD(WF3906 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            WF3907    R             89REFFLD(WF3907 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            PTOT      R            100REFFLD(WF3907 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            MARK           8O      110
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    20'產品小計----------------------->'
     A            T13904    R             56REFFLD(WF3904 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            T13905    R             67REFFLD(WF3905 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            T13906    R             78REFFLD(WF3906 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            T13907    R             89REFFLD(WF3907 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            T1TOT     R            100REFFLD(WF3907 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    14'未確認產品小計+
     A                                      ----------------------->'
     A            T23904    R             56REFFLD(WF3904 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            T23905    R             67REFFLD(WF3905 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            T23906    R             78REFFLD(WF3906 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            T23907    R             89REFFLD(WF3907 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A            T2TOT     R            100REFFLD(WF3907 *LIBL/REWF39)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ====================+
     A                                       ===================='
     A                                      SPACEA(1)
     A                                     2'<<SOR063>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
