     A*%%***********************************************************************
     A*%%TS  RD  20021004  133447  REPGMR      REL-V4R4M0  5769-PW1
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR042BP                                   *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/02/10                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR042B                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :產品客戶報價表                            *
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
     A                                    55
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
     A                                    61
     A                                      '客戶報價到期表'
     A                                      SPACEA(001)
     A                                     1
     A                                      '通路'
     A            DSB01S         1   O    +1
     A                                    +1
     A                                      '-'
     A            DSB01E         1   O    +1
     A                                      SPACEA(001)
     A                                     1
     A                                      '型態'
     A            DMD08S         2   O    +1
     A                                    +1
     A                                      '-'
     A            DMD08E         2   O    +1
     A                                      SPACEA(001)
     A                                     1
     A                                      '地區'
     A            DME07S         2   O    +1
     A                                    +1
     A                                      '-'
     A            DME07E         2   O    +1
     A                                   107
     A                                      '日期:'
     A            $EGMDY         6  0O   115
     A                                      EDTCDE(Y)
     A                                   124
     A                                      '頁次:'
     A                                   132
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號'
     A            DSB02S         9   O    +1
     A                                    +1
     A                                      '-'
     A            DSB02E         9   O    +1
     A                                   107
     A                                      '時間:'
     A                                   115
     A                                      TIME
     A                                   126
     A                                      '<SOR42B>'
     A                                      SPACEA(001)
     A                                     1
     A                                      '截止日期'
     A            DDATE          6  0O    +1
     A                                      EDTWRD('  /  /  ')
     A                                   107
     A                                      ' USER :'
     A            $USER         10A  O   115
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ================================='
     A                                      SPACEA(001)
     A                                     1
     A                                      '客戶／簡稱'
     A                                    31
     A                                      '產品代號／簡稱'
     A                                    60
     A                                      '生效日期'
     A                                    71
     A                                      '截止日期'
     A                                    81
     A                                      '折扣別'
     A                                    90
     A                                      '折扣率'
     A                                    99
     A                                      '比率１'
     A                                   108
     A                                      '比率２'
     A                                   117
     A                                      '比率３'
     A                                   126
     A                                      '型態'
     A                                   132
     A                                      '地區'
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------------------------'
     A                                      SPACEA(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PD1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A  20                                 1
     A                                      '  '
     A  20                                  SPACEA(001)
     A  20        SB01      R              2
     A                                      SPACEB(002)
     A  20        ME04      R              7
     A                                      REFFLD(ME04 *LIBL/RERF)
     A  21        SB02      R             26
     A N21                                26
     A                                      ' " '
     A  21        DMA03         25        35
     A N21                                35
     A                                      '  "'
M001DA*           SB05      R             61
     A            DSB05          6  0     61
     A                                      EDTWRD('  /  /  ')
M001DA*           SB13      R             72
     A            DSB13          6  0     72
     A                                      EDTWRD('  /  /  ')
     A            DSB04          6        82
     A            DSB06          6S 4O    88
     A                                      EDTCDE(J)
     A                                    96
     A                                      '%'
     A*                                     EDTWRD('  . 0%')
     A            SB07      R             99
     A                                      EDTCDE(Z)
     A                                   102
     A                                      '/'
     A            SB08      R            103
     A                                      EDTCDE(Z)
     A            SB09      R            108
     A                                      EDTCDE(Z)
     A                                   111
     A                                      '/'
     A            SB10      R            112
     A                                      EDTCDE(Z)
     A            SB11      R            117
     A                                      EDTCDE(Z)
     A                                   120
     A                                      '/'
     A            SB12      R            122
     A                                      EDTCDE(Z)
     A            MD08      R            128
     A            ME07      R            134
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ================================='
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ================================='
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<SOR42B>>--->報表結束'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ================================='
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CP+999CRTPRTF
     A*%%CP+    IGCDTA(*YES)
     A*%%CP+    FILE(REPLIB/SOR042BP)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       198      *N     )
     A*%%***********************************************************************
