     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR042P                                    *
     A*    AUTHOR       : A1087  JOYCE                               *
     A*    CREATE DATE  : 81/02/10                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR042                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :銷售訂單系統                              *
     A*    REMARK       :產品客戶報價表                            *
     A*===============================================================
     A* MODI CODE | AUTHOR |  DATE  | DESCRIPTION
     A*---------------------------------------------------------------
     A*  M001     | MICH   | 000824 | DETAIL MODIFY
     A*---------------------------------------------------------------
     A****************************************************************
     A                                      REF(*LIBL/SOSAPF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    53
     A                                      MSGCON(030 URE9999 REMF)
     A                                   113
     A                                      '日期:'
     A            $EGMDY         6  0O   121
     A                                      EDTCDE(Y)
     A                                   130
     A                                      '頁次:'
     A                                   138
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                    59
     A                                      '產品通路報價表'
     A                                   113
     A                                      '時間:'
     A                                   121
     A                                      TIME
     A                                      SPACEA(001)
     A                                   132
     A                                      '<SOR042>'
     A                                   113
     A                                      ' USER :'
     A            $USER         10A  O   121
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號:'
     A            DMA01S    R             13
     A                                      REFFLD(SA01)
     A                                    24
     A                                      '-'
     A            DMA01E    R             26
     A                                      REFFLD(SA01)
     A                                    41
     A                                      '生效日期:'
     A            DATE           6S 0     53
     A                                      EDTWRD('  /  /  ')
     A                                      SPACEA(001)
     A                                     1
     A                                      '通路:'
     A            DMD07S         1A       13
     A                                    24
     A                                      '-'
     A            DMD07E         1A       26
     A                                    31
     A                                      '型態:'
     A            DMD08S         2A       43
     A                                    54
     A                                      '-'
     A            DMD08E         2A       56
     A                                      SPACEA(002)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------'
     A
     A                                      SPACEA(001)
     A                                    51
     A                                      '正常折扣'
     A                                    76
     A                                      '特別折扣'
     A                                   105
     A                                      '搭　贈'
     A                                      SPACEA(001)
     A                                    49
     A                                      '----------------'
     A                                    73
     A                                      '----------------'
     A                                    95
     A                                      '---------------------------'
     A                                      SPACEA(001)
     A                                     1
     A                                      '通路'
     A                                    16
     A                                      '形態'
     A                                    40
     A                                      '牌價'
     A                                    49
     A                                      '折扣率　折扣價'
     A                                    73
     A                                      '折扣率　折扣價'
     A                                    95
     A                                      '比率１'
     A                                   105
     A                                      '比率２'
     A                                   115
     A                                      '比率３'
     A                                   124
     A                                      '生效日　　截止日'
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ---------------'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PH2
     A                                    41
     A                                      '產品代號:'
     A            SA01      R        O    53
     A            MA03      R        O    63
     A                                      REFFLD(MA03 *LIBL/RERF)
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A*                                     SPACEA(001)
     A            SA02      R              2
     A            PSA02         12O        4
     A            SA03      R             17
     A            PSA03         16O       20
     A            PRICE          7  0     36
     A                                      EDTCDE(J)
     A            SA06N          6S 4     46
     A                                      EDTCDE(1)
     A                                    53
     A                                      '%'
     A            SA06N$         9  2     55
     A                                      EDTCDE(J)
     A            SA06S          6S 4     70
     A                                      EDTCDE(1)
     A                                    77
     A                                      '%'
     A            SA06S$         9  2     79
     A                                      EDTCDE(J)
     A            SA07      R             95
     A                                      EDTCDE(Z)
     A                                    98
     A                                      '/'
     A            SA08      R             99
     A                                      EDTCDE(Z)
     A            SA09      R            105
     A                                      EDTCDE(Z)
     A                                   108
     A                                      '/'
     A            SA10      R            109
     A                                      EDTCDE(Z)
     A            SA11      R            115
     A                                      EDTCDE(Z)
     A                                   118
     A                                      '/'
     A            SA12      R            119
     A                                      EDTCDE(Z)
M001DA*           SA05P     R            124REFFLD(SA05 RERF)
     A            SA05P          6  0    124
     A                                      EDTWRD('  /  /  ')
M001DA*           SA13P     R            134REFFLD(SA13 RERF)
     A            SA13P          6  0    134
     A                                      EDTWRD('  /  /  ')
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A                                     1
     A                                      '　製表人:___________'
     A                                    23
     A                                      '通路主管:___________'
     A                                    45
     A                                      '地區主管:___________'
     A                                    67
     A                                      '產品主管:___________'
     A                                    89
     A                                      '總經理:___________'
     A                                   110
     A                                      '電腦室:_____________'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
                                            ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A                                     1
     A                                      '　製表人:___________'
     A                                    23
     A                                      '通路主管:___________'
     A                                    45
     A                                      '地區主管:___________'
     A                                    67
     A                                      '產品主管:___________'
M001MA*                                   89'副總經理:___________'
M001MA*                                  112'電腦室:___________'
     A                                    89
     A                                      '總經理:___________'
     A                                   110
     A                                      '電腦室:_____________'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
                                            ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<SOR042>>--->報表結束'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE3
     A*%%***********************************************************************
     A*%%RI 00000 
     A*%%***********************************************************************
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
                                            ===================================-
     A                                      ==============='
     A                                      SPACEA(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*----------------------------------------------------------------
     A          R PE9
     A*%%***********************************************************************
     A*%%RI 00000 
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      'もも此範圍無資料もも'
