     /*=============================================================*/
     /* CODE   AUTHOR.     DATE    DESCRIPTION                   */
     /*-------------------------------------------------------------*/
     /* M001  MICHELLE   98.12.18  Y2K MODIFY                    */
     /*=============================================================*/
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    47MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    53'銷貨退回明細表'
     A                                      SPACEA(1)
     A            DSELC          8O  O    57
     A                                      SPACEA(2)
     A                                     1'公司　　:'
     A            SG01      R        O    +1
     A            #B03      R        O    +1
     A                                      SPACEA(1)
     A                                     1'退貨日期:'
M001MA*           DSG06S    R        O    +1REFFLD(SG26)
M001MA            DSG06S         6  0O    +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'～'
M001MA*           DSG06E    R        O    +0REFFLD(SG26)
M001MA            DSG06E         6  0O    +0
     A                                      EDTWRD('  /  /  ')
     A                                      SPACEA(1)
     A                                     1'折讓日期:'
M001MA*           DSG26S    R        O    +1REFFLD(SG26)
M001MA            DSG26S         6  0O    +1
     A                                      EDTWRD('  /  /  ')
     A                                    +1'～'
M001MA*           DSG26E    R        O    +0REFFLD(SG26)
M001MA            DSG26E         6  0O    +0
     A                                      EDTWRD('  /  /  ')
     A                                    87'日期:'
     A            $EGMDY         6  0O    95EDTCDE(Y)
     A                                   104'頁次:'
     A                                   112PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
M001MA*           DSN03S         5   O    +1
M001MA            DSG45S         9A       +1
     A                                    +1'～'
M001MA*           DSN03E         5   O    +0
M001MA            DSG45E         9A       +0
     A                                    87'時間:'
     A                                    95TIME
     A                                   106'<SOR061>'
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSH03S         9   O    +1
     A                                    +1'～'
     A            DSH03E         9   O    +0
     A                                    87' USER :'
     A            $USER         10        97
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      =================')
     A                                      SPACEA(1)
     A                                     1'退貨日期'
     A                                    11'退貨單碼'
     A                                    25'折讓單號'
     A                                    38'客戶代號／簡稱'
     A                                    86'－－已分配－－'
     A                                   108'折讓日期'
     A                                      SPACEA(1)
     A                                    25'產品代號／簡稱'
     A                                    56'訂購'
     A                                    66'搭贈'
     A                                    76'試飲'
     A                                    86'訂購'
     A                                    96'搭贈'
     A                                   108'銷退金額'
     A                                      SPACEA(1)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      -----------------')
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
M001MA N30        PSG06          6  0      2
     A                                      EDTWRD('  /  /  ')
     A*M001D                                REFFLD(SG06)
     A            SG02      R             12
     A            SG09      R             26
     A            SG04      R             39
     A                                    44'-'
     A            SG05      R             45
     A            ME04      R             49
M001MA            PSG26          6  0    109EDTWRD('  /  /  ')
     A*M001D                                REFFLD(SG26)
     A*----------------------------------------------------------------
     A          R PD2                       SPACEA(1)
     A            SH03      R             26
     A            MA03      R             35
     A            SH04A     R             55EDTCDE(J)
     A                                      REFFLD(SH04)
     A            SH05      R             66EDTCDE(J)
     A            SH04B     R             75EDTCDE(J)
     A                                      REFFLD(SH04)
     A            SH12      R             85EDTCDE(J)
     A            SH13      R             96EDTCDE(J)
     A            SH07      R            106EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    23'も退貨單小計も-------------->'
     A            SH04AS    R             55EDTCDE(J)
     A                                      REFFLD(SH04)
     A            SH05S     R             66EDTCDE(J)
     A                                      REFFLD(SH05)
     A            SH04BS    R             75EDTCDE(J)
     A                                      REFFLD(SH04)
     A            SH12S     R             85EDTCDE(J)
     A                                      REFFLD(SH12)
     A            SH13S     R             96EDTCDE(J)
     A                                      REFFLD(SH13)
     A            SH07S     R            106EDTCDE(J)
     A                                      REFFLD(SH07)
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    21'もも日期小計もも-------------->'
     A            SH04AD    R             55EDTCDE(J)
     A                                      REFFLD(SH04)
     A            SH05D     R             66EDTCDE(J)
     A                                      REFFLD(SH05)
     A            SH04BD    R             75EDTCDE(J)
     A                                      REFFLD(SH04)
     A            SH12D     R             85EDTCDE(J)
     A                                      REFFLD(SH12)
     A            SH13D     R             96EDTCDE(J)
     A                                      REFFLD(SH13)
     A            SH07D     R            106EDTCDE(J)
     A                                      REFFLD(SH07)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    21'もも公司合計もも-------------->'
     A            SH04AC    R             55EDTCDE(J)
     A                                      REFFLD(SH04)
     A            SH05C     R             66EDTCDE(J)
     A                                      REFFLD(SH05)
     A            SH04BC    R             75EDTCDE(J)
     A                                      REFFLD(SH04)
     A            SH12C     R             85EDTCDE(J)
     A                                      REFFLD(SH12)
     A            SH13C     R             96EDTCDE(J)
     A                                      REFFLD(SH13)
     A            SH07C     R            106EDTCDE(J)
     A                                      REFFLD(SH07)
     A*----------------------------------------------------------------
     A          R PE1                       SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      =================')
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEA(1)
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      =================')
     A                                      SPACEA(1)
     A                                     2'<<SOR061>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
