     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR069P                                    *
     A*    AUTHOR       : TINA                                       *
     A*    CREATE DATE  : 83/06/22                                   *
     A*    UPDATE DATE  : 82/06/12  TINA                             *
     A*    PROGRAM NAME : SOR069                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :應收系統                                  *
     A*    REMARK       :業務員領單登記表                          *
     A****************************************************************
     A                                      REF(RERF)
     A          R PH1                       SKIPB(2)
     A                                    46MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    51'業務員領單登記表'
     A                                      SPACEA(1)
     A                                     1'公　司:'
     A            WFB301    R             12REFFLD(WFB30/WFB301 *LIBL/REWFB3)
     A            #B03      R             +1
     A                                    93'日期:'
     A            $EGMDY         6  0O   101EDTCDE(Y)
     A                                   110'頁次:'
     A                                   117PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'業務員:'
     A            WFB302    R             12REFFLD(WFB30/WFB302 *LIBL/REWFB3)
     A            MC02      R             20
     A                                    93'時間:'
     A                                   101TIME
     A                                      SPACEA(1)
     A                                     1'選　項:'
     A            DSEL           1A       12
     A N20                                14'最新業務員'
     A  20                                14'交易業務員'
     A                                    93' USER :'
     A            $USER         10   O   101
     A                                   111'<SOR069>'
     A                                      SPACEA(1)
     A                                     1'==============================-
     A                                      ==============================-
     A                                      ==============================-
     A                                      =============================='
     A                                      SPACEA(1)
     A                                     1'|'
     A                                     2'領單日期'
     A                                    12'|'
     A                                    17'客戶名稱'
     A                                    40'|'
     A                                    41'出貨月份'
     A                                    51'|'
     A                                    53'出貨總筆數'
     A                                    66'|'
     A                                    70'金　額'
     A                                    83'|'
     A                                    85'簽　收'
     A                                    96'|'
     A                                   104'備　註'
     A                                   120'|'
     A                                      SPACEA(1)
     A                                     1'|'
     A                                    +0'=========='
     A                                    12'+'
     A                                    +0'==========================='
     A                                    40'+'
     A                                    +0'=========='
     A                                    51'+'
     A                                    +0'=============='
     A                                    66'+'
     A                                    +0'================'
     A                                    83'+'
     A                                    +0'============'
     A                                    96'+'
     A                                    +0'======================='
     A                                   120'|'
     A*----------------------------------------------------------------
     A          R PD1                       SPACEB(1)
     A                                     1'|'
     A                                    12'|'
     A  30        WFB303    R             13REFFLD(WFB30/WFB303 *LIBL/REWFB3)
     A  30        ME04      R             19
     A                                    40'|'
M001MA* 31        MMYY      R             42REFFLD(WFB30/WFB304 *LIBL/REWFB3)
M001MA  31        MMYY           4  0     42
     A                                      EDTWRD('  /  ')
     A                                    51'|'
     A            WFB305    R             56REFFLD(WFB30/WFB305 *LIBL/REWFB3)
     A                                      EDTCDE(1)
     A                                    66'|'
     A            WFB306    R             68REFFLD(WFB30/WFB306 *LIBL/REWFB3)
     A                                      EDTCDE(1)
     A                                    83'|'
     A                                    96'|'
     A                                   120'|'
     A                                      SPACEA(1)
     A                                     1'|'
     A                                    +0'----------'
     A                                    12'+'
     A                                    +0'---------------------------'
     A                                    40'+'
     A                                    +0'----------'
     A                                    51'+'
     A                                    +0'--------------'
     A                                    66'+'
     A                                    +0'----------------'
     A                                    83'+'
     A                                    +0'------------'
     A                                    96'+'
     A                                    +0'-----------------------'
     A                                   120'|'
     A*----------------------------------------------------------------
     A          R PE1                       SPACEB(1)
     A                                     1'==============================-
     A                                      ==============================-
     A                                      ==============================-
     A                                      =============================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2                       SPACEB(1)
     A                                     1'==============================-
     A                                      ==============================-
     A                                      ==============================-
     A                                      =============================='
     A                                      SPACEA(1)
     A                                     2'<<SOR069>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEB(1)
     A                                     3'もも此範圍無資料もも'
