     A*===============================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE FOR Y2K
     F*----------------------------------------------------------------
     F*  M002     | 99.11.08 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     F*  M003     | 00.11.08 |增加大區域選項
     F*================================================================
     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    84
     A                                      MSGCON(030 URE9999 REMF)
     A                                      SPACEA(001)
     A                                    88
     A                                      '品牌銷售彙總表'
     A                                      SPACEA(001)
     A            GROUP         10   O    95
     A                                      SPACEA(001)
     A                                     1
     A                                      '辦事處　:'
     A            COMP           1A  O    +1
     A            COMPC          6O  O    +1
     A                                    25
     A                                      '業務人員:'
     A            DSC27S    R        O    37
     A                                      REFFLD(MC02)
     A                                      SPACEA(001)
     A                                     1
     A                                      '產品代號:'
     A            DSD03S         2A  O    15
     A                                    +1
     A                                      '-'
     A            DSD03E         2A  O    +1
     A                                    +1
     A                                      '通　　路:'
     A            DSC33S    R        O    +1
     A                                      REFFLD(SC33)
     A                                    +1
     A                                      '-'
     A            DSC33E    R        O    +1
     A                                      REFFLD(SC33)
     A                                      SPACEA(001)
     A                                     1
     A                                      '客戶代號:'
     A            DSC45S         9   O    13
     A                                    23
     A                                      '-'
     A            DSC45E         9   O    25
     A                                      SPACEA(001)
     A                                     1
     A                                      '客戶名稱:'
     A            DSC46S        18O  O    13
     A                                    50'"A"銷售瓶數 "B"搭贈瓶數'
     A                                      COLOR(BLU)
     A                                    +0'"C"銷退瓶數 "D"銷退金額'
     A                                      COLOR(BLU)
     A                                   167
     A                                      '日期:'
     A            $EGMDY         6  0O   175
     A                                      EDTCDE(Y)
     A                                   184
     A                                      '頁次:'
     A                                   193
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A N20                                 1
     A                                      '送貨日期:'
     A                                    50'"E"銷售箱數 "F"搭贈箱數'
     A                                      COLOR(BLU)
     A                                    +0'"G"銷售金額'
     A                                      COLOR(BLU)
     A  20                                 1
     A                                      '確認日期:'
M001MA*N20        DSC08S    R        O    13REFFLD(SC39)
     A N20        DSC08S         6  0O    13
     A                                      EDTWRD('  /  /  ')
M001MA* 20        DSC39S    R        O    13REFFLD(SC39)
     A  20        DSC39S         6  0O    13
     A                                      EDTWRD('  /  /  ')
     A                                    21
     A                                      '-'
M001MA*N20        DSC08E    R        O    22REFFLD(SC39)
     A N20        DSC08E         6  0O    22
     A                                      EDTWRD('  /  /  ')
M001MA* 20        DSC39E    R        O    22REFFLD(SC39)
     A  20        DSC39E         6  0O    22
     A                                      EDTWRD('  /  /  ')
     A                                   167
     A                                      '時間:'
     A                                   175
     A                                      TIME
     A                                      SPACEA(001)
     A                                     1
     A                                      '分析方式:'
     A            DSEL2          1A       +1
     A N22                                20
     A                                      '禮盒不拆'
     A  22                                20
     A                                      '禮盒拆單瓶'
     A                                   168
     A                                      'USER :'
     A            $USER         10   O   175
     A                                   186
     A                                      '<SOR165>'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(001)
     A                                     1
     A                                      '日期'
     A            DAY1           4S 0O    30
     A                                      EDTWRD('  /  ')
     A            DAY2           4S 0O    64
     A                                      EDTWRD('  /  ')
     A            DAY3           4S 0O    98
     A                                      EDTWRD('  /  ')
     A            DAY4           4S 0O   132
     A                                      EDTWRD('  /  ')
     A            DAY5           4S 0O   166
     A                                      EDTWRD('  /  ')
     A                                      SPACEA(001)
     A                                     1
     A                                      '客戶／品牌'
     A                                    30
     A                                      'A'
     A                                    34
     A                                      'B'
     A                                    38
     A                                      'C'
     A                                    45
     A                                      'D'
     A                                    49
     A                                      'E'
     A                                    53
     A                                      'F'
     A                                    60
     A                                      'G'
     A*
     A                                    64
     A                                      'A'
     A                                    68
     A                                      'B'
     A                                    72
     A                                      'C'
     A                                    79
     A                                      'D'
     A                                    83
     A                                      'E'
     A                                    87
     A                                      'F'
     A                                    94
     A                                      'G'
     A*
     A                                    98
     A                                      'A'
     A                                   102
     A                                      'B'
     A                                   106
     A                                      'C'
     A                                   113
     A                                      'D'
     A                                   117
     A                                      'E'
     A                                   121
     A                                      'F'
     A                                   128
     A                                      'G'
     A*
     A                                   132
     A                                      'A'
     A                                   136
     A                                      'B'
     A                                   140
     A                                      'C'
     A                                   147
     A                                      'D'
     A                                   151
     A                                      'E'
     A                                   155
     A                                      'F'
     A                                   162
     A                                      'G'
     A*
     A                                   166
     A                                      'A'
     A                                   170
     A                                      'B'
     A                                   174
     A                                      'C'
     A                                   181
     A                                      'D'
     A                                   185
     A                                      'E'
     A                                   189
     A                                      'F'
     A                                   196
     A                                      'G'
     A*
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A*客戶
     A  31        WF02           5A  O     1
     A*客戶
     A  31        WF02N         18O  O     6
     A*品牌
     A            WF01           2A  O    24
     A            WX01           4  0O    27EDTCDE(3)
     A            WX02           4  0O    31EDTCDE(3)
     A            WX03           4  0O    35EDTCDE(3)
     A            WX04           7  0O    39EDTCDE(3)
     A            WX05           4  0O    46EDTCDE(3)
     A            WX06           4  0O    50EDTCDE(3)
     A            WX07           7  0O    54EDTCDE(3)
     A            WX08           4  0O    61EDTCDE(3)
     A            WX09           4  0O    65EDTCDE(3)
     A            WX10           4  0O    69EDTCDE(3)
     A            WX11           7  0O    73EDTCDE(3)
     A            WX12           4  0O    80EDTCDE(3)
     A            WX13           4  0O    84EDTCDE(3)
     A            WX14           7  0O    88EDTCDE(3)
     A            WX15           4  0O    95EDTCDE(3)
     A            WX16           4  0O    99EDTCDE(3)
     A            WX17           4  0O   103EDTCDE(3)
     A            WX18           7  0O   107EDTCDE(3)
     A            WX19           4  0O   114EDTCDE(3)
     A            WX20           4  0O   118EDTCDE(3)
     A            WX21           7  0O   122EDTCDE(3)
     A            WX22           4  0O   129EDTCDE(3)
     A            WX23           4  0O   133EDTCDE(3)
     A            WX24           4  0O   137EDTCDE(3)
     A            WX25           7  0O   141EDTCDE(3)
     A            WX26           4  0O   148EDTCDE(3)
     A            WX27           4  0O   152EDTCDE(3)
     A            WX28           7  0O   156EDTCDE(3)
     A            WX29           4  0O   163EDTCDE(3)
     A            WX30           4  0O   167EDTCDE(3)
     A            WX31           4  0O   171EDTCDE(3)
     A            WX32           7  0O   175EDTCDE(3)
     A            WX33           4  0O   182EDTCDE(3)
     A            WX34           4  0O   186EDTCDE(3)
     A            WX35           7  0O   190EDTCDE(3)
     A*----------------------------------------------------------------
     A          R PT1
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------'
     A                                      SPACEA(001)
     A                                     1
     A                                      '客戶小計------------>'
     A            WX01S          4  0O    27EDTCDE(3)
     A            WX02S          4  0O    31EDTCDE(3)
     A            WX03S          4  0O    35EDTCDE(3)
     A            WX04S          7  0O    39EDTCDE(3)
     A            WX05S          4  0O    46EDTCDE(3)
     A            WX06S          4  0O    50EDTCDE(3)
     A            WX07S          7  0O    54EDTCDE(3)
     A            WX08S          4  0O    61EDTCDE(3)
     A            WX09S          4  0O    65EDTCDE(3)
     A            WX10S          4  0O    69EDTCDE(3)
     A            WX11S          7  0O    73EDTCDE(3)
     A            WX12S          4  0O    80EDTCDE(3)
     A            WX13S          4  0O    84EDTCDE(3)
     A            WX14S          7  0O    88EDTCDE(3)
     A            WX15S          4  0O    95EDTCDE(3)
     A            WX16S          4  0O    99EDTCDE(3)
     A            WX17S          4  0O   103EDTCDE(3)
     A            WX18S          7  0O   107EDTCDE(3)
     A            WX19S          4  0O   114EDTCDE(3)
     A            WX20S          4  0O   118EDTCDE(3)
     A            WX21S          7  0O   122EDTCDE(3)
     A            WX22S          4  0O   129EDTCDE(3)
     A            WX23S          4  0O   133EDTCDE(3)
     A            WX24S          4  0O   137EDTCDE(3)
     A            WX25S          7  0O   141EDTCDE(3)
     A            WX26S          4  0O   148EDTCDE(3)
     A            WX27S          4  0O   152EDTCDE(3)
     A            WX28S          7  0O   156EDTCDE(3)
     A            WX29S          4  0O   163EDTCDE(3)
     A            WX30S          4  0O   167EDTCDE(3)
     A            WX31S          4  0O   171EDTCDE(3)
     A            WX32S          7  0O   175EDTCDE(3)
     A            WX33S          4  0O   182EDTCDE(3)
     A            WX34S          4  0O   186EDTCDE(3)
     A            WX35S          7  0O   190EDTCDE(3)
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------'
     A*----------------------------------------------------------------
     A          R PT2
     A*                                     SPACEA(001)
     A*                                    1
     A*                                     '-----------------------------------
     A*                                     ------------------------------------
     A*                                     ------------------------------------
     A*                                     ------------------------------------
     A*                                     ------------------------------------
     A*                                     ------------------------'
     A                                      SPACEA(001)
     A                                     1
     A                                      '總　　計------------>'
     A            WX01T          4  0O    27EDTCDE(3)
     A            WX02T          4  0O    31EDTCDE(3)
     A            WX03T          4  0O    35EDTCDE(3)
     A            WX04T          7  0O    39EDTCDE(3)
     A            WX05T          4  0O    46EDTCDE(3)
     A            WX06T          4  0O    50EDTCDE(3)
     A            WX07T          7  0O    54EDTCDE(3)
     A            WX08T          4  0O    61EDTCDE(3)
     A            WX09T          4  0O    65EDTCDE(3)
     A            WX10T          4  0O    69EDTCDE(3)
     A            WX11T          7  0O    73EDTCDE(3)
     A            WX12T          4  0O    80EDTCDE(3)
     A            WX13T          4  0O    84EDTCDE(3)
     A            WX14T          7  0O    88EDTCDE(3)
     A            WX15T          4  0O    95EDTCDE(3)
     A            WX16T          4  0O    99EDTCDE(3)
     A            WX17T          4  0O   103EDTCDE(3)
     A            WX18T          7  0O   107EDTCDE(3)
     A            WX19T          4  0O   114EDTCDE(3)
     A            WX20T          4  0O   118EDTCDE(3)
     A            WX21T          7  0O   122EDTCDE(3)
     A            WX22T          4  0O   129EDTCDE(3)
     A            WX23T          4  0O   133EDTCDE(3)
     A            WX24T          4  0O   137EDTCDE(3)
     A            WX25T          7  0O   141EDTCDE(3)
     A            WX26T          4  0O   148EDTCDE(3)
     A            WX27T          4  0O   152EDTCDE(3)
     A            WX28T          7  0O   156EDTCDE(3)
     A            WX29T          4  0O   163EDTCDE(3)
     A            WX30T          4  0O   167EDTCDE(3)
     A            WX31T          4  0O   171EDTCDE(3)
     A            WX32T          7  0O   175EDTCDE(3)
     A            WX33T          4  0O   182EDTCDE(3)
     A            WX34T          4  0O   186EDTCDE(3)
     A            WX35T          7  0O   190EDTCDE(3)
     A*                                     SPACEA(001)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<SOR165>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9
     A                                      SPACEA(001)
     A                                     3
     A                                      'もも此範圍無資料もも'
