     A*===============================================================
     F* MODI CODE |   DATE   |  DESCRIPTION
     F*================================================================
     F*  M001     | 98.10.21 | MANUAL MODIFY BY MICHELLE FOR Y2K
     F*----------------------------------------------------------------
     F*  M002     | 99.11.08 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     F*  M003     | 00.11.08 |增加大區域選項
     F*================================================================
     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    84MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    88'公司產品銷售彙總表'
     A                                      SPACEA(1)
     A            GROUP         10   O    95
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            COMP           1A  O    +1
     A            COMPC          6O  O    +1
M002AA                                   +20'集　　團：'
M002AA            DMD06S         2        +1
M002AA            D#A03S        32O       +2
     A                                      SPACEA(1)
     A                                     1'業務員組別:'
     A            DSC28S    R        O    15REFFLD(SC28)
     A                                    20'-'
     A            DSC28E    R        O    22REFFLD(SC28)
M002AA                                   +25'-'
M002AA            DMD06E         2        +2
M002AA            D#A03E        32O       +2
@@   A                                      SPACEA(1)
@@   A                                     1'業務人員:'
@@   A            DSC27S    R        O    15REFFLD(MC02)
M003AA                                    41'大區域別：'
M003AA            D#L01S         2        +1
M003AA            D#L02S        20        +2
M003AA                                    +1' - '
M003AA            D#L01E         2        +1
M003AA            D#L02E        20        +2
     A                                      SPACEA(1)
     A                                     1'產品代號:'
     A            DSD03S    R        O    15REFFLD(SD03)
     A                                    +1'-'
     A            DSD03E    R        O    +1REFFLD(SD03)
     A                                      SPACEA(001)
     A                                     1'通　　路:'
     A            DSC33S    R        O    13REFFLD(SC33)
     A                                    15'-'
     A            DSC33E    R        O    17REFFLD(SC33)
     A                                      SPACEA(1)
     A                                     1'型　　態:'
     A            DSC34S    R        O    13REFFLD(SC34)
     A                                    16'-'
     A            DSC34E    R        O    18REFFLD(SC34)
     A                                      SPACEA(1)
     A                                     1'客戶代號:'
     A            DSC45S         9   O    13
     A                                    23'-'
     A            DSC45E         9   O    25
@@   A                                      SPACEA(1)
@@   A                                     1'客戶名稱:'
@@   A            DSC46S        18O  O    13
     A                                   167'日期:'
     A            $EGMDY         6  0O   175EDTCDE(Y)
     A                                   184'頁次:'
     A                                   193PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(1)
     A N20                                 1'送貨日期:'
     A  20                                 1'確認日期:'
M001MA*N20        DSC08S    R        O    13REFFLD(SC39)
M001MA N20        DSC08S         6  0O    13
     A                                      EDTWRD('  /  /  ')
M001MA* 20        DSC39S    R        O    13REFFLD(SC39)
M001MA  20        DSC39S         6  0O    13
     A                                      EDTWRD('  /  /  ')
     A                                    21'-'
M001MA*N20        DSC08E    R        O    22REFFLD(SC39)
M001MA N20        DSC08E         6  0O    22
     A                                      EDTWRD('  /  /  ')
M001MA* 20        DSC39E    R        O    22REFFLD(SC39)
M001MA  20        DSC39E         6  0O    22
     A                                      EDTWRD('  /  /  ')
     A                                   167'時間:'
     A                                   175TIME
     A                                      SPACEA(1)
     A                                     1'分析方式:'
     A            DSEL2          1A       +1
     A N22                                20'禮盒不拆'
     A  22                                20'禮盒拆單瓶'
     A                                   168'USER :'
     A            $USER         10   O   175
     A                                   186'<SOR162>'
     A                                      SPACEA(1)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(1)
     A                                    51
     A                                      DFT('-------------')
     A                                    +0
     A                                      DFT('銷售')
     A                                    +0
     A                                      DFT('-------------')
     A                                    +7
     A                                      DFT('-------------')
     A                                    +0
     A                                      DFT('銷退')
     A                                    +0
     A                                      DFT('-------------')
     A                                   131
     A                                      DFT('-------------')
     A                                   144
     A                                      DFT('實際')
     A                                   150
     A                                      DFT('-------------')
     A                                   168
     A                                      DFT('------')
     A                                   174
     A                                      DFT('標準箱數')
     A                                   184
     A                                      DFT('------')
     A                                   191
     A                                      DFT('標準')
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('產品代號／名稱')
     A                                    28
     A                                      DFT('公司代號／名稱')
     A                                    49
     A                                      DFT('訂購')
     A                                    +2
     A                                      DFT('搭贈')
     A                                    +2
     A                                      DFT('試飲')
     A                                    +6
     A                                      DFT('淨金額')
     A                                    +4
     A                                      DFT('訂購')
     A                                    +2
     A                                      DFT('搭贈')
     A                                    +2
     A                                      DFT('試飲')
     A                                    +4
     A                                      DFT('銷退金額')
     A                                   129
     A                                      DFT('訂購')
     A                                   136
     A                                      DFT('搭贈')
     A                                   145
     A                                      DFT('試飲')
     A                                   155
     A                                      DFT('實際金額')
     A                                   168
     A                                      DFT('訂購')
     A                                   177
     A                                      DFT('搭贈')
     A                                   185
     A                                      DFT('試飲')
     A                                   191
     A                                      DFT('容積')
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('-------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------------------------')
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A  21                                 1
     A                                      DFT(' ')
     A                                      SPACEA(001)
     A N30        WF3701    R        O     2
     A                                      REFFLD(WF3701 *LIBL/REWF37)
     A N30        MA03      R        O    +0
     A            WF3702    R        O    29
     A                                      REFFLD(WF3702 *LIBL/REWF37)
     A            #B03      R        O    31
     A            WF3703    R        O    47
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            WF3704    R        O    +0
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            WF3705    R        O    +0
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            WF3706    R        O    +0
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            WF3707    R        O    +2
     A                                      REFFLD(WF3707 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            WF3708    R        O    +0
     A                                      REFFLD(WF3708 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            WF3709    R        O    +0
     A                                      REFFLD(WF3709 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            WF3710    R        O    +0
     A                                      REFFLD(WF3710 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            QTY1      R        O   126
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            QTY2      R        O   134
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            QTY3      R        O   142
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            QTY4      R        O   151
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            CASE1          6  0O   167
     A                                      EDTCDE(J)
     A            CASE2          6  0O   175
     A                                      EDTCDE(J)
     A            CASE3          6  0O   183
     A                                      EDTCDE(J)
     A            DCASE          5  2O   191
     A                                      EDTCDE(J)
     A                                   198'L'
     A*----------------------------------------------------------------
     A          R PT1
     A                                      SPACEA(001)
     A                                    20
     A                                      DFT('產品小計------------>')
     A            T13703    R        O    47
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T13704    R        O    +0
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T13705    R        O    +0
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T13706    R        O    +0
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T13707    R        O    +2
     A                                      REFFLD(WF3707 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T13708    R        O    +0
     A                                      REFFLD(WF3708 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T13709    R        O    +0
     A                                      REFFLD(WF3709 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T13710    R        O    +0
     A                                      REFFLD(WF3710 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T1QTY1    R        O   126
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T1QTY2    R        O   134
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T1QTY3    R        O   142
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T1QTY4    R        O   151
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T1CAS1         6  0O   167
     A                                      EDTCDE(J)
     A            T1CAS2         6  0O   175
     A                                      EDTCDE(J)
     A            T1CAS3         6  0O   183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2
     A                                      SPACEA(001)
     A            WF3712    R        O    21
     A                                      REFFLD(WF3712 *LIBL/REWF37)
     A                                    +3
     A                                      DFT('------------>')
     A            T23703    R        O    47
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T23704    R        O    +0
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T23705    R        O    +0
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T23706    R        O    +0
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T23707    R        O    +2
     A                                      REFFLD(WF3707 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T23708    R        O    +0
     A                                      REFFLD(WF3708 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T23709    R        O    +0
     A                                      REFFLD(WF3709 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T23710    R        O    +0
     A                                      REFFLD(WF3710 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T2QTY1    R        O   126
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T2QTY2    R        O   134
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T2QTY3    R        O   142
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T2QTY4    R        O   151
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T2CAS1         6  0O   167
     A                                      EDTCDE(J)
     A            T2CAS2         6  0O   175
     A                                      EDTCDE(J)
     A            T2CAS3         6  0O   183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3
     A                                      SPACEA(001)
     A            WF3711    R        O    21
     A                                      REFFLD(WF3711 *LIBL/REWF37)
     A                                    +5
     A                                      DFT('------------>')
     A            T33703    R        O    47
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T33704    R        O    +0
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T33705    R        O    +0
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T33706    R        O    +0
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T33707    R        O    +2
     A                                      REFFLD(WF3707 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T33708    R        O    +0
     A                                      REFFLD(WF3708 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T33709    R        O    +0
     A                                      REFFLD(WF3709 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T33710    R        O    +0
     A                                      REFFLD(WF3710 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T3QTY1    R        O   126
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T3QTY2    R        O   134
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T3QTY3    R        O   142
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T3QTY4    R        O   151
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T3CAS1         6  0O   167
     A                                      EDTCDE(J)
     A            T3CAS2         6  0O   175
     A                                      EDTCDE(J)
     A            T3CAS3         6  0O   183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT4
     A                                      SPACEA(001)
     A                                    20
     A                                      DFT('總　　計------------>')
     A            T43703    R        O    47
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T43704    R        O    +0
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T43705    R        O    +0
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T43706    R        O    +0
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T43707    R        O    +2
     A                                      REFFLD(WF3707 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T43708    R        O    +0
     A                                      REFFLD(WF3708 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T43709    R        O    +0
     A                                      REFFLD(WF3709 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T43710    R        O    +0
     A                                      REFFLD(WF3710 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T4QTY1    R        O   126
     A                                      REFFLD(WF3703 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T4QTY2    R        O   134
     A                                      REFFLD(WF3704 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T4QTY3    R        O   142
     A                                      REFFLD(WF3705 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T4QTY4    R        O   151
     A                                      REFFLD(WF3706 *LIBL/REWF37)
     A                                      EDTCDE(J)
     A            T4CAS1         6  0O   167
     A                                      EDTCDE(J)
     A            T4CAS2         6  0O   175
     A                                      EDTCDE(J)
     A            T4CAS3         6  0O   183
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('***續下頁***')
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('<<SOR162>>--->報表結束')
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
