     A*%%TS  SD  19930226  112311  D910074     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : SOR066D                                    *
     A*    AUTHOR       : AN MAIN HSIA                               *
     A*    CREATE DATE  : 81/11/18                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SOR066                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :訂單系統                                  *
     A*    REMARK       :客戶銷售明細表                            *
     /*=============================================================*/
     /*  CODE       AUTHOR.     DATE    DESCRIPTION
     /*-------------------------------------------------------------
     /*  M001      MICHELLE   98.12.19  Y2K MODIFY
     F*----------------------------------------------------------------
     F*  M002     | MICHELLE  | 99.11.08 | ADD CUSGRP OPTION
     F*----------------------------------------------------------------
     F*  M003     | 00.11.08 |增加大區域選項
     F*----------------------------------------------------------------
     /*=============================================================*/
     A****************************************************************
     A                                      REF(*LIBL/RERF)
     A          R PH1
     A                                  1  2'SOR066'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                  1 62'日期:'
     A            $EGMDY         6  0O  1 70
     A                                  2  2'SCR001'
     A                                  2 32'客戶銷售明細表'
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5 26'辦事處　:'
     A            COMP           1A  O  5 38
     A                                  5 40'( 1=台北2=台中3=高雄" "=全+
     A                                      部)'
M003AA                                  6 26'產品組別:'
M003AA            DMA11          1A  O  6 38
M003AA                                  7 26'大區域別:'
M003AA            D#L01S         2   O  7 38
M003AA                                  7 47'-'
M003AA            D#L01E         2   O  7 49
     A                                  8 26'通　　路:'
     A                                  8 47'-'
     A            DSC33S    R        O  8 38REFFLD(SC33)
     A            DSC33E    R        O  8 49REFFLD(SC33)
     A                                  9 26'型　　態:'
     A            DSC34S    R        O  9 38REFFLD(SC34)
     A                                  9 47'-'
     A            DSC34E    R        O 10 49REFFLD(SC34)
     A                                 10 26'客戶代號:'
     A            DSC04S    R        O 10 38REFFLD(SC04)
     A                                 10 47'-'
     A            DSC04E    R        O 10 49REFFLD(SC04)
     A                                 11 26'產品代號:'
     A            DSD03S    R        O 11 38REFFLD(SD03)
     A                                 11 47'-'
     A            DSD03E    R        O 11 49REFFLD(SD03)
     A                                 15 26'送貨日期:'
M001MA*           DSC08S    R        O 15 38REFFLD(SC39)
M001MA            DSC08S         6  0O 15 38
     A                                      EDTWRD('  /  /  ')
     A                                 15 47'-'
M001MA*           DSC08E    R        O 15 49REFFLD(SC39)
M001MA            DSC08E         6  0O 15 49
     A                                      EDTWRD('  /  /  ')
     A                                 15 60'(MM/DD/YY)'
     A                                 16 26'確認日期:'
M001MA*           DSC39S    R        O 16 38REFFLD(SC39)
M001MA            DSC39S         6  0O 16 38
     A                                      EDTWRD('  /  /  ')
     A                                 16 47'-'
M001MA*           DSC39E    R        O 16 49REFFLD(SC39)
M001MA            DSC39E         6  0O 16 49
     A                                      EDTWRD('  /  /  ')
     A                                 16 60'(MM/DD/YY)'
     A                                 17 26'執行環境:'
     A            $EVR           1  0O 17 38
     A                                 17 42'(1-即時   2-批次)'
     A                                 18 26'列印份數:'
     A            $CPY           3  0O 18 38
     A                                 19 26'列表機　:'
     A            $PRTID         2  0O 19 38
     A                                 20 27'***請準備１３２行報表紙***'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F4 =視窗查詢'
     A                                 12 26'業務員　:'
     A            DSC27S    R        O 12 38REFFLD(SC27)
     A                                 12 47'-'
     A            DSC27E    R        O 12 49REFFLD(SC27)
M002AA                                 13 26'集　　團:'
M002AA            DMD06S         2     13 38
M002AA                                 13 47'-'
M002AA            DMD06E         2     13 49
     A                                 14 26'禮盒碼　:'
     A            DMA54          1     14 38
     A                                 14 42'(A=全部 B=非禮盒 C=禮盒)'
