     A*%%TS  SD  19970331  100007  D910454     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : SSM000D                                    *
     A*    AUTHOR       : JUDY LEE                                   *
     A*    CREATE DATE  : 09/11/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SSM000C                                    *
     A*    SYSTEM       :專櫃銷售　　　　　　　                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19970331  100007  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'SSM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'專櫃系統主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  4  1'               '
     A                                      DSPATR(RI)
     A                                  5  1' '
     A                                      DSPATR(RI)
     A                                  5  4'資料維護'
     A                                  5 15' '
     A                                      DSPATR(RI)
     A                                  6  1'               '
     A                                      DSPATR(RI)
     A                                  5 17'01.ＰＬＵ資料輸入'
     A                                      DSPATR(UL)
     A                                  6 17'02.銷貨資料輸入'
     A                                      DSPATR(UL)
     A                                  7 17'03.銷貨資料轉檔'
     A                                      DSPATR(UL)
     A                                  8 17'04.匯東產品進貨處理'
     A                                      DSPATR(UL)
     A                                  9 17'05.供應商產品報價設定'
     A                                      DSPATR(UL)
     A                                 10 17'06.採購單資料維護'
     A                                      DSPATR(UL)
     A                                 11 17'07.採購驗收處理'
     A                                      DSPATR(UL)
     A                                 13  1'               '
     A                                      DSPATR(RI)
     A                                 14  1' '
     A                                      DSPATR(RI)
     A                                 14  4'資料查詢'
     A                                 14 15' '
     A                                      DSPATR(RI)
     A                                 15  1'               '
     A                                      DSPATR(RI)
     A                                 13 17'21.採購狀況－依產品'
     A                                      DSPATR(UL)
     A                                 14 17'22.採購狀況－依供應商'
     A                                      DSPATR(UL)
     A                                 15 17'23.採購狀況－依採購單'
     A                                      DSPATR(UL)
     A                                 16 17'24.產品存貨狀況'
     A                                      DSPATR(UL)
M001AA                                 17 17'25.物流點存貨狀況'
     A                                      DSPATR(UL)
     A                                  4 41'              '
     A                                      DSPATR(RI)
     A                                  5 41' '
     A                                      DSPATR(RI)
     A                                  5 43'報表作業'
     A                                  5 54' '
     A                                      DSPATR(RI)
     A                                  6 41'              '
     A                                      DSPATR(RI)
     A                                  5 56'41.五日銷售數量表'
     A                                      DSPATR(UL)
     A                                  6 56'42.五日銷售金額表'
     A                                      DSPATR(UL)
     A                                  7 56'43.銷售淨額報表'
     A                                      DSPATR(UL)
M002MA*                                 8 56'44.期間銷售分析表'
M002MA                                  8 56'44.期間銷售達成率分析表'
     A                                      DSPATR(UL)
     A                                  9 56'45.產品毛利率表'
     A                                      DSPATR(UL)
     A                                 10 56'46.產品銷售排行榜'
     A                                      DSPATR(UL)
     A                                 11 56'47.結帳表　　　'
     A                                      DSPATR(UL)
     A                                 12 56'48.驗收金額月彙總表'
     A                                      DSPATR(UL)
M001MA                                 13 54'X 49.銷售庫存週轉報表'
     A                                      DSPATR(UL)
     A                                 14 56'50.部門銷售金額總表'
     A                                      DSPATR(UL)
     A                                 16 56'51.部門銷售統計年報'
     A                                      DSPATR(UL)
     A                                 17 56'52.進貨明細表'
     A                                      DSPATR(UL)
     A                                 18 56'53.產品存貨彙總表'
     A                                      DSPATR(UL)
M002AA                                 20 56'55.期間銷售分析表'
M002AA                                      DSPATR(UL)
     A                                 23 30'請輸入選擇項目:'
     A            DOPID          2A  B 23 48DSPATR(UL)
     A                                 23  2'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                 18  1'               '
     A                                      DSPATR(RI)
     A                                 19  1' '
     A                                      DSPATR(RI)
     A                                 19  4'盤點作業'
     A                                 19 15' '
     A                                      DSPATR(RI)
     A                                 20  1'               '
     A                                      DSPATR(RI)
     A                                 19 17'31.盤點作業主畫面　'
     A                                      DSPATR(UL)
     A                                 19 56'54.匯東進貨成本一覽表'
     A                                      DSPATR(UL)
