     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*===============================================================
     A*---------------------------------------------------------------
     A****************************************************************
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEB(001)
     A            PBB03     R              2
     A                                      REFFLD(BB03 W2BBPF)
     A            PBB08     R             24REFFLD(BB08 W2BBPF)
     A                                      EDTCDE(O)
     A*----------------------------------------------------------------
