     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*===============================================================
     A*---------------------------------------------------------------
     A****************************************************************
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEB(001)
     A            X101      R              2
     A                                      REFFLD(X101 W2X1PF)
     A            XXXX          50O       24
     A*----------------------------------------------------------------
