     A*%%TS  SD  19930512  155728  REPGMR      REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   人頭馬匯東洋酒股份有限公司－版權所有    TEL:5042266    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : VSM000D                                    *
     A*    AUTHOR       : JUDY LEE                                   *
     A*    CREATE DATE  : 04/16/93                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : VSM000C                                    *
     A*    SYSTEM       :普銷系統　　　　　　　                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19930512  155728  REPGMR      REL-V2R1M0  5738-PW1
     A                                      OVERLAY
     A                                  1  2'VSM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'普銷系統主畫面'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  4  1'               '
     A                                      DSPATR(RI)
     A                                  4 17'01.普銷領／繳貨處理'
     A                                  5  1' '
     A                                      DSPATR(RI)
     A                                  5  4'資料維護'
     A                                  5 15' '
     A                                      DSPATR(RI)
     A                                  5 17'02.收貨確認'
     A                                  6  1'               '
     A                                      DSPATR(RI)
     A                                  6 17'03.普銷訂單輸入'
     A                                  7 17'04.普銷送貨單輸入'
     A                                  8 17'05.普銷訂單／送貨單批次作業'
     A                                  4 41'              '
     A                                      DSPATR(RI)
     A                                  4 56'41.核准簽章明細表'
     A                                  5 41' '
     A                                      DSPATR(RI)
     A                                  5 43'報表作業'
     A                                  5 54' '
     A                                      DSPATR(RI)
     A                                  5 56'42.普銷訂／送貨單明細'
     A                                  6 41'              '
     A                                      DSPATR(RI)
     A                                  6 56'43.普銷送貨撿料彙總表'
     A                                  7 56'44.普銷統一發票列印'
     A                                 22 30'請輸入選擇項目:'
     A            DOPID          2A  B 22 48DSPATR(UL)
     A                                      VALUES('  ' '01' '02' '03' '04' '05+
     A                                      ' '06' '41' '42' '43' '44' '45')
     A                                 23  2'執行'
     A                                 23 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A                                  8 56'45.普銷淨出貨表　　'
     A                                  9 17'06.業務助理對帳員領繳查詢　'
