     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250   *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : VTB004D                                    *
     A*    AUTHOR       : DEREK                                      *
     A*    CREATE DATE  : 2012/06/29                                 *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : VTB004                                     *
     A*    SYSTEM       :進銷存                                    *
     A*    SUBSYSTEM    :媒體申報                                  *
     A*    REMARK       :銷項資料人工轉檔                          *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      MSGLOC(24)
     A                                      PRINT
     A          R DSPD1
     A                                      CSRLOC(D#ROW      D#COL)
     A                                      OVERLAY
     A                                      CA03(03 '結束執行')
     A                                      CF14(14 '處理作業')
     A            D#ROW          3S 0H
     A            D#COL          3S 0H
     A                                  1  2'VTB004'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 31'銷項資料人工轉檔'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                 12 21'+----------------------------------
     A                                      --------------+'
     A                                 13 21'|　　此作業將轉入媒體申報人工輸+
                                            入檔'
     A                                 13 69'|'
     A                                 14 21'|　　請按F3放棄此作業或F14執+
     A                                      行此作業'
     A                                 14 69'|'
     A                                 15 21'+----------------------------------
     A                                      --------------+'
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A                                 22 26'F14=處理作業'
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  99        ERRMSG        50A  O 24  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
