     A*%%TS  SD  19970331  100007  D910454     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   寰盛洋酒股份有限公司－版權所有    TEL: 8773-9099         *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : VTM000D                                    *
     A*    AUTHOR       : MICHELLE                                   *
     A*    CREATE DATE  : 04/12/02                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : VTM000C                                    *
     A*    SYSTEM       :媒體申報作業　　　　　                    *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19970331  100007  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'VTM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 32'媒體申報主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  4  1'               '
     A                                      DSPATR(RI)
     A                                  5  1' '
     A                                      DSPATR(RI)
     A                                  5  4'資料維護'
     A                                  5 15' '
     A                                      DSPATR(RI)
     A                                  6  1'               '
     A                                      DSPATR(RI)
     A                                  5 17'01.銷項憑證轉檔'
     A                                      DSPATR(UL)
     A                                  6 17'02.進項憑證轉檔'
     A                                      DSPATR(UL)
     A                                  7 17'03.銷項資料人工輸入'
     A                                      DSPATR(UL)
     A                                  8 17'04.進項資料人工輸入'
     A                                      DSPATR(UL)
     A                                 11 17'07.合併進銷項資料檔'
     A                                      DSPATR(UL)
     A                                 13  1'               '
     A                                      DSPATR(RI)
     A                                 14  1' '
     A                                      DSPATR(RI)
     A                                 14  4'資料查詢'
     A                                 14 15' '
     A                                      DSPATR(RI)
     A                                 15  1'               '
     A                                      DSPATR(RI)
     A                                 13 17'10.轉檔查詢'
     A                                      DSPATR(UL)
     A                                  4 41'              '
     A                                      DSPATR(RI)
     A                                  5 41' '
     A                                      DSPATR(RI)
     A                                  5 43'報表作業'
     A                                  5 54' '
     A                                      DSPATR(RI)
     A                                  6 41'              '
     A                                      DSPATR(RI)
     A                                  5 56'41.轉檔列印'
     A                                      DSPATR(UL)
     A                                  6 56'42.人工輸入列印'
     A                                      DSPATR(UL)
     A                                  7 56'43.銷退折讓轉檔列印'
     A                                      DSPATR(UL)
     A                                  8 56'44.合併列印'
     A                                      DSPATR(UL)
     A                                  9 56'45.ＡＰ轉檔列印'
     A                                      DSPATR(UL)
     A                                 23 30'請輸入選擇項目:'
     A            DOPID          2A  B 23 48
     A                                 23  2'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 UPT9999 *LIBL/PTMF)
     A                                      DSPATR(HI)
     A*                                18  1'               '
     A*                                     DSPATR(RI)
     A*                                19  1' '
     A*                                     DSPATR(RI)
     A*                                19  4'盤點作業'
     A*                                19 15' '
     A*                                     DSPATR(RI)
     A*                                20  1'               '
     A*                                     DSPATR(RI)
     A*                                19 17'31.盤點作業主畫面　'
     A*                                     DSPATR(UL)
     A*                                19 56'54.匯東進貨成本一覽表'
     A*                                     DSPATR(UL)
