     A*===============================================================
     F*  CODE | AUTHOR |  DATE  |  DESCRIPTION
     F*================================================================
     F*       |        |        |
     F*----------------------------------------------------------------
     F*================================================================
     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    84MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    88'媒體申報銷退轉檔表'
     A                                      SPACEA(1)
     A                                     1'公司別  :'
     A            DVQ91          1A       14
     A            NAME           6O       17
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            DVQ92          1A       14
     A            OFFICE         6O       17
     A                                   161'日期:'
     A            $EGMDY         6  0O   169EDTCDE(Y)
     A                                   180'頁次:'
     A                                   188PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'申報年月:'
     A            DVQ04S         4  0     14EDTWRD('0 /  ')
     A                                    20'-'
     A            DVQ04E         4  0     22EDTWRD('0 /  ')
     A                                    +2'(MM/YY)'
     A                                   161'時間:'
     A                                   169TIME
     A                                      SPACEA(1)
     A                                     1'課稅別  :  1應稅2零稅率 +
     A                                      3免稅'
     A                                   162'USER :'
     A            $USER         10       169
     A                                   180'<VTR030P1>'
     A                                      SPACEA(1)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(1)
     A                                     3'年月'
     A                                    17'格式'
     A                                    31'銷售額'
     A                                    47'營業稅'
     A                                    60'課稅別'
     A                                    70'銷售人統編'
     A                                    84'買受人統編'
     A                                   101'發票號碼'
     A                                   121'發票日期'
     A                                   133'折讓單號'
     A                                   145'客戶/簡稱'
     A                                   175'折讓日期'
     A                                      SPACEA(1)
     A                                     1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A  21                                 1
     A                                      DFT(' ')
     A                                      SPACEA(001)
     A N31        VQ04      R              2EDTWRD('    /  ')
     A N30        VQ01      R             19
     A            VQ07      R             23EDTCDE(J)
     A            VQ09      R             41EDTCDE(J)
     A            VQ08      R             63
     A            VQ15      R             71
     A            VQ05      R             86
     A            VQ16      R             99
     A            VQ17      R            121EDTWRD('    /  /  ')
     A            VQ19      R            135
     A            AG0910         9       145
     A            ME04      R            154
     A            AGDATE         8  0    175EDTWRD('    /  /  ')
     A*----------------------------------------------------------------
     A          R PT1
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('格式小計--->')
     A            T1VQ07        12  0     23EDTCDE(J)
     A            T1VQ09        10  0     +2EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT2
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('年月小計--->')
     A            T2VQ07        12  0     23EDTCDE(J)
     A            T2VQ09        10  0     +2EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3
     A                                      SPACEA(001)
     A
     A            PLACE          6O        1
     A                                    +0
     A                                      DFT('辦事處小計->')
     A            T3VQ07        12  0     23EDTCDE(J)
     A            T3VQ09        10  0     +2EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT4
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('總　　計--->')
     A            T4VQ07        12  0     23EDTCDE(J)
     A            T4VQ09        10  0     +2EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('***續下頁***')
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('<<VTR030P1>>--->報表結束')
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
