     A*===============================================================
     F*  CODE | AUTHOR |  DATE  |  DESCRIPTION
     F*================================================================
     F*       |        |        |
     F*----------------------------------------------------------------
     F*================================================================
     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    54MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    58'進項人工輸入明細表'
     A                                      SPACEA(1)
     A                                     1'公司別　：'
     A            DVR91          1A       14
     A            NAME           6O       17
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            DVR92S         1A       14
     A            OFFICE         6O       17
     A                                   101'日期:'
     A            $EGMDY         6  0O   109EDTCDE(Y)
     A                                   119'頁次:'
     A                                   127PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'歸屬年月:'
     A            DVR04S         4  0     14EDTWRD('0 /  ')
     A                                    20'-'
     A            DVR04E         4  0     22EDTWRD('0 /  ')
     A                                    +2'(MM/YY)'
     A                                   101'時間:'
     A                                   109TIME
     A                                      SPACEA(1)
     A                                     1'員工代號:'
     A            DVR96S         6        14
                  SU02          10O       22
     A                                      SPACEA(1)
     A                                   102'USER :'
     A            $USER         10       109
     A                                   120'<VTR003P>'
     A                                      SPACEA(1)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(1)
     A                                    12'發票號碼'
     A                                   124'洋菸酒'
     A                                      SPACEA(1)
     A                                     1'格式'
     A                                      UNDERLINE
     A                                    10'其他憑證號碼'
     A                                      UNDERLINE
     A                                    26'發票日期'
     A                                      UNDERLINE
     A                                    38'銷售人統編'
     A                                      UNDERLINE
     A                                    53'銷售額／稅基'
     A                                      UNDERLINE
     A                                    74'營業稅'
     A                                      UNDERLINE
     A                                    84'稅別'
     A                                      UNDERLINE
     A                                    94'彙加'
     A                                      UNDERLINE
     A                                   102'張數'
     A                                      UNDERLINE
     A                                   110'扣抵'
     A                                      UNDERLINE
     A                                   124'註　記'
     A                                      UNDERLINE
     A                                      SPACEA(1)
     A*                                    1
     A*                                     DFT('-------------------------------
     A*                                     ------------------------------------
     A*                                     ------------------------------------
     A*                                     ------------------------------------
     A*                                     ------------------------------------
     A*                                     ----------------------------')
     A*                                     SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A  21                                 1
     A                                      DFT(' ')
     A                                      SPACEA(001)
     A N30        DVR01          2         3
     A            DVR16         14        10
     A            DVR17          6  0     26EDTWRD('  /  /  ')
     A            DVR15         10        39
     A            DVR07         12  0     52EDTCDE(J)
     A            DVR09         10  0     69EDTCDE(J)
     A            DVR08          1        85
     A            CVR08          6O       86
     A            DVR13          1        97
     A            DVR18          4  0    102EDTCDE(J)
     A            DVR10          1       111
     A            CVR10         10O      112
     A            DVR14          1       128
     A*----------------------------------------------------------------
     A          R PT1
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('格式小計------------>')
     A            T1VR07        12  0     52EDTCDE(J)
     A            T1VR09        10  0     69EDTCDE(J)
     A            T1VR18         6  0    100EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT4
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('總　　計------------>')
     A            T2VR07        12  0     52EDTCDE(J)
     A            T2VR09        10  0     69EDTCDE(J)
     A            T2VR18         6  0    100EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('***續下頁***')
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('<<VTR003>>--->報表結束')
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
