     A*===============================================================
     F*  CODE | AUTHOR |  DATE  |  DESCRIPTION
     F*================================================================
     F*       |        |        |
     F*----------------------------------------------------------------
     F*================================================================
     A                                      REF(RERF)
     A          R PH1
     A                                      SKIPB(002)
     A                                    84MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    86'ＡＰ媒體申報轉檔明細表'
     A                                      SPACEA(1)
     A                                     1'公司別  :'
     A            DVQ91          1A       14
     A            NAME           6O       17
     A                                      SPACEA(1)
     A                                     1'辦事處　:'
     A            DVQ92          1A       14
     A            OFFICE         6O       17
     A                                      SPACEA(1)
     A                                     1'申報年月:'
     A            DVQ04S         4  0     14EDTWRD('0 /  ')
     A                                    20'-'
     A            DVQ04E         4  0     22EDTWRD('0 /  ')
     A                                    +2'(MM/YY)'
     A                                   161'日期:'
     A            $EGMDY         6  0O   169EDTCDE(Y)
     A                                   180'頁次:'
     A                                   188PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'員工編號:'
     A            DVQ96          6        14
                  DMARK         12O       +2
     A                                   161'時間:'
     A                                   169TIME
     A                                      SPACEA(1)
     A                                     1'課稅別  :  1應稅2零稅率 +
     A                                      3免稅'
     A                                   162'USER :'
     A            $USER         10       169
     A                                   180'<VTR050P1>'
     A                                      SPACEA(1)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ========================'
     A                                      SPACEA(1)
     A                                     2'單據號碼'
     A                                    18'格式'
     A                                    32'銷售額'
     A                                    48'營業稅'
     A                                    61'課稅別'
     A                                    71'銷售人統編'
     A                                    85'買受人統編'
     A                                   102'發票號碼'
     A                                   122'發票日期'
     A                                   134'彙加'
     A                                   141'張數'
     A                                   151'年月'
     A                                   161'稅額科目'
     A                                      SPACEA(1)
     A                                     1'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ------------------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A  21                                 1
     A                                      DFT(' ')
     A                                      SPACEA(001)
     A N31        VQ19      R              2
     A            VQ01      R             20
     A            VQ07      R             24EDTCDE(J)
     A            VQ09      R             42EDTCDE(J)
     A            VQ08      R             64
     A            VQ15      R             73
     A            VQ05      R             87
     A            VQ16      R             98
     A            VQ17      R            122EDTWRD('    /  /  ')
     A            VQ13      R            136
     A            VQ18      R            141EDTCDE(J)
     A            VQ04      R            150EDTWRD('    /  ')
     A            VQ21           8       162
     A*----------------------------------------------------------------
     A          R PT4
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('總　　計--->')
     A            T4VQ07        12  0     23EDTCDE(J)
     A            T4VQ09        10  0     +2EDTCDE(J)
     A            T4VQ18         6  0    +82EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('***續下頁***')
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      DFT('==============================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ===================================-
     A                                      ============================')
     A                                      SPACEA(001)
     A                                     2
     A                                      DFT('<<VTR050P1>>--->報表結束')
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
