     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS001D                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/01/30                                   *
     A*    UPDDTA DATE  : 81/05/05 UPD BY JOYCE                      *
     A*    PROGRAM NAME : PWDS001                                    *
     A*    REMARK       :(WINDOW)-產品代碼查詢                     *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  4 19'                                  -
     A                                                                 '
     A                                      DSPATR(RI)
     A                                  5 19' '
     A                                      DSPATR(RI)
     A                                  5 20' '
     A                                  5 21'經銷商:'
     A            S011I1         5   O  5 31
     A            ME04      R        O  5 37
     A                                  5 79' '
     A                                      DSPATR(RI)
     A                                  6 19' '
     A                                      DSPATR(RI)
     A                                  7 21'OP : / -挑選                    -
     A                                                   '
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  7 19' '
     A                                      DSPATR(RI)
     A                                  8 21'OP產品代號　產品中文簡稱    產+
     A                                      品英文簡稱　　　庫存量 '
     A                                      DSPATR(UL)
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  8 19' '
     A                                      DSPATR(RI)
     A            D1011          1A  B  9 21VALUES('/' ' ')
     A  61                                  DSPATR(ND)
     A  61                                  DSPATR(PR)
     A                                  8 22' '
     A            D1012         44A  O  9 23
     A            D1013          7  0O  9 68EDTCDE(J)
     A  61                                  DSPATR(ND)
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9 19' '
     A                                      DSPATR(RI)
     A            D1021          1A  B 10 21VALUES('/' ' ')
     A  62                                  DSPATR(ND)
     A  62                                  DSPATR(PR)
     A                                  9 22' '
     A            D1022         44A  O 10 23
     A            D1023          7  0O 10 68EDTCDE(J)
     A  62                                  DSPATR(ND)
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10 19' '
     A                                      DSPATR(RI)
     A            D1031          1A  B 11 21VALUES('/' ' ')
     A  63                                  DSPATR(ND)
     A  63                                  DSPATR(PR)
     A                                 10 22' '
     A            D1032         44A  O 11 23
     A            D1033          7  0O 11 68EDTCDE(J)
     A  63                                  DSPATR(ND)
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 19' '
     A                                      DSPATR(RI)
     A            D1041          1A  B 12 21VALUES('/' ' ')
     A  64                                  DSPATR(ND)
     A  64                                  DSPATR(PR)
     A                                 11 22' '
     A            D1042         44A  O 12 23
     A            D1043          7  0O 12 68EDTCDE(J)
     A  64                                  DSPATR(ND)
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 19' '
     A                                      DSPATR(RI)
     A            D1051          1A  B 13 21VALUES('/' ' ')
     A  65                                  DSPATR(ND)
     A  65                                  DSPATR(PR)
     A                                 12 22' '
     A            D1052         44A  O 13 23
     A            D1053          7  0O 13 68EDTCDE(J)
     A  65                                  DSPATR(ND)
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 13 19' '
     A                                      DSPATR(RI)
     A            D1061          1A  B 14 21VALUES('/' ' ')
     A  66                                  DSPATR(ND)
     A  66                                  DSPATR(PR)
     A                                 13 22' '
     A            D1062         44A  O 14 23
     A            D1063          7  0O 14 68EDTCDE(J)
     A  66                                  DSPATR(ND)
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 14 19' '
     A                                      DSPATR(RI)
     A            D1071          1A  B 15 21VALUES('/' ' ')
     A  67                                  DSPATR(ND)
     A  67                                  DSPATR(PR)
     A                                 14 22' '
     A            D1072         44A  O 15 23
     A            D1073          7  0O 15 68EDTCDE(J)
     A  67                                  DSPATR(ND)
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 15 19' '
     A                                      DSPATR(RI)
     A            D1081          1A  B 16 21VALUES('/' ' ')
     A  68                                  DSPATR(ND)
     A  68                                  DSPATR(PR)
     A                                 15 22' '
     A            D1082         44A  O 16 23
     A            D1083          7  0O 16 68EDTCDE(J)
     A  68                                  DSPATR(ND)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 16 19' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 17 19' '
     A                                      DSPATR(RI)
     A                                  6 44'                                  '
     A                                  6 21'起始值...'
     A            DMA01          9A  B  6 33DSPATR(UL)
     A                                 17 44'                                  '
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 19' '
     A                                      DSPATR(RI)
     A                                 18 21'執行  F3 =退出　　            -
     A                                                   '
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 19'                                  -
     A                                                                 '
     A                                      DSPATR(RI)
     A                                  6 43'                                  '
