     A*%%TS  SD  19920730  131531  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS002D                                    *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    CREATE DATE  : 81/01/13                                   *
     A*    PROGRAM NAME : WDS001                                     *
     A*    REMARK       :(WINDOW)                                    *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  19920730  131531  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  4 45'                                  -
     A                                       '
     A                                      DSPATR(RI)
     A                                  5 45' '
     A                                      DSPATR(RI)
     A                                  5 47'供應商代碼                   '
     A                                  5 79' '
     A                                      DSPATR(RI)
     A                                  6 45' '
     A                                      DSPATR(RI)
     A                                  7 47'OP : / -挑選                 '
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  7 45' '
     A                                      DSPATR(RI)
     A                                  8 47'OP 供商簡稱　　　　　供商代號'
     A                                      DSPATR(UL)
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  8 45' '
     A                                      DSPATR(RI)
     A            D1011          1A  B  9 48VALUES('/' ' ')
     A  61                                  DSPATR(ND)
     A  61                                  DSPATR(PR)
     A            D1012         26A  O  9 50
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9 45' '
     A                                      DSPATR(RI)
     A            D1021          1A  B 10 48VALUES('/' ' ')
     A  62                                  DSPATR(ND)
     A  62                                  DSPATR(PR)
     A            D1022         26A  O 10 50
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10 45' '
     A                                      DSPATR(RI)
     A            D1031          1A  B 11 48VALUES('/' ' ')
     A  63                                  DSPATR(ND)
     A  63                                  DSPATR(PR)
     A            D1032         26A  O 11 50
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 45' '
     A                                      DSPATR(RI)
     A            D1041          1A  B 12 48VALUES('/' ' ')
     A  64                                  DSPATR(ND)
     A  64                                  DSPATR(PR)
     A            D1042         26A  O 12 50
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 45' '
     A                                      DSPATR(RI)
     A            D1051          1A  B 13 48VALUES('/' ' ')
     A  65                                  DSPATR(ND)
     A  65                                  DSPATR(PR)
     A            D1052         26A  O 13 50
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 13 45' '
     A                                      DSPATR(RI)
     A            D1061          1A  B 14 48VALUES('/' ' ')
     A  66                                  DSPATR(ND)
     A  66                                  DSPATR(PR)
     A            D1062         26A  O 14 50
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 14 45' '
     A                                      DSPATR(RI)
     A            D1071          1A  B 15 48VALUES('/' ' ')
     A  67                                  DSPATR(ND)
     A  67                                  DSPATR(PR)
     A            D1072         26A  O 15 50
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 15 45' '
     A                                      DSPATR(RI)
     A            D1081          1A  B 16 48VALUES('/' ' ')
     A  68                                  DSPATR(ND)
     A  68                                  DSPATR(PR)
     A            D1082         26A  O 16 50
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 16 45' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 17 45' '
     A                                      DSPATR(RI)
     A                                  6 47'起始值...'
     A            DMB03     R        B  6 59REFFLD(MB03)
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 45' '
     A                                      DSPATR(RI)
     A                                 18 47'執行  F3 =退出　　         '
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 45'                                  -
     A                                       '
     A                                      DSPATR(RI)
     A                                 17 47'                               '
