     A*%%TS  SD  19920708  094115  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS004D                                    *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/02/12                                   *
     A*    PROGRAM NAME : PWDS004                                    *
     A*    REMARK       :(WINDOW)-客戶信用查詢                     *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  19920708  094115  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  4 43'                                  -
     A                                         '
     A                                      DSPATR(RI)
     A                                  5 43' '
     A                                      DSPATR(RI)
     A                                  5 45'                                 '
     A                                  5 79' '
     A                                      DSPATR(RI)
     A                                  6 43' '
     A                                      DSPATR(RI)
     A                                  6 45'         '
     A                                  6 55'客戶信用查詢'
     A                                      DSPATR(UL)
     A                                  6 70'        '
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  7 43' '
     A                                      DSPATR(RI)
     A                                  7 45'                                 '
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  8 43' '
     A                                      DSPATR(RI)
     A                                  8 46'客戶代號'
     A                                  8 57'   '
     A                                  8 61':'
     A            MD01      R        O  8 63REFFLD(MD0/MD01 *LIBL/MTMDPF)
     A                                  8 69'         '
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9 43' '
     A                                      DSPATR(RI)
     A                                  9 46'客戶名稱'
     A                                  9 57'   '
     A                                  9 61':'
     A            DME04     R   15   O  9 63REFFLD(ME0/ME04 *LIBL/MTMEPF)
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10 43' '
     A                                      DSPATR(RI)
     A                                 10 46'信用額度'
     A                                 10 57'   '
     A                                 10 61':'
     A            MD22      R        O 10 63REFFLD(MD0/MD22 *LIBL/MTMDPF)
     A                                      EDTCDE(J)
     A                                 10 74'    '
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 43' '
     A                                      DSPATR(RI)
     A                                 11 46'應收帳款'
     A                                 11 61':'
     A            MD31      R        O 11 63REFFLD(MD0/MD31 *LIBL/MTMDPF)
     A                                      EDTCDE(J)
     A                                 11 74'    '
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 43' '
     A                                      DSPATR(RI)
     A                                 12 46'應收票據'
     A                                 12 57'   '
     A                                 12 61':'
     A            MD32      R        O 12 63REFFLD(MD0/MD32 *LIBL/MTMDPF)
     A                                      EDTCDE(J)
     A                                 12 74'    '
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 13 43' '
     A                                      DSPATR(RI)
     A                                 13 46'計劃使用額度'
     A                                 13 61':'
     A            MD30      R        O 13 63REFFLD(MD0/MD30 *LIBL/MTMDPF)
     A                                      EDTCDE(J)
     A                                 13 74'    '
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 14 43' '
     A                                      DSPATR(RI)
     A                                 14 46'可用額度'
     A                                 14 57'   '
     A                                 14 61':'
     A            DMD29     R     S  O 14 63REFFLD(MD0/MD29 *LIBL/MTMDPF)
     A                                      EDTCDE(J)
     A                                 14 74'    '
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 15 43' '
     A                                      DSPATR(RI)
     A                                 15 45'                                 '
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 16 43' '
     A                                      DSPATR(RI)
     A                                 16 46'執行  F3 =退出　　          '
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 17 43'                                  -
     A                                         '
     A                                      DSPATR(RI)
     A                                 11 57'   '
