     A*%%TS  SD  19920730  160044  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS015D                                    *
     A*    AUTHOR       : ANDY
     A*    CREATE DATE  : 81/06/12                                   *
     A*    PROGRAM NAME : WDS015                                     *
     A*    REMARK       :(WINDOW)                                    *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  19920730  160044  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      PUTOVR
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  4 43'                                  -
     A                                         '
     A                                      DSPATR(RI)
     A                                  5 43' '
     A                                      DSPATR(RI)
     A                                  5 55'業務員代碼'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  5 68'          '
     A                                  5 79' '
     A                                      DSPATR(RI)
     A                                  6 43' '
     A                                      DSPATR(RI)
     A                                  7 45'OP : / -挑選                   '
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  7 43' '
     A                                      DSPATR(RI)
     A                                  8 45'OP 員工姓名　　員工代碼        '
     A                                      DSPATR(UL)
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  8 43' '
     A                                      DSPATR(RI)
     A            OPT1           1A  B  9 45VALUES('/' ' ')
     A                                      OVRDTA
     A  60                                  DSPATR(ND)
     A  60                                  DSPATR(PR)
     A            D01           20A  O  9 48OVRDTA
     A  60                                  DSPATR(ND)
     A                                  9 69'         '
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9 43' '
     A                                      DSPATR(RI)
     A            OPT2           1A  B 10 45VALUES('/' ' ')
     A                                      OVRDTA
     A  61                                  DSPATR(ND)
     A  61                                  DSPATR(PR)
     A            D02           20A  O 10 48OVRDTA
     A  61                                  DSPATR(ND)
     A                                 10 69'         '
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10 43' '
     A                                      DSPATR(RI)
     A            OPT3           1A  B 11 45VALUES('/' ' ')
     A                                      OVRDTA
     A  62                                  DSPATR(ND)
     A  62                                  DSPATR(PR)
     A            D03           20A  O 11 48OVRDTA
     A  62                                  DSPATR(ND)
     A                                 11 69'         '
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 43' '
     A                                      DSPATR(RI)
     A            OPT4           1A  B 12 45VALUES('/' ' ')
     A                                      OVRDTA
     A  63                                  DSPATR(ND)
     A  63                                  DSPATR(PR)
     A            D04           20A  O 12 48OVRDTA
     A  63                                  DSPATR(ND)
     A                                 12 69'         '
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 43' '
     A                                      DSPATR(RI)
     A            OPT5           1A  B 13 45VALUES('/' ' ')
     A                                      OVRDTA
     A  64                                  DSPATR(ND)
     A  64                                  DSPATR(PR)
     A            D05           20A  O 13 48OVRDTA
     A  64                                  DSPATR(ND)
     A                                 13 69'         '
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 13 43' '
     A                                      DSPATR(RI)
     A            OPT6           1A  B 14 45VALUES('/' ' ')
     A                                      OVRDTA
     A  65                                  DSPATR(ND)
     A  65                                  DSPATR(PR)
     A            D06           20A  O 14 48OVRDTA
     A  65                                  DSPATR(ND)
     A                                 14 69'         '
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 14 43' '
     A                                      DSPATR(RI)
     A            OPT7           1A  B 15 45VALUES('/' ' ')
     A                                      OVRDTA
     A  66                                  DSPATR(ND)
     A  66                                  DSPATR(PR)
     A            D07           20A  O 15 48OVRDTA
     A  66                                  DSPATR(ND)
     A                                 15 69'         '
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 15 43' '
     A                                      DSPATR(RI)
     A            OPT8           1A  B 16 45VALUES('/' ' ')
     A                                      OVRDTA
     A  67                                  DSPATR(ND)
     A  67                                  DSPATR(PR)
     A            D08           20A  O 16 48OVRDTA
     A  67                                  DSPATR(ND)
     A                                 16 69'         '
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 16 43' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 17 43' '
     A                                      DSPATR(RI)
     A                                  6 45'起始值...'
     A            DBGN1     R        B  6 57REFFLD(MC02)
     A                                      OVRDTA
     A                                 17 45'                                 '
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 43' '
     A                                      DSPATR(RI)
     A                                 18 45'執行  F3 =退出　　           '
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 43'                                  -
     A                                         '
     A                                      DSPATR(RI)
     A                                  6 70'        '
     A                                  5 45'         '
