     A*%%TS  SD  20001009  110600  D910517T    REL-V3R7M0  5716-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS036D                                    *
     A*    AUTHOR       : MICHELLE
     A*    CREATE DATE  : 88/12/27                                   *
     A*    PROGRAM NAME : WDS036                                     *
     A*    REMARK       :(WINDOW)                                    *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  20001009  110600  D910517T    REL-V3R7M0  5716-PW1
     A                                      PUTOVR
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  6 37'A費用單位  品牌'
     A                                      DSPATR(UL)
     A                                  5 37'A : / -挑選'
     A                                  3 40'費用單位查詢'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  2 35'                       '
     A                                      DSPATR(RI)
     A                                  3 35' '
     A                                      DSPATR(RI)
     A                                  4 35' '
     A                                      DSPATR(RI)
     A                                  5 35' '
     A                                      DSPATR(RI)
     A                                  6 35' '
     A                                      DSPATR(RI)
     A                                  7 35' '
     A                                      DSPATR(RI)
     A                                  8 35' '
     A                                      DSPATR(RI)
     A                                  9 35' '
     A                                      DSPATR(RI)
     A                                 10 35' '
     A                                      DSPATR(RI)
     A                                 11 35' '
     A                                      DSPATR(RI)
     A                                 12 35' '
     A                                      DSPATR(RI)
     A                                 13 35' '
     A                                      DSPATR(RI)
     A                                 14 35' '
     A                                      DSPATR(RI)
     A                                 15 35' '
     A                                      DSPATR(RI)
     A                                  3 57' '
     A                                      DSPATR(RI)
     A                                  4 57' '
     A                                      DSPATR(RI)
     A                                  5 57' '
     A                                      DSPATR(RI)
     A                                  6 57' '
     A                                      DSPATR(RI)
     A                                  7 57' '
     A                                      DSPATR(RI)
     A                                  8 57' '
     A                                      DSPATR(RI)
     A                                  9 57' '
     A                                      DSPATR(RI)
     A                                 10 57' '
     A                                      DSPATR(RI)
     A                                 11 57' '
     A                                      DSPATR(RI)
     A                                 12 57' '
     A                                      DSPATR(RI)
     A                                 13 57' '
     A                                      DSPATR(RI)
     A                                 14 57' '
     A                                      DSPATR(RI)
     A                                 15 57' '
     A                                      DSPATR(RI)
     A                                  7 36'                     '
     A                                  8 36'                     '
     A                                  9 36'                     '
     A                                 10 36'                     '
     A                                 11 36'                     '
     A                                 12 36'                     '
     A                                 13 36'                     '
     A                                 14 36'                     '
     A                                 15 36'                     '
     A                                  7 55' '
     A                                  8 55' '
     A                                  9 55' '
     A                                 10 55' '
     A                                 11 55' '
     A                                 12 55' '
     A                                 13 55' '
     A                                 14 55' '
     A                                 15 55' '
     A            OPT1           1A  B  7 37VALUES(' ' '/')
     A                                      OVRDTA
     A  60                                  DSPATR(PR)
     A  60                                  DSPATR(ND)
     A            D01           14A  O  7 40OVRDTA
     A  60                                  DSPATR(ND)
     A            OPT2           1A  B  8 37VALUES(' ' '/')
     A                                      OVRDTA
     A  61                                  DSPATR(PR)
     A  61                                  DSPATR(ND)
     A            D02           14A  O  8 40OVRDTA
     A  61                                  DSPATR(ND)
     A            OPT3           1A  B  9 37VALUES(' ' '/')
     A                                      OVRDTA
     A  62                                  DSPATR(PR)
     A  62                                  DSPATR(ND)
     A            D03           14A  O  9 40OVRDTA
     A  62                                  DSPATR(ND)
     A            OPT4           1A  B 10 37VALUES(' ' '/')
     A                                      OVRDTA
     A  63                                  DSPATR(PR)
     A  63                                  DSPATR(ND)
     A            D04           14A  O 10 40OVRDTA
     A  63                                  DSPATR(ND)
     A            OPT5           1A  B 11 37VALUES(' ' '/')
     A                                      OVRDTA
     A  64                                  DSPATR(PR)
     A  64                                  DSPATR(ND)
     A            D05           14A  O 11 40OVRDTA
     A  64                                  DSPATR(ND)
     A            OPT6           1A  B 12 37VALUES(' ' '/')
     A                                      OVRDTA
     A  65                                  DSPATR(PR)
     A  65                                  DSPATR(ND)
     A            D06           14A  O 12 40OVRDTA
     A  65                                  DSPATR(ND)
     A            OPT7           1A  B 13 37VALUES(' ' '/')
     A                                      OVRDTA
     A  66                                  DSPATR(PR)
     A  66                                  DSPATR(ND)
     A            D07           14A  O 13 40OVRDTA
     A  66                                  DSPATR(ND)
     A            OPT8           1A  B 14 37VALUES(' ' '/')
     A                                      OVRDTA
     A  67                                  DSPATR(PR)
     A  67                                  DSPATR(ND)
     A            D08           14A  O 14 40OVRDTA
     A  67                                  DSPATR(ND)
     A                                  4 38'起始值...'
     A            DBGN1          5A  B  4 50OVRDTA
     A                                  4 55'  '
     A                                 15 36' 執行 F3 :跳出    '
     A                                 15 32' '
     A                                 15 34' '
     A                                 15 58' '
     A                                 16 35'                       '
     A                                      DSPATR(RI)
