     A*%%TS  SD  19920730  164629  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS017D                                    *
     A*    AUTHOR       : ANDY
     A*    CREATE DATE  : 81/06/15                                   *
     A*    PROGRAM NAME : WDS017                                     *
     A*    REMARK       :(WINDOW)                                    *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  19920730  164629  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      PUTOVR
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                  3 46'                                 '
     A                                      DSPATR(RI)
     A                                  4 46' '
     A                                      DSPATR(RI)
     A                                  4 52'收款種類代號查詢'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 48'   '
     A                                  4 71'      '
     A                                  4 78' '
     A                                      DSPATR(RI)
     A                                  5 46' '
     A                                      DSPATR(RI)
     A                                  6 48'A : /挑選'
     A                                  6 60'                 '
     A                                  5 78' '
     A                                      DSPATR(RI)
     A                                  6 46' '
     A                                      DSPATR(RI)
     A                                  7 48'A代號代號說明            '
     A                                      DSPATR(UL)
     A                                  6 78' '
     A                                      DSPATR(RI)
     A                                  7 46' '
     A                                      DSPATR(RI)
     A                                  7 78' '
     A                                      DSPATR(RI)
     A            OPT1           1A  B  8 48OVRDTA
     A  60                                  DSPATR(ND)
     A  60                                  DSPATR(PR)
     A            D01           27A  O  8 50OVRDTA
     A  60                                  DSPATR(ND)
     A                                  8 46' '
     A                                      DSPATR(RI)
     A                                  8 78' '
     A                                      DSPATR(RI)
     A            OPT2           1A  B  9 48OVRDTA
     A  61                                  DSPATR(ND)
     A  61                                  DSPATR(PR)
     A            D02           27A  O  9 50OVRDTA
     A  61                                  DSPATR(ND)
     A                                  9 46' '
     A                                      DSPATR(RI)
     A                                  9 78' '
     A                                      DSPATR(RI)
     A            OPT3           1A  B 10 48OVRDTA
     A  62                                  DSPATR(ND)
     A  62                                  DSPATR(PR)
     A            D03           27A  O 10 50OVRDTA
     A  62                                  DSPATR(ND)
     A                                 10 46' '
     A                                      DSPATR(RI)
     A                                 10 78' '
     A                                      DSPATR(RI)
     A            OPT4           1A  B 11 48OVRDTA
     A  63                                  DSPATR(ND)
     A  63                                  DSPATR(PR)
     A            D04           27A  O 11 50OVRDTA
     A  63                                  DSPATR(ND)
     A                                 11 46' '
     A                                      DSPATR(RI)
     A                                 11 78' '
     A                                      DSPATR(RI)
     A            OPT5           1A  B 12 48OVRDTA
     A  64                                  DSPATR(ND)
     A  64                                  DSPATR(PR)
     A            D05           27A  O 12 50OVRDTA
     A  64                                  DSPATR(ND)
     A                                 12 46' '
     A                                      DSPATR(RI)
     A                                 12 78' '
     A                                      DSPATR(RI)
     A            OPT6           1A  B 13 48OVRDTA
     A  65                                  DSPATR(ND)
     A  65                                  DSPATR(PR)
     A            D06           27A  O 13 50OVRDTA
     A  65                                  DSPATR(ND)
     A                                 13 46' '
     A                                      DSPATR(RI)
     A                                 13 78' '
     A                                      DSPATR(RI)
     A            OPT7           1A  B 14 48OVRDTA
     A  66                                  DSPATR(ND)
     A  66                                  DSPATR(PR)
     A            D07           27A  O 14 50OVRDTA
     A  66                                  DSPATR(ND)
     A                                 14 46' '
     A                                      DSPATR(RI)
     A                                 14 78' '
     A                                      DSPATR(RI)
     A            OPT8           1A  B 15 48OVRDTA
     A  67                                  DSPATR(ND)
     A  67                                  DSPATR(PR)
     A            D08           27A  O 15 50OVRDTA
     A  67                                  DSPATR(ND)
     A                                 15 46' '
     A                                      DSPATR(RI)
     A                                 15 78' '
     A                                      DSPATR(RI)
     A                                 16 46' '
     A                                      DSPATR(RI)
     A                                  5 48'起始值:'
     A            DBGN           2A  B  5 58
     A                                  5 61'                '
     A                                 16 78' '
     A                                      DSPATR(RI)
     A                                 17 46' '
     A                                      DSPATR(RI)
     A                                 17 48'執行    F3 :跳出         '
     A                                 17 78' '
     A                                      DSPATR(RI)
     A                                 18 46'                                 '
     A                                      DSPATR(RI)
     A                                 16 48'                             '
