     A*%%TS  SD  19920730  163104  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS017D                                    *
     A*    AUTHOR       : ANDY
     A*    CREATE DATE  : 81/06/15                                   *
     A*    PROGRAM NAME : WDS017                                     *
     A*    REMARK       :(WINDOW)                                    *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  19920730  163104  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      PUTOVR
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                  3 48'                             '
     A                                      DSPATR(RI)
     A                                  4 48' '
     A                                      DSPATR(RI)
     A                                  4 50'     '
     A                                  4 56'通路代號查詢'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  4 71'    '
     A                                  4 76' '
     A                                      DSPATR(RI)
     A                                  5 48' '
     A                                      DSPATR(RI)
     A                                  6 50'A : / 挑選             '
     A                                  5 76' '
     A                                      DSPATR(RI)
     A                                  6 48' '
     A                                      DSPATR(RI)
     A                                  7 50' 通路                  '
     A                                  6 76' '
     A                                      DSPATR(RI)
     A                                  7 48' '
     A                                      DSPATR(RI)
     A                                  8 50'A代號通路說明        '
     A                                      DSPATR(UL)
     A                                  7 76' '
     A                                      DSPATR(RI)
     A                                  8 48' '
     A                                      DSPATR(RI)
     A            OPT1           1A  B  9 50VALUES(' ' '/')
     A                                      OVRDTA
     A  60                                  DSPATR(ND)
     A  60                                  DSPATR(PR)
     A            D01           20A  O  9 53OVRDTA
     A  60                                  DSPATR(ND)
     A                                  8 76' '
     A                                      DSPATR(RI)
     A                                  9 48' '
     A                                      DSPATR(RI)
     A            OPT2           1A  B 10 50VALUES(' ' '/')
     A                                      OVRDTA
     A  61                                  DSPATR(ND)
     A  61                                  DSPATR(PR)
     A            D02           20A  O 10 53OVRDTA
     A  61                                  DSPATR(ND)
     A                                  9 76' '
     A                                      DSPATR(RI)
     A                                 10 48' '
     A                                      DSPATR(RI)
     A            OPT3           1A  B 11 50VALUES(' ' '/')
     A                                      OVRDTA
     A  62                                  DSPATR(ND)
     A  62                                  DSPATR(PR)
     A            D03           20A  O 11 53OVRDTA
     A  62                                  DSPATR(ND)
     A                                 10 76' '
     A                                      DSPATR(RI)
     A                                 11 48' '
     A                                      DSPATR(RI)
     A            OPT4           1A  B 12 50VALUES(' ' '/')
     A                                      OVRDTA
     A  63                                  DSPATR(ND)
     A  63                                  DSPATR(PR)
     A            D04           20A  O 12 53OVRDTA
     A  63                                  DSPATR(ND)
     A                                 11 76' '
     A                                      DSPATR(RI)
     A                                 12 48' '
     A                                      DSPATR(RI)
     A            OPT5           1A  B 13 50VALUES(' ' '/')
     A                                      OVRDTA
     A  64                                  DSPATR(ND)
     A  64                                  DSPATR(PR)
     A            D05           20A  O 13 53OVRDTA
     A  64                                  DSPATR(ND)
     A                                 12 76' '
     A                                      DSPATR(RI)
     A                                 13 48' '
     A                                      DSPATR(RI)
     A            OPT6           1A  B 14 50VALUES(' ' '/')
     A                                      OVRDTA
     A  65                                  DSPATR(ND)
     A  65                                  DSPATR(PR)
     A            D06           20A  O 14 53OVRDTA
     A  65                                  DSPATR(ND)
     A                                 13 76' '
     A                                      DSPATR(RI)
     A                                 14 48' '
     A                                      DSPATR(RI)
     A            OPT7           1A  B 15 50VALUES(' ' '/')
     A                                      OVRDTA
     A  66                                  DSPATR(ND)
     A  66                                  DSPATR(PR)
     A            D07           20A  O 15 53OVRDTA
     A  66                                  DSPATR(ND)
     A                                 14 76' '
     A                                      DSPATR(RI)
     A                                 15 48' '
     A                                      DSPATR(RI)
     A            OPT8           1A  B 16 50VALUES(' ' '/')
     A                                      OVRDTA
     A  67                                  DSPATR(ND)
     A  67                                  DSPATR(PR)
     A            D08           20A  O 16 53OVRDTA
     A  67                                  DSPATR(ND)
     A                                 15 76' '
     A                                      DSPATR(RI)
     A                                 16 48' '
     A                                      DSPATR(RI)
     A                                 16 76' '
     A                                      DSPATR(RI)
     A                                 17 48' '
     A                                      DSPATR(RI)
     A                                  5 50'起始值:'
     A            DBGN           1A  B  5 61OVRDTA
     A                                  5 63'            '
     A                                 17 76' '
     A                                      DSPATR(RI)
     A                                 18 48' '
     A                                      DSPATR(RI)
     A                                 18 50'執行  F3 :跳出       '
     A                                 18 76' '
     A                                      DSPATR(RI)
     A                                 19 48'                             '
     A                                      DSPATR(RI)
     A                                  9 74' '
     A                                 10 74' '
     A                                 11 74' '
     A                                 12 74' '
     A                                 13 74' '
     A                                 14 74' '
     A                                 15 74' '
     A                                 16 74' '
     A                                 17 50'                         '
