     A*%%TS  SD  19930215  160008  D910121     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*    DSPF NAME    : WDS041D                                    *
     A*    AUTHOR       : MICHELLE
     A*    CREATE DATE  : 050902                                     *
     A*    PROGRAM NAME : WDS041                                     *
     A*    REMARK       :(WINDOW)                                    *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  19930215  160008  D910121     REL-V2R1M0  5738-PW1
     A                                      PUTOVR
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  6 22'A格式　說　明                   -
     A                                                   '
     A                                      DSPATR(UL)
     A                                  5 22'A : / -挑選                     -
     A                                                   '
     A                                  3 44'格式代碼查詢'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  3 20' '
     A                                      DSPATR(RI)
     A                                  2 20'                                  -
     A                                                                '
     A                                      DSPATR(RI)
     A                                  3 79' '
     A                                      DSPATR(RI)
     A                                  4 20' '
     A                                      DSPATR(RI)
     A                                  5 20' '
     A                                      DSPATR(RI)
     A                                  6 20' '
     A                                      DSPATR(RI)
     A                                  7 20' '
     A                                      DSPATR(RI)
     A                                  8 20' '
     A                                      DSPATR(RI)
     A                                  9 20' '
     A                                      DSPATR(RI)
     A                                 10 20' '
     A                                      DSPATR(RI)
     A            OPT1           1A  B  7 22VALUES(' ' '/')
     A                                      OVRDTA
     A  60                                  DSPATR(PR)
     A  60                                  DSPATR(ND)
     A            D01           53O  O  7 25OVRDTA
     A  60                                  DSPATR(ND)
     A            OPT2           1A  B  8 22VALUES(' ' '/')
     A                                      OVRDTA
     A  61                                  DSPATR(PR)
     A  61                                  DSPATR(ND)
     A            D02           53O  O  8 25OVRDTA
     A  61                                  DSPATR(ND)
     A            OPT3           1A  B  9 22VALUES(' ' '/')
     A                                      OVRDTA
     A  62                                  DSPATR(PR)
     A  62                                  DSPATR(ND)
     A            D03           53O  O  9 25OVRDTA
     A  62                                  DSPATR(ND)
     A            OPT4           1A  B 10 22VALUES(' ' '/')
     A                                      OVRDTA
     A  63                                  DSPATR(PR)
     A  63                                  DSPATR(ND)
     A            D04           53O  O 10 25OVRDTA
     A  63                                  DSPATR(ND)
     A            OPT5           1A  B 11 22VALUES(' ' '/')
     A                                      OVRDTA
     A  64                                  DSPATR(PR)
     A  64                                  DSPATR(ND)
     A            D05           53O  O 11 25OVRDTA
     A  64                                  DSPATR(ND)
     A            OPT6           1A  B 12 22VALUES(' ' '/')
     A                                      OVRDTA
     A  65                                  DSPATR(PR)
     A  65                                  DSPATR(ND)
     A            D06           53O  O 12 25OVRDTA
     A  65                                  DSPATR(ND)
     A            OPT7           1A  B 13 22VALUES(' ' '/')
     A                                      OVRDTA
     A  66                                  DSPATR(PR)
     A  66                                  DSPATR(ND)
     A            D07           53O  O 13 25OVRDTA
     A  66                                  DSPATR(ND)
     A            OPT8           1A  B 14 22VALUES(' ' '/')
     A                                      OVRDTA
     A  67                                  DSPATR(PR)
     A  67                                  DSPATR(ND)
     A            D08           53O  O 14 25OVRDTA
     A  67                                  DSPATR(ND)
     A                                 11 20' '
     A                                      DSPATR(RI)
     A                                 12 20' '
     A                                      DSPATR(RI)
     A                                 13 20' '
     A                                      DSPATR(RI)
     A                                 14 20' '
     A                                      DSPATR(RI)
     A                                 15 20' '
     A                                      DSPATR(RI)
     A                                 16 20' '
     A                                      DSPATR(RI)
     A                                 17 20'                                  -
     A                                                                '
     A                                      DSPATR(RI)
     A                                  4 79' '
     A                                      DSPATR(RI)
     A                                  5 79' '
     A                                      DSPATR(RI)
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                  4 22'起始值:'
     A            DBGN1         10A  B  4 32OVRDTA
     A                                  4 34'                                  '
     A                                 16 22'執行   F3 :跳出               -
     A                                                    '
     A                                  3 23'                  '
     A                                  3 63'            '
     A                                 15 23'                                  -
     A                                                 '
