     A*%%TS  SD  19920730  145609  REPGMRP     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS006D                                    *
     A*    AUTHOR       : A1034  STEPHANIE                           *
     A*    CREATE DATE  : 81/01/13                                   *
     A*    PROGRAM NAME : WDS006                                     *
     A*    REMARK       :(WINDOW)                                    *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  19920730  145609  REPGMRP     REL-V2R1M0  5738-PW1
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  4 31'                                  -
     A                                                     '
     A                                      DSPATR(RI)
     A                                  5 31' '
     A                                      DSPATR(RI)
     A                                  5 33'採購備註代碼                    -
     A                                                 '
     A                                      DSPATR(HI)
     A                                  5 79' '
     A                                      DSPATR(RI)
     A                                  6 31' '
     A                                      DSPATR(RI)
     A                                  7 33'OP : / -挑選                    -
     A                                                 '
     A                                  6 79' '
     A                                      DSPATR(RI)
     A                                  7 31' '
     A                                      DSPATR(RI)
     A                                  8 33'OP備註代碼 備註內容           -
     A                                                 '
     A                                      DSPATR(UL)
     A                                  7 79' '
     A                                      DSPATR(RI)
     A                                  8 31' '
     A                                      DSPATR(RI)
     A            D1011          1A  B  9 33VALUES('/' ' ')
     A  61                                  DSPATR(ND)
     A  61                                  DSPATR(PR)
     A            D1012         42A  O  9 36
     A                                  8 79' '
     A                                      DSPATR(RI)
     A                                  9 31' '
     A                                      DSPATR(RI)
     A            D1021          1A  B 10 33VALUES('/' ' ')
     A  62                                  DSPATR(ND)
     A  62                                  DSPATR(PR)
     A            D1022         42A  O 10 36
     A                                  9 79' '
     A                                      DSPATR(RI)
     A                                 10 31' '
     A                                      DSPATR(RI)
     A            D1031          1A  B 11 33VALUES('/' ' ')
     A  63                                  DSPATR(ND)
     A  63                                  DSPATR(PR)
     A            D1032         42A  O 11 36
     A                                 10 79' '
     A                                      DSPATR(RI)
     A                                 11 31' '
     A                                      DSPATR(RI)
     A            D1041          1A  B 12 33VALUES('/' ' ')
     A  64                                  DSPATR(ND)
     A  64                                  DSPATR(PR)
     A            D1042         42A  O 12 36
     A                                 11 79' '
     A                                      DSPATR(RI)
     A                                 12 31' '
     A                                      DSPATR(RI)
     A            D1051          1A  B 13 33VALUES('/' ' ')
     A  65                                  DSPATR(ND)
     A  65                                  DSPATR(PR)
     A            D1052         42A  O 13 36
     A                                 12 79' '
     A                                      DSPATR(RI)
     A                                 13 31' '
     A                                      DSPATR(RI)
     A            D1061          1A  B 14 33VALUES('/' ' ')
     A  66                                  DSPATR(ND)
     A  66                                  DSPATR(PR)
     A            D1062         42A  O 14 36
     A                                 13 79' '
     A                                      DSPATR(RI)
     A                                 14 31' '
     A                                      DSPATR(RI)
     A            D1071          1A  B 15 33VALUES('/' ' ')
     A  67                                  DSPATR(ND)
     A  67                                  DSPATR(PR)
     A            D1072         42A  O 15 36
     A                                 14 79' '
     A                                      DSPATR(RI)
     A                                 15 31' '
     A                                      DSPATR(RI)
     A            D1081          1A  B 16 33VALUES('/' ' ')
     A  68                                  DSPATR(ND)
     A  68                                  DSPATR(PR)
     A            D1082         42A  O 16 36
     A                                 15 79' '
     A                                      DSPATR(RI)
     A                                 16 31' '
     A                                      DSPATR(RI)
     A                                 16 79' '
     A                                      DSPATR(RI)
     A                                 17 31' '
     A                                      DSPATR(RI)
     A                                  6 33'起始值...'
     A            DPJ01     R        B  6 45REFFLD(PJ01)
     A                                  6 50'                            '
     A                                 17 79' '
     A                                      DSPATR(RI)
     A                                 18 31' '
     A                                      DSPATR(RI)
     A                                 18 33'執行  F3 =退出　　            -
     A                                                 '
     A                                 18 79' '
     A                                      DSPATR(RI)
     A                                 19 31'                                  -
     A                                                     '
     A                                      DSPATR(RI)
     A                                 17 33'                                  -
     A                                                 '
