     A*%%TS  SD  19921209  144236  D910121     REL-V2R1M0  5738-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*    DSPF NAME    : WDS025D                                    *
     A*    AUTHOR       : ANDY
     A*    CREATE DATE  : 81/07/09                                   *
     A*    PROGRAM NAME : WDS025                                     *
     A*    REMARK       :(WINDOW)                                    *
     A*                  RETDSP(*YES)                                *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/RERF)
     A                                      PRINT
     A          R DSPC0                     ASSUME
     A                                  2  2' '
     A          R DSPC1
     A*%%TS  SD  19921209  144236  D910121     REL-V2R1M0  5738-PW1
     A                                      PUTOVR
     A                                      CA03(03)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A                                      PROTECT
     A                                      CLRL(*NO)
     A                                  4 50'盤點單號查詢'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 38'A : /挑選'
     A                                  6 38'起始值:'
     A                                 18 38'執行  F3 :跳出'
     A            DBGN           9A  B  6 48OVRDTA
     A                                  8 38'A盤點單號                       -
     A                                      '
     A                                      DSPATR(UL)
     A            DIO02          5A  O  5 48
     A                                  3 35'                                  -
     A                                           '
     A                                      DSPATR(RI)
     A                                 19 35'                                  -
     A                                           '
     A                                      DSPATR(RI)
     A                                  7 35' '
     A                                      DSPATR(RI)
     A                                  8 35' '
     A                                      DSPATR(RI)
     A                                  9 35' '
     A                                      DSPATR(RI)
     A                                  4 35' '
     A                                      DSPATR(RI)
     A                                  5 35' '
     A                                      DSPATR(RI)
     A                                  6 35' '
     A                                      DSPATR(RI)
     A                                 10 35' '
     A                                      DSPATR(RI)
     A                                 11 35' '
     A                                      DSPATR(RI)
     A                                 12 35' '
     A                                      DSPATR(RI)
     A                                 13 35' '
     A                                      DSPATR(RI)
     A                                 14 35' '
     A                                      DSPATR(RI)
     A                                 15 35' '
     A                                      DSPATR(RI)
     A                                 16 35' '
     A                                      DSPATR(RI)
     A                                 17 35' '
     A                                      DSPATR(RI)
     A                                 18 35' '
     A                                      DSPATR(RI)
     A                                  4 73' '
     A                                      DSPATR(RI)
     A                                  5 73' '
     A                                      DSPATR(RI)
     A                                  6 73' '
     A                                      DSPATR(RI)
     A                                  7 73' '
     A                                      DSPATR(RI)
     A                                  8 73' '
     A                                      DSPATR(RI)
     A                                  9 73' '
     A                                      DSPATR(RI)
     A                                 10 73' '
     A                                      DSPATR(RI)
     A                                 11 73' '
     A                                      DSPATR(RI)
     A                                 12 73' '
     A                                      DSPATR(RI)
     A                                 13 73' '
     A                                      DSPATR(RI)
     A                                 14 73' '
     A                                      DSPATR(RI)
     A                                 15 73' '
     A                                      DSPATR(RI)
     A                                 16 73' '
     A                                      DSPATR(RI)
     A                                 17 73' '
     A                                      DSPATR(RI)
     A                                 18 73' '
     A                                      DSPATR(RI)
     A            DOP1           1A  B  9 38OVRDTA
     A                                      VALUES(' ' '/')
     A  61                                  DSPATR(ND)
     A N61                                  DSPATR(UL)
     A  61                                  DSPATR(PR)
     A            D1             9   O  9 40OVRDTA
     A  61                                  DSPATR(ND)
     A            DOP2           1A  B 10 38OVRDTA
     A                                      VALUES(' ' '/')
     A  62                                  DSPATR(ND)
     A N62                                  DSPATR(UL)
     A  62                                  DSPATR(PR)
     A            D2             9A  O 10 40OVRDTA
     A  62                                  DSPATR(ND)
     A            DOP3           1A  B 11 38OVRDTA
     A                                      VALUES(' ' '/')
     A  63                                  DSPATR(ND)
     A N63                                  DSPATR(UL)
     A  63                                  DSPATR(PR)
     A            D3             9A  O 11 40OVRDTA
     A  63                                  DSPATR(ND)
     A            DOP4           1A  B 12 38OVRDTA
     A                                      VALUES(' ' '/')
     A  64                                  DSPATR(ND)
     A N64                                  DSPATR(UL)
     A  64                                  DSPATR(PR)
     A            D4             9A  O 12 40OVRDTA
     A  64                                  DSPATR(ND)
     A            DOP5           1A  B 13 38OVRDTA
     A                                      VALUES(' ' '/')
     A  65                                  DSPATR(ND)
     A N65                                  DSPATR(UL)
     A  65                                  DSPATR(PR)
     A            D5             9A  O 13 40OVRDTA
     A  65                                  DSPATR(ND)
     A            DOP6           1A  B 14 38OVRDTA
     A  66                                  DSPATR(ND)
     A N66                                  DSPATR(UL)
     A  66                                  DSPATR(PR)
     A                                      VALUES(' ' '/')
     A            D6             9A  O 14 40OVRDTA
     A  66                                  DSPATR(ND)
     A            DOP7           1A  B 15 38OVRDTA
     A                                      VALUES(' ' '/')
     A  67                                  DSPATR(ND)
     A N67                                  DSPATR(UL)
     A  67                                  DSPATR(PR)
     A            D7             9A  O 15 40OVRDTA
     A  67                                  DSPATR(ND)
     A            DOP8           1A  B 16 38OVRDTA
     A                                      VALUES(' ' '/')
     A  68                                  DSPATR(ND)
     A N68                                  DSPATR(UL)
     A  68                                  DSPATR(PR)
     A            D8             9A  O 16 40OVRDTA
     A  68                                  DSPATR(ND)
     A                                  5 38'物流點:'
     A                                  4 37'            '
     A                                  4 65'       '
     A                                  5 54'                  '
     A                                  6 58'              '
     A                                  7 50'                      '
     A                                  9 50'                      '
     A                                 10 50'                      '
     A                                 11 50'                      '
     A                                 12 50'                      '
     A                                 13 50'                      '
     A                                 14 50'                      '
     A                                 15 50'                      '
     A                                 16 50'                      '
     A                                 17 37'                                  -
     A                                       '
     A                                 18 57'               '
