     A*%%TS  SD  19960328  173223  D910341     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*    DSPF NAME    : WOA100D                                    *
     A*    AUTHOR       : A1092  TAYLOR                              *
     A*    CREATE DATE  : 81/02/10                                   *
     A*    UPDATE DATE  : 81/04/17 PHILIP                            *
     A*    PROGRAM NAME : WOA100                                     *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/WORF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR2                    SFL
     A*%%TS  SD  19960328  164941  D910341     REL-V3R1M0  5763-PW1
     A  54                                  SFLNXTCHG
     A            DNEW2          1A  H
     A            RRN2           3Y 0H
     A            HWI03     R        H      REFFLD(WI03)
     A            HWI02     R        H      REFFLD(WI02)
     A            DDEL2          1A  B 10  3DSPATR(UL)
     A                                      VALUES(' ' 'D')
     A            DWI03     R        B 10  5REFFLD(WI03)
     A                                      DSPATR(UL)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A            DWI02     R        B 10 16REFFLD(WI02)
     A                                      DSPATR(UL)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A            DWI04     R        B 10 27REFFLD(WI04)
     A                                      DSPATR(UL)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A            DWI05          6  0B 10 38
     A                                      DSPATR(UL)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                      EDTWRD('  /  /  ')
     A            DWI06     R        B 10 48REFFLD(WI06)
     A                                      DSPATR(UL)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A            DWI07     R        B 10 64REFFLD(WI07)
     A                                      DSPATR(UL)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A            DWI08     R        B 11 16REFFLD(WI08)
     A                                      DSPATR(UL)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A            DWI09     R        B 11 49REFFLD(WI09)
     A                                      DSPATR(UL)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A*----------------------------------------------------------------
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*%%TS  SD  19960328  171732  D910341     REL-V3R1M0  5763-PW1
     A                                      SFLSIZ(0060)
     A                                      SFLPAG(0006)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A                                      CSRLOC(#LIN       #COL)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A            DRRN2          3S 0H      SFLRCDNBR
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'WOA1002D'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DATE           6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  1
     A                                  2 31'客戶員工資料維護'
     A                                      DSPATR(RI)
     A                                  2 70TIME
     A                                  5  2'客戶代號:'
     A            WE01      R        O  5 14
     A            WE02      R        O  5 22
     A                                  8  3'D'
     A                                  7  5'員工別名'
     A                                  7 16'員工姓名'
     A                                  7 27'職　　稱'
     A                                  7 38'生　　日'
     A                                  7 50'電　話１'
     A                                  7 67'電　話２'
     A                                  8 68'(BB CALL)'
     A                                  8 16'地　　　址１'
     A                                  8 50'地　　　址２'
     A                                  9  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A*----------------------------------------------------------------
     A          R DSPC2
     A*%%TS  SD  19960328  173223  D910341     REL-V3R1M0  5763-PW1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  88
     AO 99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  1'執行'
     A                                 23  9'PF3 =回主畫面'
     A                                 23 43'PF5 =參考資料'
     A                                 23 60'PF12=回前畫面'
     A                                 24  9'PA1 =下一頁'
     A                                 24 26'PA2 =上一頁'
