     A*%%TS  SD  19960415  114620  D910341     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*    DSPF NAME    : WOA1003D                                   *
     A*    AUTHOR       : A1092  TAYLOR                              *
     A*    CREATE DATE  : 81/02/10                                   *
     A*    UPDATE DATE  : 81/04/17 PHILIP                            *
     A*    PROGRAM NAME : WOA1003                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :                                            *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      REF(*LIBL/WORF)
     A                                      MSGLOC(22)
     A                                      PRINT
     A          R SFLSR2                    SFL
     A*%%TS  SD  19960402  174230  D910341     REL-V3R1M0  5763-PW1
     A  54                                  SFLNXTCHG
     A            DNEW2          1A  H
     A            RRN2           3Y 0H
     A            HWD02     R        H      REFFLD(WD02)
     A            DDEL2          1A  B  9  3DSPATR(UL)
     A                                      VALUES(' ' 'D')
     A            DWD02     R        B  9  5REFFLD(WD02)
     A                                      DSPATR(UL)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A            DMA02     R        O  9 15REFFLD(RERFR/MA02 *LIBL/RERF)
     A            DWD03     R        B  9 51REFFLD(WD03)
     A                                      DSPATR(UL)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A            DWD04     R        B  9 60REFFLD(WD04)
     A                                      DSPATR(UL)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A            DWD05     R        B  9 69REFFLD(WD05)
     A                                      DSPATR(UL)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A*----------------------------------------------------------------
     A          R SFLCR2                    SFLCTL(SFLSR2)
     A*%%TS  SD  19960402  150312  D910341     REL-V3R1M0  5763-PW1
     A                                      SFLSIZ(0072)
     A                                      SFLPAG(0012)
     A                                      CA03(03)
     A                                      CF04(04)
     A                                      CF05(05)
     A                                      CF12(12)
     A                                      ROLLUP(25)
     A                                      CSRLOC(#LIN       #COL)
     A                                      OVERLAY
     A  50                                  SFLDSP
     A  51                                  SFLDSPCTL
     A  52                                  SFLCLR
     A  53                                  SFLEND
     A            DRRN2          3S 0H      SFLRCDNBR
     A            #LIN           3S 0H
     A            #COL           3S 0H
     A                                  1  2'WOA1003D'
     A            CONAME        32A  O  1 25MSGID(US# 9001 S#MF)
     A            DATE           6Y 0O  1 70EDTCDE(Y)
     A            $USERN        10A  O  2  1
     A                                  2 31'客戶產品資料維護'
     A                                      DSPATR(RI)
     A                                  2 70TIME
     A                                  5  2'客戶代號:'
     A            WD01      R        O  5 14
     A            WE02      R        O  5 22
     A                                  7  3'D'
     A                                  7  5'產品代號'
     A                                  7 16'產品全稱'
     A                                  7 50'庫存量'
     A                                  7 59'庫存成本'
     A                                  7 70'安全存量'
     A                                  8  1'-----------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A*----------------------------------------------------------------
     A          R DSPC2
     A*%%TS  SD  19960415  114620  D910341     REL-V3R1M0  5763-PW1
     A            ERRID          7A  H
     A            ERRF          10A  H
     A  88
     AO 99        ERRMSG        70A  O 22  2MSGID(&ERRID &ERRF)
     A                                      DSPATR(HI)
     A                                 23  1'執行'
     A                                 23  9'PF3 =回主畫面'
     A                                 23 60'PF12=回前畫面'
     A                                 24  9'PA1 =下一頁'
     A                                 24 26'PA2 =上一頁'
