     A*%%TS  SD  19960821  155840  D910454     REL-V3R1M0  5763-PW1
     A*  80/11/15  13:46:08    REPGMR      REL-R03M00  5728-PW1
     A****************************************************************
     A*    DSPF NAME    : WOM000D                                    *
     A*    AUTHOR       : 910070  JUDY LEE                           *
     A*    CREATE DATE  : 1993.12.04                                 *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : WOM000C                                    *
     A*    SYSTEM       :市場資訊系統                              *
     A*    SUBSYSTEM    :                                            *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A*  80/11/15  13:50:09    REPGMR      REL-R03M00  5728-PW1
     A          R DSPC1
     A*%%TS  SD  19960821  155840  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'WOM000'
     A                                  1 26MSGCON(030 URE9999 *LIBL/REMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 29'客戶管理系統主畫面'
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                  5  2'              '
     A                                      DSPATR(RI)
     A                                  5 17'01.客戶資料維護－Ｃ'
     A                                  5 39'              '
     A                                      DSPATR(RI)
     A                                  5 55'41.客戶資料列印'
     A                                  6  2' '
     A                                      DSPATR(RI)
     A                                  6  4'資料維護'
     A                                  6 15' '
     A                                      DSPATR(RI)
     A                                  6 17'02.客戶資料維護－Ｎ'
     A                                  6 39' '
     A                                      DSPATR(RI)
     A                                  6 41'報表列印'
     A                                  6 52' '
     A                                      DSPATR(RI)
     A                                  6 55'42.客戶員工資料列印'
     A                                  7  2'              '
     A                                      DSPATR(RI)
     A                                  7 39'              '
     A                                      DSPATR(RI)
     A                                  7 55'43.客戶（等級）資料列印'
     A                                 11  2'              '
     A                                      DSPATR(RI)
     A                                 12  2' '
     A                                      DSPATR(RI)
     A                                 12  4'查詢作業'
     A                                 12 15' '
     A                                      DSPATR(RI)
     A                                 13  2'              '
     A                                      DSPATR(RI)
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('  ' '01' '02' '03' '04' '05-
     A                                      ' '06' '07' '21' '22' '41' '42' '43-
     A                                      ' '44')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 64MSGCON(016 URE9996 *LIBL/REMF)
     A                                      DSPATR(HI)
