     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    DSPF NAME    : WOR1001P                                   *
     A*    AUTHOR       : A1139  JANE                                *
     A*    CREATE DATE  : 81/02/13                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : WOR1001                                    *
     A*    SYSTEM       :人頭馬匯東                                *
     A*    SUBSYSTEM    :主檔                                      *
     A*    REMARK       :客戶清冊                                  *
     A****************************************************************
     A                                      REF(WORF)
     A          R PH1                       SKIPB(2)
     A                                    61MSGCON(030 URE9999 REMF)
     A                                      SPACEA(1)
     A                                    70'客戶清冊'
     A                                      SPACEA(1)
     A                                     1'通　路'
     A                                    11':'
     A            DWE07S    R             12REFFLD(WE07)
     A                                    19'～'
     A            DWE07E    R             24REFFLD(WE07)
     A                                      SPACEA(1)
     A                                     1'型　態'
     A                                    11':'
     A            DWE08S    R             12REFFLD(WE08)
     A                                    19'～'
     A            DWE08E    R             24REFFLD(WE08)
     A                                      SPACEA(1)
     A                                     1'地　區'
     A                                    11':'
     A            DWE15S         1        12
     A                                    19'～'
     A            DWE15E         1        24
     A                                      SPACEA(1)
     A                                     1'區　域'
     A                                    11':'
     A            DWE11S         2        12
     A                                    19'～'
     A            DWE11E         2        24
     A                                    99'日期:'
     A            $EGMDY         6  0O   106EDTCDE(Y)
     A                                   116'頁次:'
     A                                   123PAGNBR EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     1'業務員'
     A                                    11':'
     A            DWE18S    R        O    12REFFLD(WE18)
     A                                    19'～'
     A            DWE18E    R        O    24REFFLD(WE18)
     A                                    99'時間:'
     A                                   106TIME
     A                                      SPACEA(1)
     A                                     1'客戶代號'
     A                                    11':'
     A            DWE01S    R        O    12REFFLD(WE01)
     A                                    19'～'
     A            DWE01E    R        O    24REFFLD(WE01)
     A                                    99' USER :'
     A            $USER         10   O   106
     A                                   117'<WOR100P>'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     1'客戶代號'
     A                                    12'客戶全稱'
     A                                    49'通路'
     A                                    56'型態'
     A                                    64'地區'
     A                                    71'地址'
     A                                   104'負責人'
     A                                   117'電話一'
     A                                      SPACEA(1)
     A                                    12'客戶簡稱'
     A                                    32'業務員'
     A                                    49'統一編號'
     A                                    64'區域'
     A                                   104'聯絡人'
     A                                   117'傳真機'
     A                                      SPACEA(1)
     A                                     1'------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------------------------+
     A                                       ------------'
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PD1
     A            WE01      R              2
     A            WE02      R             12
     A            WE07      R             51
     A            WE08      R             58
     A            WE10      R             66
     A            WE04      R             71
     A            WE12      R            104
     A            WE15      R            117
     A*----------------------------------------------------------------
     A                                      SPACEA(1)
     A            WE03      R             12
     A            WE18      R             32
     A            MC02      R             39REFFLD(MC02 MTMCPF)
     A            WE09      R             50
     A            WE11      R             66
     A            WE041     R             71
     A            WE13      R            104
     A            WE17      R            117
     A                                      SPACEA(1)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ============'
     A                                      SPACEA(1)
     A                                     2'<<WOR100>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                     3'もも此範圍無資料もも'
