     A*%%TS  SD  20110617  154501  CWDEV5      REL-V5R3M0  5722-WDS
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : INM000D                                    *
     A*    AUTHOR       : A1546   VINCENT HO                         *
     A*    CREATE DATE  : 97/09/16                                   *
     A*    UPDATE DATE  : 100/01/31 A1492 TERRY                      *
     A*    PROGRAM NAME : INM000C                                    *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :庫存管理系統主畫面                        *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  20110617  154501  CWDEV5      REL-V5R3M0  5722-WDS
     A                                      OVERLAY
     A                                  1  2'INM000'
     A                                  1 26MSGCON(030 USC9999 *LIBL/SCMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'庫存管理系統主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70DSPATR(UL)
     A                                  4  2'資料維護'
     A                                      DSPATR(UL)
     A                                  5  4'01.存貨調撥處理'
     A                                  6  4'02.進貨退出處理'
     A                                  7  4'03.陳列轉進貨處理'
     A                                  8  4'04.陳列品退出處理'
     A                                  9  4'05.存貨調整處理'
     A                                 10  4'06.產品成本調整處理'
     A                                 11  4'07.庫存月結處理'
     A                                 12  4'08.單據入庫處理'
     A                                 14  4'09.月結還原處理'
     A                                 15  4'10.盤點處理    '
     A                                  4 24'查詢作業'
     A                                      DSPATR(UL)
     A                                  5 26'11.未完成調撥單查詢'
     A                                  6 26'12.現場產品存貨查詢'
     A                                  7 26'13.現場分店存貨查詢'
     A                                  8 26'14.現場產品異動查詢'
     A                                  9 26'15.陳列轉進貨單查詢'
     A                                 10 26'16.陳列品退出單查詢'
     A                                 11 26'17.調撥單歷史查詢'
     A                                  4 48'報表作業'
     A                                      DSPATR(UL)
     A                                  5 50'21.帳列產品庫存金額表－依分店'
     A                                  6 50'22.帳列產品庫存金額表－依產品'
     A*                                 7 50'23.現場產品庫存表－依分店'
     A*                                 8 50'24.現場產品庫存表－依產品'
     A                                  9 50'25.月加權成本計算表'
     A                                 10 50'26.陳列轉進貨報表'
     A                                 11 50'27.陳列品退出報表'
     A                                 12 50'28.銷貨成本報表'
     A                                 14 50'30.現場產品庫存總表－依產品'
     A                                 15 50'31.現場產品庫存表－依分店'
     A                                 16 50'32.陳列品餘額彙總表－依供應商'
     A                                 17 50'33.陳列品使用明細表'
     A                                 18 50'34.產品異動報表'
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('01' '02' '03' '04' '05' '06-
     A                                      ' '07' '11' '12' '13' '14' '15' '21-
     A                                      ' '22' '23' '24' '25' '08' '16' '17-
     A                                      ' '26' '27'      '28' '10' '30' '32-
     A                                      ' '31' '33' '34')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 USC9998 *LIBL/SCMF)
     A                                      DSPATR(HI)
