     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    PRTF NAME    : INR070P                                    *
     A*    AUTHOR       : A1388  WIND                                *
     A*    CREATE DATE  : 2008/12/18                                 *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : INR070P                                    *
     A*    SYSTEM       :                                          *
     A*    SUBSYSTEM    :庫存系統                                  *
     A*    REMARK       :陳列品退出表                              *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A****************************************************************
     A                                      REF(SCWK10)
     A          R PH1
     A                                      SKIPB(002)
     A                                     1'<INR070P>'
     A                                    33MSGCON(030 USC9999 SCMF)
     A                                    73'日期:'
     A            $EGMDY         6  0O    +1EDTCDE(Y)
     A                                      SPACEA(001)
     A                                    40'陳列品退出表'
     A                                    73'時間:'
     A                                    +1TIME
     A                                      SPACEA(001)
     A                                    73'頁次:'
     A                                    +1PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1'公司代號:'
     A            DTL05     R        O    +1REFFLD(W1001)
     A            D#B03     R        O    +1REFFLD(#B03 PA#BPF)
     A                                    +3'通路代號:'
     A            DTL06S         2A  O    +1
     A                                    +1'-'
     A            DTL06E         2A  O    +1
     A                                    +1'分店代號:'
     A            DTL07S         5   O    +1
     A                                    +1'-'
     A            DTL07E         5   O    +1
     A                                      SPACEA(001)
     A                                     1'產品代號:'
     A            DTL02S         9   O    +1
     A                                    +1'-'
     A            DTL02E         9   O    +1
     A                                    +1'退出日期:'
     A            DTL08S         6S 0O    +1EDTCDE(Y)
     A                                    +1'-'
     A            DTL08E         6S 0O    +1EDTCDE(Y)
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ==================='
     A
     A                                      SPACEB(001)
     A                                     1'產品代號／名稱'
     A                                      SPACEB(001)
     A                                   +13'分店代號／名稱'
     A                                    +1'退出數量'
     A                                    +1'驗收單號'
     A                                    +5'陳列轉進貨單號'
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      -------------------'
     A
     A                                      SPACEB(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEB(001)
     A  30        W1002     R              2
     A  30        W1003     R             +1
     A  31        W1006     R             +1
     A  31        W1007     R             +1
     A            W1009     R             +2EDTCDE(J)
     A            W1010     R             +2
     A            W1011     R             +2
     A*----------------------------------------------------------------
     A          R PD2
     A                                      SPACEB(001)
     A                                    35'分店合計:'
     A            Q1             6S 0     +3EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD3
     A                                      SPACEB(001)
     A                                    35'產品合計:'
     A            Q2             6S 0     +3EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PD4
     A                                      SPACEB(001)
     A                                    35'總  計:'
     A            Q3             6S 0     +3EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEB(001)
     A                                     2
     A                                      '***續下頁***'
     A                                      SPACEB(001)
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEB(001)
     A                                     2
     A                                      '<<INR070P>>--->報表結束'
     A                                      SPACEB(001)
     A*----------------------------------------------------------------
     A          R PE3
     A                                     1'==================================-
     A                                      ===================================-
     A                                      ==================='
     A                                      SPACEB(001)
     A*----------------------------------------------------------------
     A          R PE9
     A                                      SPACEB(001)
     A                                     3
     A                                      'もも此範圍無資料もも'
