     A*%%TS  SD  19961204  154547  D910454     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : MAM000D                                    *
     A*    AUTHOR       : A1546   VINCENT HO                         *
     A*    CREATE DATE  : 97/09/16                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : MAM000C                                    *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :主檔資料維護主畫面                        *
     A*    REMARK       :主畫面                                    *
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19961204  154547  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'MAM000'
     A                                  1 26MSGCON(030 USC9999 *LIBL/SCMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'主檔資料維護主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  5  5'01.貨運站基本資料'
     A                                  6  5'02.供應商基本資料'
     A                                  7  5'03.產品基本資料'
     A                                  8  5'04.銷售通路基本資料'
     A                                  9  5'05.銷售通路分店資料'
     A                                 10  5'06.前台人員資料'
     A                                 11  5'07.銷售區碼資料'
     A                                 13  5'11.代碼資料'
     A                                 14  5'12.休假日期資料'
     A                                 15  5'13.網頁人員鎖定解除'
     A                                 16  5'14.網頁暫存資料清除'
     A                                  5 29'21.單件運費資料'
     A                                  6 29'22.最低運費資料'
     A                                  7 29'23.銷售區碼與分店對照'
     A                                  8 29'24.等級與貨架對照資料'
     A                                  9 29'25.貨架與產品對照資料'
     A                                 10 29'26.通路分店對照資料'
     A                                 11 29'27.通路產品對照資料'
     A                                 12 29'28.分店與科目對照資料'
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('01' '02' '03' '04' '05' '06-
     A                                      ' '07' '11' '12' '21' '22' '23' '24-
     A                                      ' '25' '26' '27' '28' '13' '14')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 USC9998 *LIBL/SCMF)
     A                                      DSPATR(HI)
