     A                                      REF(SCRF)
     A          R PH1A
     A                                      SKIPB(002)
     A                                     1
     A                                      '<PUC0412>'
     A                                    30
     A                                      MSGCON(030 USC9999 SCMF)
     A                                    72
     A                                      '日期:'
     A            $EGMDY         6  0O    80
     A                                      EDTCDE(Y)
     A                                      SPACEA(001)
     A                                    36
     A                                      '最低運費異常表'
     A                                    72
     A                                      '時間:'
     A                                    80
     A                                      TIME
     A                                      SPACEA(001)
     A                                    72
     A                                      '頁次:'
     A                                    80
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A                                     1
     A                                      '公司別:'
     A            DCK01     R        O    +1
     A                                      REFFLD(CK01)
     A            D#B03     R        O    +1
     A                                      REFFLD(#B03 PA#BPF)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==============================='
     A                                      SPACEA(001)
     A                                      SPACEB(001)
     A                                     1
     A                                      '通路別'
     A                                    10
     A                                      '供應商'
     A                                    19
     A                                      '到分店日'
     A                                    31
     A                                      '批號'
     A                                    46
     A                                      '分店'
     A                                    54
     A                                      '區碼'
     A                                    61
     A                                      '到'
     A                                    66
     A                                      '區碼'
     A                                    74
     A                                      '實際箱數'
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      -------------------------------'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1A
     A                                      SPACEA(001)
     A            CK02      R              4
     A            CK08      R             11
     A            SCK04     R   -2        20EDTCDE(Y)
     A                                      REFFLD(CK04 POCKPF)
     A            CK05      R             31
     A            CK10      R             47
     A            CK07      R             57
     A            CK09      R             68
     A            CK12      R             76
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PE1A
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==============================='
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2A
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==============================='
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<PUC0411>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE3A
     A                                      SPACEA(001)
