     A*%%TS  SD  19961204  154547  D910454     REL-V3R1M0  5763-PW1
     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*--------------------------------------------------------------*
     A*    DSPF NAME    : PUM000D                                    *
     A*    AUTHOR       : A1546   VINCENT HO                         *
     A*    CREATE DATE  : 97/09/16                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : PUM000C                                    *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :採購管理系統主畫面                        *
     A*    REMARK       :主畫面                                    *
     A*---------------------------------------------------------------
     A*00A需求單號: 1080981
     A*00A  108/08/12 CAROL新增採購單查詢-採購單號               *
     A*---------------------------------------------------------------
     A****************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      MSGLOC(24)
     A                                      PRINT
     A                                      CA03(03)
     A          R DSPC1
     A*%%TS  SD  19961204  154547  D910454     REL-V3R1M0  5763-PW1
     A                                      OVERLAY
     A                                  1  2'PUM000'
     A                                  1 26MSGCON(030 USC9999 *LIBL/SCMF)
     A                                      DSPATR(HI)
     A                                  1 62'日期:'
     A            $EGMDY         6Y 0O  1 70EDTCDE(Y)
     A                                  2  2'SCR001'
     A                                  2 30'採購管理系統主畫面'
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 62'時間:'
     A                                  2 70TIME
     A                                      EDTWRD('  :  :  ')
     A                                  3 62' USER :'
     A            $USER         10A  O  3 70
     A                                      DSPATR(UL)
     A                                  4  2'供應商產品報價作業'
     A                                      DSPATR(UL)
     A                                  5  4'01.產品年度基本報價複製'
     A                                  6  4'02.供應商產品報價單維護'
     A                                  7  4'03.供應商產品報價單核准'
     A                                  8  4'04.供應商產品報價查詢'
     A                                 11  2'訂貨單作業'
     A                                      DSPATR(UL)
     A                                 12  4'11.前台訂貨單轉後台處理'
     A                                 13  4'12.訂貨單維護'
     A                                 14  4'13.訂貨單審核作業'
     A                                 15  4'14.訂貨單核准作業'
     A                                 16  4'15.訂貨單歷史查詢'
 00B+A                                 17  4'16.訂貨單取消核准作業'
 00B+A                                 18  4'17.缺貨資料維護'
     A                                  4 30'採購單作業'
     A                                      DSPATR(UL)
     A                                  5 32'21.採購批次處理'
     A                                  6 32'22.採購單寄出作業'
     A                                  7 32'23.應到貨箱數表寄出'
     A                                  8 32'24.採購單查詢'
 00A+A                                  9 32'25.採購單查詢-採購單號'
     A                                 11 30'驗收單作業'
     A                                      DSPATR(UL)
     A                                 12 32'31.驗收單維護'
     A                                 13 32'32.異常驗收單審核'
     A                                 14 32'33.補增驗收單維護'
     A                                 15 32'34.貨運實際箱數維護'
     A                                 16 32'35.未完成驗收單號查詢'
     A                                 17 32'36.驗收單歷史查詢'
     A                                  5 56'41.運費月結處理'
     A                                  7 56'42.採購報表作業'
     A                                 21 30'請輸入選擇項目:'
     A            DOPID          2A  B 21 48DSPATR(UL)
     A                                      VALUES('01' '02' '03' '04' '11' '12-
     A                                      ' '13' '14' '15' '21' '22' '23' '24-
     A                                      ' '31' '32' '33' '34' '35' '36' '41-
 00B-A*                                     ' '42' '25')
 00B+A                                      ' '42' '25' '16' '17')
     A                                 22  2'執行'
     A                                 22 10'F3 =回主畫面'
     A  98        ERR1          60A  O 24  2MSGID(UPT 2023 PTMF)
     A                                      DSPATR(HI)
     A                                 24 66MSGCON(014 USC9998 *LIBL/SCMF)
     A                                      DSPATR(HI)
