     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A*    AUTHOR       : A1546 VINCENT                              *
     A*    CREATE DATE  : 98/09/16                                   *
     A*    UPDATE DATE  :                                            *
     A*    PROGRAM NAME : SEH001P                                    *
     A*    SYSTEM       :西祺進銷存                                *
     A*    SUBSYSTEM    :庫存管理系統                              *
     A*    REMARK       :通路銷售資料上傳錯誤記錄表                *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
     A****************************************************************
     A          R PH1
     A                                      SKIPB(002)
     A                                    27
     A                                      MSGCON(030 USC9999 SCMF)
     A                                      SPACEA(001)
     A                                    31
     A                                      '銷售上傳錯誤記錄表'
     A                                      SPACEA(002)
     A                                    51
     A                                      '日期:'
     A            $DATE          6  0O    59
     A                                      EDTCDE(Y)
     A                                    68
     A                                      '頁次:'
     A                                    76
     A                                      PAGNBR
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A*                                    1
     A*                                     '處理訖日:'
     A*           PDATE          6  0O    13
     A*                                     EDTCDE(Y)
     A                                    51
     A                                      '時間:'
     A                                    59
     A                                      TIME
     A                                    70
     A                                      '<SEH001P>'
     A                                      SPACEA(001)
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==========='
     A                                      SPACEA(001)
     A                                     1
     A                                      '錯誤代號'
     A                                    +4
     A                                      '錯誤原因'
     A                                      SPACEA(001)
     A                                     1
     A                                      '-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      SPACEA(001)
     A*----------------------------------------------------------------
     A          R PD1
     A                                      SPACEA(001)
     A            PFD1          11         2
     A            PERR          42        +2
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==========='
     A                                      SPACEA(001)
     A                                     2
     A                                      '***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1
     A                                      '==================================-
     A                                      ===================================-
     A                                      ==========='
     A                                      SPACEA(001)
     A                                     2
     A                                      '<<SEH001P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE31
     A                                      SPACEA(001)
     A                                     3
     A                                      'もも無錯誤記錄'
