     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : VOU0022
     A*    PROGRAM NAME : 傳票採購成本表
     A*    AUTHOR       : CAROL HUANG
     A*    CREATE DATE  : 2010.02.01
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A*===============================================================
     A* CODE |  AUTHOR  |  DATE  | DESCTIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
     A****************************************************************
     A                                      REF(SCRF)
     A          R PH1                       SKIPB(2)
     A                                    35MSGCON(030 USC9999 SCMF)
     A                                      SPACEA(1)
     A                                    39'  傳票採購成本表'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            COM            1A       13
     A            #B03      R             +1REFFLD(#B03  *LIBL/PA#BPF)
     A                                    87'日期:'
     A            $EGMDY         6  0     95EDTCDE(Y)
     A                                   104'頁次:'
     A                                   112PAGNBR
     A                                      SPACEA(1)
     A                                     1'通路別　:'
     A            CL02      R     A       13REFFLD(CL02)
     A            ND04      R             +1REFFLD(ND04)
     A                                    87'時間:'
     A                                    95TIME
     A                                      EDTWRD('  :  :  ')
     A                                   104'<VOU0022P>'
     A                                      SPACEA(1)
     A                                     1'帳務月份:'
     A            D05            4  0     13EDTWRD('  /  ')
     A                                    87' USER :'
     A            $USER         10A       95
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==========+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     1'供應商/名稱'
     A                                    22'確認日期'
     A                                    34'確認單號'
     A                                    46'驗收單號'
     A                                    57'產品代號/名稱'
     A                                    78'數量'
     A                                    91'金額'
     A                                   107'稅額'
     A                                   115'分店代號'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==========+
     A                                       ========================='
     A                                      SPACEA(1)
     A*
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
     A            CM02      R              3REFFLD(CM02)
     A            NB03      R            + 1REFFLD(NB03)
     A            CL07      R            + 1REFFLD(CL07)
     A                                      EDTWRD('    /  /  ')
     A            CM01      R            + 1REFFLD(CM01)
     A            CM03      R            + 1REFFLD(CM03)
     A            NC05      R            + 1REFFLD(NC05)
     A            CM06      R             76REFFLD(CM06)
     A                                      EDTCDE(J)
     A            CM08      R             85REFFLD(CM08)
     A                                      EDTCDE(J)
     A            CM09      R            101REFFLD(CM09)
     A                                      EDTCDE(J)
     A            CL04      R            118REFFLD(CL04)
     A*
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    50'單號小計 ------------>'
     A            T1CM06    R             76REFFLD(CM06)
     A                                      EDTCDE(J)
     A            T1CM08    R             85REFFLD(CM08)
     A                                      EDTCDE(J)
     A            T1CM09    R            101REFFLD(CM09)
     A                                      EDTCDE(J)
     A*
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    50'供應商小計----------->'
     A            T2CM06    R             76REFFLD(CM06)
     A                                      EDTCDE(J)
     A            T2CM08    R             85REFFLD(CM08)
     A                                      EDTCDE(J)
     A            T2CM09    R            101REFFLD(CM09)
     A                                      EDTCDE(J)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    50'總  計------------->'
     A            T3CM06    R             76REFFLD(CM06)
     A                                      EDTCDE(J)
     A            T3CM08    R             85REFFLD(CM08)
     A                                      EDTCDE(J)
     A            T3CM09    R            101REFFLD(CM09)
     A                                      EDTCDE(J)
     A                                      SPACEA(1)
     A*                                    1'------------------------------+
     A*                                      ------------------------------+
     A*                                      ------------------------------+
     A*                                      ----------+
     A*                                      -------------------------'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==========+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ==========+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'<<VOU0022P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
