     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : VOU0042
     A*    PROGRAM NAME : 進貨退出成本表
     A*    AUTHOR       : CAROL HUANG
     A*    CREATE DATE  : 2010.02.01
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A*===============================================================
     A* CODE |  AUTHOR  |  DATE  | DESCTIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
     A****************************************************************
     A                                      REF(SCRF)
     A          R PH1                       SKIPB(2)
     A                                    35MSGCON(030 USC9999 SCMF)
     A                                      SPACEA(1)
     A                                    39'傳票進貨退出成本表'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            COM            1A       13
     A            #B03      R             +1REFFLD(#B03  *LIBL/PA#BPF)
     A                                    97'日期:'
     A            $EGMDY         6  0    105EDTCDE(Y)
     A                                   114'頁次:'
     A                                   122PAGNBR
     A                                      SPACEA(1)
     A                                     1'通路別　:'
     A            TE02      R     A       13REFFLD(TE02)
     A            ND04      R             +1REFFLD(ND04)
     A                                    97'時間:'
     A                                   105TIME
     A                                      EDTWRD('  :  :  ')
     A                                   114'<VOU0042P>'
     A                                      SPACEA(1)
     A                                     1'帳務月份:'
     A            D05            4  0     13EDTWRD('  /  ')
     A                                    97' USER :'
     A            $USER         10A      105
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===============+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     1'供應商/名稱'
     A                                    22'退出日期'
     A                                    34'單據號碼'
     A*                                   46'驗收單號'
     A                                    46'產品代號/名稱'
     A                                    77'數量'
     A                                    95'金額'
     A                                   113'稅額'
     A                                   120'分店代號'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===============+
     A                                       ========================='
     A                                      SPACEA(1)
     A*
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
     A            TF02      R              3REFFLD(TF02)
     A            NB03      R            + 1REFFLD(NB03)
     A            TE03      R            + 1REFFLD(TE03)
     A                                      EDTWRD('    /  /  ')
     A            TF01      R            + 1REFFLD(TF01)
     A            TF03      R            + 1REFFLD(TF03)
     A            NC05      R            + 1REFFLD(NC05)
     A            TF04      R            + 1REFFLD(TF04)
     A                                      EDTCDE(1)
     A            @WCOST    R            + 1REFFLD(@WCOST *LIBL/WFJR15PF)
     A                                      EDTCDE(1)
     A            @COST1    R            + 1REFFLD(@COST1 *LIBL/WFJR15PF)
     A                                      EDTCDE(1)
     A            TE04      R            123REFFLD(TE04)
     A*
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    50'單號小計 ------------>'
     A            T1TF04    R             76REFFLD(TF04)
     A                                      EDTCDE(1)
     A            T1COST    R             83REFFLD(@WCOST *LIBL/WFJR15PF)
     A                                      EDTCDE(1)
     A            T1CST1    R            101REFFLD(@COST1 *LIBL/WFJR15PF)
     A                                      EDTCDE(1)
     A*
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    50'供應商小計----------->'
     A            T2TF04    R             76REFFLD(TF04)
     A                                      EDTCDE(1)
     A            T2COST    R             83REFFLD(@WCOST  *LIBL/WFJR15PF)
     A                                      EDTCDE(1)
     A            T2CST1    R            101REFFLD(@COST1 *LIBL/WFJR15PF)
     A                                      EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    50'總  計------------->'
     A            T3TF04    R             76REFFLD(TF04)
     A                                      EDTCDE(1)
     A            T3COST    R             83REFFLD(@WCOST  *LIBL/WFJR15PF)
     A                                      EDTCDE(1)
     A            T3CST1    R            101REFFLD(@COST1 *LIBL/WFJR15PF)
     A                                      EDTCDE(1)
     A                                      SPACEA(1)
     A*                                    1'------------------------------+
     A*                                      ------------------------------+
     A*                                      ------------------------------+
     A*                                      ---------------+
     A*                                      -------------------------'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===============+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===============+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'<<VOU0042P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
