     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250
     A*
     A*    PROGRAM ID   : VOU0052
     A*    PROGRAM NAME : 傳票陳列轉進貨成本表
     A*    AUTHOR       : CAROL HUANG
     A*    CREATE DATE  : 2010.02.01
     A*    UPDATE DATE  :
     A*    SYSTEM       : 進銷存收TO總帳
     A*===============================================================
     A* CODE |  AUTHOR  |  DATE  | DESCTIPTION
     A*---------------------------------------------------------------
     A*---------------------------------------------------------------
     A****************************************************************
     A                                      REF(SCRF)
     A          R PH1                       SKIPB(2)
     A                                    35MSGCON(030 USC9999 SCMF)
     A                                      SPACEA(1)
     A                                    38'傳票陳列轉進貨成本表'
     A                                      SPACEA(2)
     A                                     1'公司別　:'
     A            COM            1A       13
     A            #B03      R             +1REFFLD(#B03  *LIBL/PA#BPF)
     A                                    97'日期:'
     A            $EGMDY         6  0    105EDTCDE(Y)
     A                                   114'頁次:'
     A                                   122PAGNBR
     A                                      SPACEA(1)
     A                                     1'通路別　:'
     A            TG02      R     A       13REFFLD(TG02)
     A            ND04      R             +1REFFLD(ND04)
     A                                    97'時間:'
     A                                   105TIME
     A                                      EDTWRD('  :  :  ')
     A                                   114'<VOU0052P>'
     A                                      SPACEA(1)
     A                                     1'帳務月份:'
     A            D05            4  0     13EDTWRD('  /  ')
     A                                    97' USER :'
     A            $USER         10A      105
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===============+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     1'供應商/名稱'
     A                                    22'確認日期'
     A                                    34'確認單號'
     A                                    46'驗收單號'
     A                                    57'產品代號/名稱'
     A                                    77'數量'
     A                                    95'金額'
     A                                   113'稅額'
     A                                   120'分店代號'
     A                                      SPACEA(1)
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===============+
     A                                       ========================='
     A                                      SPACEA(1)
     A*
     A          R PD1                       SPACEA(1)
     A  20                                 1' '
     A                                      SPACEA(1)
     A            TG06      R              3REFFLD(TG06)
     A            NB03      R            + 1REFFLD(NB03)
     A            TG03      R            + 1REFFLD(TG03)
     A                                      EDTWRD('    /  /  ')
     A            TH01      R            + 1REFFLD(TH01)
     A            TH02      R            + 1REFFLD(TH02)
     A            NC05      R            + 1REFFLD(NC05)
     A            TH03      R            + 1REFFLD(TH03)
     A                                      EDTCDE(1)
     A            WCOST     R            + 1REFFLD(WCOST *LIBL/WFJR16PF)
     A                                      EDTCDE(1)
     A            WCOST1    R            + 1REFFLD(WCOST1 *LIBL/WFJR16PF)
     A                                      EDTCDE(1)
     A            TH08      R            123REFFLD(TH08)
     A*
     A*----------------------------------------------------------------
     A          R PT1                       SPACEA(1)
     A                                    50'單號小計 ------------>'
     A            T1TH03    R             76REFFLD(TH03)
     A                                      EDTCDE(1)
     A            T1COST    R             84REFFLD(WCOST  *LIBL/WFJR16PF)
     A                                      EDTCDE(1)
     A            T1CST1    R            102REFFLD(WCOST1 *LIBL/WFJR16PF)
     A                                      EDTCDE(1)
     A*
     A*----------------------------------------------------------------
     A          R PT2                       SPACEA(1)
     A                                    50'供應商小計----------->'
     A            T2TH03    R             76REFFLD(TH03)
     A                                      EDTCDE(1)
     A            T2COST    R             84REFFLD(WCOST  *LIBL/WFJR16PF)
     A                                      EDTCDE(1)
     A            T2CST1    R            102REFFLD(WCOST1 *LIBL/WFJR16PF)
     A                                      EDTCDE(1)
     A*----------------------------------------------------------------
     A          R PT3                       SPACEA(1)
     A                                    50'總  計------------->'
     A            T3TH03    R             76REFFLD(TH03)
     A                                      EDTCDE(1)
     A            T3COST    R             84REFFLD(WCOST  *LIBL/WFJR16PF)
     A                                      EDTCDE(1)
     A            T3CST1    R            102REFFLD(WCOST1 *LIBL/WFJR16PF)
     A                                      EDTCDE(1)
     A                                      SPACEA(1)
     A*                                    1'------------------------------+
     A*                                      ------------------------------+
     A*                                      ------------------------------+
     A*                                      ---------------+
     A*                                      -------------------------'
     A*----------------------------------------------------------------
     A          R PE1
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===============+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'***續下頁***'
     A*----------------------------------------------------------------
     A          R PE2
     A                                     1'==============================+
     A                                       ==============================+
     A                                       ==============================+
     A                                       ===============+
     A                                       ========================='
     A                                      SPACEA(1)
     A                                     2'<<VOU0052P>>--->報表結束'
     A*----------------------------------------------------------------
     A          R PE9                       SPACEA(1)
     A                                    16'無符合列印範圍之資料'
