     FGRID3D  CF  E                    WORKSTN
     C                     CALL 'GRID2'
     C                     PARM           GDATA
     C                     PARM           GCODE
     C           TAGXX     TAG
     C                     WRITEDD1
     C                     WRITEGSET
     C                     EXFMTDD1
     C*          *IN03     IFEQ '1'
     C                     SETON                     LR
     C   LR                RETRN
     C*                    ELSE
     C*                    GOTO TAGXX
     C*                    END
