      ****************************************************************
      * PROGRAM ID : P08                                             *
      * SYSTEM ID  : PTPLIB                                          *
      * FUNTCTION  :驗証時間                                       *
      *                                                              *
      * PARAMETER : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   P0801I    I   *DEC(P) 4 0  HHMM(小時分鐘) *
      *             02   P0811O    O   *CHAR   1   驗証結果...     *
      *                                             Y=OK , N =ERROR  *
      ****************************************************************
     I            DS
     I                                        1   40I1
     I                                        1   20H
     I                                        3   40M
      *--------------------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P0801I  40
     C                     PARM           P0811O  1
      *--------------------------------------------------------------*
      *                    MAIN PROGRAM                              *
      *--------------------------------------------------------------*
     C                     MOVE 'Y'       P0811O                       UC
     C                     Z-ADDP0801I    I1                           UC
      *
     C                     CALL 'R@S005'
     C                     PARM 'GIANT/PT'S0051I  8
      *
     C           I1        IFLT 0
     C                     MOVE 'N'       P0811O
     C                     END
      *
     C           H         IFLT 0
     C           H         ORGT 24
     C                     MOVE 'N'       P0811O
     C                     END
      *
     C           M         IFLT 0
     C           M         ORGE 60
     C                     MOVE 'N'       P0811O
     C                     END
      *
     C           H         IFEQ 24
     C           M         ANDNE0
     C                     MOVE 'N'       P0811O
     C                     END
      *
     C                     SETON                     LR
     C                     RETRN
