     FP31D    CF  E                    WORKSTN
  01-C           *IN03     DOWEQ'0'
    C                     EXFMTDSPC1
    C                     MOVEA*ALL'0'   *IN,60
    C                     CALL 'P31'
    C                     PARM D01       P3401I  80
    C                     PARM D02       P3402I  1
    C                     PARM D03       P3403I  1
    C                     PARM D04       P3404I  1
    C                     PARM D05       P3405I  1
    C           D06       PARM           P3411O  80
  01-C                     END
     C                     SETON                     LR
