      ****************************************************************
      * PROGRAM ID : P31                                             *
      * SYSTEM ID  : PTPLIB                                          *
      * FUNTCTION  :日期格式轉換（中西）                           *
      *                                                              *
      * PARAMETER : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   P3101I    I   *DEC    8 0  輸入年月日     *
      *             02   P3102I    I   *CHAR   1    原始日期格式   *
      *                                              '1'=00YYMMDD    *
      *                                              '2'=YYYYMMDD    *
      *                                              '3'=00MMDDYY    *
      *                                              '4'=MMDDYYYY    *
      *                                              '5'=00DDMMYY    *
      *                                              '6'=DDMMYYYY    *
      *             03   P3103I    I   *CHAR   1    原始曆別       *
      *                                             '1':西曆       *
      *                                             '2':國曆       *
      *             04   P3104I    I   *CHAR   1    轉換後日期格式 *
      *             05   P3105I    I   *CHAR   1    轉換後曆別     *
      *             06   P3111O    O   *DEC    8 0  轉換後日期     *
      *                                             Y=OK , N =ERROR  *
      *                                                              *
      * W-VARABLE : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   P3101     N   *DEC    4 0 原始西元年      *
      *             02   P3102     N   *DEC    2 0 原始月份        *
      *             03   P3103     N   *DEC    2 0 原始日期        *
      *             04   P3104     N   *DEC    8 0 轉換後日期      *
      *             05   P3105     N   *CHAR   1   日期格式        *
      *             06   P3106     N   *CHAR   1   曆別            *
      *
      ****************************************************************
     E* WFV   :日期格式VALUE
     E                    WFV     6   6  1
     I            DS
     I                                        1   80WDATE
     I                                        1   20WD1
     I                                        3   40WD2
     I                                        5   60WD3
     I                                        7   80WD4
     I            DS
     I                                        1   80WYMD
     I                                        1   20WY1
     I                                        3   40WY2
     I                                        5   60WY3
     I                                        7   80WY4
      *--------------------------------------------------------------*
      *                    MAIN PROGRAM                              *
      *--------------------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P3101I  80
     C                     PARM           P3102I  1
     C                     PARM           P3103I  1
     C                     PARM           P3104I  1
     C                     PARM           P3105I  1
     C                     PARM           P3111O  80
     C*最高機密
     C****                 CALL 'R@S005'
     C****                 PARM 'GIANT/PT'S0051I  8
     C*
     C                     EXSR P31CHK                     *CHK中西曆
  01-C           *IN99     IFEQ '1'
    C                     Z-ADD0         P3104
  01-C                     END
     C   99                GOTO QUIT
     C*
     C                     Z-ADDP3101I    @DATE   80
     C                     MOVE P3102I    @FMT    1
     C                     MOVE P3103I    @CALD   1
     C                     EXSR @@YMD
     C*
     C                     Z-ADDWYYYY     P3101   40
     C                     Z-ADDWMM       P3102   20
     C                     Z-ADDWDD       P3103   20
     C*
     C                     EXSR P31CVD                     *CVD DATE
     C*
     C           QUIT      TAG
     C                     MOVE P3104     P3111O
     C                     SETON                     LR
     C/COPY QRPGSRC,@CHECK
      *--------------------------------------------------------------*
      *                 P31CHK....CHECK中西曆及輸入格式
      *--------------------------------------------------------------*
01===C           P31CHK    BEGSR
|    C*
|    C                     MOVE P3103I    @CALD
|    C                     MOVE P3102I    @FMT
|    C                     EXSR @@CHK
|    C   99                GOTO ERROR
|    C*
|    C                     MOVE P3105I    @CALD
|    C                     MOVE P3104I    @FMT
|    C                     EXSR @@CHK
|    C   99                GOTO ERROR
|    C*
|    C*
01===C           ERROR     ENDSR
      *--------------------------------------------------------------*
      *                 P31CVD....轉換日期
      *--------------------------------------------------------------*
02===C           P31CVD    BEGSR
|    C*
| 01-C           P3105I    IFEQ '1'                        *西曆
|   C*
| 02-C           P3104I    IFEQ '1'                        *00YYMMDD
|   C                     Z-ADD0         WY1
|   C                     Z-ADDP3101     WY2
|   C                     Z-ADDP3102     WY3
|   C                     Z-ADDP3103     WY4
| 02-C                     END
|   C*
| 03-C           P3104I    IFEQ '2'                        *YYYYMMDD
|   C                     MOVELP3101     WY1
|   C                     MOVE P3101     WY2
|   C                     Z-ADDP3102     WY3
|   C                     Z-ADDP3103     WY4
| 03-C                     END
|   C*
| 04-C           P3104I    IFEQ '3'                        *00MMDDYY
|   C                     Z-ADD0         WY1
|   C                     Z-ADDP3102     WY2
|   C                     Z-ADDP3103     WY3
|   C                     Z-ADDP3101     WY4
| 04-C                     END
|   C*
| 05-C           P3104I    IFEQ '4'                        *MMDDYYYY
|   C                     Z-ADDP3102     WY1
|   C                     Z-ADDP3103     WY2
|   C                     MOVELP3101     WY3
|   C                     MOVE P3101     WY4
| 05-C                     END
|   C*
| 06-C           P3104I    IFEQ '5'                        *00DDMMYY
|   C                     Z-ADD0         WY1
|   C                     Z-ADDP3103     WY2
|   C                     Z-ADDP3102     WY3
|   C                     Z-ADDP3101     WY4
| 06-C                     END
|   C*
| 07-C           P3104I    IFEQ '6'                        *DDMMYYYY
|   C                     Z-ADDP3103     WY1
|   C                     Z-ADDP3102     WY2
|   C                     MOVELP3101     WY3
|   C                     MOVE P3101     WY4
| 07-C                     END
|   C*
| 01-C                     END
|    C*
| 08-C           P3105I    IFEQ '2'                        *中曆
|   C           P3104I    ANDEQ'2'                        *YYYYMMDD
|   C                     SUB  1911      P3101
|   C                     MOVELP3101     WY1
|   C                     MOVE P3101     WY2
|   C                     Z-ADDP3102     WY3
|   C                     Z-ADDP3103     WY4
| 08-C                     END
|    C*
|    C                     Z-ADDWYMD      P3104   80
02===C                     ENDSR
      *--------------------------------------------------------------*
** <<日期格式>>VALUE
123456
