     FP34D    CF  E                    WORKSTN
  01-C           *IN03     DOWEQ'0'
    C                     EXFMTDSPC1
    C                     MOVEA*ALL'0'   *IN,60
    C                     CALL 'P34'
    C                     PARM D01       P3401I  60
    C                     PARM D02       P3403I  1
    C                     PARM D03       P3404I  1
    C           D04       PARM           P3411O  1
    C           D05       PARM           P3412O  20
    C*
  01-C                     END
     C                     SETON                     LR
