      ****************************************************************
      *    PROGRAM ID   : P36                                        *
      *    SYSTEM  ID   : PTPLIB                                     *
      *    FUNCTION     :轉換日期為西元簡寫日期                    *
      *                                                              *
      * PARAMETER : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   P3601I    I   *DEC    8 0  輸入年月日     *
      *             01   P3602I    I   *CHAR   1    日期格式       *
      *                                              '1'=00YYMMDD    *
      *                                              '2'=YYYYMMDD    *
      *                                              '3'=00MMDDYY    *
      *                                              '4'=MMDDYYYY    *
      *                                              '5'=00DDMMYY    *
      *                                              '6'=DDMMYYYY    *
      *             01   P3603I    I   *CHAR   1    曆別           *
      *                                             '1':西曆       *
      *                                             '2':國曆       *
      *             02   P3611O    O   *CHAR  13   轉換結果        *
      *                                                              *
      * W-VARABLE : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   P3601     N   *DEC    4 0 西元年          *
      *             02   P3602     N   *DEC    2 0 月份            *
      *             03   P3603     N   *DEC    2 0 日期            *
      *                                                              *
      ****************************************************************
      * WMV 月份VALUE
      * WMF :月份簡寫
     E* WFV :日期格式VALUE
     E                    WMV    12  12  2 0
     E                    WMF    12  12  4
     E                    WFV     6   6  1
     I*
     I            DS
     I                                        1   80WDATE
     I                                        1   20WD1
     I                                        3   40WD2
     I                                        5   60WD3
     I                                        7   80WD4
     IWRST        DS
     I                                        1   4 WR1
     I                                        5   5 WR2
     I                                        6   70WR3
     I                                        8   9 WR4
     I                                       10  130WR5
      *--------------------------------------------------------------*
      *                    MAIN PROGRAM                              *
      *--------------------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P3601I  80
     C                     PARM           P3602I  1
     C                     PARM           P3603I  1
     C                     PARM           P3611O 13
      *最高機密
     C                     CALL 'R@S005'
     C                     PARM 'GIANT/PT'S0051I  8
      *
     C                     Z-ADDP3601I    @DATE   80
     C                     MOVE P3602I    @FMT    1
     C                     MOVE P3603I    @CALD   1
      *
     C                     EXSR @@CHK                      *CHK中西曆
     C           *IN99     IFEQ '1'
     C                     MOVE *BLANKS   P3607  13
     C                     GOTO QUIT
     C                     END
     C                     EXSR @@YMD                      *GET年月日
      *
     C                     Z-ADDWYYYY     P3601   40
     C                     Z-ADDWMM       P3602   20
     C                     Z-ADDWDD       P3603   20
      *
     C                     EXSR P36GSM                     *CHK MM,DD
      *
     C           QUIT      TAG
     C                     MOVE P3607     P3611O
     C                     SETON                     LR
     C/COPY QRPGSRC,@CHECK
      *--------------------------------------------------------------*
      *          P36GSM....GET 簡寫之年月日
      *--------------------------------------------------------------*
04===C           P36GSM    BEGSR
     C*
     C                     Z-ADD1         J       20
     C           P3602     LOKUPWMV,J                    40
     C           *IN40     IFEQ '1'
     C                     MOVE WMF,J     WR1
     C                     END
     C*
     C                     MOVE *BLANKS   WR2
     C                     Z-ADDP3603     WR3
     C                     MOVE ', '      WR4
     C                     Z-ADDP3601     WR5
     C*
     C                     MOVE WRST      P3607
     C*
04===C                     ENDSR
      *--------------------------------------------------------------*
**
010203040506070809101112
**
JAN.FEB.MAR.APR.MAY.JUN.JUL.AUG.SEP.OCT.NOV.DEC.
** <<日期格式>>VALUE
123456
