     FP36D    CF  E                    WORKSTN
  01-C           *IN03     DOWEQ'0'
    C                     EXFMTDSPC1
    C                     MOVEA*ALL'0'   *IN,60
    C                     CALL 'P36'
    C                     PARM D01       P3601I  80
    C                     PARM D02       P3602I  1
    C                     PARM D03       P3603I  1
    C           D04       PARM           P3611O 13
    C*
  01-C                     END
     C                     SETON                     LR
