      ****************************************************************
      * PROGRAM ID : P38                                             *
      * SYSTEM ID  : PTPLIB                                          *
      * FUNTCTION  :驗証月份（中西曆）                             *
      *                                                              *
      * PARAMETER : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   P3801I    I   *DEC    6 0  輸入年月       *
      *             02   P3802I    I   *CHAR   1    日期格式       *
      *                                              '1'=00YYMM      *
      *                                              '2'=YYYYMM      *
      *                                              '3'=00MMYY      *
      *                                              '4'=MMYYYY      *
      *                                              '5'=00MMYY      *
      *                                              '6'=MMYYYY      *
      *             03   P3803I    I   *CHAR   1    曆別           *
      *                                             '1':西曆       *
      *                                             '2':國曆       *
      *             04   P3801O    I   *DEC    6 0  轉出年月YYYYMM *
      *             05   P3811O    O   *CHAR   1   驗証結果...     *
      *                                             Y=OK , N =ERROR  *
      ****************************************************************
     E* WFV   :日期格式VALUE
     E                    WFV     6   6  1
      *
     I            DS
     I                                        1   60WDATE
     I                                        1   20WD1
     I                                        3   40WD2
     I                                        5   60WD3
      *--------------------------------------------------------------*
      *                    MAIN PROGRAM                              *
      *--------------------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P3801I  60
     C                     PARM           P3802I  1
     C                     PARM           P3803I  1
     C                     PARM           P3801O  60
     C                     PARM           P3811O  1
      *最高機密
     C                     CALL 'R@S005'
     C                     PARM 'GIANT/PT'S0051I  8
      *CLEAR OUTPUT FIELD
     C                     MOVEL'Y'       P3811O
     C                     Z-ADD*ZERO     P3801O
     C*
     C                     Z-ADDP3801I    @DATE   60
     C                     MOVE P3802I    @FMT    1
     C                     MOVE P3803I    @CALD   1
      *
     C                     EXSR @@CHK                      *CHK中西曆
     C           *IN99     IFEQ '1'
     C                     MOVE 'N'       P3811O
     C                     GOTO QUIT
     C                     END
     C                     EXSR @@YMD                      *GET年月
| 02-C           @FMT      IFEQ '3'
     C           @FMT      OREQ '5'
     C           WD1       IFNE *ZERO
|   C                     MOVE 'N'       P3811O
     C                     GOTO QUIT
     C                     END
     C                     END
      *
      *CHECK MONTH
| 01-C           WMM       IFGT 12
|   C           WMM       ORLE 0
|   C                     MOVE 'N'       P3811O
     C                     GOTO QUIT
     C                     END
      *
     C           QUIT      TAG
     C                     MOVELWYYYY     P3801O
     C                     MOVE WMM       P3801O
     C                     SETON                     LR
     C/COPY QRPGSRC,@CHKYM
      *--------------------------------------------------------------*
** <<日期格式>>VALUE
123456
