      ****************************************************************
      * PROGRAM ID : P39                                             *
      * SYSTEM ID  : PTPLIB                                          *
      * FUNTCTION  :日期格式轉換（中西）                           *
      *                                                              *
      * PARAMETER : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   P3901I    I   *DEC    6 0  輸入年月日     *
      *             02   P3902I    I   *CHAR   1    原始日期格式   *
      *                                              '1'=00YYMMDD    *
      *                                              '2'=YYYYMMDD    *
      *                                              '3'=00MMDDYY    *
      *                                              '4'=MMDDYYYY    *
      *                                              '5'=00DDMMYY    *
      *                                              '6'=DDMMYYYY    *
      *             03   P3903I    I   *CHAR   1    原始曆別       *
      *                                             '1':西曆       *
      *                                             '2':國曆       *
      *             04   P3904I    I   *CHAR   1    轉換後日期格式 *
      *             05   P3905I    I   *CHAR   1    轉換後曆別     *
      *             06   P3911O    O   *DEC    6 0  轉換後日期     *
      ****************************************************************
     E* WFV   :日期格式VALUE
     E                    WFV     6   6  1
     I            DS
     I                                        1   60WDATE
     I                                        1   20WD1
     I                                        3   40WD2
     I                                        5   60WD3
     I            DS
     I                                        1   60WYMD
     I                                        1   20WY1
     I                                        3   40WY2
     I                                        5   60WY3
      *--------------------------------------------------------------*
      *                    MAIN PROGRAM                              *
      *--------------------------------------------------------------*
     C           *ENTRY    PLIST
     C                     PARM           P3901I  60
     C                     PARM           P3902I  1
     C                     PARM           P3903I  1
     C                     PARM           P3904I  1
     C                     PARM           P3905I  1
     C                     PARM           P3911O  60
     C*最高機密
     C****                 CALL 'R@S005'
     C****                 PARM 'GIANT/PT'S0051I  8
     C*CLEAR OUTPUT FIELD
     C                     Z-ADD*ZERO     P3911O
     C           P3901I    IFEQ *ZERO
     C                     GOTO QUIT
     C                     END
     C*
     C                     EXSR P39CHK                     *CHK中西曆
  01-C           *IN99     IFEQ '1'
     C                     GOTO QUIT
  01-C                     END
     C*
     C                     Z-ADDP3901I    @DATE   60
     C                     MOVE P3902I    @FMT    1
     C                     MOVE P3903I    @CALD   1
     C                     EXSR @@YMD
     C*
     C                     EXSR P39CVD                     *CVD DATE
     C                     Z-ADDWYMD      P3911O
     C*
     C           QUIT      TAG
     C                     SETON                     LR
     C/COPY QRPGSRC,@CHKYM
     C*--------------------------------------------------------------*
     C*                 P39CHK....CHECK中西曆及輸入格式
     C*--------------------------------------------------------------*
01===C           P39CHK    BEGSR
|    C*
|    C                     MOVE P3903I    @CALD
|    C                     MOVE P3902I    @FMT
|    C                     EXSR @@CHK
|    C   99                GOTO ERROR
|    C*
|    C                     MOVE P3905I    @CALD
|    C                     MOVE P3904I    @FMT
|    C                     EXSR @@CHK
|    C   99                GOTO ERROR
|    C*
01===C           ERROR     ENDSR
      *--------------------------------------------------------------*
      *                 P39CVD....轉換日期
      *--------------------------------------------------------------*
02===C           P39CVD    BEGSR
|    C*
| 01-C           P3905I    IFEQ '1'                        *西曆
|   C*
| 02-C           P3904I    IFEQ '1'                        *00YYMMDD
|   C                     Z-ADD0         WY1
|   C                     Z-ADDWYYYY     WY2
|   C                     Z-ADDWMM       WY3
| 02-C                     END
|   C*
| 03-C           P3904I    IFEQ '2'                        *YYYYMMDD
|   C                     MOVELWYYYY     WY1
|   C                     MOVE WYYYY     WY2
|   C                     Z-ADDWMM       WY3
| 03-C                     END
|   C*
| 04-C           P3904I    IFEQ '3'                        *00MMDDYY
|   C                     Z-ADD0         WY1
|   C                     Z-ADDWMM       WY2
|   C                     Z-ADDWYYYY     WY3
| 04-C                     END
|   C*
| 05-C           P3904I    IFEQ '4'                        *MMDDYYYY
|   C                     Z-ADDWMM       WY1
|   C                     MOVELWYYYY     WY2
|   C                     MOVE WYYYY     WY3
| 05-C                     END
|   C*
| 06-C           P3904I    IFEQ '5'                        *00DDMMYY
|   C                     Z-ADD0         WY1
|   C                     Z-ADDWMM       WY2
|   C                     Z-ADDWYYYY     WY3
| 06-C                     END
|   C*
| 07-C           P3904I    IFEQ '6'                        *DDMMYYYY
|   C                     Z-ADDWMM       WY1
|   C                     MOVELWYYYY     WY2
|   C                     MOVE WYY       WY3
| 07-C                     END
|   C*
| 01-C                     END
|    C*
| 08-C           P3905I    IFEQ '2'                        *中曆
|   C           P3904I    ANDEQ'2'                        *YYYYMMDD
|   C                     SUB  1911      WYYYY
|   C                     MOVELWYYYY     WY1
|   C                     MOVE WYYYY     WY2
|   C                     Z-ADDWMM       WY3
| 08-C                     END
|    C*
02===C                     ENDSR
      *--------------------------------------------------------------*
** <<日期格式>>VALUE
123456
