      ****************************************************************
      * PROGRAM ID : P45                                             *
      * SYSTEM ID  : PTPLIB                                          *
      * FUNTCTION  :轉換中國年為西元年                             *
      *                                                              *
      * PARAMETER : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   P4501I    I   *DEC(P) 7 0  YYYMMDD(中國年)*
      *             02   P4501O    O   *DEC(P) 6 0  DDMMYY(西元年) *
      *                                                              *
      * W-VARABLE : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ==== ============      *
      *             00   CYR       N   *DEC    7 0 YYYMMDD(中國年) *
      *             00   WYR       N   *DEC    6 0 DDMMYY(西元年) *
      *             00   CMM,WMM   N   *DEC    2 0 月份            *
      *             00   CDD,WDD   N   *DEC    2 0 日期            *
      *             00   WYY2      N   *DEC    4 0 *1911+CYY         *
      ****************************************************************
      *45D    CF  E                    WORKSTN
     I            DS
     I                                        1   70CYR
     I                                        1   30CYY
     I                                        4   50CMM
     I                                        6   70CDD
     I            DS
     I                                        1   60WYR
     I                                        1   20WDD
     I                                        3   40WMM
     I                                        5   60WYY
     I            DS
     I                                        1   40WYY2
     I                                        3   40WYY1
      *--------------------------------------------------------------*
      *                    MAIN PROGRAM                              *
      *--------------------------------------------------------------*
     C           *ENTRY    PLIST
     C           CYR       PARM           P4501I  70
     C                     PARM WYR       P4501O  60
      *
     C                     CALL 'R@S005'
     C                     PARM 'GIANT/PT'S0051I  8
      *
     C           CYY       ADD  1911      WYY2    40
     C                     Z-ADDWYY1      WYY     20
     C                     Z-ADDCDD       WDD
     C                     Z-ADDCMM       WMM
     C                     SETON                     LR
     C                     RETRN
