      ****************************************************************
      * PROGRAM ID : P46                                             *
      * SYSTEM ID  : PTPLIB                                          *
      * FUNTCTION  :轉換西元年為中國年                             *
      *                                                              *
      * PARAMETER : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   P4601I    I   *DEC(P) 6 0  DDMMYY(西元年)**
      *             02   P4601O    O   *DEC(P) 7 0  YYYMMDD(中國年)*
      *                                                              *
      * W-VARABLE : SEQ  FIELD    I/O  TYPE   LEN   DESCRIPTION      *
      *             ===  =======  ===  =====  ====  ===========      *
      *             01   CYR       N   *DEC    7 0 中國年          *
      *             02   WYR       N   *DEC    6 0 西元年          *
      *             02   CMM,WMM   N   *DEC    2 0 月份            *
      *             03   CDD,WDD   N   *DEC    2 0 日期            *
      *             04   WYY2      N   *DEC    4 0 *1900+WYY(WYY>87) *
      *             04   WYY2      N   *DEC    4 0 *2000+WYY(ELSE)   *
      ****************************************************************
     I            DS
     I                                        1   70CYR
     I                                        1   30CYY
     I                                        4   50CMM
     I                                        6   70CDD
     I            DS
     I                                        1   60WYR
     I                                        1   20WDD
     I                                        3   40WMM
     I                                        5   60WYY
      *--------------------------------------------------------------*
      *                    MAIN PROGRAM                              *
      *--------------------------------------------------------------*
     C           *ENTRY    PLIST
     C           WYR       PARM           P4601I  60
     C                     PARM CYR       P4601O  70
      *
     C                     CALL 'R@S005'
     C                     PARM 'GIANT/PT'S0051I  8
      *
     C           WYY       IFGT 87
     C           WYY       ADD  1900      WYY2    40
     C                     ELSE
     C           WYY       ADD  2000      WYY2    40
     C                     END
     C           WYY2      SUB  1911      CYY
     C                     Z-ADDWMM       CMM
     C                     Z-ADDWDD       CDD
     C                     SETON                     LR
     C                     RETRN
