     FP51D    CF  E                    WORKSTN
     C           *IN03     DOWEQ'0'
     C                     EXFMTP51DSF
     C                     CALL 'P51'
     C                     PARM           AA
     C                     PARM           BB
     C                     PARM           CC
     C                     PARM           DD
     C                     END
     C                     SETON                     LR
