     H****************************************************************
     H*   テび戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     H*--------------------------------------------------------------*
     H*    PROGRAM ID   : P58NEW                                     *
     H*    PROGRAM NAME :计锣﹃(オ綼跋だタ璽计)    *
     H*    AUTHOR       : A1209 STEVEN                               *
     H*    VERSION      :                                            *
     H****************************************************************
     E                    AA         21  1                 *ㄓ方ARRAY
     E                    BB         21  1                 *い丁
     E                    CC         28  1                 *挡狦ARRAY
     C*==============================================================*
     C*                    PARAMETERS                                *
     C*==============================================================*
     C           *ENTRY    PLIST
     C           PI1       PARM           P5801I 215       *ㄓ方
     C           PI2       PARM           P5802I  10       *计计
     C                     PARM PO1       P5811O 28        *挡狦
     C*==============================================================*
     C*                    DEFN
     C*==============================================================*
     C           *LIKE     DEFN P5801I    PI1
     C           *LIKE     DEFN P5802I    PI2
     C           *LIKE     DEFN P5811O    PO1
     C*==============================================================*
     C*                    MAIN ROUTINE                              *
     C*==============================================================*
     C                     CLEARAA
     C                     CLEARAA
     C                     CLEARBB
     C                     CLEARCC
     C                     CLEARPO1
     C                     Z-ADD1         @B      20
     C                     Z-ADD1         @A      20
     C                     Z-ADD1         @C      20
     C* CHECK NOT ZERO
     C           PI1       IFNE 0
     C*
     C           PI2       IFLT 0
     C                     Z-ADD0         PI2
     C                     ENDIF
     C           PI2       IFGT 5
     C                     Z-ADD5         PI2
     C                     ENDIF
     C           PI1       IFLT 0
     C           0         SUB  PI1       PI1
     C                     MOVEA'-'       CC,@C
     C                     ADD  1         @C
     C                     ENDIF
     C*
     C                     MOVELPI1       AATXT  21
     C                     MOVEAAATXT     AA
     C* SKIP LEADING ZERO
     C           AA,@A     DOWEQ'0'
     C                     ADD  1         @A
     C                     ENDDO
     C* AA --> BB
     C           @A        DO   21        @K      20
     C                     MOVEAAA,@K     BB,@B
     C           @K        IFEQ 16
     C                     Z-ADD@B        @D      20       *俱计
     C*                                                    * BB竚
     C                     ENDIF
     C                     ADD  1         @B
     C                     ENDDO
     C* BB --> CC
     C           @D        DIV  3         @E      20
     C                     MVR            @E
     C*
     C           1         DO   21        @B
     C                     MOVEABB,@B     CC,@C
     C                     ADD  1         @C
     C*
     C           @B        IFLT @D
     C           @B        DIV  3         @F      20
     C                     MVR            @F
     C           @E        IFEQ @F
     C                     MOVEA','       CC,@C
     C                     ADD  1         @C
     C                     ENDIF
     C                     ELSE
     C           @B        IFEQ @D
     C                     MOVEA'.'       CC,@C
     C                     Z-ADD@C        @G      20
     C                     ADD  1         @C
     C                     ENDIF
     C                     ENDIF
     C                     ENDDO
     C*篒计
     C           PI2       IFGT 0
     C                     ADD  PI2       @G
     C                     ADD  1         @G
     C                     ENDIF
     C           @G        DO   28        @C
     C                     MOVEA' '       CC,@C
     C                     ENDDO
     C* IF PI1 EQ ZERO
     C                     ELSE
     C                     MOVEL'0'       CC,@C
     C                     ENDIF
     C*
     C                     MOVEACC        PO1
     C*
     C                     SETON                     LR
