     H****************************************************************
     H*   獂び戈癟м秨祇Τそ⌒舦┮Τ    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : P78                                        *
     H*    PROGRAM NAME :﹃锣传Θ俱计                            *
     H*    AUTHOR       : SERMON                                     *
     H*    CREATE DATE  : 96/02/09                                   *
     H*    UPDATE DATE  :                                            *
     H****************************************************************
     E                    @S01      256  1               *ORIGINAL
     E                    @S02      256  1               *MODIFIED
     I*---------------------------------------------------------------*
     I            DS
     I                                        1 256 @S01
     I                                        1 256 W7801
     I            DS
     I                                        1 256 @S02
     I                                        1 256 W7802
     C*===============================================================*
     C*                    DEFN
     C*===============================================================*
     C           *LIKE     DEFN P7802I    IDX
     C           *LIKE     DEFN P7802I    MAX
     C           *LIKE     DEFN P7802I    DGL
     C           *LIKE     DEFN P7801O    NUM
     C           *LIKE     DEFN P7801O    SUM
     C*===============================================================*
     C*                    MAIN ROUTINE
     C*===============================================================*
     C           *ENTRY    PLIST
     C                     PARM           P7801I256        ﹃
     C                     PARM           P7802I  30       
     C                     PARM SUM       P7801O 150       计
     C                     EXSR R0100
     C                     EXSR R1000
     C                     SETON                     LR
     C*===============================================================*
     C*                    INITIAL ROUTINE
     C*===============================================================*
     C           R0100     BEGSR
     C                     MOVELP7801I    W7801
     C                     MOVEL*BLANK    W7802
     C                     Z-ADDP7802I    MAX
     C                     Z-ADD1         IDX
     C                     Z-ADD*ZERO     NUM
     C                     Z-ADD*ZERO     SUM
     C                     Z-ADD*ZERO     DGL
     C                     MOVE 'N'       FL01    1        Τ计
     C                     MOVE 'N'       FL02    1        璽计
     C                     ENDSR
     C*===============================================================*
     C*                    R1000
     C*===============================================================*
     C           R1000     BEGSR
     C*
     C           IDX       DOWLEMAX
     C*
     C           @S01,IDX  IFEQ ' '
     C           FL01      IFEQ 'N'
     C           FL02      ANDEQ'N'
     C                     ADD  1         IDX
     C                     ITER
     C                     END
     C                     END
     C*
     C           @S01,IDX  IFGE '0'
     C           @S01,IDX  ANDLE'9'
     C           @S01,IDX  CAT  W7802     W7802
     C                     ADD  1         DGL
     C                     MOVE 'Y'       FL01
     C                     ELSE
     C           @S01,IDX  IFEQ '-'
     C           FL01      ANDEQ'N'
     C           FL02      ANDEQ'N'
     C                     MOVE 'Y'       FL02
     C                     ELSE
     C                     LEAVE
     C                     END
     C                     END
     C*
     C                     ADD  1         IDX
     C                     END
     C*
     C           W7802     IFEQ *BLANK
     C                     GOTO E1000
     C                     END
     C*
     C                     Z-ADD*ZERO     IDX
     C           IDX       DOWLTDGL
     C                     CALL 'P79'
     C                     PARM 10        P7901I 150
     C                     PARM IDX       P7902I 150
     C           NUM       PARM           P7901O 150
     C                     ADD  1         IDX
     C                     SELEC
     C           @S02,IDX  WHEQ '0'
     C                     MULT 0         NUM
     C           @S02,IDX  WHEQ '1'
     C                     MULT 1         NUM
     C           @S02,IDX  WHEQ '2'
     C                     MULT 2         NUM
     C           @S02,IDX  WHEQ '3'
     C                     MULT 3         NUM
     C           @S02,IDX  WHEQ '4'
     C                     MULT 4         NUM
     C           @S02,IDX  WHEQ '5'
     C                     MULT 5         NUM
     C           @S02,IDX  WHEQ '6'
     C                     MULT 6         NUM
     C           @S02,IDX  WHEQ '7'
     C                     MULT 7         NUM
     C           @S02,IDX  WHEQ '8'
     C                     MULT 8         NUM
     C           @S02,IDX  WHEQ '9'
     C                     MULT 9         NUM
     C                     END
     C                     ADD  NUM       SUM
     C                     END
     C*
     C           FL02      IFEQ 'Y'
     C                     MULT -1        SUM
     C                     END
     C           E1000     ENDSR
