     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM ID   : P79                                        *
     H*    PROGRAM NAME :乘冪計算                                  *
     H*    AUTHOR       : SERMON                                     *
     H*    CREATE DATE  : 96/02/10                                   *
     H*    UPDATE DATE  :                                            *
     H****************************************************************
     C*                    DEFN
     C*===============================================================*
     C           *LIKE     DEFN P7901I    BASE
     C           *LIKE     DEFN P7902I    TIMES
     C           *LIKE     DEFN P7901O    NUM
     C*===============================================================*
     C*                    MAIN ROUTINE
     C*===============================================================*
     C           *ENTRY    PLIST
     C           BASE      PARM           P7901I 150       底數
     C           TIMES     PARM           P7902I 150       指數
     C                     PARM NUM       P7901O 150       結果
     C*
     C                     Z-ADDBASE      NUM
     C*
     C                     SUB  1         TIMES
     C           TIMES     IFLT 0
     C                     Z-ADD1         NUM
     C                     ELSE
     C                     DO   TIMES
     C                     MULT BASE      NUM
     C                     END
     C                     END
     C                     SETON                     LR
