     IC830I1      DS                             16
     I                                        1  110WF11
     I                                       12  12 WF12
     I                                       13  160WF13
     C           *ENTRY    PLIST
     C                     PARM           P830I1 154       ┏计
     C                     PARM           P830I2  40       计
     C                     PARM           P8311O 104       挡狦
     C*
     C                     MOVELP830I1    WF11
     C                     MOVEL'.'       WF12
     C                     MOVE P830I1    WF13
     C*
     C                     MOVELP830I2    C830I2
     C*
     C                     CALL 'P83C'
     C                     PARM           C830I1           ┏计
     C                     PARM           C830I2  4        计
     C                     PARM           C8311O 10        挡狦
     C*
     C                     Z-ADD*ZERO     P8311O
     C                     MOVELC8311O    TEMP   100
     C           TEMP      DIV  10000     P8311O
     C*
     C                     SETON                     LR
