     H****************************************************************
     H*   PROGRAM NAME : PTB854                                      *
     H*   AUTHER       : A1046 JOHNSON CHEN                          *
     H*   CREATE DATE  : 78/11/11                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       :泛太公用系統                               *
     H*   SUBSYSTEM    :應用系統文件                               *
     H*   REMARK       :檔案被程式使用的狀況列印                   *
     H*   PROCEDURE    : PTB851                                      *
     H****************************************************************
     FFLPF    IP  E           K        DISK
     FPGPF    IF  E           K        DISK
     FTXPF    IF  E           K        DISK
     FPTB854P O   E             39     PRINTER
     IFL0
     I                                              WHRFI L1
     I           UDS
     I                                      111 1160DDATE
     I                                      500 509 FI
     I                                      510 519 LI
     I                                      520 529 PR
     I            DS
     I                                        1  11 WHRFI
     I                                        1  10 FN
     C           KEY01     KLIST
     C                     KFLD           K01    11
     C                     KFLD           K02    11
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     SETON                     10
     C                     END
      *
     C           WHRFI     IFNE TEMP
     C                     EXSR RTN100
     C           FN        CHAINTXPF                 40
     C           *IN40     IFEQ '1'
     C                     MOVE *BLANK    PTEXT
     C                     ELSE
     C                     MOVE *BLANK    P6501I
     C                     MOVELATTXT     P6501I
     C                     Z-ADD39        P6502I
     C                     CALL 'P65'
     C                     PARM           P6501I 80
     C                     PARM           P6502I  30
     C                     PARM           P6511O 80
     C                     PARM           P6512O 80
     C                     MOVELP6511O    PTEXT
     C                     END
     C                     WRITEPD1                    39
     C                     MOVELWHRFI     K01
     C                     MOVE *LOVAL    K02
     C           KEY01     SETLLPGPF                 40
     C  N40                READ PGPF                     40
     C           *IN40     DOWEQ'0'
     C           WHFNAM    IFEQ WHRFI
     C                     EXSR RTN100
     C                     WRITEPD2                    39
     C                     READ PGPF                     40
     C                     ELSE
     C                     SETON                     40
     C                     END
     C                     END
     C                     END
     C                     MOVELWHRFI     TEMP   11
     CL1NLR                WRITEPL1
     CLRN10                WRITEPH1
     CLR                   WRITEPE2
      *==============================================================*
      *            RTN100 : FOR OVERFLOW
      *==============================================================*
     C           RTN100    BEGSR
     C           *IN39     IFEQ '1'
     C                     WRITEPE1
     C                     WRITEPH1
     C                     SETOF                     39
     C                     END
     C                     ENDSR
