      ****************************************************************
      * 泛太資訊科技開發股份有限公司－版權所有      TEL:7313250    *
      ****************************************************************
      * FUNTCTION  : PROGRAM STATUS DATA STRUCTURE                   *
      *                                                              *
     FC@TESTPFO   E           K        DISK                      A
     I           SDS
     I                                        1  10 W@01
     I                                       11  150W@02
     I                                       16  200W@03
     I                                       21  28 W@04
     I                                       29  36 W@05
     I                                       37  390W@06
     I                                       40  42 W@07
     I                                       43  46 W@08
     I                                       47  50 W@09
     I                                       51  80 W@10
     I                                       81  90 W@11
     I                                       91 170 W@12
     I                                      171 174 W@13
     I                                      175 200 W@14
     I                                      201 208 W@15
     I                                      209 243 W@16
     I                                      244 253 W@17
     I                                      254 263 W@18
     I                                      264 2690W@19
     I                                      270 2750W@20
     I                                      276 2810W@21
     I                                      282 2870W@22
     I                                      288 293 W@23
     I                                      294 299 W@24
     I                                      300 303 W@25
     I                                      304 313 W@26
     I                                      314 323 W@27
     I                                      324 333 W@28
     I           UDS
     I                                      101 110 WUSER
     C           KEYC@     KLIST                           *C@PFTEST
     C                     KFLD           WC@01  10
      *==============================================================*
      *                    MAIN PROGRAM                              *
      *==============================================================*
     C*          *ENTRY    PLIST
     C*                    PARM           P01I   10
      *
     C                     EXSR P67CHK
      *
     C                     SETON                       LR
     C                     RETRN
      *==============================================================*
      *          P67CHK....CHECK VALUE FOR WRITE_IN OR DELET_OUT     *
      *==============================================================*
     C           P67CHK    BEGSR
      *
     C                     MOVE W@01      C@01
     C                     MOVE W@02      C@02
     C                     MOVE W@03      C@03
     C                     MOVE W@04      C@04
     C                     MOVE W@05      C@05
     C                     MOVE W@06      C@06
     C                     MOVE W@07      C@07
     C                     MOVE W@08      C@08
     C                     MOVE W@09      C@09
     C                     MOVE W@10      C@10
     C                     MOVE W@11      C@11
     C                     MOVE W@12      C@12
     C                     MOVE W@13      C@13
     C                     MOVE W@14      C@14
     C                     MOVE W@15      C@15
     C                     MOVE W@16      C@16
     C                     MOVE W@17      C@17
     C                     MOVE W@18      C@18
     C                     MOVE W@19      C@19
     C                     MOVE W@20      C@20
     C                     MOVE W@21      C@21
     C                     MOVE W@22      C@22
     C                     MOVE W@23      C@23
     C                     MOVE W@24      C@24
     C                     MOVE W@25      C@25
     C                     MOVE W@26      C@26
     C                     MOVE W@27      C@27
     C                     MOVE W@28      C@28
      *
     C                     WRITEC@0
      *
     C                     ENDSR
