     F*
     FPXLF    IF  E           K        DISK
     FPXPRTF  O   E             66     PRINTER
      /SPACE
     I*
     I*  DECLARE NAMED CONSTANTS
     I*
     I              '1'                   C         ON
     I              '0'                   C         OFF
     I*
     I*  RENAME ANY FIELDS LONGER THAN SIX CHARACTERS
     IFILEREC
     I           SDS
     I                                      254 263 ##$USR
     C*
     C           *LIKE     DEFN SRCSEQ    #NV02
     C*
     C                     WRITEHDG00
     C*
     C           *INLR     DOWEQOFF
     C                     READ PXLF                     LR
     C*
     C*  TEST FOR TOTAL LEVEL BREAKS
     C*
     C           SRCSEQ    IFNE #NV02
     C           *INLR     OREQ ON
     C                     MOVE ON        *IN02
     C                     END
     C           *INLR     IFEQ ON
     C                     MOVE ON        *IN01
     C                     END
     C*
     C*
     C*  CONTROL BREAK - IF NECESSARY, TOTAL LEVEL 02
     C*
     C           *IN02     IFEQ ON
     C           C01       IFGT 0
     C*
     C*
     C                     END
     C           *IN66     IFEQ ON
     C                     WRITEHDG00
     C                     MOVE 'N'       $NEWPG
     C                     MOVE ON        *IN68
     C                     MOVE OFF       *IN66
     C                     END
     C*
     C*  WRITE TOTAL TIME SUMS/RESETS FOR CURRENT LEVEL
     C*
     C                     Z-ADD0         C02
     C                     END
     C*
     C*  CONTROL BREAK - IF NECESSARY, TOTAL LEVEL 01
     C*
     C           *IN01     IFEQ ON
     C           C01       IFGT 0
     C*
     C*
     C           $NEWPG    IFEQ 'Y'
     C                     WRITEHDG00
     C                     MOVE 'N'       $NEWPG
     C                     END
     C                     WRITETOT01
     C                     END
     C           *IN66     IFEQ ON
     C                     WRITEHDG00
     C                     MOVE 'N'       $NEWPG
     C                     MOVE ON        *IN68
     C                     MOVE OFF       *IN66
     C                     END
     C*
     C*  WRITE TOTAL TIME SUMS/RESETS FOR CURRENT LEVEL
     C*
     C                     Z-ADD0         C01
     C                     END
     C*
     C*   WAS SKIP TO NEW PAGE REQUESTED IN ANY CONTROL LEVEL?
     C*
     C           $NEWPG    IFEQ 'Y'
     C                     WRITEHDG00
     C                     MOVE 'N'       $NEWPG  1
     C                     END
     C*
     C*  PROCESS DETAIL
     C*
     C           *INLR     IFEQ OFF
     C*
     C* DETAIL CALCULATIONS
     C*
     C*
     C                     ADD  1         C02     90
     C                     ADD  1         C01     90
     C*  FIELD RE-SIZING/SUMMING
     C*
     C*   WRITE DETAIL LINE FOR REPORT, THEN CHECK FOR OVERFLOW.
     C*   *IN68: WHETHER HEADINGS TO BE PRINTED ON LEVEL BREAKS OR (OF).
     C*
     C                     WRITEDET00
     C           *IN66     IFEQ ON
     C                     WRITEHDG00
     C                     END
     C           *IN66     IFEQ ON
     C                     MOVE ON        *IN68
     C                     ELSE
     C                     MOVE OFF       *IN68
     C                     END
     C                     MOVE OFF       *IN66
     C*
     C*
     C*  SAVE FIELDS FOR CONTROL BREAK
     C*
     C                     MOVELSRCSEQ    #NV02
     C*
     C*  SAVE FIELDS FOR LAST OCCURRENCE
     C*
     C                     Z-ADDSRCSEQ    Q001  0062
     C                     MOVELSRCDTA    Q002  080
     C                     MOVEA'00000000'*IN,1
     C                     MOVEA'00000000'*IN,9
     C                     MOVEA'00000000'*IN,17
     C                     END
     C                     END
