     H****************************************************************
     H*   PROGRAM NAME : PYR222                                      *
     H*   AUTHER       : A1043 JACKIE LIU                            *
     H*   CREATE DATE  : 78/10/23                                    *
     H*   UPDATE DATE  :                                             *
     H*   SYSTEM       :財務系統                                   *
     H*   SUBSYSTEM    :人事薪資系統                               *
     H*   PROCEDURE    : PYR221C                                     *
     H*   PURPOSE      :年度薪資扣繳總表清冊列印                   *
     H*   INDICATORS   :                                             *
     H*           31   : WHEN L3 / OVERFLOW --- PRINT DIVISION DESC. *
     H*           39   : OVERFLOW --- IN F-SPEC DEFINES              *
     H*                  AFTER OVERFLOW , REMEMBER SETOF             *
     H*           L1   :年月--- GET DETAIL DATA , INDEX IS MONTH   *
     H*           L2   :員工編號--- SUMMARY ARRAY & PRINT DETAIL   *
     H*           L3   :部門別--- PRINT DIV TOTAL                  *
     H*           L4   :公司別--- PRINT CO. TOTAL & NEXT PAGE      *
     H****************************************************************
     FPIPF    IP  E           K        DISK
     FCMPF    IF  E           K        DISK
     FEMPF    IF  E           K        DISK
     FNMPF    IF  E           K        DISK
     FPYR222P#O   E             39     PRINTER
     E                    A38        12  6 0             *應稅薪金
     E                    A28        12  6 0             *所得稅
     E                    ANT        12  6 0             *稅後淨額
     E                    AD38       12  6 0
     E                    AD28       12  6 0
     E                    ADNT       12  6 0
     E                    AC38       12  6 0
     E                    AC28       12  6 0
     E                    ACNT       12  6 0
     E                    AS38       12  6 0
     E                    AS28       12  6 0
     E                    ASNT       12  6 0
     IPI0
     I                                              PI02  L1
     I                                              PI01  L2
     I                                              PI05  L3
     I                                              PI04  L4
     I            DS
     I                                        1  15 WNM02
     I                                        1   1 EM03
     I                                        2   6 WEM04
     I            DS
     I                                        1   40PI02
     I                                        3   40M
     I           UDS
     I                                      111 1160DDATE
     I                                      501 5020DYY
     C*==============================================================*
     C*                    KEY LIST FOR NMPF
     C*==============================================================*
     C           KEYNM     KLIST                           *NMPF
     C                     KFLD           WNM01   2
     C                     KFLD           WNM02  15
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C   L4      PI04      CHAINCMPF                 40    *GET CM02
     C   L4                WRITEPH1                        *FIRST HEAD
     C*
     C                     EXSR RTN010                     *ADD BY MM
     C   L3                SETON                     31
     C*
     CL1                   EXSR RTN100                     *ADD ELEMENT
     CL2                   EXSR RTN200                     *RPT DETAIL
     CL3                   EXSR RTN300                     *RPT DIV TOT
     CL4                   EXSR RTN400                     *PRT CO. TOT
     CLR                   EXSR RTN500                     *PRT SUMMARY
     C*==============================================================*
     C*          RTN010....SUMMARY SAME MONTH'S A & B, M=PI02'S MONTH
     C*==============================================================*
     CSR         RTN010    BEGSR
     C                     ADD  PI38      A38,M            *DETAIL
     C                     ADD  PI28      A28,M
     C                     ENDSR
     C*==============================================================*
     C*          RTN100....ADD ARRAY'S ELEMENT
     C*==============================================================*
     CSR         RTN100    BEGSR
     C           A38,M     SUB  A28,M     ANT,M
     C*
     C                     ADD  A38,M     AD38,M           *DIVISION
     C                     ADD  A28,M     AD28,M
     C                     ADD  ANT,M     ADNT,M
     C*
     C                     ADD  A38,M     AC38,M           *COMPANY
     C                     ADD  A28,M     AC28,M
     C                     ADD  ANT,M     ACNT,M
     C*
     C                     ADD  A38,M     AS38,M           *SUMMARY
     C                     ADD  A28,M     AS28,M
     C                     ADD  ANT,M     ASNT,M
     C                     ENDSR
     C*==============================================================*
     C*          RTN200....SUMMARY DETAIL ARRAY & PRINT DETAIL
     C*==============================================================*
     CSR         RTN200    BEGSR
     C                     EXSR RTN210                     *MOVE PI38
     C                     EXSR RTN220                     *MOVE PI28
     C                     EXSR RTN230                     *MOVE NET
     C*
     C           PI01      CHAINEMPF                 40    *GET EM02
     C*
     C                     MOVE '01'      WNM01            *DIVISION
     C                     MOVE EM04      WEM04
     C           KEYNM     CHAINNMPF                 40    *GET NM03
     C                     MOVELNM03      PNM03
     C*
     C           *IN39     IFEQ '1'                        *OVERFLOW
     C                     WRITEPE1                        *NEXT PAGE
     C                     WRITEPH1
     C                     SETON                     31
     C                     SETOF                     39
     C                     END
     C*
     C                     WRITEPD11                       *WRITE DETAIL
     C                     WRITEPD12                       *WRITE DETAIL
     C                     WRITEPD13                       *WRITE DETAIL
     C*
     C                     EXSR RTN240                     *CLEAR DETAIL
     C                     SETOF                     31
     C                     ENDSR
     C*==============================================================*
     C*          RTN210....MOVE A38 TO PPI38
     C*==============================================================*
     CSR         RTN210    BEGSR
     C                     MOVE A38,1     PPI381
     C                     MOVE A38,2     PPI382
     C                     MOVE A38,3     PPI383
     C                     MOVE A38,4     PPI384
     C                     MOVE A38,5     PPI385
     C                     MOVE A38,6     PPI386
     C                     MOVE A38,7     PPI387
     C                     MOVE A38,8     PPI388
     C                     MOVE A38,9     PPI389
     C                     MOVE A38,10    PPI38A
     C                     MOVE A38,11    PPI38B
     C                     MOVE A38,12    PPI38C
     C                     XFOOTA38       PPI38T           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN220....MOVE A28 TO PPI28
     C*==============================================================*
     CSR         RTN220    BEGSR
     C                     MOVE A28,1     PPI281
     C                     MOVE A28,2     PPI282
     C                     MOVE A28,3     PPI283
     C                     MOVE A28,4     PPI284
     C                     MOVE A28,5     PPI285
     C                     MOVE A28,6     PPI286
     C                     MOVE A28,7     PPI287
     C                     MOVE A28,8     PPI288
     C                     MOVE A28,9     PPI289
     C                     MOVE A28,10    PPI28A
     C                     MOVE A28,11    PPI28B
     C                     MOVE A28,12    PPI28C
     C                     XFOOTA28       PPI28T           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN230....MOVE ANT TO PPINT
     C*==============================================================*
     CSR         RTN230    BEGSR
     C                     MOVE ANT,1     PNET1
     C                     MOVE ANT,2     PNET2
     C                     MOVE ANT,3     PNET3
     C                     MOVE ANT,4     PNET4
     C                     MOVE ANT,5     PNET5
     C                     MOVE ANT,6     PNET6
     C                     MOVE ANT,7     PNET7
     C                     MOVE ANT,8     PNET8
     C                     MOVE ANT,9     PNET9
     C                     MOVE ANT,10    PNETA
     C                     MOVE ANT,11    PNETB
     C                     MOVE ANT,12    PNETC
     C                     XFOOTANT       PNETT
     C                     ENDSR
     C*==============================================================*
     C*          RTN240....CLEAR DETAIL
     C*==============================================================*
     CSR         RTN240    BEGSR
     C                     Z-ADD*ZEROS    PPI381
     C                     Z-ADD*ZEROS    PPI382
     C                     Z-ADD*ZEROS    PPI383
     C                     Z-ADD*ZEROS    PPI384
     C                     Z-ADD*ZEROS    PPI385
     C                     Z-ADD*ZEROS    PPI386
     C                     Z-ADD*ZEROS    PPI387
     C                     Z-ADD*ZEROS    PPI388
     C                     Z-ADD*ZEROS    PPI389
     C                     Z-ADD*ZEROS    PPI38A
     C                     Z-ADD*ZEROS    PPI38B
     C                     Z-ADD*ZEROS    PPI38C
     C                     Z-ADD*ZEROS    PPI38T
     C*
     C                     Z-ADD*ZEROS    PPI281
     C                     Z-ADD*ZEROS    PPI282
     C                     Z-ADD*ZEROS    PPI283
     C                     Z-ADD*ZEROS    PPI284
     C                     Z-ADD*ZEROS    PPI285
     C                     Z-ADD*ZEROS    PPI286
     C                     Z-ADD*ZEROS    PPI287
     C                     Z-ADD*ZEROS    PPI288
     C                     Z-ADD*ZEROS    PPI289
     C                     Z-ADD*ZEROS    PPI28A
     C                     Z-ADD*ZEROS    PPI28B
     C                     Z-ADD*ZEROS    PPI28C
     C                     Z-ADD*ZEROS    PPI28T
     C*
     C                     Z-ADD*ZEROS    PNET1
     C                     Z-ADD*ZEROS    PNET2
     C                     Z-ADD*ZEROS    PNET3
     C                     Z-ADD*ZEROS    PNET4
     C                     Z-ADD*ZEROS    PNET5
     C                     Z-ADD*ZEROS    PNET6
     C                     Z-ADD*ZEROS    PNET7
     C                     Z-ADD*ZEROS    PNET8
     C                     Z-ADD*ZEROS    PNET9
     C                     Z-ADD*ZEROS    PNETA
     C                     Z-ADD*ZEROS    PNETB
     C                     Z-ADD*ZEROS    PNETC
     C                     Z-ADD*ZEROS    PNETT
     C*
     C                     MOVEA*ZEROS    A38              *CLEAR AR
     C                     MOVEA*ZEROS    A28
     C                     MOVEA*ZEROS    ANT
     C                     ENDSR
     C*==============================================================*
     C*          RTN300....WRITE DIVISION TOTAL
     C*==============================================================*
     CSR         RTN300    BEGSR
     C                     EXSR RTN310                     *MOVE PI38
     C                     EXSR RTN320                     *MOVE PI28
     C                     EXSR RTN330                     *MOVE NET
     C*
     C                     WRITEPT11                       *WRITE DIVTOTAL
     C                     WRITEPT12                       *WRITE DIVTOTAL
     C                     WRITEPT13                       *WRITE DIVTOTAL
     C*
     C                     EXSR RTN340                     *CLEAR DIVTOTAL
     C                     ENDSR
     C*==============================================================*
     C*          RTN310....MOVE AD38 TO PDV38
     C*==============================================================*
     CSR         RTN310    BEGSR
     C                     MOVE AD38,1    PDV381
     C                     MOVE AD38,2    PDV382
     C                     MOVE AD38,3    PDV383
     C                     MOVE AD38,4    PDV384
     C                     MOVE AD38,5    PDV385
     C                     MOVE AD38,6    PDV386
     C                     MOVE AD38,7    PDV387
     C                     MOVE AD38,8    PDV388
     C                     MOVE AD38,9    PDV389
     C                     MOVE AD38,10   PDV38A
     C                     MOVE AD38,11   PDV38B
     C                     MOVE AD38,12   PDV38C
     C                     XFOOTAD38      PDV38T           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN320....MOVE AD28 TO PDV28
     C*==============================================================*
     CSR         RTN320    BEGSR
     C                     MOVE AD28,1    PDV281
     C                     MOVE AD28,2    PDV282
     C                     MOVE AD28,3    PDV283
     C                     MOVE AD28,4    PDV284
     C                     MOVE AD28,5    PDV285
     C                     MOVE AD28,6    PDV286
     C                     MOVE AD28,7    PDV287
     C                     MOVE AD28,8    PDV288
     C                     MOVE AD28,9    PDV289
     C                     MOVE AD28,10   PDV28A
     C                     MOVE AD28,11   PDV28B
     C                     MOVE AD28,12   PDV28C
     C                     XFOOTAD28      PDV28T           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN330....MOVE ADNT TO PDVNT
     C*==============================================================*
     CSR         RTN330    BEGSR
     C                     MOVE ADNT,1    PDVNT1
     C                     MOVE ADNT,2    PDVNT2
     C                     MOVE ADNT,3    PDVNT3
     C                     MOVE ADNT,4    PDVNT4
     C                     MOVE ADNT,5    PDVNT5
     C                     MOVE ADNT,6    PDVNT6
     C                     MOVE ADNT,7    PDVNT7
     C                     MOVE ADNT,8    PDVNT8
     C                     MOVE ADNT,9    PDVNT9
     C                     MOVE ADNT,10   PDVNTA
     C                     MOVE ADNT,11   PDVNTB
     C                     MOVE ADNT,12   PDVNTC
     C                     XFOOTADNT      PDVNTT           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN340....CLEAR DIVISION TOTAL
     C*==============================================================*
     CSR         RTN340    BEGSR
     C                     Z-ADD*ZEROS    PDV381
     C                     Z-ADD*ZEROS    PDV382
     C                     Z-ADD*ZEROS    PDV383
     C                     Z-ADD*ZEROS    PDV384
     C                     Z-ADD*ZEROS    PDV385
     C                     Z-ADD*ZEROS    PDV386
     C                     Z-ADD*ZEROS    PDV387
     C                     Z-ADD*ZEROS    PDV388
     C                     Z-ADD*ZEROS    PDV389
     C                     Z-ADD*ZEROS    PDV38A
     C                     Z-ADD*ZEROS    PDV38B
     C                     Z-ADD*ZEROS    PDV38C
     C                     Z-ADD*ZEROS    PDV38T
     C*
     C                     Z-ADD*ZEROS    PDV281
     C                     Z-ADD*ZEROS    PDV282
     C                     Z-ADD*ZEROS    PDV283
     C                     Z-ADD*ZEROS    PDV284
     C                     Z-ADD*ZEROS    PDV285
     C                     Z-ADD*ZEROS    PDV286
     C                     Z-ADD*ZEROS    PDV287
     C                     Z-ADD*ZEROS    PDV288
     C                     Z-ADD*ZEROS    PDV289
     C                     Z-ADD*ZEROS    PDV28A
     C                     Z-ADD*ZEROS    PDV28B
     C                     Z-ADD*ZEROS    PDV28C
     C                     Z-ADD*ZEROS    PDV28T
     C*
     C                     Z-ADD*ZEROS    PDVNT1
     C                     Z-ADD*ZEROS    PDVNT2
     C                     Z-ADD*ZEROS    PDVNT3
     C                     Z-ADD*ZEROS    PDVNT4
     C                     Z-ADD*ZEROS    PDVNT5
     C                     Z-ADD*ZEROS    PDVNT6
     C                     Z-ADD*ZEROS    PDVNT7
     C                     Z-ADD*ZEROS    PDVNT8
     C                     Z-ADD*ZEROS    PDVNT9
     C                     Z-ADD*ZEROS    PDVNTA
     C                     Z-ADD*ZEROS    PDVNTB
     C                     Z-ADD*ZEROS    PDVNTC
     C                     Z-ADD*ZEROS    PDVNTT
     C*
     C                     MOVEA*ZEROS    AD38
     C                     MOVEA*ZEROS    AD28
     C                     MOVEA*ZEROS    ADNT
     C                     ENDSR
     C*==============================================================*
     C*          RTN400....WRITE COMPANY TOTAL
     C*==============================================================*
     CSR         RTN400    BEGSR
     C                     EXSR RTN410                     *MOVE PI38
     C                     EXSR RTN420                     *MOVE PI28
     C                     EXSR RTN430                     *MOVE NET
     C*
     C                     WRITEPT21                       *WRITE CO.TOTAL
     C                     WRITEPT22                       *WRITE CO.TOTAL
     C                     WRITEPT23                       *WRITE CO.TOTAL
     C*
     C                     EXSR RTN440                     *CLEAR CO.TOTAL
     C                     ENDSR
     C*==============================================================*
     C*          RTN410....MOVE AC38 TO PCO38
     C*==============================================================*
     CSR         RTN410    BEGSR
     C                     MOVE AC38,1    PCO381
     C                     MOVE AC38,2    PCO382
     C                     MOVE AC38,3    PCO383
     C                     MOVE AC38,4    PCO384
     C                     MOVE AC38,5    PCO385
     C                     MOVE AC38,6    PCO386
     C                     MOVE AC38,7    PCO387
     C                     MOVE AC38,8    PCO388
     C                     MOVE AC38,9    PCO389
     C                     MOVE AC38,10   PCO38A
     C                     MOVE AC38,11   PCO38B
     C                     MOVE AC38,12   PCO38C
     C                     XFOOTAC38      PCO38T           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN420....MOVE AC28 TO PCO28
     C*==============================================================*
     CSR         RTN420    BEGSR
     C                     MOVE AC28,1    PCO281
     C                     MOVE AC28,2    PCO282
     C                     MOVE AC28,3    PCO283
     C                     MOVE AC28,4    PCO284
     C                     MOVE AC28,5    PCO285
     C                     MOVE AC28,6    PCO286
     C                     MOVE AC28,7    PCO287
     C                     MOVE AC28,8    PCO288
     C                     MOVE AC28,9    PCO289
     C                     MOVE AC28,10   PCO28A
     C                     MOVE AC28,11   PCO28B
     C                     MOVE AC28,12   PCO28C
     C                     XFOOTAC28      PCO28T           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN430....MOVE ACNT TO PCONT
     C*==============================================================*
     CSR         RTN430    BEGSR
     C                     MOVE ACNT,1    PCONT1
     C                     MOVE ACNT,2    PCONT2
     C                     MOVE ACNT,3    PCONT3
     C                     MOVE ACNT,4    PCONT4
     C                     MOVE ACNT,5    PCONT5
     C                     MOVE ACNT,6    PCONT6
     C                     MOVE ACNT,7    PCONT7
     C                     MOVE ACNT,8    PCONT8
     C                     MOVE ACNT,9    PCONT9
     C                     MOVE ACNT,10   PCONTA
     C                     MOVE ACNT,11   PCONTB
     C                     MOVE ACNT,12   PCONTC
     C                     XFOOTACNT      PCONTT           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN440....CLEAR COMPANY TOTAL
     C*==============================================================*
     CSR         RTN440    BEGSR
     C                     Z-ADD*ZEROS    PCO381
     C                     Z-ADD*ZEROS    PCO382
     C                     Z-ADD*ZEROS    PCO383
     C                     Z-ADD*ZEROS    PCO384
     C                     Z-ADD*ZEROS    PCO385
     C                     Z-ADD*ZEROS    PCO386
     C                     Z-ADD*ZEROS    PCO387
     C                     Z-ADD*ZEROS    PCO388
     C                     Z-ADD*ZEROS    PCO389
     C                     Z-ADD*ZEROS    PCO38A
     C                     Z-ADD*ZEROS    PCO38B
     C                     Z-ADD*ZEROS    PCO38C
     C                     Z-ADD*ZEROS    PCO38T
     C*
     C                     Z-ADD*ZEROS    PCO281
     C                     Z-ADD*ZEROS    PCO282
     C                     Z-ADD*ZEROS    PCO283
     C                     Z-ADD*ZEROS    PCO284
     C                     Z-ADD*ZEROS    PCO285
     C                     Z-ADD*ZEROS    PCO286
     C                     Z-ADD*ZEROS    PCO287
     C                     Z-ADD*ZEROS    PCO288
     C                     Z-ADD*ZEROS    PCO289
     C                     Z-ADD*ZEROS    PCO28A
     C                     Z-ADD*ZEROS    PCO28B
     C                     Z-ADD*ZEROS    PCO28C
     C                     Z-ADD*ZEROS    PCO28T
     C*
     C                     Z-ADD*ZEROS    PCONT1
     C                     Z-ADD*ZEROS    PCONT2
     C                     Z-ADD*ZEROS    PCONT3
     C                     Z-ADD*ZEROS    PCONT4
     C                     Z-ADD*ZEROS    PCONT5
     C                     Z-ADD*ZEROS    PCONT6
     C                     Z-ADD*ZEROS    PCONT7
     C                     Z-ADD*ZEROS    PCONT8
     C                     Z-ADD*ZEROS    PCONT9
     C                     Z-ADD*ZEROS    PCONTA
     C                     Z-ADD*ZEROS    PCONTB
     C                     Z-ADD*ZEROS    PCONTC
     C                     Z-ADD*ZEROS    PCONTT
     C*
     C                     MOVEA*ZEROS    AC38
     C                     MOVEA*ZEROS    AC28
     C                     MOVEA*ZEROS    ACNT
     C                     ENDSR
     C*==============================================================*
     C*          RTN500....WRITE SUMMARY TOTAL
     C*==============================================================*
     CSR         RTN500    BEGSR
     C                     EXSR RTN510                     *MOVE PI38
     C                     EXSR RTN520                     *MOVE PI28
     C                     EXSR RTN530                     *MOVE NET
     C*
     C                     WRITEPT31                       *WRITE DIVTOTAL
     C                     WRITEPT32                       *WRITE DIVTOTAL
     C                     WRITEPT33                       *WRITE DIVTOTAL
     C                     WRITEPE2                        *REPORT END
     C                     ENDSR
     C*==============================================================*
     C*          RTN510....MOVE AS38 TO PSM38
     C*==============================================================*
     CSR         RTN510    BEGSR
     C                     MOVE AS38,1    PSM381
     C                     MOVE AS38,2    PSM382
     C                     MOVE AS38,3    PSM383
     C                     MOVE AS38,4    PSM384
     C                     MOVE AS38,5    PSM385
     C                     MOVE AS38,6    PSM386
     C                     MOVE AS38,7    PSM387
     C                     MOVE AS38,8    PSM388
     C                     MOVE AS38,9    PSM389
     C                     MOVE AS38,10   PSM38A
     C                     MOVE AS38,11   PSM38B
     C                     MOVE AS38,12   PSM38C
     C                     XFOOTAS38      PSM38T           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN520....MOVE AS28 TO PSM28
     C*==============================================================*
     CSR         RTN520    BEGSR
     C                     MOVE AS28,1    PSM281
     C                     MOVE AS28,2    PSM282
     C                     MOVE AS28,3    PSM283
     C                     MOVE AS28,4    PSM284
     C                     MOVE AS28,5    PSM285
     C                     MOVE AS28,6    PSM286
     C                     MOVE AS28,7    PSM287
     C                     MOVE AS28,8    PSM288
     C                     MOVE AS28,9    PSM289
     C                     MOVE AS28,10   PSM28A
     C                     MOVE AS28,11   PSM28B
     C                     MOVE AS28,12   PSM28C
     C                     XFOOTAS28      PSM28T           *SUMMARY AR
     C                     ENDSR
     C*==============================================================*
     C*          RTN530....MOVE ASNT TO PSMNT
     C*==============================================================*
     CSR         RTN530    BEGSR
     C                     MOVE ASNT,1    PSMNT1
     C                     MOVE ASNT,2    PSMNT2
     C                     MOVE ASNT,3    PSMNT3
     C                     MOVE ASNT,4    PSMNT4
     C                     MOVE ASNT,5    PSMNT5
     C                     MOVE ASNT,6    PSMNT6
     C                     MOVE ASNT,7    PSMNT7
     C                     MOVE ASNT,8    PSMNT8
     C                     MOVE ASNT,9    PSMNT9
     C                     MOVE ASNT,10   PSMNTA
     C                     MOVE ASNT,11   PSMNTB
     C                     MOVE ASNT,12   PSMNTC
     C                     XFOOTASNT      PSMNTT           *SUMMARY AR
     C                     ENDSR
