     F****************************************************************
     F*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     F*                                                              *
     F*    PROGRAM NAME : R@A002                                     *
     F*    AUTHOR       : A1062   JEANNY LIN                         *
     F*    CREATE DATE  : 79/05/14                                   *
     F*    UPDATE DATE  :                                            *
     F*    SYSTEM       :應用程式版權保護系統                      *
     F*    PURPOSE      :應用程式版權資料更新                      *
     F****************************************************************
     FR@A002D CF  E                    WORKSTN
     IR@DA01      DS
     I                                        1 108 DA01
     I                                        1   2 DRA01
     I                                        3   3 DRA02
     I                                        4  11 DRA03
     I                                       12  15 DRA04
     I                                       16  210DRA05
     I                                       22  23 DRA601
     I                                       24  25 DRA602
     I                                       26  27 DRA603
     I                                       28  29 DRA604
     I                                       30  31 DRA605
     I                                       32  33 DRA606
     I                                       34  35 DRA607
     I                                       36  37 DRA608
     I                                       38  39 DRA609
     I                                       40  41 DRA610
     I                                       42  43 DRA611
     I                                       44  45 DRA612
     I                                       46  47 DRA613
     I                                       48  49 DRA614
     I                                       50  51 DRA615
     I                                       52  53 DRA616
     I                                       54  55 DRA617
     I                                       56  57 DRA618
     I                                       58  59 DRA619
     I                                       60  61 DRA620
     I                                       62  63 DRA621
     I                                       64  65 DRA622
     I                                       66  67 DRA623
     I                                       68  69 DRA624
     I                                       70  71 DRA625
     I                                       72  73 DRA626
     I                                       74  75 DRA627
     I                                       76  77 DRA628
     I                                       78  79 DRA629
     I                                       80  81 DRA630
     I                                       82  83 DRA631
     I                                       84  85 DRA632
     I                                       86  87 DRA633
     I                                       88  89 DRA634
     I                                       90  91 DRA635
     I                                       92  93 DRA636
     I                                       94  95 DRA637
     I                                       96  97 DRA638
     I                                       98  99 DRA639
     I                                      100 101 DRA640
     I                                      102 1080DRA07
     I           UDS
     I                                      101 110 USER
     I                                      111 1160DDATE
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           *NAMVAR   DEFN           R@DA01
     C           *LOCK     IN   *NAMVAR
     C*
     C           *IN03     DOWEQ'0'                        *03 DO
     C                     EXFMTDSPC1
     C                     MOVEA*ALL'0'   *IN,60
     C*
     C           *IN03     IFEQ '0'                        *03 IF
     C                     EXSR RTN100                     *CHK SCR
     C*
     C           *IN99     IFEQ '0'                        *99 IF
     C                     OUT  *NAMVAR
     C                     SETON                     03
     C                     END                             *99 IF
     C*
     C                     END                             *03 IF
     C*
     C                     END                             *03 DO
     C                     SETON                     LR
     C*==============================================================*
     C*          RTN100....CHECK 'SC02' SCREEN
     C*==============================================================*
     C           RTN100    BEGSR
     C*
     C           DRA03     IFEQ *BLANK
     C                     SETON                     609899
     C                     END
     C   99                GOTO END100
     C*
     C           DRA04     IFEQ *BLANK
     C                     SETON                     619899
     C                     END
     C   99                GOTO END100
     C*
     C           DRA05     IFEQ 0
     C                     SETON                     629799
     C                     END
     C   99                GOTO END100
     C*
     C           DRA05     IFEQ 0
     C                     SETON                     629799
     C                     END
     C   99                GOTO END100
     C*
     C           DRA07     IFEQ 0
     C                     SETON                     639799
     C                     END
     C*
     C           END100    ENDSR
