     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : R@A003                                     *
     H*    AUTHOR       : A1062   JEANNY LIN                         *
     H*    CREATE DATE  : 79/05/29                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       :應用程式版權保護系統                      *
     H*    PURPOSE      :應用程式版權資料列印                      *
     H****************************************************************
     FR@R003D CF  E                    WORKSTN
     I            DS
     I                                        1  80 RA06
     I                                        1   2 RA601
     I                                        3   4 RA602
     I                                        5   6 RA603
     I                                        7   8 RA604
     I                                        9  10 RA605
     I                                       11  12 RA606
     I                                       13  14 RA607
     I                                       15  16 RA608
     I                                       17  18 RA609
     I                                       19  20 RA610
     I                                       21  22 RA611
     I                                       23  24 RA612
     I                                       25  26 RA613
     I                                       27  28 RA614
     I                                       29  30 RA615
     I                                       31  32 RA616
     I                                       33  34 RA617
     I                                       35  36 RA618
     I                                       37  38 RA619
     I                                       39  40 RA620
     I                                       41  42 RA621
     I                                       43  44 RA622
     I                                       45  46 RA623
     I                                       47  48 RA624
     I                                       49  50 RA625
     I                                       51  52 RA626
     I                                       53  54 RA627
     I                                       55  56 RA628
     I                                       57  58 RA629
     I                                       59  60 RA630
     I                                       61  62 RA631
     I                                       63  64 RA632
     I                                       65  66 RA633
     I                                       67  68 RA634
     I                                       69  70 RA635
     I                                       71  72 RA636
     I                                       73  74 RA637
     I                                       75  76 RA638
     I                                       77  78 RA639
     I                                       79  80 RA640
     ILDA        UDS
     I                                      111 1160DDATE
     I                                      501 502 DRA011
     I                                      503 504 DRA012
     C*==============================================================*
     C*          IDENTIFY A PARAMETER LIST
     C*==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN97     PARM *IN97     IN97    1
     C           CPY       PARM CPY       CPY     30
     C           PRTID     PARM PRTID     PRTID   10
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C  N10                EXSR RTN100
     C                     SETON                     99
     C*
     C           *IN03     DOWEQ'0'
     C           *IN99     ANDEQ'1'
     C                     EXFMTDSPC1
     C                     MOVEA*ALL'0'   *IN,60           *CLEAR
     C  N03                EXSR RTN200                     *CHK FIELD  N
     C                     END
     C*
     C           *NAMVAR   DEFN *LDA      LDA
     C                     OUT  *NAMVAR
     C*
     C   03                SETON                     LR
     C                     RETRN
     C*===============================================================*
     C*          RTN100....INIT SCREEN
     C*===============================================================*
     C           RTN100    BEGSR
     C                     MOVE *BLANK    DRA011
     C                     MOVE '99'      DRA012
     C                     SETON                     10
     C                     ENDSR
     C*===============================================================*
     C*          RTN200....CHECK DATA FROM SCREEN KEY-IN
     C*===============================================================*
     C           RTN200    BEGSR
     C*
     C           DRA011    IFGT DRA012
     C                     SETON                     606198
     C                     SETON                     99
     C                     END
     C*
     C           END200    ENDSR
