     F****************************************************************
     F*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     F*                                                              *
     F*    PROGRAM NAME : R@A007                                     *
     F*    AUTHOR       : A1062   JEANNY LIN                         *
     F*    CREATE DATE  : 79/05/19                                   *
     F*    UPDATE DATE  :                                            *
     F*    SYSTEM       :應用程式版權保護系統                      *
     F*    PURPOSE      :                                            *
     F****************************************************************
     FR@RAPF  IF  E           K        DISK
     IR@DA02      DS
     I                                        1 108 DA02
     I                                        1   2 RA01
     I                                        3   3 RA02
     I                                        4  11 RA03
     I                                       12  15 RA04
     I                                       16  210RA05
     I                                       22 101 RA06
     I                                      102 1080RA07
     C*==============================================================*
     C*                    LIST PARAMETERS
     C*==============================================================*
     C           *ENTRY    PLIST
     C           DRA01     PARM           S0071I  2
     C           DRA02     PARM           S0072I  1
     C                     PARM           S0073I  1
     C                     PARM           S0071O  1
     C*==============================================================*
     C*                    KEY LIST FOR R@RAPF
     C*==============================================================*
     C           KEYRA     KLIST
     C                     KFLD           DRA01   2
     C                     KFLD           DRA02   1
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C           *NAMVAR   DEFN           R@DA02
     C           *LOCK     IN   *NAMVAR
     C           KEYRA     CHAINRA0                  40    *NF
     C   40                MOVE 'Y'       S0071O
     C           S0073I    IFEQ 'Y'
     C  N40                OUT  *NAMVAR                    *SAVE
     C                     END
     C                     SETON                     LR
