     F****************************************************************
     F*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     F*                                                              *
     F*    PROGRAM NAME : R@S002                                     *
     F*    AUTHOR       : A1062   JEANNY LIN                         *
     F*    CREATE DATE  : 79/05/16                                   *
     F*    UPDATE DATE  :                                            *
     F*    SYSTEM       :應用程式版權保護系統                      *
     F*    PURPOSE      :                                            *
     F****************************************************************
     E                    AA          9  1 0
     E                    AB          9  1 0
     I            DS
     I                                        1   7 WR@A
     I                                        1   70WR@AN
     I                                        1   10WR@A1
     I                                        2   20WR@A2
     I                                        3   30WR@A3
     I                                        4   40WR@A4
     I                                        5   50WR@A5
     I                                        6   60WR@A6
     I                                        7   70WR@A7
     I            DS
     I                                        1   9 WR@B
     I                                        1   90WR@BN
     I                                        1   10WR@B1
     I                                        2   20WR@B2
     I                                        3   30WR@B3
     I                                        4   40WR@B4
     I                                        5   50WR@B5
     I                                        6   60WR@B6
     I                                        7   70WR@B7
     I                                        8   80WR@B8
     I                                        9   90WR@B9
     I            DS
     I                                        1   9 WR@N
     I                                        1   90ZZ
     C*==============================================================*
     C*                    LIST PARAMETERS
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WR@A      PARM           S0021I  7
     C           WR@B      PARM           S0022I  9
     C                     PARM           S0021O  4
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     ADD  0         WR@AN
     C                     MOVE WR@A1     AA,1
     C                     MOVE WR@A2     AA,2
     C                     MOVE WR@A3     AA,3
     C                     MOVE WR@A4     AA,4
     C                     MOVE WR@A5     AA,5
     C                     MOVE WR@A6     AA,6
     C                     MOVE WR@A7     AA,7
     C                     Z-ADD1         AA,8
     C                     Z-ADD1         AA,9
     C                     ADD  0         WR@BN
     C                     MOVE WR@B1     AB,1
     C                     MOVE WR@B2     AB,2
     C                     MOVE WR@B3     AB,3
     C                     MOVE WR@B4     AB,4
     C                     MOVE WR@B5     AB,5
     C                     MOVE WR@B6     AB,6
     C                     MOVE WR@B7     AB,7
     C                     MOVE WR@B8     AB,8
     C                     MOVE WR@B9     AB,9
     C*
     C                     Z-ADD0         ZZ
     C           1         DO   9         N       20
     C           AA,N      MULT AB,N      YY      30
     C                     MULT N         YY
     C                     ADD  YY        ZZ
     C                     END
     C                     MOVE WR@N      S0021O
     C                     SETON                     LR
