     F****************************************************************
     F*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     F*                                                              *
     F*    PROGRAM NAME : R@S001                                     *
     F*    AUTHOR       : A1062   JEANNY LIN                         *
     F*    CREATE DATE  : 79/05/16                                   *
     F*    UPDATE DATE  :                                            *
     F*    SYSTEM       :應用程式版權保護系統                      *
     F*    PURPOSE      :                                            *
     F****************************************************************
     E                    AT1    37  37  1
     E                    AT2    37  37  2 0
     E                    AX          7  1 0
     E                    AZ          4  1
     E                    AZA         4  2 0
     E                    AY          6  1 0
     E                    AV         80  1
     E                    AW         80  2 0
     I            DS
     I                                        1   8 WR@X
     I                                        1   80WR@XN
     I                                        2   20WR@X1
     I                                        3   30WR@X2
     I                                        4   40WR@X3
     I                                        5   50WR@X4
     I                                        6   60WR@X5
     I                                        7   70WR@X6
     I                                        8   80WR@X7
     I            DS
     I                                        1   6 WR@Y
     I                                        1   20WY12
     I                                        3   40WY34
     I                                        5   60WY56
     I            DS
     I                                        1   6 WR@YY
     I                                        1   60WR@YN
     I                                        1   20WY12Y
     I                                        3   60WY36
     I                                        1   10WR@Y1
     I                                        2   20WR@Y2
     I                                        3   30WR@Y3
     I                                        4   40WR@Y4
     I                                        5   50WR@Y5
     I                                        6   60WR@Y6
     I            DS
     I                                        1   70ZZ
     I                                        1   7 WR@N
     C*==============================================================*
     C*                    LIST PARAMETERS
     C*==============================================================*
     C           *ENTRY    PLIST
     C           WR@X      PARM           S0011I  8
     C                     PARM           S0012I  4
     C           WR@Y      PARM           S0013I  6
     C                     PARM           S0014I 80
     C                     PARM           S0011O  7
     C*==============================================================*
     C*                    MAIN ROUTINE
     C*==============================================================*
     C                     ADD  0         WR@XN
     C                     MOVE WR@X1     AX,1
     C                     MOVE WR@X2     AX,2
     C                     MOVE WR@X3     AX,3
     C                     MOVE WR@X4     AX,4
     C                     MOVE WR@X5     AX,5
     C                     MOVE WR@X6     AX,6
     C                     MOVE WR@X7     AX,7
     C                     MOVEAS0012I    AZ
     C                     MOVEAS0014I    AV
     C*1
     C                     Z-ADDWY12      WY12Y
     C           WY34      MULT 30        WY36
     C                     ADD  WY56      WY36
     C                     MOVE WR@Y1     AY,1
     C                     MOVE WR@Y2     AY,2
     C                     MOVE WR@Y3     AY,3
     C                     MOVE WR@Y4     AY,4
     C                     MOVE WR@Y5     AY,5
     C                     MOVE WR@Y6     AY,6
     C*2
     C           1         DO   4         Z       10
     C                     Z-ADD1         N       20
     C           AZ,Z      LOKUPAT1,N                    30*EQ
     C   30                MOVE AT2,N     AZA,Z
     C                     END
     C*3
     C           1         DO   80        V       20
     C           AV,V      IFNE *BLANK
     C                     Z-ADD1         N
     C           AV,V      LOKUPAT1,N                    30*EQ
     C   30                MOVE AT2,N     AW,V
     C  N30                MOVE 0         AW,V
     C                     ELSE
     C                     MOVE 0         AW,V
     C                     END
     C                     END
     C*4
     C                     Z-ADD0         ZZ
     C           1         DO   6         W       10
     C           8         SUB  W         AA      10
     C           AX,W      MULT AY,W      BB      20
     C           AA        MULT BB        CC      30
     C                     ADD  CC        ZZ
     C                     END
     C*
     C                     XFOOTAZA       DD      60
     C                     XFOOTAW        EE      70
     C                     MULT AX,7      EE
     C                     MULT AX,7      EE
     C*
     C                     MULT DD        ZZ
     C                     ADD  EE        ZZ
     C*
     C                     MOVE WR@N      S0011O
     C*
     C                     SETON                     LR
     C                     RETRN
**
 @0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ
**
3264484950515253545556576566676869707172737475767778798081828384858687888990
