     H****************************************************************
      *    PROGRAM NAME : S@R08                                      *
      *    AUTHOR       : A1046  JOHNSON CHEN                        *
      *    CREATE DATE  : 78/11/28                                   *
      *    UPDATE DATE  :                                            *
      *    SYSTEM       :泛太系統                                  *
      *    SUBSYSTEM    :安全管制系統                              *
      *    PURPOSE      :終端機使用權檢核表列印                    *
      *    INDICATORS   :                                            *
      *            39   : OVERFLOW --- IN F-SPEC DEFINES             *
      *                   AFTER OVERFLOW , REMEMBER SETOF            *
      ****************************************************************
     FS@SRPF  IP  E           K        DISK
     FS@R08P  O   E             39     PRINTER
     I           UDS
     I                                      111 1160DDATE
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N30                WRITEPH1                        *FIRST
     C                     SETON                     30
     C           *IN39     IFEQ '1'
     C                     WRITEPE1
     C                     WRITEPH1                        *NEXT PAGE
     C                     END
     C           I         IFEQ 0
     C                     ADD  1         I       10
     C                     MOVELSR01      PSR011
     C                     MOVELSR02      PSR021
     C                     MOVELSR03      PSR031
     C                     ELSE
     C                     Z-ADD0         I
     C                     MOVELSR01      PSR012
     C                     MOVELSR02      PSR022
     C                     MOVELSR03      PSR032
     C                     WRITEPD1                    39  *WRITE RCDS
     C                     MOVE *BLANK    PSR011
     C                     MOVE *BLANK    PSR021
     C                     MOVE *BLANK    PSR031
     C                     MOVE *BLANK    PSR012
     C                     MOVE *BLANK    PSR022
     C                     MOVE *BLANK    PSR032
     C                     END
      *
     CLR         I         IFEQ 1
     CLR                   WRITEPD1                    39  *HALF RCDS
     CLR                   END
     CLR                   WRITEPE2                        *LR
