      ****************************************************************
      *    PROGRAM NAME : S@R061                                     *
      *    AUTHOR       : A1046  JOHNSON CHEN                        *
      *    CREATE DATE  : 78/11/27                                   *
      *    UPDATE DATE  :                                            *
      *    SYSTEM       :泛太系統                                  *
      *    SUBSYSTEM    :安全管制系統                              *
      *    PURPOSE      :程式使用權檢核表列印                      *
      *    PROCEDURE    : S@R060C                                    *
      *    INDICATORS   :                                            *
      *         60-65   : FIELD CNOTROL (PC RI)                      *
      *            99   : ERROR                                      *
      *            98   : ERROR MESSAGE                              *
      ****************************************************************
     FS@R06D  CF  E                    WORKSTN
     ILDA        UDS
     I                                      111 1160DDATE
     I                                      501 510 DSU011
     I                                      511 520 DSU012
     I                                      521 530 DSU021
     I                                      531 540 DSU022
     I                                      541 550 DSU031
     I                                      551 560 DSU032
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN95     PARM *IN95     IN95    1
      *==============================================================*
      *          MAIN ROUTINE
      *==============================================================*
     C  N95                EXSR RTN100                     *INIT VALUE
     C                     EXFMTDSPC1
      *
     C           *IN03     DOWEQ'0'
     C           *IN99     ANDEQ'1'
     C                     MOVEA*ALL'0'   *IN,60           *CLEAR
     C                     EXSR RTN200                     *CHK FIELD  N
     C   99                EXFMTDSPC1
     C                     END
      *
     C           *NAMVAR   DEFN *LDA      LDA
     C                     OUT  *NAMVAR
     C                     RETRN
      *==============================================================*
      *          RTN100....INITIAL VALUE
      *==============================================================*
     CSR         RTN100    BEGSR
     C                     MOVE *BLANK    DSU011
     C                     MOVE *BLANK    DSU012
     C                     MOVE *BLANK    DSU021
     C                     MOVE *BLANK    DSU022
     C                     MOVE *BLANK    DSU031
     C                     MOVE *BLANK    DSU032
     C                     SETON                     99
     C                     ENDSR
      *==============================================================*
      *          RTN200....CHECK SCREEN FIELDS
      *==============================================================*
     CSR         RTN200    BEGSR
      *CHECK輸入使用者代號　起不可大於迄
     C           DSU011    IFGT DSU012
     C                     SETON                     6061
     C                     SETON                     9899
     C                     END
     C   99                GOTO END200
      *CHECK輸入程式代號　起不可大於迄
     C           DSU021    IFGT DSU022
     C                     SETON                     6263
     C                     SETON                     9899
     C                     END
     C   99                GOTO END200
      *CHECK輸入ＬＩＢＲＡＲＹ　起不可大於迄
     C           DSU031    IFGT DSU032
     C                     SETON                     6465
     C                     SETON                     9899
     C                     END
     C   99                GOTO END200
      *
     C           DSU011    IFEQ *BLANK
     C           DSU012    ANDEQ*BLANK
     C                     MOVE *HIVAL    DSU012
     C                     END
     C           DSU021    IFEQ *BLANK
     C           DSU022    ANDEQ*BLANK
     C                     MOVE *HIVAL    DSU022
     C                     END
     C           DSU031    IFEQ *BLANK
     C           DSU032    ANDEQ*BLANK
     C                     MOVE *HIVAL    DSU032
     C                     END
     CSR         END200    ENDSR
