     H****************************************************************
     H*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     H*                                                              *
     H*    PROGRAM NAME : S@R07                                      *
     H*    AUTHOR       : A1038   CATHY SUN                          *
     H*    CREATE DATE  : 79/02/10                                   *
     H*    UPDATE DATE  :                                            *
     H*    SYSTEM       : SECURITY SYSTEM                            *
     H*    REMARK       :程式使用權列印（依程式別）                *
     H****************************************************************
     FS@SUPF  IP  E           K        DISK
     FS@SPPF  IF  E           K        DISK
     FS@R07P  O   E             39     PRINTER
     I****************************************************************
     ISU0
     I                                              SU02  L1
     I           UDS
     I                                      111 1160DDATE
     I                                      501 510 DSU011
     I                                      511 520 DSU012
     I                                      521 530 DSU021
     I                                      531 540 DSU022
     I                                      541 550 DSU031
     I                                      551 560 DSU032
     C****************************************************************
     C*                    MAIN ROUTINE
     C****************************************************************
     C           *IN10     IFEQ '0'
     C                     WRITEPH1
     C                     SETON                     1031
     C                     END
     C*
     C           *IN39     IFEQ '1'
     C* OVERFLOW : SKIP PAGE :
     C                     EXSR RTN100
     C                     END
     C*
     C           SU02      CHAINS@SPPF               40    *NF
     C   40                MOVE *BLANK    SP02
     C  N40                WRITEPD1
     C                     SETOF                     31
     C*
     CL1                   SETON                     31
     CLR                   EXSR RTN200
     C****************************************************************
     C*          RTN100    OVERFLOW
     C****************************************************************
     C           RTN100    BEGSR
     C                     WRITEPE1
     C                     WRITEPH1
     C                     SETOF                     39
     C                     ENDSR
     C****************************************************************
     C*          RTN200    END OF REPORT
     C****************************************************************
     C           RTN200    BEGSR
     C           *IN39     IFEQ '1'
     C* OVERFLOW : SKIP PAGE :
     C                     EXSR RTN100
     C                     END
     C                     WRITEPE2
     C                     ENDSR
