             PGM
             DCLF       FILE(*LIBL/ATN01D)
             CHGVAR     VAR(&DOPT) VALUE(' ')
             SNDRCVF    RCDFMT(DSPC1)
             IF         COND(&IN03 *EQ '1') THEN(GOTO CMDLBL(ENDLBL))
             IF         COND(&DOPT *EQ '1') THEN(DSPMSG)
             IF         COND(&DOPT *EQ '2') THEN(WRKSPLF)
             IF         COND(&DOPT *EQ '3') THEN(WRKSBMJOB)
             IF         COND(&DOPT *EQ '4') THEN(WRKACTJOB)
 ENDLBL:     ENDPGM
