             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&USER)  TYPE(*CHAR) LEN(10)
             DCLF       FILE(*LIBL/FIA02CD) RCDFMT(DSPC1)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&USER)
             RTVDTAARA  DTAARA(*LDA (111 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&DDATE) VALUE(&WDATE)
  START:     SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             IF         (&DOPID = '01') THEN(WRKSPLF)
             IF         (&DOPID = '02') THEN(WRKACTJOB)
             IF         (&DOPID = '03') THEN(DSPMSG)
             IF         (&DOPID = '90') THEN(RETURN)
             GOTO       START
             ENDPGM
