     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM NAME : HELLO                                     */
     /*    AUTHOR       : A1062   JEANNY LIN                        */
     /*    CREATE DATE  : 79/05/25                                  */
     /*    UPDATE DATE  :                                           */
     /***************************************************************/
             PGM        PARM(&HELLO)
             DCL        VAR(&HELLO) TYPE(*CHAR) LEN(1)
             SNDMSG     MSG('ACCESS VIOLATION, ERROR-CODE =' *BCAT +
                          &HELLO) TOUSR(QSYSOPR)
             ENDPGM
