/********************************************************************/
/*                                                                  */
/* 5728SS1 R02 M00 900303    RTVCLSRC Output     07/11/90 08:30:17  */
/*                                                                  */
/* Program name . . . . . . . . . . . . . . :   P50               PN*/
/* Library name . . . . . . . . . . . . . . :   PTPLIB            PL*/
/* Original source file . . . . . . . . . . :   QCLSRC            SN*/
/* Library name . . . . . . . . . . . . . . :   PTPLIB            SL*/
/* Original source member . . . . . . . . . :   P50               SM*/
/* Source file change                                               */
/*   date/time  . . . . . . . . . . . . . . :   07/06/90 09:48:45 SC*/
/* Patch option . . . . . . . . . . . . . . :   *NOPATCH          PO*/
/* User profile . . . . . . . . . . . . . . :   *USER             UP*/
/* Text . . . : RECEIVE PROGRAM MSESSAGE                          TX*/
/* Owner  . . . . . . . . . . . . . . . . . :   QSECOFR           OW*/
/* Patch change ID  . . . . . . . . . . . . :                     PC*/
/* Patch APAR ID  . . . . . . . . . . . . . :                     PA*/
/* User mod flag  . . . . . . . . . . . . . :   *YES              UM*/
/*                                                                ED*/
/********************************************************************/
     PGM PARM(&MSG)
     DCL VAR(&MSG) TYPE(*CHAR) LEN(78)
     CALL PGM(R@S005) PARM('GIANT/PT')
     RCVMSG PGMQ(*PRV) MSGQ(*PGMQ) MSGTYPE(*NEXT) MSGKEY(*TOP) -
MSG(&MSG)
     ENDPGM
