     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM NAME : P52                                       */
     /*    AUTHOR       : A1092   TAYLOR                            */
     /*    CREATE DATE  : 80/03/16                                  */
     /*    UPDATE DATE  :                                           */
     /***************************************************************/
             PGM        PARM(&LIB &FIL &MSGID &MSGTXT)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&FIL) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MSGID) TYPE(*CHAR) LEN(7)
             DCL        VAR(&MSGTXT) TYPE(*CHAR) LEN(132)
             CALL       PGM(R@S005) PARM('GIANT/PT')
             IF         COND((%SST(&LIB 1 5) *EQ '*LIBL') *OR +
                          (%SST(&LIB 1 5) *EQ '*libl')) THEN(RTVMSG +
                          MSGID(&MSGID) MSGF(&FIL) MSG(&MSGTXT))
             ELSE       CMD(RTVMSG MSGID(&MSGID) MSGF(&LIB/&FIL) +
                          MSG(&MSGTXT))
             ENDPGM
