             PGM
             DCLF       FILE(P61D)
             DCL        VAR(&WRK) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DOUTQ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&DCOPY) TYPE(*DEC) LEN(3)
             DCL        VAR(&FLAG) TYPE(*CHAR) LEN(8) VALUE('GIANT/PT')
 /**/
             CALL       PGM(R@S005) PARM(&FLAG)
             RTVJOBA    JOB(&DWRK)
 STRLBL:     SNDRCVF    DEV(*FILE) RCDFMT(P61DR)
                        CHGVAR  &IN61    VALUE('0')
                        CHGVAR  &IN62    VALUE('0')
             RMVMSG     CLEAR(*ALL)
             IF         COND(&IN03) THEN(GOTO CMDLBL(ENDLBL))
             IF         COND(%SST(&DOUTQ 1 1) *EQ ' ') THEN(DO)
                        CHGVAR  &IN61    VALUE('1')
             CHGVAR     VAR(&ERRMSG) VALUE('訊息:OUTQ編號不可空白')
                        GOTO       CMDLBL(STRLBL)
                        ENDDO
             CHKOBJ     OBJ(&DOUTQ) OBJTYPE(*OUTQ)
             MONMSG     MSGID(CPF9801) EXEC(DO)
                        CHGVAR  &IN61    VALUE('1')
                        CHGVAR  &ERRMSG  VALUE('訊息:OUTQ編號不存在')
                        GOTO       CMDLBL(STRLBL)
                        ENDDO
             IF         COND(&DCOPY *GT 255 *OR &DCOPY *LT 1) THEN(DO)
                        CHGVAR  &IN62    VALUE('1')
                        CHGVAR  &ERRMSG VALUE('訊息:COPY份數不在1～255')
                        GOTO       CMDLBL(STRLBL)
                        ENDDO
             CHGVAR     VAR(%SST(*LDA 81 10)) VALUE(&DOUTQ)
             CHGVAR     VAR(%SST(*LDA 91 3)) VALUE(&DCOPY)
 ENDLBL:     ENDPGM
