             PGM        PARM(&P6201I &P6202I &P6211O)
             DCL        VAR(&P6201I)  TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&P6202I)  TYPE(*DEC)  LEN(4 0)
             DCL        VAR(&P6211O)  TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&TOVAR)   TYPE(*CHAR) LEN(6)
             DCL        VAR(&WRKDAT)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&TMPDAT)  TYPE(*CHAR) LEN(6)
             DCL        VAR(&TMPDATD) TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&JULIANA) TYPE(*CHAR) LEN(5)
             DCL        VAR(&YRD)     TYPE(*DEC)  LEN(2 0)
             DCL        VAR(&TMPYRD)  TYPE(*DEC)  LEN(4)
             DCL        VAR(&YRC)     TYPE(*CHAR) LEN(4)
             DCL        VAR(&DAYSD)   TYPE(*DEC)  LEN(9 0)
             DCL        VAR(&LEAP)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&NUM5)    TYPE(*DEC)  LEN(5 0)
             DCL        VAR(&DAYSINYEAR) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&FLAG) TYPE(*CHAR) LEN(8) VALUE('GIANT/PT')
             /*         */
             CALL       PGM(R@S005) PARM(&FLAG)
             CHGVAR     &WRKDAT &P6201I
             CHGVAR     &TMPDAT ((%SST(&WRKDAT 1 2)) *TCAT ('0100'))
             CHGVAR     &TMPDATD &TMPDAT
             CALL       P20 PARM(&TMPDATD &P6201I &DAYSD)
             /*         */
             CHGVAR     &YRD %SST(&WRKDAT 1 2)
             CHGVAR     VAR(&NUM5) VALUE(&DAYSD + &P6202I)
 CHKPLUS:    IF         (&NUM5 *GT 0) GOTO CHKLEAP
             IF         (&YRD *EQ 00) CHGVAR &YRD 99
             ELSE       CHGVAR &YRD (&YRD - 1)
 CHKLEAP:    CHGVAR     &YRC &YRD
             CHGVAR     &TMPDAT (%SST(&YRC 3 2) *CAT '0229')
             CHGVAR     &TMPDATD &TMPDAT
             CALL       P04 PARM(&TMPDATD &LEAP)
             IF         (&LEAP *EQ 'Y') CHGVAR &DAYSINYEAR 366
             ELSE       CHGVAR  &DAYSINYEAR 365
             /*         */
             IF         (&NUM5 *LE 0) DO
             CHGVAR     &NUM5 (&NUM5 + &DAYSINYEAR)
             GOTO       CHKPLUS
             ENDDO
             IF         (&NUM5 *GT &DAYSINYEAR) DO
             IF         (&YRD *EQ 99) CHGVAR &YRD -1
             CHGVAR     &YRD (&YRD + 1)
             CHGVAR     &NUM5 (&NUM5 - &DAYSINYEAR)
             GOTO       CHKLEAP
             ENDDO
             CHGVAR     &DAYSD &NUM5
             CHGVAR     &TMPYRD (&YRD + 1911)
             CHGVAR     &YRC   &TMPYRD
             CHGVAR     (%SST(&JULIANA 1 2)) (%SST(&YRC 3 2))
             CHGVAR     %SST(&JULIANA 3 3) &DAYSD
             CVTDAT     DATE(&JULIANA) TOVAR(&TOVAR) FROMFMT(*JUL) +
                          TOFMT(*MDY) TOSEP(*NONE)
             /*         */
             CHGVAR     %SST(&WRKDAT 1 2) &YRD
             CHGVAR     (%SST(&WRKDAT 3 4)) (%SST(&TOVAR 1 4))
             CHGVAR     &P6211O &WRKDAT
             ENDPGM
