     A*****************************************************************
     A*               印表機代碼資料檔(P64F)
     A*****************************************************************
     A                                      UNIQUE
     A          R P64R
     A            P6401          2          COLHDG('印表機代碼')
     A            P6402         10          COLHDG('印表機名稱')
     A            P6403         10          COLHDG('OUTQ' )
     A            P6404         12O         COLHDG('印表機說明')
     A          K P6401
