             PGM
             DCL        VAR(&IN1) TYPE(*CHAR) LEN(80)
             DCL        VAR(&IN2) TYPE(*CHAR) LEN(80)
             DCL        VAR(&OT1) TYPE(*CHAR) LEN(161)
             DCL        VAR(&OT2) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&WS)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&LEN) TYPE(*CHAR) LEN(3)
/**/
 /**/
 INIT:
             RTVJOBA    JOB(&WS)
 START:
            ?CHGDTAARA  DTAARA(*LDA  (1 80))
            ?CHGDTAARA  DTAARA(*LDA  (101 80))
             RTVDTAARA  DTAARA(*LDA (1 80)) RTNVAR(&IN1)
             RTVDTAARA  DTAARA(*LDA (101 80)) RTNVAR(&IN2)
             CALL       PGM(P73) PARM(&IN1 &IN2 &OT1 &OT2)
             CHGDTAARA  DTAARA(*LDA (201 161)) VALUE(&OT1)
             CHGVAR     VAR(&LEN) VALUE(&OT2)
             CHGDTAARA  DTAARA(*LDA (401 3)) VALUE(&LEN)
             DSPDTAARA  DTAARA(*LDA)
             SNDBRKMSG  MSG(&OT1) TOMSGQ(&WS)

 EOJ:
             ENDPGM
