/********************************************************************/
/* Program name . . . . . . . . . . . . . . :   P75                 */
/* Source file change . . . . . . . . . . . :   92/09/22            */
/* PURPOSE :選擇列印環境與印表機                                  */
/* USE     : &PRTF : PRINT FILE ID                                  */
/*           &PENV : 1- INQUIRY                                     */
/*                   2- BATCH PROCESS                               */
/*           &CPY  :列印份數                                      */
/*           &PRTNM: PRINTER ID                                     */
/********************************************************************/
 PGM PARM(&PRTF &PENV &CPY &PRTNM)

     DCL VAR(&PENV)    TYPE(*CHAR) LEN(1)
     DCL VAR(&PRTF)    TYPE(*CHAR) LEN(10)
     DCL VAR(&CPY)     TYPE(*DEC)  LEN(3 0)
     DCL VAR(&PRTNM)   TYPE(*CHAR) LEN(10)

     DCL VAR(&FLAG) TYPE(*CHAR) LEN(8) VALUE('GIANT/PT')
     CALL PGM(R@S005) PARM(&FLAG)

  /*查詢*/
     IF COND(&PENV = '1') THEN(DO)
        DSPSPLF FILE(&PRTF) SPLNBR(*LAST)
        MONMSG  MSGID(CPF0000)
        DLTSPLF FILE(&PRTF) SPLNBR(*LAST)
        MONMSG  MSGID(CPF0000)
        GOTO    CMDLBL(ENDPGM)
     ENDDO

  /* CHGSPLFA & STRPRTWTR */
     IF COND(&CPY = 0) THEN(CHGVAR VAR(&CPY) VALUE(1))
     IF COND(&PRTNM = ' ') THEN(DO)
        CHGSPLFA   FILE(&PRTF) SPLNBR(*LAST) COPIES(&CPY) +
                   SCHEDULE(*IMMED) SAVE(*NO)
        MONMSG MSGID(CPF0000)
     ENDDO
     ELSE (DO)
        CHGSPLFA  FILE(&PRTF) SPLNBR(*LAST) DEV(&PRTNM) +
                  COPIES(&CPY) OUTQ(*DEV) SCHEDULE(*IMMED) +
                  SAVE(*NO)
        MONMSG MSGID(CPF0000)
     ENDDO

     CHGJOB INQMSGRPY(*SYSRPYL)
     STRPRTWTR  DEV(&PRTNM) OUTQ(*DEV) MSGQ(*REQUESTER)
     MONMSG MSGID(CPF0000)
     CHGJOB INQMSGRPY(*RQD)

ENDPGM: +
     RCLRSC
     RETURN
     ENDPGM
