/********************************************************************/
/*                                                                  */
/* 5728SS1 R01 M02 890615    RTVCLSRC Output     11/28/89 10:54:04  */
/*                                                                  */
/* Program name . . . . . . . . . . . . . . :   PTB851            PN*/
/* Library name . . . . . . . . . . . . . . :   PTPTLIB           PL*/
/* Original source file . . . . . . . . . . :   QCLSRC            SN*/
/* Library name . . . . . . . . . . . . . . :   PTPTLIB           SL*/
/* Original source member . . . . . . . . . :   PTB851            SM*/
/* Source file change                                               */
/*   date/time  . . . . . . . . . . . . . . :   11/24/89 17:01:39 SC*/
/* Patch option . . . . . . . . . . . . . . :   *NOPATCH          PO*/
/* User profile . . . . . . . . . . . . . . :   *USER             UP*/
/* Text . . . : CRT TEMP DB/PGM FILES ACCORDING INPUT PARMS       TX*/
/* Owner  . . . . . . . . . . . . . . . . . :   A1046             OW*/
/* Patch change ID  . . . . . . . . . . . . :                     PC*/
/* Patch APAR ID  . . . . . . . . . . . . . :                     PA*/
/* User mod flag  . . . . . . . . . . . . . :   *YES              UM*/
/*                                                                ED*/
/********************************************************************/
     PGM PARM(&FILES &LIB &PGMS &LIB1)
     DCL VAR(&FILES) TYPE(*CHAR) LEN(10)
     DCL VAR(&LIB) TYPE(*CHAR) LEN(10)
     DCL VAR(&LIB1) TYPE(*CHAR) LEN(10)
     DCL VAR(&PGMS) TYPE(*CHAR) LEN(10)
     DCL VAR(&WRKSTN) TYPE(*CHAR) LEN(10)
     DCL VAR(&OLDCURLIB) TYPE(*CHAR) LEN(10)
INIT:
             RTVJOBA    JOB(&WRKSTN) CURLIB(&OLDCURLIB)
     CALL P63
     CHGCURLIB CURLIB(&LIB)
     CHGDTAARA DTAARA(*LDA (500 10)) VALUE(&FILES)
     CHGDTAARA DTAARA(*LDA (510 10)) VALUE(&LIB)
     CHGDTAARA DTAARA(*LDA (520 10)) VALUE(&PGMS)
     CHGDTAARA DTAARA(*LDA (530 10)) VALUE(&WRKSTN)
     CHGDTAARA DTAARA(*LDA (540 10)) VALUE(&LIB1)
     SBMJOB CMD(CALL PGM(PTB851A)) JOB(PTB851)
     CHGCURLIB CURLIB(&OLDCURLIB)
EOJ:
     ENDPGM
