 /*------------------------------------------------------------------*/
 /*  ™â™ã Computer  Center  of  Lucoral  Company                   */
 /*------------------------------------------------------------------*/
 /*   1. AUTHOR      : K.C.HSIAO                                     */
 /*   2. CREATE DATE : 03/21/1989                                    */
 /*   3. FUNCTION    : TRANSLATE MAP TO PRTF (CMD)                   */
 /*------------------------------------------------------------------*/
             CMD        PROMPT('TRANSLATE PRTF')

             PARM       KWD(MBR)        TYPE(*NAME)   LEN(10)        +
                        MIN(1)          PROMPT('Edit mbr:')

             PARM       KWD(TOMBR)      TYPE(*NAME)   LEN(10)        +
                        MIN(1)          PROMPT('PRTF mbr:')

             PARM       KWD(TOFILE)     TYPE(*NAME)   LEN(10)        +
                        MIN(1)          PROMPT('Source file:')

             PARM       KWD(TOLIB)      TYPE(*NAME)   LEN(10)        +
                        MIN(1)          PROMPT('Source lib:')

             PARM       KWD(TRANS)      TYPE(*CHAR)   LEN(1)         +
                        RSTD(*YES)      VALUES('Y' 'N')              +
                        DFT(N)                                       +
                        PROMPT('Translate(Y,N):')

             PARM       KWD(COMPILE)    TYPE(*CHAR)   LEN(1)         +
                        RSTD(*YES)      VALUES('Y' 'N')              +
                        DFT(N)                                       +
                        PROMPT('Compile(Y,N):')
