             PGM        PARM(&DATE)
             DCL        VAR(&DATE) TYPE(*DEC) LEN(15 5)
             DCL        VAR(&DATEX) TYPE(*CHAR) LEN(17)
             DCL        VAR(&DAT) TYPE(*CHAR) LEN(6)
             DCL        VAR(&TIM) TYPE(*CHAR) LEN(6) VALUE('070000')
             DCL        VAR(&DATTIM) TYPE(*CHAR) LEN(13)
 LOOP:       CHGVAR     VAR(&DATEX) VALUE(&DATE)
             CHGVAR     VAR(&DAT) VALUE(%SST(&DATEX  6 6))
             CHGVAR     VAR(&DATTIM) VALUE(&DAT *BCAT &TIM)
             CHGSYSVAL  SYSVAL(QIPLDATTIM) VALUE(&DATTIM)
             DSPSYSVAL  SYSVAL(QIPLDATTIM)
 EOJ:
             ENDPGM
