             PGM
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
 WS:         RTVJOBA    JOB(&JOB)
 SEND:       SNDBRKMSG  MSG('PARAMETERS SHOULD BE "FILES-CRITERIA +
                          FILE-LIB PROGRAMS-CRITERIA PGM-LIB" +
                          IN KEYWORD FORMAT') TOMSGQ(&JOB)
 EOJ:
             ENDPGM
