             PGM
             DCL        VAR(&FILES) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB1) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGMS) TYPE(*CHAR) LEN(10)
             DCL        VAR(&WRKSTN) TYPE(*CHAR) LEN(10)
             CHGVAR     VAR(&FILES)  VALUE(%SST(*LDA 500 10))
             CHGVAR     VAR(&LIB)  VALUE(%SST(*LDA 510 10))
             CHGVAR     VAR(&PGMS) VALUE(%SST(*LDA 520 10))
             CHGVAR     VAR(&WRKSTN) VALUE(%SST(*LDA 530 10))
             CHGVAR     VAR(&LIB1) VALUE(%SST(*LDA 540 10))
 /**/
 START:      DSPDBR     FILE(&LIB/&FILES) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/F1PF)
             MONMSG     MSGID(CPF3012) EXEC(DO)
             SNDBRKMSG  MSG('CPF3012--->FILE' *BCAT &FILES *BCAT +
                          '不存在於' *BCAT &LIB *BCAT '中') +
                          TOMSGQ(&WRKSTN)
             GOTO       EOJ
             ENDDO
             CRTPF      FILE(QTEMP/FLPF) SRCFILE(PTFLIB/QDDSSRC) +
                          OPTION(*NOSRC *NOLIST *NOSECLVL)
             MONMSG     MSGID(CPF7302)     /* FILE "FLPF" ALREADY   */
                                           /* EXISTED, IT IS OKEY.  */
             CPYF       FROMFILE(QTEMP/F1PF) TOFILE(QTEMP/FLPF) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             DLTF       FILE(QTEMP/F1PF)
             DSPPGMREF  PGM(&LIB1/&PGMS) OUTPUT(*OUTFILE) +
                          OUTFILE(QTEMP/P1PF)
             CRTPF      FILE(QTEMP/PGPF) SRCFILE(PTFLIB/QDDSSRC) +
                          OPTION(*NOSRC *NOLIST *NOSECLVL)
             MONMSG     MSGID(CPF7302)    /* FILE "PGPF" ALREADY    */
                                          /* EXISTED, IT IS OKEY.   */
             CPYF       FROMFILE(QTEMP/P1PF) TOFILE(QTEMP/PGPF) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             DLTF       FILE(QTEMP/P1PF)
             DSPFD      FILE(&LIB/&FILES) TYPE(*BASATR) +
                          OUTPUT(*OUTFILE) OUTFILE(QTEMP/T1PF) +
                          FILEATR(*PF *LF)
             CRTPF      FILE(QTEMP/TXPF) SRCFILE(PTFLIB/QDDSSRC) +
                          OPTION(*NOSRC *NOLIST *NOSECLVL)
             MONMSG     MSGID(CPF7302)    /* FILE "TXPF" ALREADY    */
                                          /* EXISTED, IT IS OKEY.   */
             CPYF       FROMFILE(QTEMP/T1PF) TOFILE(QTEMP/TXPF) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             DLTF       FILE(QTEMP/T1PF)
             OVRDBF     FILE(FLPF) TOFILE(QTEMP/FLPF)
             OVRDBF     FILE(PGPF) TOFILE(QTEMP/PGPF)
             OVRDBF     FILE(TXPF) TOFILE(QTEMP/TXPF)
             CALL  PTB854
 /**/
             DLTOVR     FILE(FLPF PGPF TXPF)
 EOJ:
             ENDPGM
