             PGM
             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
 WS:         RTVJOBA    JOB(&JOB)
 SEND:       SNDBRKMSG  MSG('Parameters Should Be "Message-File +
                          Library Message-ID" In Keyword +
                          Format') TOMSGQ(&JOB)
 EOJ:
             ENDPGM
