             CMD        PROMPT('PRINT PGMS WHICH USE FILES')
             PARM       KWD(FILE) TYPE(*CHAR) LEN(10) SPCVAL((*ALL) +
                          (GENERIC*)) MIN(1) MAX(1) PROMPT('FILE NAME')
             PARM       KWD(FLIB) TYPE(*CHAR) LEN(10) MIN(1) MAX(1) +
                          PROMPT('FILES LIBRARY NAME')
             PARM       KWD(PGM) TYPE(*CHAR) LEN(10) SPCVAL((*ALL) +
                          (GENERIC*)) MIN(1) MAX(1) PROMPT('PROGRAM +
                          NAME')
             PARM       KWD(PLIB) TYPE(*CHAR) LEN(10) MIN(1) MAX(1) +
                          PROMPT('PROGRAMS LIBRARY NAME')
