             PGM        PARM(&B &C &F &L &N &O &S &T)
             DCL        VAR(&B)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&C)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&F)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&L)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&N)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&O)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&S)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&T)   TYPE(*CHAR) LEN(10)

             IF         COND(&B = 'L' *OR &B = 'X') THEN(DO)
                        SNDPGMMSG MSG('User Option ' *CAT &C *CAT +
                          '不能被用在Work With Libraries')
                        GOTO EOJ
                        ENDDO
             IF         COND(&B = 'O') THEN(DO)
             IF         COND(&T = '*PGM') THEN(DO)
             SBMJOB     CMD(CHGPGM PGM(&L/&N) OPTIMIZE(*YES)) JOB(&N)
             SNDPGMMSG  MSG('Program' *BCAT &N *BCAT '已送至Batch +
                          By Change Program Command With +
                          OPTIMIZE(*YES)')
                        ENDDO
             ELSE       DO
             SNDPGMMSG  MSG('User Option ' *CAT &C *CAT +
                          '不能被用在Object Type: ' *CAT &T)
                        ENDDO
                        GOTO EOJ
                        ENDDO

 /******  COMPILE PGM WITH GENOPT(*OPTIMIZE)  ******/
             IF     COND(&S *EQ 'RPG') THEN(DO)
             SBMJOB     CMD(CRTRPGPGM PGM(&O/&N) SRCFILE(&L/&F) +
                          GENOPT(*OPTIMIZE)) JOB(&N)
                    GOTO MSG
                    ENDDO
             IF     COND(&S *EQ 'CBL') THEN(DO)
             SBMJOB     CMD(CRTCBLPGM PGM(&O/&N) SRCFILE(&L/&F) +
                          GENOPT(*OPTIMIZE)) JOB(&N)
                    GOTO MSG
                    ENDDO
             IF     COND(&S *EQ 'CLP') THEN(DO)
             SBMJOB     CMD(CRTCLPGM PGM(&O/&N) SRCFILE(&L/&F)) JOB(&N)
                    GOTO CLPMSG
                    ENDDO

             SNDPGMMSG  MSG('User Option ' *CAT &C *CAT +
                          '不能被用在Member Type: ' *CAT &S)
             GOTO EOJ
    MSG:
             SNDPGMMSG  MSG('Member' *BCAT &N *BCAT +
                          '已送至Batch Compile With +
                          GENOPT(*OPTIMIZE)')
             GOTO EOJ
    CLPMSG:
             SNDPGMMSG  MSG('Member' *BCAT &N *BCAT '已送至Batch +
                          Compile ')
             GOTO EOJ
    EOJ:     ENDPGM
