   PGM  PARM(&MBR &FILE &LIBR &LENGTH &WIDTH &OVER &DEST &FCFC)
             DCL     &MBR    *CHAR     10
             DCL     &FILE   *CHAR     10
             DCL     &LIBR   *CHAR     10
             DCL     &OBJECT *CHAR     23
             DCL     &LFILE  *DEC      2   1
             DCL     &LLIBR  *DEC      2   1
             DCL     &NUM    *CHAR     2
             DCL     &LENGTH *DEC      3
             DCL     &WIDTH  *DEC      3
             DCL     &OVER   *DEC      3
             DCL     &DEST   *CHAR     10
             DCL     &FCFC   *CHAR     5
             MONMSG     MSGID(CPF0000)
             MONMSG     MSGID(CPF7302)
             MONMSG     MSGID(CPF7306)
             DLTF       FILE(PTFLIB/PXLF)
CHKLIBRL:
             IF (%SST(&LIBR &LLIBR 1) *EQ ' ') GOTO CHKFILEL
             CHGVAR  &LLIBR VALUE(&LLIBR + 1)
             GOTO CHKLIBRL
CHKFILEL:
             IF (%SST(&FILE &LFILE 1) *EQ ' ') GOTO START
             CHGVAR  &LFILE VALUE(&LFILE + 1)
             GOTO CHKFILEL
START:
             OVRDBF     FILE(QDDSSRC) TOFILE(QLIBS/QDDSSRC) MBR(PXLF)
             CHGVAR     &LLIBR  VALUE(&LLIBR - 1)
             CHGVAR     &NUM    VALUE(&LLIBR)
             CHGVAR     &LIBR   VALUE(%SST(&LIBR 1 &LLIBR))
             CHGVAR     &LFILE  VALUE(&LFILE - 1)
             CHGVAR     &FILE   VALUE(%SST(&FILE 1 &LFILE))
             CHGVAR     &OBJECT VALUE('(' *CAT &LIBR *TCAT '/' *CAT +
                        &FILE *TCAT ')')
             CALL    PGM(PTPLIB/PXEDTLF) PARM(&OBJECT)
             DLTOVR     FILE(QDDSSRC)
             CRTLF      FILE(PTFLIB/PXLF) SRCFILE(QLIBS/QDDSSRC) +
                          DTAMBRS((&LIBR/&FILE (&MBR))) LVLCHK(*NO)
             CRTPRTF    FILE(PTFLIB/PXPRTF) PAGESIZE(&LENGTH &WIDTH) +
                          OVRFLW(&OVER) CTLCHAR(&FCFC)
             CALL       PGM(PTPLIB/PX)
             CHGSPLFA   FILE(PXPRTF) SPLNBR(*LAST) DEV(&DEST)
             DLTSPLF    FILE(PXLF) SPLNBR(*LAST)
             DLTF       FILE(PTFLIB/PXLF)
             DLTF       FILE(PTFLIB/PXPRTF)
   ENDPGM
