/* TAACLPGC - Scan a variable - CPP for SCNVAR                   */
             PGM
             DCL        &RESULT *DEC LEN(3 0)
             DCL        &RESULTA *CHAR 3
             DCL        &STRING *CHAR LEN(999)
             DCL        &STRINGLEN *DEC LEN(3 0)
             DCL        &STRPOS *DEC LEN(3 0)
             DCL        &PATTERN *CHAR LEN(999)
             DCL        &PATTERNLEN *DEC LEN(3 0)
             DCL        &TRANSLATE *CHAR LEN(4)
             DCL        &TRIM *CHAR LEN(4)
             DCL        &WILD *CHAR LEN(1)
             CHGVAR     &STRING     VALUE(QCLSRC)
             CHGVAR     &STRINGLEN  VALUE(10)
             CHGVAR     &STRPOS     VALUE(1)
             CHGVAR     &PATTERN    VALUE(' ')
             CHGVAR     &PATTERNLEN VALUE(1)
             CALL       PGM(QCLSCAN) PARM(&STRING &STRINGLEN &STRPOS  +
                          &PATTERN &PATTERNLEN &TRANSLATE &TRIM &WILD +
                          &RESULT)
             CHGVAR     &RESULTA &RESULT
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('The +
                          RESULT FIELD IS' *BCAT &RESULTA) +
                          TOPGMQ(*EXT) MSGTYPE(*INFO)
             ENDPGM
