             PGM
       /*  CHECK SCREEN */
             DCL        VAR(&IN03)     TYPE(*LGL)  LEN(1)
             CHGVAR     VAR(&IN03)  VALUE('0')
             CALL       PGM(PYR221) PARM(&IN03)
             IF         COND(&IN03) THEN(DO)
             RETURN
             ENDDO
       /*  SUBMIT JOB & CLEAR LDA */
             SBMJOB     JOB(PYR221C) RQSDTA('CALL PYR221C')
             CHGVAR     VAR(%SST(*LDA 501 2)) VALUE(' ')
             ENDPGM
