             PGM
             DCL        VAR(&DYY)   TYPE(*CHAR) LEN(2)
             CHGVAR     VAR(&DYY)   VALUE(%SST(*LDA 501 2))
             OVRDBF     FILE(PIPF) SHARE(*YES)
             OPNQRYF    FILE((PIPF)) QRYSLT('%SST(PI02C 1 2) *EQ "' +
                          *CAT &DYY *CAT '" ') KEYFLD((PI04) (PI05) +
                          (PI01) (PI02) (PI03)) MAPFLD((PI02C PI02 +
                          *CHAR 4))
             OVRPRTF    FILE(PYR222P) PAGESIZE(66 198) CPI(15) +
                          OVRFLW(60) LVLCHK(*NO)
             CALL        PYR222
             CLOF        OPNID(PIPF)
             DLTOVR     FILE(PIPF PYR222P)
             ENDPGM
