     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1062   JEANNY LIN                        */
     /*    PROGRAM NAME : R@R003C                                   */
     /*    CREATE DATE  : 79/05/30                                  */
     /*    UPDATE DATE  :                                           */
     /***************************************************************/
             PGM
     /*  CHECK SCREEN */
             DCL        VAR(&IN03) TYPE(*LGL) LEN(1)
             DCL        VAR(&IN97) TYPE(*LGL) LEN(1)
             DCL        VAR(&CPY) TYPE(*DEC) LEN(3 0)
             DCL        VAR(&PRTID) TYPE(*DEC) LEN(1 0)
             DCL        VAR(&DRA011)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DRA012)    TYPE(*CHAR) LEN(2)
             CHGVAR     VAR(&IN03) VALUE('0')
             CHGVAR     VAR(&IN97) VALUE('0')
             CHGVAR     VAR(&DRA011)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DRA012)    VALUE(%SST(*LDA 503 2))
             CHGPRTF    FILE(R@R003P) PAGESIZE(*N 198) CPI(15)
 START:      CALL       PGM(R@R0031) PARM(&IN03 &IN97 &CPY &PRTID)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 4)) VALUE(' ')
             RETURN
             ENDDO
             CHGVAR     VAR(%SST(*LDA 125 3)) VALUE(&CPY)
             CHGVAR     VAR(%SST(*LDA 128 1)) VALUE(&PRTID)
             SBMJOB     JOB(R@R0032) RQSDTA('CALL R@R0032')
             CHGVAR     VAR(&IN97)  VALUE('1')
             GOTO       START
             ENDPGM
