     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM NAME : R@S005                                    */
     /*    AUTHOR       : A1062   JEANNY LIN                        */
     /*    CREATE DATE  : 79/05/17                                  */
     /*    UPDATE DATE  :                                           */
     /***************************************************************/
             PGM        PARM(&FLAG)
             DCL        VAR(&FLAG) TYPE(*CHAR) LEN(8)
             DCL        VAR(&CPUID) TYPE(*CHAR) LEN(8)    /**/
             DCL        VAR(&MODEL) TYPE(*CHAR) LEN(4)
             DCL        VAR(&EXDATE) TYPE(*CHAR) LEN(6)   /**/
             DCL        VAR(&SUBSYS) TYPE(*CHAR) LEN(80)
             DCL        VAR(&PTN01) TYPE(*CHAR) LEN(7)    /**/
             DCL        VAR(&PTN02) TYPE(*CHAR) LEN(4)    /**/
             DCL        VAR(&ETTIME) TYPE(*CHAR) LEN(9)   /**/
             DCL        VAR(&RPTN01) TYPE(*CHAR) LEN(7)   /**/
             DCL        VAR(&RPTN02) TYPE(*CHAR) LEN(4)   /**/
             DCL        VAR(&ERRC) TYPE(*CHAR) LEN(1)
     /* -1 */
             IF         COND(&FLAG *NE 'GIANT/PT') THEN(DO)
             CHGVAR     VAR(&ERRC) VALUE('8')
             GOTO       ERR
             ENDDO
     /* 0 */
             RTVDTAARA  DTAARA(R@DA01 (4 8)) RTNVAR(&CPUID)
             RTVDTAARA  DTAARA(R@DA01 (12 4)) RTNVAR(&MODEL)
             RTVDTAARA  DTAARA(R@DA01 (16 6)) RTNVAR(&EXDATE)
             RTVDTAARA  DTAARA(R@DA01 (22 80)) RTNVAR(&SUBSYS)
             RTVDTAARA  DTAARA(R@DA01 (102 7)) RTNVAR(&PTN01)
     /* 1 */
             CALL       PGM(R@S003) PARM(&CPUID &MODEL &EXDATE &ERRC)
             IF         COND(&ERRC *NE '0') THEN(GOTO CMDLBL(ERR))
     /* 2 */
             CALL       PGM(R@S001) PARM(&CPUID &MODEL &EXDATE +
                          &SUBSYS &RPTN01)
             IF         COND(&PTN01 *NE &RPTN01) THEN(DO)
             CHGVAR     VAR(&ERRC) VALUE('4')
             GOTO       ERR
             ENDDO
     /* 3 */
             RTVDTAARA  DTAARA(*LDA (487 4)) RTNVAR(&PTN02)
             RTVDTAARA  DTAARA(*LDA (491 9)) RTNVAR(&ETTIME)
             IF         COND(&PTN02 *EQ '              ' | &ETTIME +
                          *EQ '              ') THEN(DO)
             CHGVAR     VAR(&ERRC) VALUE('5')
             GOTO       ERR
             ENDDO
     /* 4 */
             CALL       R@S002 PARM(&PTN01 &ETTIME &RPTN02)
             IF         COND(&PTN02 *NE &RPTN02) THEN(DO)
             CHGVAR     VAR(&ERRC) VALUE('6')
             GOTO       ERR
             ENDDO
     /* 5 */
             GOTO       EOJ
     /* 9 */
 ERR:        CALL       PGM(HELLO) PARM(&ERRC)
             SIGNOFF
     /* 99 */
 EOJ:
             ENDPGM
