     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM NAME : R@S003                                    */
     /*    AUTHOR       : A1062   JEANNY LIN                        */
     /*    CREATE DATE  : 79/05/16                                  */
     /*    UPDATE DATE  :                                           */
     /***************************************************************/
             PGM        PARM(&CPUID &MODEL &EXDATE &ERRC)
             DCL        VAR(&CPUID) TYPE(*CHAR) LEN(8)   /**/
             DCL        VAR(&MODEL) TYPE(*CHAR) LEN(4)
             DCL        VAR(&EXDATE) TYPE(*CHAR) LEN(6)  /**/
             DCL        VAR(&ERRC) TYPE(*CHAR) LEN(1)
             DCL        VAR(&SCPUID) TYPE(*CHAR) LEN(8)
             DCL        VAR(&SMODEL) TYPE(*CHAR) LEN(4)
             DCL        VAR(&LDATE) TYPE(*CHAR) LEN(6)   /**/
             DCL        VAR(&VIR) TYPE(*CHAR) LEN(6)
     /* 0 */
             RTVSYSVAL  SYSVAL(QSRLNBR) RTNVAR(&SCPUID)
             IF         COND(&CPUID *NE &SCPUID) THEN(DO)
             CHGVAR     VAR(&ERRC) VALUE('7')
             GOTO       EOJ
             ENDDO
     /* 1 */
             IF         COND(&MODEL *NE '@@@@') THEN(DO)
             RTVSYSVAL  SYSVAL(QMODEL) RTNVAR(&SMODEL)
             IF         COND(&MODEL *NE &SMODEL) THEN(DO)
             CHGVAR     VAR(&ERRC) VALUE('1')
             GOTO       EOJ
             ENDDO
             ENDDO
     /* 2 */
             RTVDTAARA  DTAARA(*LDA (111 6)) RTNVAR(&LDATE)
             IF         COND(&EXDATE *EQ '999999') THEN(GOTO +
                          CMDLBL(STEP3))
             ELSE (DO)
             IF         COND(&LDATE > &EXDATE) THEN(DO)
             CHGVAR     VAR(&ERRC) VALUE('2')
             GOTO       EOJ
             ENDDO
             ENDDO
     /* 3 */
 STEP3:      CHGVAR     VAR(&ERRC) VALUE('0')
     /* 99 */
 EOJ:
             ENDPGM
