     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    PROGRAM NAME : R@S004                                    */
     /*    AUTHOR       : A1062   JEANNY LIN                        */
     /*    CREATE DATE  : 79/05/16                                  */
     /*    UPDATE DATE  :                                           */
     /***************************************************************/
             PGM        PARM(&RSUBSYS)
             DCL        VAR(&RSUBSYS) TYPE(*CHAR) LEN(2)
             DCL        VAR(&CPUID) TYPE(*CHAR) LEN(8)     /**/
             DCL        VAR(&MODEL) TYPE(*CHAR) LEN(4)
             DCL        VAR(&EXDATE) TYPE(*CHAR) LEN(6)    /**/
             DCL        VAR(&SUBSYS) TYPE(*CHAR) LEN(80)
             DCL        VAR(&PTN01) TYPE(*CHAR) LEN(7)     /**/
             DCL        VAR(&RPTN01) TYPE(*CHAR) LEN(7)    /**/
             DCL        VAR(&ERRC) TYPE(*CHAR) LEN(1)
             DCL        VAR(&NSTR) TYPE(*DEC) LEN(2)       /**/
     /* 4 */
             CALL       P63
     /* 0 */
             RTVDTAARA  DTAARA(R@DA01 (4 8)) RTNVAR(&CPUID)
             RTVDTAARA  DTAARA(R@DA01 (12 4)) RTNVAR(&MODEL)
             RTVDTAARA  DTAARA(R@DA01 (16 6)) RTNVAR(&EXDATE)
             RTVDTAARA  DTAARA(R@DA01 (22 80)) RTNVAR(&SUBSYS)
             RTVDTAARA  DTAARA(R@DA01 (102 7)) RTNVAR(&PTN01)
     /* 1 */
             CALL       PGM(R@S003) PARM(&CPUID &MODEL &EXDATE &ERRC)
             IF         COND(&ERRC *NE '0') THEN(GOTO CMDLBL(ERR))
     /* 2 */
             CALL       PGM(R@S001) PARM(&CPUID &MODEL &EXDATE +
                          &SUBSYS &RPTN01)
             IF         COND(&PTN01 *NE &RPTN01) THEN(DO)
             CHGVAR     VAR(&ERRC) VALUE('4')
             GOTO       ERR
             ENDDO
     /* 3 */
             IF         COND(%SST(&SUBSYS 1 2) = '@@') THEN(GOTO +
                          CMDLBL(EOJ))
             ELSE (DO)
             CHGVAR     VAR(&NSTR) VALUE(1)
 STEP3:      IF         COND(%SST(&SUBSYS &NSTR 2) = &RSUBSYS) +
                        THEN(GOTO CMDLBL(EOJ))
             IF         COND(&NSTR = 79) THEN(DO)
             CHGVAR     VAR(&ERRC) VALUE('3')
             GOTO       ERR
             ENDDO
             CHGVAR     VAR(&NSTR) VALUE(&NSTR + 2)
             GOTO       STEP3
             ENDDO
     /* 9 */
 ERR:        CALL       PGM(HELLO) PARM(&ERRC)
             SIGNOFF
     /* 99 */
 EOJ:
             ENDPGM
