             PGM
             DCL        VAR(&WRKSTN) TYPE(*CHAR) LEN(10)
             MONMSG     MSGID(CPF9999) EXEC(GOTO CMDLBL(EOJ))
             RTVJOBA    JOB(&WRKSTN)
             ?          DSPOBJD OBJTYPE(*PGM) ?-DETAIL(*FULL) +
                          ?-OUTPUT(*OUTFILE) ?-OUTFILE(QTEMP/AA) +
                          ?-OUTMBR(*FIRST *REPLACE)
 /* 錯誤訊息*/
             MONMSG     MSGID(CPF6801) EXEC(DO)
             SNDPGMMSG  MSGID(CPF6801) MSGF(QCPFMSG)
             GOTO       EOJ
             ENDDO
 /**/
             MONMSG     MSGID(CPF2105) EXEC(DO)
             SNDBRKMSG  MSG('OBJECT不存在') TOMSGQ(&WRKSTN)
             GOTO       EOJ
             ENDDO
 /**/
             MONMSG     MSGID(CPF2110) EXEC(DO)
             SNDBRKMSG  MSG('LIBRARY不存在') TOMSGQ(&WRKSTN)
             GOTO       EOJ
             ENDDO
 /*************/
             CPYF       FROMFILE(QTEMP/AA) TOFILE(PTFLIB/S@TXPF) +
                          MBROPT(*REPLACE) FMTOPT(*MAP *DROP)
             DLTF       FILE(QTEMP/AA)
             CALL       S@A14
 EOJ:
             CLRPFM     FILE(PTFLIB/S@TXPF)
             ENDPGM
