             PGM        PARM(&USER &PGMID &LIB &PUB &COR)
             DCL        VAR(&COR) TYPE(*CHAR) LEN(1) VALUE('Y')
             DCL        VAR(&PUB) TYPE(*CHAR) LEN(1) VALUE('Y')
             DCL        VAR(&USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&USR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGMID) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             MONMSG     MSGID(CPF9999) EXEC(GOTO CMDLBL(EOJ))
             CHKOBJ     OBJ(&LIB) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CHGVAR     VAR(&COR) VALUE('O')
             GOTO END
             ENDDO
             CHKOBJ     OBJ(&LIB/&PGMID) OBJTYPE(*PGM)
             MONMSG     MSGID(CPF9801) EXEC(DO)
             CHGVAR     VAR(&COR) VALUE('O')
             GOTO END
             ENDDO
             RTVJOBA    USER(&USR)
             IF         COND(&PUB *EQ 'Y') THEN(DO)
   /*        GRTOBJAUT  OBJ(&LIB/&PGMID) OBJTYPE(*PGM) USER(&USR) +
                          AUT(*ALL)                             */
             RVKOBJAUT  OBJ(&LIB/&PGMID) OBJTYPE(*PGM) USER(*ALL) +
                          AUT(*ALL)
             GRTOBJAUT  OBJ(&LIB/&PGMID) OBJTYPE(*PGM) USER(*PUBLIC) +
                          AUT(*CHANGE)
  /*         GRTOBJAUT  OBJ(&LIB/&PGMID) OBJTYPE(*PGM) USER(&USR) +
                          AUT(*CHANGE)                     */
             ENDDO
             ELSE       DO
             RVKOBJAUT  OBJ(&LIB/&PGMID) OBJTYPE(*PGM) USER(&USER) +
                          AUT(*ALL)
             ENDDO
             CHGVAR     VAR(&COR) VALUE('Y')
             GOTO END
 EOJ:        CHGVAR     VAR(&COR) VALUE('N')
 END:        ENDPGM
