             PGM        PARM(&DOPT &PGMID &LIB &COR)
             DCL        VAR(&COR) TYPE(*CHAR) LEN(1) VALUE('Y')
             DCL        VAR(&DOPT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&PGMID) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             MONMSG     MSGID(CPF9999) EXEC(GOTO CMDLBL(EOJ))
             IF         COND(&DOPT *EQ 'Y') THEN(DO)
             RVKOBJAUT  OBJ(&LIB/&PGMID) OBJTYPE(*PGM) USER(*PUBLIC) +
                          AUT(*ALL)
     /*      RVKOBJAUT  OBJ(&LIB/&PGMID) OBJTYPE(*PGM) USER(*ALL) +
                          AUT(*EXCLUDE)    */
             ENDDO
             ELSE       DO
             RVKOBJAUT  OBJ(&LIB/&PGMID) OBJTYPE(*PGM) USER(*PUBLIC) +
                          AUT(*ALL)
             GRTOBJAUT  OBJ(&LIB/&PGMID) OBJTYPE(*PGM) USER(*PUBLIC) +
                          AUT(*CHANGE)
             ENDDO
             CHGVAR     VAR(&COR) VALUE('Y')
             GOTO END
 EOJ:        CHGVAR     VAR(&COR) VALUE('N')
 END:        ENDPGM
