/*-------------------------------------------------------------------*/
/*           1. AUTHOR     : Johnson Chen                            */
/*           2. CREAT DATE : 79/02/03                                */
/*           3. FUNCTION   : CHECK OBJECT (LIB/FILE)                 */
/*-------------------------------------------------------------------*/
             PGM        PARM(&LIB &PGM &OPT)
/*-------------------------------------------------------------------*/
/*              DECLARE SECTION                                      */
/*-------------------------------------------------------------------*/
             DCL        VAR(&OPT)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PGM)  TYPE(*CHAR) LEN(10)
             CHGVAR     VAR(&OPT) VALUE('Y')
/*-------------------------------------------------------------------*/
/*           MONITOR MESSAGE SECTION                                 */
/*-------------------------------------------------------------------*/
             MONMSG     MSGID(CPF0000)
/*-------------------------------------------------------------------*/
/*           CHECK LIB NAME                                          */
/*-------------------------------------------------------------------*/
             CHKOBJ     OBJ(&LIB) OBJTYPE(*LIB)
             MONMSG     MSGID(CPF9800)   EXEC(DO)
             CHGVAR     VAR(&OPT) VALUE('L')
             GOTO       ENDPGM
             ENDDO
/*-------------------------------------------------------------------*/
/*           CHECK SOURCE                                            */
/*-------------------------------------------------------------------*/
             CHKOBJ     OBJ(&LIB/&PGM) OBJTYPE(*PGM)
             MONMSG     MSGID(CPF9800)   EXEC(DO)
             CHGVAR     VAR(&OPT) VALUE('P')
             GOTO       ENDPGM
             ENDDO
/*-------------------------------------------------------------------*/
/*           ENDPGM SECTION                                          */
/*-------------------------------------------------------------------*/
 ENDPGM:     RCLRSC
             RETURN
             ENDPGM
