             PGM        PARM(&CKVAL &SU01)
             DCL        VAR(&CKVAL)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&SU01) TYPE(*CHAR) LEN(10)
             CHGVAR     VAR(&CKVAL) VALUE('0')
             CHKOBJ     OBJ(QSYS/&SU01) OBJTYPE(*USRPRF)
             MONMSG     MSGID(CPF9801 CPF0001) EXEC(CHGVAR +
                          VAR(&CKVAL) VALUE('1'))
             ENDPGM
