     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1092   TAYLOR                            */
     /*    CREATE DATE  : 81/01/15                                  */
     /***************************************************************/
             PGM
             DCL        VAR(&IPLDT)   TYPE(*CHAR)  LEN(13)
             CALL       P63
             CALL       PGM(SETIPL) PARM(&IPLDT)
             CHGSYSVAL  SYSVAL(QIPLDATTIM) VALUE(&IPLDT)
             ENDPGM
