/* TAAATNAC - Simple attention key handling program TAAATNAC      */
/*  UPDATE DATE   : 79/05/17 BY JOHNSON CHEN                      */
/*  UPDATE PURPOSE: GROUPJOB CAN CREAT UP TO 16 JOBS              */
/*                  AT LEAST ARE 2 GROUP JOBS                     */
/*----------------------------------------------------------------*/
/*  This program lets a user profile flip/flop to another         */
/*    group job in a similar manner as System Request TFRSECJOB   */
/*    by just pressing the Attention key.  When the key is        */
/*    pressed the first time, the current job is made a group     */
/*    job and given the name DDS.      A second group job is      */
/*    setup as RPG     and transferred to. The TFRGRPJOB          */
/*    command transfers to QCMD. This causes special code         */
/*    to be run by the system so that the user profile options    */
/*    are used, the initial program is called (if it exists) etc. */
/*  The function is usually invoked by specifying:                */
/*                                                                */
/*               CHGUSRPRF  ....    ATNPGM(TAATOOL/TAAATNAC       */
/*                                                                */
             PGM
             DCL        &GRPJOB *CHAR LEN(10)
             RTVGRPA    GRPJOB(&GRPJOB) /* Retrieve current name */
                        /* If no group job exists, set to GRP1 */
             IF         (&GRPJOB *EQ '*NONE') DO /* No grp job */
             CHGGRPA    GRPJOB(DDS) TEXT('1ST GROUP JOB')
             CHGVAR     &GRPJOB 'DDS' /* Change CL variable */
             TFRGRPJOB  GRPJOB(RPG) INLGRPPGM(QSYS/QCMD) +
                          TEXT('2ND GROUP JOB')
             RETURN     /* Return to interrupted function */
             ENDDO      /* If NO GROUP JOB, transfer to RPG */
             TFRGRPJOB  GRPJOB(*SELECT)
             ENDPGM
