             PGM
             DCL        VAR(&P6201I)  TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&P6202I)  TYPE(*DEC)  LEN(4 0)
             DCL        VAR(&P6211O)  TYPE(*DEC)  LEN(6 0)
             DCL        VAR(&P6201IA)  TYPE(*CHAR)  LEN(6)
             DCL        VAR(&P6202IA)  TYPE(*CHAR)  LEN(4)
             DCL        VAR(&P6211OA)  TYPE(*CHAR)  LEN(6)
             CHGVAR     &P6201I       VALUE(800101)
             CHGVAR     &P6202I       VALUE(10)
             /*         */
             CALL       P62 PARM(&P6201I &P6202I)
             /*         */
             CHGVAR     &P6201IA      &P6201I
             CHGVAR     &P6202IA      &P6202I
             CHGVAR     &P6211OA      &P6211O
             SNDPGMMSG  MSG(&P6201IA *BCAT &P6202IA *BCAT '=' *CAT +
                          &P6211OA) TOPGMQ(*EXT)
             ENDPGM
