/*-------------------------------------------------------------------*/
/*           1. AUTHOR     : SANDY LIAW                              */
/*           2. CREAT DATE : 05/06/1989                              */
/*           3. FUNCTION   :                                         */
/*-------------------------------------------------------------------*/
             PGM        PARM(&MBR &FILE &LIB &PRT &CPY)
/*-------------------------------------------------------------------*/
/*              DECLARE SECTION                                      */
/*-------------------------------------------------------------------*/
             DCL        VAR(&MBR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&CPY)  TYPE(*DEC)  LEN(1 0)
/*-------------------------------------------------------------------*/
/*              MAIN SECTION                                         */
/*-------------------------------------------------------------------*/

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ENDPGM))

 START:
             CHKOBJ     OBJ(&LIB/&FILE) OBJTYPE(*FILE) MBR(&MBR) +
                          AUT(*USE)

             OVRPRTF    FILE(QSYSPRT) DEV(&PRT) PAGESIZE(*N 198) +
                          CPI(15) OUTQ(&PRT) COPIES(&CPY)

             CPYSRCF    FROMFILE(&LIB/&FILE) TOFILE(*PRINT) +
                          FROMMBR(&MBR)
/*-------------------------------------------------------------------*/
/*           ENDPGM SECTION                                          */
/*-------------------------------------------------------------------*/
 ENDPGM:     RCLRSC
             RETURN
             ENDPGM
