/*-------------------------------------------------------------------*/
/*           1. AUTHOR     : SANDY LIAW                              */
/*           2. CREAT DATE : 05/06/1989                              */
/*           3. FUNCTION   :                                         */
/*-------------------------------------------------------------------*/
             PGM        PARM(&MBR &FILE &LIB &PRT &CPY)
/*-------------------------------------------------------------------*/
/*              DECLARE SECTION                                      */
/*-------------------------------------------------------------------*/
             DCL        VAR(&MBR)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&PRT)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&CPY)  TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&MSGDTA)   TYPE(*CHAR)   LEN(80)
/*-------------------------------------------------------------------*/
/*           MONITOR MESSAGE SECTION                                 */
/*-------------------------------------------------------------------*/

             MONMSG     MSGID(CPF0000)

/*-------------------------------------------------------------------*/
/*           CHECK LIB NAME                                          */
/*-------------------------------------------------------------------*/

             CHKOBJ     OBJ(&LIB) OBJTYPE(*LIB)

             MONMSG     MSGID(CPF9800)   EXEC(DO)

             CHGVAR     VAR(&MSGDTA) VALUE('    MSG9999---> +
                      Library' *BCAT &LIB *BCAT 'Not Found Or Not +
                          Authority !')

             SNDPGMMSG  MSGID(CPF9898) MSGF(QSYS/QCPFMSG) +
                          MSGDTA(&MSGDTA) MSGTYPE(*DIAG)

             SNDPGMMSG  MSGID(CPF0002) MSGF(QSYS/QCPFMSG) +
                          MSGTYPE(*ESCAPE)

             ENDDO
/*-------------------------------------------------------------------*/
/*           CHECK FILE NAME                                         */
/*-------------------------------------------------------------------*/

             CHKOBJ     OBJ(&FILE) OBJTYPE(*FILE)

             MONMSG     MSGID(CPF9800)   EXEC(DO)

             CHGVAR     VAR(&MSGDTA) VALUE('    MSG9999---> +
                         File' *BCAT &FILE *BCAT 'Not Found Or Not +
                          Authority !')


             SNDPGMMSG  MSGID(CPF9898) MSGF(QSYS/QCPFMSG) +
                          MSGDTA(&MSGDTA) MSGTYPE(*DIAG)

             SNDPGMMSG  MSGID(CPF0002) MSGF(QSYS/QCPFMSG) +
                          MSGTYPE(*ESCAPE)

             ENDDO
/*-------------------------------------------------------------------*/
/*           CHECK &MBR IN &LIB/&FILE                                */
/*-------------------------------------------------------------------*/

             CHKOBJ     OBJ(&LIB/&FILE) OBJTYPE(*FILE) MBR(&MBR) +
                          AUT(*USE)

             MONMSG     MSGID(CPF9800)   EXEC(DO)

             CHGVAR     VAR(&MSGDTA) VALUE('    MSG9999---> +
                      Member' *BCAT &MBR *BCAT 'Not Found Or Not +
                          Authority !')


             SNDPGMMSG  MSGID(CPF9898) MSGF(QSYS/QCPFMSG) +
                          MSGDTA(&MSGDTA) MSGTYPE(*DIAG)

             SNDPGMMSG  MSGID(CPF0002) MSGF(QSYS/QCPFMSG) +
                          MSGTYPE(*ESCAPE)

             ENDDO
/*-------------------------------------------------------------------*/
/*           ENDPGM SECTION                                          */
/*-------------------------------------------------------------------*/
 ENDPGM:     RCLRSC
             RETURN
             ENDPGM
