     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    AUTHOR       : A1650   DEREK                             */
     /*    CREATE DATE  : 2015/01/12                                */
     /*    PROGRAM NAME : DBR001C                                   */
     /*    SYSTEM       :西祺進銷存                               */
     /*    SUBSYSTEM    :銷售系統                                 */
     /*    REMARK       :抽成獎金表(FOR DBQT)                     */
     /*-------------------------------------------------------------*/
     /* MODI CODE |   DATE   | DESCRIPTION                          */
     /***************************************************************/
             PGM        PARM(&PARM1 &PARM2 &PARM3)

             DCL        VAR(&PARM1)  TYPE(*CHAR) LEN(20) /*起日*/
             DCL        VAR(&PARM2)  TYPE(*CHAR) LEN(20) /*迄日*/
             DCL        VAR(&PARM3)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&DATES)  TYPE(*CHAR) LEN(8) /*起日*/
             DCL        VAR(&DATEE)  TYPE(*CHAR) LEN(8) /*迄日*/

             CHGVAR     VAR(&DATES) VALUE(&PARM1)
             CHGVAR     VAR(&DATEE) VALUE(&PARM2)
             CHGDTAARA  DTAARA(*LDA (601 8)) VALUE(&PARM1)
             CHGDTAARA  DTAARA(*LDA (609 8)) VALUE(&PARM2)

             CALL P63

             CLRPFM     FILE(DBADPF)

             OVRDBF     FILE(SEHAPF) SHARE(*YES)

             OPNQRYF    FILE((SEHAPF)) QRYSLT(' HA01="S1" & +
                          HA02="C1" & CHA03 *EQ %RANGE("' *CAT +
                          &DATES *CAT '" "' *CAT &DATEE *CAT '") & +
                          HA10="P" ') KEYFLD((HA04) (HA05)) +
                          MAPFLD((CHA03 HA03 *CHAR 8))

             CALL       PGM(DBR002)

             CLOF       OPNID(SEHAPF)
             DLTOVR     FILE(*ALL)

             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')

             ENDPGM
