     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    AUTHOR       : A1650   DEREK                             */
     /*    CREATE DATE  : 2015/02/04                                */
     /*    PROGRAM NAME : DBR006C                                   */
     /*    SYSTEM       :西祺進銷存                               */
     /*    SUBSYSTEM    :銷售系統                                 */
     /*    REMARK       :供應商進貨明細表 (FOR DBQT)              */
     /*-------------------------------------------------------------*/
     /* MODI CODE |   DATE   | DESCRIPTION                          */
     /***************************************************************/
             PGM        PARM(&PARM1 &PARM2 &PARM3)

             DCL        VAR(&PARM1)  TYPE(*CHAR) LEN(20) /*起日*/
             DCL        VAR(&PARM2)  TYPE(*CHAR) LEN(20) /*迄日*/
             DCL        VAR(&PARM3)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&DATES)  TYPE(*CHAR) LEN(8) /*起日*/
             DCL        VAR(&DATEE)  TYPE(*CHAR) LEN(8) /*迄日*/

             CHGVAR     VAR(&DATES) VALUE(&PARM1)
             CHGVAR     VAR(&DATEE) VALUE(&PARM2)

             CALL P63

             CLRPFM     FILE(DBALPF)

   /*進貨*/
             OVRDBF     FILE(POCMPF) SHARE(*YES)

             OPNQRYF    FILE((POCMPF)) QRYSLT(' CCM16 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '") & (%SST(CM01 3 2) *EQ "C1" *OR +
                          %SST(CM01 3 2) *EQ "C2") & CM15="P" ') +
                          KEYFLD((CM02) (CM03) (CM16)) +
                          MAPFLD((CCM16 CM16 *CHAR 8))

             CALL       PGM(DBR0060)

             CLOF       OPNID(POCMPF)
             DLTOVR     FILE(*ALL)

   /*進貨退出*/
             OVRDBF     FILE(INTFPF) SHARE(*YES)

             OPNQRYF    FILE((INTFPF)) QRYSLT(' CTF08 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '") & TF09="P" ') KEYFLD((TF02) (TF03) +
                          (TF08)) MAPFLD((CTF08 TF08 *CHAR 8))

             CALL       PGM(DBR0061)

             CLOF       OPNID(INTFPF)
             DLTOVR     FILE(*ALL)

   /*陳列轉進貨*/
             OVRDBF     FILE(INTHPF) SHARE(*YES)

             OPNQRYF    FILE((INTHPF)) QRYSLT(' CTH09 *EQ %RANGE("' +
                          *CAT &DATES *CAT '" "' *CAT &DATEE *CAT +
                          '") & TH10="P" ') KEYFLD((TH02) (TH09)) +
                          MAPFLD((CTH09 TH09 *CHAR 8))

             CALL       PGM(DBR0062)

             CLOF       OPNID(INTHPF)
             DLTOVR     FILE(*ALL)

   /*計算編號*/
             CALL       PGM(DBR0063)

             ENDPGM
