     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    AUTHOR       : A1650   DEREK                             */
     /*    CREATE DATE  : 2015/01/16                                */
     /*    PROGRAM NAME : DBR003C                                   */
     /*    SYSTEM       :西祺進銷存                               */
     /*    SUBSYSTEM    :銷售系統                                 */
     /*    REMARK       :分店帳列數量及金額統計表(FOR DBQT)       */
     /*-------------------------------------------------------------*/
     /* MODI CODE |   DATE   | DESCRIPTION                          */
     /***************************************************************/
             PGM        PARM(&PARM1 &PARM2 &PARM3)

             DCL        VAR(&PARM1)  TYPE(*CHAR) LEN(20) /*年月*/
             DCL        VAR(&PARM2)  TYPE(*CHAR) LEN(20)
             DCL        VAR(&PARM3)  TYPE(*CHAR) LEN(20)

             CALL P63

             CHGDTAARA  DTAARA(*LDA (601 6)) VALUE(&PARM1)

             CLRPFM     FILE(DBAFPF)

             CALL       PGM(DBR003)

             CHGVAR     VAR(%SST(*LDA 601 100)) VALUE(' ')

             ENDPGM
