     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    AUTHOR       : A1650   DEREK                             */
     /*    CREATE DATE  : 2015/01/20                                */
     /*    PROGRAM NAME : DBR004C                                   */
     /*    SYSTEM       :西祺進銷存                               */
     /*    SUBSYSTEM    :銷售系統                                 */
     /*    REMARK       :獎金產品銷售總表 (FOR DBQT)              */
     /*-------------------------------------------------------------*/
     /* MODI CODE |   DATE   | DESCRIPTION                          */
     /***************************************************************/
             PGM        PARM(&PARM1 &PARM2)

             DCL        VAR(&PARM1)  TYPE(*CHAR) LEN(8) /*起日*/
             DCL        VAR(&PARM2)  TYPE(*CHAR) LEN(8) /*迄日*/

             CALL P63

             CHGDTAARA  DTAARA(*LDA (501 8)) VALUE(&PARM1)
             CHGDTAARA  DTAARA(*LDA (509 8)) VALUE(&PARM2)

             CLRPFM     FILE(DBAHPF)
             CLRPFM     FILE(DBAIPF)
             CLRPFM     FILE(DBAJPF)

             CALL       PGM(DBR004)

             ENDPGM
