             PGM        PARM(&S001I1 &S001I2 &S001I3 &S001O1)
             DCL        VAR(&S001I1) TYPE(*CHAR) LEN(80)
             DCL        VAR(&S001I2) TYPE(*CHAR) LEN(80)
             DCL        VAR(&S001I3) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&S001O1) TYPE(*CHAR) LEN(80)
             DCL        VAR(&P6511O) TYPE(*CHAR) LEN(80)
             DCL        VAR(&P6512O) TYPE(*CHAR) LEN(80)

             IF         COND(&S001I1 *EQ ' ') THEN(CHGVAR +
                          VAR(&S001O1) VALUE(&S001I2))

             ELSE       DO
                          CHGVAR VAR(&S001O1) VALUE(&S001I1 *TCAT +
                          '+' *TCAT &S001I2)
                          CHGVAR     VAR(&S001I3) VALUE(&S001I3-1)
                          CALL       PGM(P65) PARM(&S001O1 &S001I3 +
                                                   &P6511O &P6512O)
                          CHGVAR     VAR(&S001O1) VALUE(&P6511O)
                        ENDDO

             ENDPGM
