/********************************************************************/
/*                                                                  */
/* 5722SS1 V5R1M0 010525     RTVCLSRC Output     01/28/13 19:11:50  */
/*                                                                  */
/* Program name . . . . . . . . . . . . . . :   INM000C           PN*/
/* Library name . . . . . . . . . . . . . . :   SCPLIB            PL*/
/* Original source file . . . . . . . . . . :   QCLSRC            SN*/
/* Library name . . . . . . . . . . . . . . :   SCPLIB            SL*/
/* Original source member . . . . . . . . . :   INM000C           SM*/
/* Source file change                                               */
/*   date/time  . . . . . . . . . . . . . . :   12/14/12 18:29:06 SC*/
/* Patch option . . . . . . . . . . . . . . :   *NOPATCH          PO*/
/* User profile . . . . . . . . . . . . . . :   *USER             UP*/
/* Text . . . : 西祺庫存管理系統主畫面                     A1492TX*/
/* Owner  . . . . . . . . . . . . . . . . . :   SCPGMR            OW*/
/* Patch change ID  . . . . . . . . . . . . :                     PC*/
/* Patch APAR ID  . . . . . . . . . . . . . :                     PA*/
/* User mod flag  . . . . . . . . . . . . . :   *YES              UM*/
/*                                                                ED*/
/********************************************************************/
     PGM
     DCL VAR(&WDATE) TYPE(*CHAR) LEN(6)
     DCL VAR(&$USER) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0101I) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0102I) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0101O) TYPE(*CHAR) LEN(1)
     DCL VAR(&WUSER) TYPE(*CHAR) LEN(3)
     DCLF FILE(*LIBL/INM000D) RCDFMT(DSPC1)
     RTVDTAARA DTAARA(*LDA (101 10)) RTNVAR(&$USER)
     RTVDTAARA DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
     CHGVAR VAR(&$EGMDY) VALUE(&WDATE)
     CHGVAR VAR(&S0101I) VALUE(&$USER)
     CHGVAR VAR(&WUSER) VALUE(%SST(&$USER 1 3))
START:
     SNDRCVF DEV(*FILE) RCDFMT(DSPC1)
     CHGVAR VAR(&IN98) VALUE('0')
     IF COND(&IN03 *EQ '1') THEN(RETURN)
     IF COND(&DOPID *EQ '01') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT001')
     ENDDO
     IF COND(&DOPID *EQ '02') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT002')
     ENDDO
     IF COND(&DOPID *EQ '03') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT003')
     ENDDO
     IF COND(&DOPID *EQ '04') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT008')
     ENDDO
     IF COND(&DOPID *EQ '05') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT004')
     ENDDO
     IF COND(&DOPID *EQ '06') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT005')
     ENDDO
     IF COND(&DOPID *EQ '07') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('MCC666C')
     ENDDO
     IF COND(&DOPID *EQ '08') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT007C')
     ENDDO
     IF COND(&DOPID *EQ '10') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('PIMSC0C')
     ENDDO
     IF COND(&DOPID *EQ '11') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT011')
     ENDDO
     IF COND(&DOPID *EQ '12') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT012')
     ENDDO
     IF COND(&DOPID *EQ '13') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT013')
     ENDDO
     IF COND(&DOPID *EQ '14') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT014')
     ENDDO
     IF COND(&DOPID *EQ '15') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT015')
     ENDDO
     IF COND(&DOPID *EQ '16') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT016')
     ENDDO
     IF COND(&DOPID *EQ '17') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INT017')
     ENDDO
     IF COND(&DOPID *EQ '21') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR010C')
     ENDDO
     IF COND(&DOPID *EQ '22') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR020C')
     ENDDO
     IF COND(&DOPID *EQ '24') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR040C')
     ENDDO
     IF COND(&DOPID *EQ '25') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR050C')
     ENDDO
     IF COND(&DOPID *EQ '26') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR060C')
     ENDDO
     IF COND(&DOPID *EQ '27') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR070C')
     ENDDO
     IF COND(&DOPID *EQ '28') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR090C')
     ENDDO
     IF COND(&DOPID *EQ '30') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR045C')
     ENDDO
     IF COND(&DOPID *EQ '31') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR046C')
     ENDDO
     IF COND(&DOPID *EQ '32') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR080C')
     ENDDO
     IF COND(&DOPID *EQ '33') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR082C')
     ENDDO
     IF COND(&DOPID *EQ '34') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR100C')
     ENDDO
     IF COND(&DOPID *EQ '35') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR110C')
     ENDDO
     IF COND(&DOPID *EQ '36') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR120C')
     ENDDO
     IF COND(&DOPID *EQ '37') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR130C')
     ENDDO
     IF COND(&DOPID *EQ '38') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('INR140C')
     ENDDO
     IF COND(&DOPID *EQ '  ') THEN(GOTO CMDLBL(START))
     GOTO CMDLBL(CHKAUT)
CHKAUT: +
     CALL PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
     IF COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
     ELSE CMD(CHGVAR VAR(&IN98) VALUE('1'))
     GOTO CMDLBL(START)
     ENDPGM
