     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1388  WIND                               */
     /*    CREATE DATE  : 2008/12/18                                */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : INR070C1                                  */
     /*    SYSTEM       :                                           */
     /*    SUBSYSTEM    :庫存系統                                 */
     /*    REMARK       :陳列品退出表                             */
     /***************************************************************/
             PGM

             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DOWNL)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DTL05)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTL06S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTL06E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTL07S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DTL07E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DTL02S)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DTL02E)  TYPE(*CHAR) LEN(9)
             DCL        VAR(&DTL08S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTL08E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DDOC)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&SELECT) TYPE(*CHAR) LEN(1024)

             CHGVAR     VAR(&DOWNL)  VALUE(%SST(*LDA 600 1))
             CHGVAR     VAR(&DTL05)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DDOC)   VALUE(%SST(*LDA 619 1))
             CHGVAR     VAR(&DTL06S) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DTL06E) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DTL07S) VALUE(%SST(*LDA 609 5))
             CHGVAR     VAR(&DTL07E) VALUE(%SST(*LDA 614 5))
             CHGVAR     VAR(&DTL02S)  VALUE(%SST(*LDA 621 9))
             CHGVAR     VAR(&DTL02E)  VALUE(%SST(*LDA 631 9))
             CHGVAR     VAR(&DTL08S) VALUE(%SST(*LDA 661 8))
             CHGVAR     VAR(&DTL08E) VALUE(%SST(*LDA 671 8))
             CHGVAR     VAR(&SELECT) VALUE('TL05 = "' || &DTL05 || +
                          '" *AND TL06 = %RANGE("' || &DTL06S || '" +
                          "' || &DTL06E || '") *AND TL07 = +
                          %RANGE("' || &DTL07S || '" "' || &DTL07E +
                          || '") *AND TL02 = %RANGE("' || &DTL02S || '"  +
                          "' || &DTL02E || '")                           +
                          *AND TL08 = %RANGE(' || &DTL08S || ' ' || +
                          &DTL08E || ') *AND TL09 = "P" ')

             OVRDBF     FILE(INTLPF) SHARE(*YES)
             OPNQRYF    FILE((INTLPF)) QRYSLT(&SELECT) KEYFLD((TL05) +
                        (TL02) (TL06) (TL07) (TL08) )
             OVRDBF     FILE(SCWK10) SHARE(*YES)
             CLRPFM     FILE(SCWK10)
             CALL       INR0701

             IF         COND(&DOWNL *EQ '1') THEN(DO)
             GOTO       DOWNLOAD
             ENDDO

             ELSE       CMD(DO)
             GOTO       PRINT
             ENDDO
 DOWNLOAD:
             CALL       INR070C2
             GOTO       END
 PRINT:
             OVRPRTF    FILE(INR070P) PAGESIZE(*N 157) CPI(12) +
                        USRDTA('陳列退出')
             CALL       INR0702
             CHGVAR     VAR(&P6601I) VALUE('INR070P')

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

 END:
             CLOF       OPNID(INTLPF)
             DLTOVR     FILE(*ALL)

             ENDPGM
