     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1388  WIND                               */
     /*    CREATE DATE  : 81/01/27                                  */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : INR010C1                                  */
     /*    SYSTEM       :                                           */
     /*    SUBSYSTEM    :庫存系統                                 */
     /*    REMARK       :帳列產品庫存金額表－依分店               */
     /*-------------------------------------------------------------*/
     /*MODIFICATION                                                 */
     /* 00A 101/11/28 DEREK增加：帳列產品庫存金額總表－依分店     */
     /***************************************************************/
             PGM

             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DOWNL)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DTO01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTO02S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTO02E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTO03S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DTO03E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DTO04S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DTO04E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DTO05S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DTO05E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DDOC)   TYPE(*CHAR) LEN(2)
             DCL        VAR(&DATA)   TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DOWNL)  VALUE(%SST(*LDA 600 1))
             CHGVAR     VAR(&DTO01)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DDOC)   VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DATA)   VALUE(%SST(*LDA 619 1))
             CHGVAR     VAR(&DTO02S) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DTO02E) VALUE(%SST(*LDA 607 2))
             CHGVAR     VAR(&DTO03S) VALUE(%SST(*LDA 609 5))
             CHGVAR     VAR(&DTO03E) VALUE(%SST(*LDA 614 5))
             CHGVAR     VAR(&DTO04S) VALUE(%SST(*LDA 621 9))
             CHGVAR     VAR(&DTO04E) VALUE(%SST(*LDA 631 9))
             CHGVAR     VAR(&DTO05S) VALUE(%SST(*LDA 661 8))
             CHGVAR     VAR(&DTO05E) VALUE(%SST(*LDA 651 8))

             IF         COND(&DOWNL *EQ '1') THEN(DO)
             GOTO       DOWNLOAD
             ENDDO

             ELSE       CMD(DO)
             GOTO       PRINT
             ENDDO
 DOWNLOAD:
             CALL       INR010C2
             GOTO       END
 PRINT:
             OVRDBF     FILE(SCWK08) SHARE(*YES)
             OVRDBF     FILE(SCWK081) SHARE(*YES)
    /*00A+*/ OVRDBF     FILE(SCWK086) SHARE(*YES)
             CLRPFM     FILE(SCWK08)
             CLRPFM     FILE(SCWK081)
    /*00A+*/ CLRPFM     FILE(SCWK086)
             CALL       INR0103

             IF         COND(&DATA *EQ '1') THEN(DO)
             OVRPRTF    FILE(INR010P) USRDTA('庫金總表')
             CALL       INR0101
             CHGVAR     VAR(&P6601I) VALUE('INR010P')
             ENDDO

    /*00A-   ELSE */
             IF         COND(&DATA *EQ '2') THEN(DO)
             OVRPRTF    FILE(INR010P1) PAGESIZE(*N 132) +
                          USRDTA('庫金明細')
             CALL       INR0102
             CHGVAR     VAR(&P6601I) VALUE('INR010P1')
             ENDDO

    /*00A+*/ IF         COND(&DATA *EQ '3') THEN(DO)
    /*00A+*/ OVRPRTF    FILE(INR010P2) PAGESIZE(*N 132) +
    /*00A+*/              USRDTA('庫金總額')
    /*00A+*/ CALL       INR0104
    /*00A+*/ CHGVAR     VAR(&P6601I) VALUE('INR010P2')
    /*00A+*/ ENDDO

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             GOTO       END

 END:
             DLTOVR     FILE(*ALL)

             ENDPGM
