     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:27313250  */
     /*                                                             */
     /*    AUTHOR       : DAISY                                     */
     /*    CREATE DATE  : 2013/12/31                                */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : INR120C1                                  */
     /*    SYSTEM       :                                           */
     /*    SUBSYSTEM    :庫存系統                                 */
     /*    REMARK       :盤盈銷售明細表                           */
     /*-------------------------------------------------------------*/
     /*MODIFICATION                                                 */
     /***************************************************************/
             PGM

             DCL        VAR(&DOWNL)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DTQ01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTQ02S) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTQ02E) TYPE(*CHAR) LEN(2)
             DCL        VAR(&DTQ03S) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DTQ03E) TYPE(*CHAR) LEN(6)
             DCL        VAR(&DDATES) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DDATEE) TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&DOWNL)  VALUE(%SST(*LDA 600 1))
             CHGVAR     VAR(&DTQ01)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DTQ02S) VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DTQ02E) VALUE(%SST(*LDA 605 2))
             CHGVAR     VAR(&DTQ03S) VALUE(%SST(*LDA 607 6))
             CHGVAR     VAR(&DTQ03E) VALUE(%SST(*LDA 613 6))
             CHGVAR     VAR(&DDATES)  VALUE(%SST(*LDA 651 8))
             CHGVAR     VAR(&DDATEE)  VALUE(%SST(*LDA 659 8))

             CLRPFM     FILE(INR120F)

             OVRDBF     FILE(INTQPF) SHARE(*YES)
             OPNQRYF    FILE((INTQPF)) QRYSLT(' TQ01 *EQ "' *CAT +
                          &DTQ01 *CAT '" & TQ02 *EQ %RANGE("' +
                          *CAT &DTQ02S *CAT '" "' *CAT &DTQ02E +
                          *CAT '") & CTQ03 *EQ %RANGE("' *CAT +
                          &DDATES *CAT '" "' *CAT &DDATEE *CAT +
                          '")') KEYFLD((TQ01) (TQ02) (TQ03)) +
                          MAPFLD((CTQ03 TQ03 *CHAR 8))

             CALL       INR1201

             CLOF       OPNID(INTQPF)
             DLTOVR     FILE(*ALL)

             CALL       PGM(ECL100C) PARM('SCFLIB' 'INR120F')

             ENDPGM
