             PGM        PARM(&LCK &IN96)

             DCL        VAR(&LCK)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

             IF         COND(&LCK *EQ '1') THEN(DO)

             /* LOCK CHECK */

             ALCOBJ     OBJ((*LIBL/POCLPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/POCMPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTCPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTDPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTEPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTFPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTGPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTHPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTKPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTLPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTIPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTJPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTMPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTNPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTAPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTBPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ENDDO
             ELSE       CMD(DO)

             /* DEALLOCATE OBJECT    */
 RLSOBJ:     DLCOBJ     OBJ((*LIBL/POCLPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/POCMPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTCPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTDPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTEPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTFPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTGPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTHPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTKPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTLPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTIPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTJPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTMPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTNPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTAPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTBPF *FILE *EXCL))

             ENDDO   /* DLCOBJ */

             ENDPGM
