             PGM        PARM(&COMP &YYMM)
             DCL        VAR(&COMP) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YYMM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&INYYMM) TYPE(*DEC) LEN(6 0)
             CHGVAR     VAR(&INYYMM) VALUE(&YYMM)
 /*          CLRPFM     FILE(GLAHWF)                         */
             CALL       PGM(MCJ005) PARM(&COMP &INYYMM)
             ENDPGM
