             PGM        PARM(&COMP &YYMM &RTNCD)
             DCL        VAR(&COMP) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YYMM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&RTNCD) TYPE(*CHAR) LEN(6)
             DCL        VAR(&INYYMM) TYPE(*DEC) LEN(6 0)
             DCL        VAR(&VHS1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHS2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHS3) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHS4) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHR1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHR2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHR3) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHA1) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHA2) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHA3) TYPE(*CHAR) LEN(1)
             DCL        VAR(&VHA4) TYPE(*CHAR) LEN(1)
             CHGVAR     VAR(&RTNCD) VALUE(' ')
             CHGVAR     VAR(&INYYMM) VALUE(&YYMM)
             CLRPFM     FILE(GLAHWF)
             CLRPFM     FILE(GLERPF)
             RTVDTAARA  DTAARA(*LDA (640 1)) RTNVAR(&VHS1)
             RTVDTAARA  DTAARA(*LDA (641 1)) RTNVAR(&VHS2)
             RTVDTAARA  DTAARA(*LDA (642 1)) RTNVAR(&VHS3)
             RTVDTAARA  DTAARA(*LDA (643 1)) RTNVAR(&VHS4)
             RTVDTAARA  DTAARA(*LDA (650 1)) RTNVAR(&VHR1)
             RTVDTAARA  DTAARA(*LDA (651 1)) RTNVAR(&VHR2)
             RTVDTAARA  DTAARA(*LDA (652 1)) RTNVAR(&VHR3)
             RTVDTAARA  DTAARA(*LDA (660 1)) RTNVAR(&VHA1)
             RTVDTAARA  DTAARA(*LDA (661 1)) RTNVAR(&VHA2)
             RTVDTAARA  DTAARA(*LDA (662 1)) RTNVAR(&VHA3)
             RTVDTAARA  DTAARA(*LDA (663 1)) RTNVAR(&VHA4)
 /*銷貨  S1*/
             IF         COND(&VHS1 *EQ 'Y' *OR &VHS1 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ001) PARM(&COMP &INYYMM)
             ENDDO
 /*進貨 C1 C2 */
             IF         COND(&VHR1 *EQ 'Y' *OR &VHR1 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ002) PARM(&COMP &INYYMM)
             ENDDO
/*銷貨成本S1 */
             IF         COND(&VHS4 *EQ 'Y' *OR &VHS4 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ003) PARM(&COMP &INYYMM)
             ENDDO
/*進貨退出B1 */
             IF         COND(&VHR3 *EQ 'Y' *OR &VHR3 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ004) PARM(&COMP &INYYMM)
             ENDDO
/*陳列轉進貨 E1 */
             IF         COND(&VHR2 *EQ 'Y' *OR &VHR2 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ005) PARM(&COMP &INYYMM)
             ENDDO
/*借貨 S2 */
             IF         COND(&VHS2 *EQ 'Y' *OR &VHS2 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ006) PARM(&COMP &INYYMM)
             ENDDO
/*盤盈銷售 S3 */
             IF         COND(&VHS3 *EQ 'Y' *OR &VHS3 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ007) PARM(&COMP &INYYMM)
             ENDDO
/*庫存調整 A1 */
             IF         COND(&VHA1 *EQ 'Y' *OR &VHA1 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ008) PARM(&COMP &INYYMM)
             ENDDO
/*盤盈虧調整A2 */
             IF         COND(&VHA2 *EQ 'Y' *OR &VHA2 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ0081) PARM(&COMP &INYYMM)
             ENDDO
/*成本調整  A3 */
             IF         COND(&VHA3 *EQ 'Y' *OR &VHA3 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ009) PARM(&COMP &INYYMM)
             ENDDO
/*陳列調整  A4 */
             IF         COND(&VHA4 *EQ 'Y' *OR &VHA4 *EQ 'F') THEN(DO)
             CALL       PGM(MCJ010) PARM(&COMP &INYYMM)
             ENDDO
/* 檢核會計科目 */
             CALL       PGM(MCJ601) PARM(&RTNCD)

             IF         COND(&RTNCD = ' ') THEN(CPYF +
                          FROMFILE(GLAHWF) TOFILE(GLAHPF) +
                          MBROPT(*ADD) FMTOPT(*NOCHK))
/* UPDATE VHCTLPF  */
             IF         COND(&RTNCD = ' ') THEN(CALL PGM(MCJ603))
             ENDPGM
