             PGM        PARM(&COMP &YYMM &RTNCD)
             DCL        VAR(&COMP) TYPE(*CHAR) LEN(2)
             DCL        VAR(&YYMM) TYPE(*CHAR) LEN(6)
             DCL        VAR(&RTNCD) TYPE(*CHAR) LEN(6)
             DCL        VAR(&INYYMM) TYPE(*DEC) LEN(6 0)
             CHGVAR     VAR(&RTNCD) VALUE(' ')
             CHGVAR     VAR(&INYYMM) VALUE(&YYMM)
             CLRPFM     FILE(GLAHWF)
             CLRPFM     FILE(GLERPF)
             CALL       PGM(MCJ910) PARM(&COMP &INYYMM)
/* 檢核會計科目 */
             CALL       PGM(MCJ601) PARM(&RTNCD)
             IF         COND(&RTNCD = ' ') THEN(CPYF +
                          FROMFILE(GLAHWF) TOFILE(GLAHPF) +
                          MBROPT(*ADD) FMTOPT(*NOCHK))
             ENDPGM
