             PGM

             DCL        VAR(&DPI01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPIYM)    TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DPI01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DPIYM)    VALUE(%SST(*LDA 507 6))
   /*  BACKUP */
             DLTF       FILE(SCFLIB/INTAPFZZ)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(SCFLIB/INTBPFZZ)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(SCFLIB/INTNPFZZ)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(SCFLIB/INTPPFZZ)
             MONMSG     MSGID(CPF2105)
             DLTF       FILE(SCFLIB/INTXPFZZ)
             MONMSG     MSGID(CPF2105)
      CPYF   FROMFILE(INTAPF) TOFILE(SCFLIB/INTAPFZZ)  CRTFILE(*YES)
      CPYF   FROMFILE(INTBPF) TOFILE(SCFLIB/INTBPFZZ)  CRTFILE(*YES)
      CPYF   FROMFILE(INTNPF) TOFILE(SCFLIB/INTNPFZZ)  CRTFILE(*YES)
      CPYF   FROMFILE(INTPPF) TOFILE(SCFLIB/INTPPFZZ)  CRTFILE(*YES)
      CPYF   FROMFILE(INTXPF) TOFILE(SCFLIB/INTXPFZZ)  CRTFILE(*YES)

             CALL       PGM(PIA0022)

             CALL       PGM(PIA0023)   /*重新計算下一月份之期初量*/

             ENDPGM
