     /***************************************************************/
     /* 泛太資訊科技開發股份有限公司－版權所有    TEL:27313250    */
     /*                                                             */
     /* PROGRAM-ID   : PIA009C3                                     */
     /* PROGRAM NAME :計算12/25庫存量-通路銷售數量            */
     /* AUTHOR       : RACHEL                                       */
     /* CREATE DATE  : 2022/09/28                                   */
     /* UPDATE DATE  :                                              */
     /* SYSTEM       :庫存系統作業                                */
     /* SUBSYSTEM    :盤點系統　　                                */
     /* REMARK       :計算盤點日與12/25之間的銷售數量           */
     /*-------------------------------------------------------------*/
     /*MODIFICATION                                                 */
     /*                                                             */
     /***************************************************************/
             PGM

             DCL        VAR(&DPI01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPI02)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DZA03S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DZA03E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&$DATA)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&SELEC1)   TYPE(*CHAR) LEN(512)

             CHGVAR     VAR(&DPI01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DPI02)    VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&DZA03S)   VALUE(%SST(*LDA 527 8))
             CHGVAR     VAR(&DZA03E)   VALUE(%SST(*LDA 535 8))


             CHGVAR     VAR(&SELEC1) VALUE('HA01 = "' || &DPI01 || +
                          '"  *AND  HA02 = "' || &DPI02 ||         +
                          '"  *AND HA03 = %RANGE(' || &DZA03S || ' +
                          ' || &DZA03E || ')   *AND HA10 = "P" ')

             OVRDBF     FILE(SEHAPF) SHARE(*YES)
             OPNQRYF    FILE((SEHAPF)) QRYSLT(&SELEC1) KEYFLD((HA01) +
                          (HA02) (HA03) (HA04) (HA05))


             CALL       PGM(PIA0093)

       /*    CHGVAR     VAR(&$DATA)     VALUE(%SST(*LDA 500 1)) */

             CLOF       OPNID(SEHAPF)

             DLTOVR     FILE(*ALL)

             ENDPGM
