     /***************************************************************/
     /* 泛太資訊科技開發股份有限公司－版權所有    TEL:27313250    */
     /*                                                             */
     /* PROGRAM-ID   : PIA009C4                                     */
     /* PROGRAM NAME :計算12/25庫存量-系統異動調整調撥數量    */
     /* AUTHOR       : RACHEL                                       */
     /* CREATE DATE  : 2022/10/18                                   */
     /* UPDATE DATE  :                                              */
     /* SYSTEM       :庫存系統作業                                */
     /* SUBSYSTEM    :盤點系統　　                                */
     /* REMARK       :計算盤點日與12/25之間的調撥數量           */
     /*-------------------------------------------------------------*/
     /*MODIFICATION                                                 */
     /*                                                             */
     /***************************************************************/
             PGM

             DCL        VAR(&DPI01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPI02)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DZA03S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&DZA03E)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&$DATA)    TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DPI01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DPI02)    VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&DZA03S)   VALUE(%SST(*LDA 527 8))
             CHGVAR     VAR(&DZA03E)   VALUE(%SST(*LDA 535 8))


             OVRDBF     FILE(INTCLF21) SHARE(*YES)

            OPNQRYF    FILE((INTCLF21)) OPTION(*ALL) QRYSLT('        +
                         TC01  = "' || &DPI01 || '"                  +
                       & TC02  = "' || &DPI02 || '"                  +
                       & TC03C = %RANGE("' || &DZA03S || '"          +
                                        "' || &DZA03E || '")         +
                       & TC09 = "P" *OR TC09="R" ')                  +
                         KEYFLD((TC01)(TC02)(TC04)(TC03)(TC05))      +
                         MAPFLD((TC03C TC03 *CHAR 8))

             OVRDBF     FILE(INTCLF22) SHARE(*YES)

            OPNQRYF    FILE((INTCLF22)) OPTION(*INP) QRYSLT('        +
                         TC01  = "' || &DPI01 || '"                  +
                       & TC02  = "' || &DPI02 || '"                  +
                       & TC06C = %RANGE("' || &DZA03S || '"          +
                                        "' || &DZA03E || '")         +
                       & TC09 = "P" *OR TC09="R" ')                  +
                         KEYFLD((TC01)(TC02)(TC07)(TC06)(TC05))      +
                         MAPFLD((TC06C TC06 *CHAR 8))


             CALL       PGM(PIA0094)

       /*    CHGVAR     VAR(&$DATA)     VALUE(%SST(*LDA 500 1)) */

             CLOF       OPNID(INTCLF21)
             CLOF       OPNID(INTCLF22)

             DLTOVR     FILE(*ALL)

             ENDPGM
