             PGM

             DCL        VAR(&DPI01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DPIYM)    TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&DPI01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DPIYM)    VALUE(%SST(*LDA 507 6))

             CALL       PGM(PIA0082)

             ENDPGM
