             PGM
       /*  CHECK SCREEN */
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN98)   TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&IN97)   TYPE(*LGL) LEN(1) VALUE('0')
             CHGVAR     VAR(%SST(*LDA 162   1)) VALUE('2')
             CHGVAR     VAR(%SST(*LDA 125   3)) VALUE('001')
             CHGVAR     VAR(%SST(*LDA 598   2)) VALUE('00')

 START:      CALL       PGM(PIR0011) PARM(&IN03 &IN98 &IN97)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')
             RETURN
             ENDDO

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)

             IF         COND(&$EVR *EQ '2') THEN(DO)
             SBMJOB     JOB(PIR001C2) RQSDTA('CALL PGM(PIR001C2)')

             CHGVAR     VAR(&IN97) VALUE('1')
             ENDDO

             ELSE       CMD(DO)
             CALL       PGM(PIR001C2)
             CHGVAR     VAR(&IN98) VALUE('1')
             ENDDO

             GOTO       START

             ENDPGM
