     /**************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250  */
     /*                                                            */
     /*    PROGRAM ID   : PUC033C                                  */
     /*    PROGRAM NAME :補增驗收單維護                          */
     /*    AUTHOR       : A1492 TERRY                              */
     /*    CREATE DATE  : 2009.09.07                               */
     /*    UPDATE DATE  :                                          */
     /*    SYSTEM       :                                          */
     /**************************************************************/
             PGM

             DCL        VAR(&P1) TYPE(*CHAR) LEN(2) VALUE('  ')
             DCL        VAR(&P2) TYPE(*CHAR) LEN(2) VALUE('  ')

             CALL       PGM(PUC033) PARM(&P1 &P2)

             ENDPGM
