             PGM

             DCL        VAR(&DCK01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WCK02)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&SEJ07)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&SEJ08)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&A)    TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DCK01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&WCK02)    VALUE(%SST(*LDA 510 6))
             CHGVAR     VAR(&SEJ07)    VALUE(%SST(*LDA 521 8))
             CHGVAR     VAR(&SEJ08)    VALUE(%SST(*LDA 531 8))

             OVRPRTF    FILE(PUC0411P) USRDTA('單件異常')
             OVRPRTF    FILE(PUC0412P) USRDTA('最低異常')

             OVRDBF     FILE(POCKPF)   SHARE(*YES)
             OPNQRYF    FILE((POCKPF)) OPTION(*ALL) QRYSLT('        +
                          CK01 = "' || &DCK01 || '"                 +
                         & CK03C = %RANGE("' || &SEJ07 || '"          +
                                        "' || &SEJ08 || '") ')      +
                          KEYFLD((CK01) (CK02) (CK03) (CK05) (CK08) +
                                (CK06) (CK10))                      +
                          MAPFLD((CK03C CK03 *CHAR 8))

   /*        OVRDBF     FILE(POCKPF)   SHARE(*YES)                  +
             OPNQRYF    FILE((POCKPF)) OPTION(*ALL) QRYSLT('        +
                          CK01 = "' || &DCK01 || '"                 +
                         &CK03S = "' || &WCK02  || '" ')            +
                          KEYFLD((CK01) (CK02) (CK03) (CK05) (CK08) +
                                (CK06) (CK10))                      +
                          MAPFLD((CK03C CK03 *CHAR 8)               +
                                 (CK03S '%SST(CK03C 1 6)' *CHAR 6)) */

             CALL       PUC0412

             CLOF       OPNID(POCKPF)
             DLTOVR     FILE(POCKPF)

             CHGVAR     VAR(&A)    VALUE(%SST(*LDA 520 1))

             IF         COND(&A *EQ '1') THEN(DO)

             CLRPFM     FILE(SCWK20)

             OVRDBF     FILE(POCKPF)   SHARE(*YES)
             OPNQRYF    FILE((POCKPF)) OPTION(*ALL) QRYSLT('        +
                          CK01 = "' || &DCK01 || '"                 +
                         &CK03S = "' || &WCK02  || '" ')            +
                         KEYFLD((CK01) (CK02) (CK03) (CK07) (CK09)  +
                                (CK10))                             +
                          MAPFLD((CK03C CK03 *CHAR 8)               +
                                 (CK03S '%SST(CK03C 1 6)' *CHAR 6))

             CALL       PUC0413

             CLOF       OPNID(POCKPF)
             DLTOVR     FILE(POCKPF)
             ENDDO

             ENDPGM
