             PGM

             DCL        VAR(&DA021)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DA022)    TYPE(*DEC) LEN(4 0)
             DCL        VAR(&WW)       TYPE(*DEC) LEN(4 0)
             DCL        VAR(&WWC)      TYPE(*CHAR) LEN(4)
             DCL        VAR(&DA022C)   TYPE(*CHAR) LEN(4)
             DCL        VAR(&DATA)     TYPE(*CHAR) LEN(1)

             RTVDTAARA  DTAARA(SCDA02 (1 4)) RTNVAR(&DA021)
             CHGVAR     VAR(&WW)       VALUE(&DA021)
             CHGVAR     VAR(&DA022)    VALUE(&WW+1)
             CHGVAR     VAR(&WWC)      VALUE(&WW)
             CHGVAR     VAR(&DA022C)   VALUE(&DA022)

             OVRDBF     FILE(POCCLF01)   SHARE(*YES)
             OPNQRYF    FILE((POCCLF01)) OPTION(*ALL) QRYSLT('  +
                        CC05C = "'||&WWC||'" & CC06 = "1"     +
                                         & CC02 = "C1"   ')   +
                        KEYFLD((CC04)(CC07)) +
                        MAPFLD((CC05C CC05 *CHAR 4))

             OVRDBF     FILE(POCCLF05)   SHARE(*YES)
             OPNQRYF    FILE((POCCLF05)) OPTION(*ALL) QRYSLT('  +
                        CC05C = "'||&WWC||'" & CC06 = "1"     +
                                         & CC02 = "C1"   ')   +
                        KEYFLD((CC04)(CC07)) +
                        MAPFLD((CC05C CC05 *CHAR 4))

             CALL       PUC0012

             CHGVAR     VAR(&DATA)    VALUE(%SST(*LDA 500 1))
             IF         COND(&DATA = "Y") THEN(DO)
             CHGDTAARA  DTAARA(SCDA02 *ALL) VALUE(&DA022C)
                        ENDDO

             CLOF       OPNID(POCCLF01)
             DLTOVR     FILE(POCCLF01)

             ENDPGM
