     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1546 VINCENT                             */
     /*    CREATE DATE  : 2009/03/10                                */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : PUC024C                                   */
     /*    SYSTEM       :                                           */
     /*    SUBSYSTEM    :採購管理系統                             */
     /*    REMARK       :採購表單寄出處理                         */
     /***************************************************************/
             PGM

             DCL     VAR(&IN03)     TYPE(*LGL)  LEN(1)
             DCL     VAR(&IN10)     TYPE(*LGL)  LEN(1)
             DCL     VAR(&IN98)     TYPE(*LGL)  LEN(1)
             DCL     VAR(&P1)       TYPE(*CHAR) LEN(2)
             DCL     VAR(&P2)       TYPE(*CHAR) LEN(2)
             DCL     VAR(&P3)       TYPE(*CHAR) LEN(10)
             DCL     VAR(&P3Y)      TYPE(*CHAR) LEN(4)
             DCL     VAR(&P3M)      TYPE(*CHAR) LEN(2)
             DCL     VAR(&P3D)      TYPE(*CHAR) LEN(2)
             DCL     VAR(&JOB)      TYPE(*CHAR) LEN(10)
             DCL     VAR(&P#CMD)    TYPE(*CHAR) LEN(120)

     /*  CHECK SCREEN */

 START:      CALL    PGM(PUC024)  PARM(&IN03 &IN10 &IN98)
             IF      COND(&IN03)  THEN(DO)
                     CHGVAR VAR(%SST(*LDA 501 100)) VALUE(' ')
                     RETURN
             ENDDO

             SBMJOB     CMD(CALL PGM(PUC024C1)) JOB(PUC024C1)

             CHGVAR     VAR(&IN98) VALUE('1')   /* 已執行*/
             GOTO       START

             ENDPGM
