    /*-------------------------------------------------------------*/
    /*MODIFICATION                                                 */
    /* 00A 102/05/21 DEREK讀取訂貨日期前未產生採購單之訂貨單     */
    /***************************************************************/
             PGM

             DCL        VAR(&DCD01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCD02)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&WCD03)    TYPE(*CHAR) LEN(8)
             DCL        VAR(&$DATA) TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DCD01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DCD02)    VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&WCD03)    VALUE(%SST(*LDA 511 8))

  /* 第一次跑R1單 */

             OVRDBF     FILE(SCWK01) TOFILE(POCEPF) SHARE(*YES)

 /*00A-      OPNQRYF    FILE((POCEPF) (POCDPF)) FORMAT(SCWK01) +
                          QRYSLT('CD01 *EQ "' *CAT &DCD01 *CAT '"   +
                          &SCD03 =   "' || &WCD03 || '"             +
                          &CD02 =   "' || &DCD02 || '"              +
                          &CD12 =   "A"  & CD06 *NE "R2"            +
                          ') KEYFLD((CD01)(CD02)(CE02)(CD04)(CD07)  +
                          (CD06)(CE03)) JFLD((CD05 CE01))           +
                          MAPFLD((SCD03 CD03 *CHAR 8)) */

 /*00A+*/    OPNQRYF    FILE((POCEPF) (POCDPF)) FORMAT(SCWK01) +
                          QRYSLT('CD01 *EQ "' *CAT &DCD01 *CAT '"   +
                          &SCD03 <=  "' || &WCD03 || '"             +
                          &CD02 =   "' || &DCD02 || '"              +
                          &CD12 =   "A"  & CD06 *NE "R2"            +
                          ') KEYFLD((CD01)(CD02)(CE02)(CD04)(CD07)  +
                          (CD06)(CE03)) JFLD((CD05 CE01))           +
                          MAPFLD((SCD03 CD03 *CHAR 8))

             CALL       PGM(PUC0212) PARM('1')

             CLOF       OPNID(POCEPF)

  /* 第二次跑R2單 */
             OVRDBF     FILE(SCWK01) TOFILE(POCEPF) SHARE(*YES)

 /*00A-      OPNQRYF    FILE((POCEPF) (POCDPF)) FORMAT(SCWK01) +
                          QRYSLT('CD01 *EQ "' *CAT &DCD01 *CAT '"   +
                          &SCD03 =   "' || &WCD03 || '"             +
                          &CD02 =   "' || &DCD02 || '"              +
                          &CD12 =   "A"  & CD06 = "R2"              +
                          ') KEYFLD((CD01)(CD02)(CE02)(CD04)(CD07)  +
                          (CD06)(CE01)(CE03)) JFLD((CD05 CE01))     +
                          MAPFLD((SCD03 CD03 *CHAR 8)) */

 /*00A+*/    OPNQRYF    FILE((POCEPF) (POCDPF)) FORMAT(SCWK01) +
                          QRYSLT('CD01 *EQ "' *CAT &DCD01 *CAT '"   +
                          &SCD03 <=  "' || &WCD03 || '"             +
                          &CD02 =   "' || &DCD02 || '"              +
                          &CD12 =   "A"  & CD06 = "R2"              +
                          ') KEYFLD((CD01)(CD02)(CE02)(CD04)(CD07)  +
                          (CD06)(CE01)(CE03)) JFLD((CD05 CE01))     +
                          MAPFLD((SCD03 CD03 *CHAR 8))

             CALL       PGM(PUC0212) PARM('2')

             CLOF       OPNID(POCEPF)
             DLTOVR     FILE(SCWK01)

             CHGVAR     VAR(&$DATA)    VALUE(%SST(*LDA 500 1))

             IF         COND(&$DATA = 'Y') THEN(DO)
             OVRDBF     FILE(POCDPF)   SHARE(*YES)
 /*00A-      OPNQRYF    FILE((POCDPF)) OPTION(*ALL) QRYSLT('          +
                          CD01 =  "' || &DCD01 || '"                  +
                         &CD02 =  "' || &DCD02 || '"                  +
                         &CD03C = "' || &WCD03 || '"                  +
                         &CD12 = "A" ')                               +
                          KEYFLD((CD01) (CD02) (CD05)) +
                          MAPFLD((CD03C CD03 *CHAR 8)) */

 /*00A+*/    OPNQRYF    FILE((POCDPF)) OPTION(*ALL) QRYSLT('          +
                          CD01 =  "' || &DCD01 || '"                  +
                         &CD02 =  "' || &DCD02 || '"                  +
                         &CD03C <= "' || &WCD03 || '"                 +
                         &CD12 = "A" ')                               +
                          KEYFLD((CD01) (CD02) (CD05)) +
                          MAPFLD((CD03C CD03 *CHAR 8))

             CALL       PUC0213
             CLOF       OPNID(POCDPF)
             ENDDO

    /*       CLOF       OPNID(POCEPF)                    */


             ENDPGM
