/*00A     需求單號: 1080981                                       */
/*00A      108/08/12 CAROL新增採購單查詢-採購單號               */
/*00B     需求單號: 1081115                                       */
/*00B      108/09/12 CAROL新增訂貨單取消核准作業                */
/*00A*/
             PGM
             DCL        VAR(&WDATE) TYPE(*CHAR) LEN(6)
             DCL        VAR(&$USER)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0102I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&S0101O) TYPE(*CHAR) LEN(1)
             DCL        VAR(&WUSER)  TYPE(*CHAR) LEN(3)

             DCLF       FILE(*LIBL/PUM000D) RCDFMT(DSPC1)
             RTVDTAARA  DTAARA(*LDA (101 10)) RTNVAR(&$USER)
             RTVDTAARA  DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
             CHGVAR     VAR(&$EGMDY) VALUE(&WDATE)
             CHGVAR     VAR(&S0101I) VALUE(&$USER)
             CHGVAR     VAR(&WUSER) VALUE(%SST(&$USER 1 3))
  START:
             SNDRCVF    DEV(*FILE) RCDFMT(DSPC1)
             CHGVAR     VAR(&IN98) VALUE('0')
             IF         COND(&IN03 *EQ '1') THEN(RETURN)

             IF         COND(&DOPID *EQ '01') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC0010C')
             ENDDO
             IF         COND(&DOPID *EQ '02') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC002')
             ENDDO
             IF         COND(&DOPID *EQ '03') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC003')
             ENDDO
             IF         COND(&DOPID *EQ '04') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC004')
             ENDDO
             IF         COND(&DOPID *EQ '11') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC0110C')
             ENDDO
             IF         COND(&DOPID *EQ '12') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC012')
             ENDDO
             IF         COND(&DOPID *EQ '13') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC013')
             ENDDO
             IF         COND(&DOPID *EQ '14') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC014')
             ENDDO
             IF         COND(&DOPID *EQ '15') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC015')
             ENDDO
/*00B+*/     IF         COND(&DOPID *EQ '16') THEN(DO)
/*00B+*/                  CHGVAR VAR(&S0102I) VALUE('PUC016')
/*00B+*/     ENDDO
             IF         COND(&DOPID *EQ '21') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC0210C')
             ENDDO
             IF         COND(&DOPID *EQ '22') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC025C')
             ENDDO
             IF         COND(&DOPID *EQ '23') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC023C')
             ENDDO
             IF         COND(&DOPID *EQ '24') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC022')
             ENDDO
/*00A+*/     IF         COND(&DOPID *EQ '25') THEN(DO)
/*00A+*/                  CHGVAR VAR(&S0102I) VALUE('PUC026')
/*00A+*/     ENDDO
             IF         COND(&DOPID *EQ '31') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC031')
             ENDDO
             IF         COND(&DOPID *EQ '32') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC032')
             ENDDO
             IF         COND(&DOPID *EQ '33') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC033C')
             ENDDO
             IF         COND(&DOPID *EQ '34') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC034')
             ENDDO
             IF         COND(&DOPID *EQ '35') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC035')
             ENDDO
             IF         COND(&DOPID *EQ '36') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC036')
             ENDDO
             IF         COND(&DOPID *EQ '41') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUC0410C')
             ENDDO
             IF         COND(&DOPID *EQ '42') THEN(DO)
                          CHGVAR VAR(&S0102I) VALUE('PUM001C')
             ENDDO

             IF         COND(&DOPID *EQ '  ') THEN(GOTO START)
             GOTO       CHKAUT

  CHKAUT:    CALL       PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
             IF         COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
             ELSE       CMD(CHGVAR VAR(&IN98) VALUE('1'))
             GOTO       START


             ENDPGM
