     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1491 EASON                               */
     /*    CREATE DATE  : 97/10/29                                  */
     /*    UPDATE DATE  : 97/11/17                                  */
     /*    PROGRAM NAME : PUR010C1                                  */
     /*    SYSTEM       :                                           */
     /*    SUBSYSTEM    :採購系統                                 */
     /*    REMARK       :驗收彙總表                               */
     /*    NOTES        : 98/03/30玉蕙要求為對帳，不列入陳列驗收單*/
     /*                                                             */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DOWNL)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCL01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCL02)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCM02S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DCM02E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DCL07S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DCL07E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATA)   TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DOWNL)  VALUE(%SST(*LDA 600 1))
             CHGVAR     VAR(&DCL01)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DCL02)  VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DCM02S) VALUE(%SST(*LDA 605 5))
             CHGVAR     VAR(&DCM02E) VALUE(%SST(*LDA 610 5))
             CHGVAR     VAR(&DCL07S) VALUE(%SST(*LDA 641 8))
             CHGVAR     VAR(&DCL07E) VALUE(%SST(*LDA 651 8))
   /*  */
                DLTF       FILE(QTEMP/INTXTM)
                MONMSG     MSGID(CPF2105)
                CRTDUPOBJ  OBJ(INTXTM) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                             TOLIB(QTEMP) NEWOBJ(INTXTM) DATA(*NO) +
                             CST(*NO) TRG(*NO)

                OVRDBF     FILE(INTXTM) TOFILE(QTEMP/INTXTM)
             CALL       PGM(PUR900) PARM(&DCL01 &DCL07S &DCL07E 'A')
                DLTOVR     FILE(INTXTM)

/*   */
             OVRDBF     FILE(INTXTM) TOFILE(QTEMP/INTXTM) SHARE(*YES)
             OPNQRYF    FILE(QTEMP/INTXTM)   OPTION(*ALL)            +
                         QRYSLT('TX01 = "' || &DCL01  || '"          +
                         & TX27 = "' || &DCL02 || ' "                +
                         & TX06 = %RANGE(  '|| &DCL07S ||'           +
                                           '|| &DCL07E ||')          +
                         & TX07 = %RANGE("' || &DCM02S || '"         +
                                         "' || &DCM02E || '")        +
                         & (TX03 =  "C1"                             +
                        *OR TX03 =  "C2"                             +
                        *OR  TX03 =  "B1")                   ')      +
                          KEYFLD((TX01)(TX27)(TX07)(TX06))

             CLRPFM     SCWK05
             CLRPFM     SCWK12
             OVRPRTF    FILE(PUR010P) USRDTA('驗收彙總')
             CALL       PUR0101
             CALL       PUR0102
             DLTOVR     FILE(PUR010P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE('PUR010P')

             CLOF       OPNID(INTXTM)
             DLTOVR     FILE(INTXTM)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)

             ENDPGM
