     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : A1491 EASON                               */
     /*    CREATE DATE  : 97/10/29                                  */
     /*    UPDATE DATE  : 97/11/17 VINCENT                          */
     /*    PROGRAM NAME : PUR020C1                                  */
     /*    SYSTEM       :                                           */
     /*    SUBSYSTEM    :採購系統                                 */
     /*    REMARK       :驗收明細表                               */
     /*    NOTES        : 98/03/30玉蕙要求為對帳，不列入陳列驗收單*/
     /*                                                             */
     /*-------------------------------------------------------------*/
     /* 00A 101/03/29 DEREK 增加（產品歸屬）選項                  */
     /* 00B 101/11/26 DEREK 增加（分店代號）選項                  */
     /* 00C 103/12/10 JONATHAN 取消F7                             */
     /***************************************************************/
             PGM
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DOWNL)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&DCL01)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCL02)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&DCM02S) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DCM02E) TYPE(*CHAR) LEN(5)
             DCL        VAR(&DCM03S) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCM03E) TYPE(*CHAR) LEN(9)
             DCL        VAR(&DCL07S) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DCL07E) TYPE(*CHAR) LEN(8)
             DCL        VAR(&DATA)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&DOPT)   TYPE(*CHAR) LEN(1)
    /*00B+*/ DCL        VAR(&DCL04S) TYPE(*CHAR) LEN(5)
    /*00B+*/ DCL        VAR(&DCL04E) TYPE(*CHAR) LEN(5)

             CHGVAR     VAR(&DOWNL)  VALUE(%SST(*LDA 600 1))
             CHGVAR     VAR(&DCL01)  VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DCL02)  VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DCM02S) VALUE(%SST(*LDA 605 5))
             CHGVAR     VAR(&DCM02E) VALUE(%SST(*LDA 610 5))
             CHGVAR     VAR(&DCM03S) VALUE(%SST(*LDA 640 9))
             CHGVAR     VAR(&DCM03E) VALUE(%SST(*LDA 650 9))
             CHGVAR     VAR(&DCL07S) VALUE(%SST(*LDA 661 8))
             CHGVAR     VAR(&DCL07E) VALUE(%SST(*LDA 671 8))
             CHGVAR     VAR(&DOPT) VALUE(%SST(*LDA 679 1))
    /*00B+*/ CHGVAR     VAR(&DCL04S) VALUE(%SST(*LDA 682 5))
    /*00B+*/ CHGVAR     VAR(&DCL04E) VALUE(%SST(*LDA 687 5))

   /*  */
                DLTF       FILE(QTEMP/INTXTM)
                MONMSG     MSGID(CPF2105)
                CRTDUPOBJ  OBJ(INTXTM) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                             TOLIB(QTEMP) NEWOBJ(INTXTM) DATA(*NO) +
                             CST(*NO) TRG(*NO)

                OVRDBF     FILE(INTXTM) TOFILE(QTEMP/INTXTM)
             CALL       PGM(PUR900) PARM(&DCL01 &DCL07S &DCL07E 'A')
                DLTOVR     FILE(INTXTM)

/*   */
             OVRDBF     FILE(INTXTM)  SHARE(*YES)

             IF         COND(&DOPT = '1') THEN(DO)
             OPNQRYF    FILE(QTEMP/INTXTM)   OPTION(*ALL)                  +
                         QRYSLT('TX01 = "' || &DCL01  || '"          +
                         & TX27 = "' || &DCL02 || ' "                +
                         & TX06 = %RANGE(  '|| &DCL07S ||'           +
                                           '|| &DCL07E ||')          +
                         & TX07 = %RANGE("' || &DCM02S || '"         +
                                         "' || &DCM02E || '")        +
                         & TX11 = %RANGE("' || &DCM03S || '"         +
                                         "' || &DCM03E || '")        +
                         & TX12 = %RANGE("' || &DCL04S || '"         +
                                         "' || &DCL04E || '")        +
                         & TX15 *NE 0                                +
                         & (TX03  = "C1"                             +
                             *OR TX03  = "C2"                        +
                             *OR TX03  = "B1")             ')        +
                        KEYFLD((TX01)(TX27)(TX07)(TX06)(TX11)(TX12))
              ENDDO

             IF         COND(&DOPT = '2') THEN(DO)
             OPNQRYF    FILE(QTEMP/INTXTM)   OPTION(*ALL)                  +
                         QRYSLT('TX01 = "' || &DCL01  || '"          +
                         & TX27 = "' || &DCL02 || ' "                +
                         & TX06 = %RANGE(  '|| &DCL07S ||'           +
                                           '|| &DCL07E ||')          +
                         & TX07 = %RANGE("' || &DCM02S || '"         +
                                         "' || &DCM02E || '")        +
                         & TX11 = %RANGE("' || &DCM03S || '"         +
                                         "' || &DCM03E || '")        +
                         & TX12 = %RANGE("' || &DCL04S || '"         +
                                         "' || &DCL04E || '")        +
                         & TX15 *NE 0                                +
                         & (TX03  = "C1"                             +
                             *OR TX03  = "C2")             ')        +
                        KEYFLD((TX01)(TX27)(TX07)(TX06)(TX11)(TX12))
              ENDDO

             IF         COND(&DOPT = '3') THEN(DO)
             OPNQRYF    FILE(QTEMP/INTXTM)   OPTION(*ALL)                  +
                         QRYSLT('TX01 = "' || &DCL01  || '"          +
                         & TX27 = "' || &DCL02 || ' "                +
                         & TX06 = %RANGE(  '|| &DCL07S ||'           +
                                           '|| &DCL07E ||')          +
                         & TX07 = %RANGE("' || &DCM02S || '"         +
                                         "' || &DCM02E || '")        +
                         & TX11 = %RANGE("' || &DCM03S || '"         +
                                         "' || &DCM03E || '")        +
                         & TX12 = %RANGE("' || &DCL04S || '"         +
                                         "' || &DCL04E || '")        +
                         & TX15 *NE 0                                +
                         & (TX03  = "B1")                  ')        +
                        KEYFLD((TX01)(TX27)(TX07)(TX06)(TX11)(TX12))
              ENDDO
 PRINT:
    /*00A*/  CLRPFM     FILE(SCWK051) /*驗收單明細表工作檔*/
    /*00A*/  CALL       PUR0200       /* WRITE TO WORKFILE */
             CLRPFM     FILE(SCWK13)
             OVRPRTF    FILE(PUR020P) PAGESIZE(*N 198) CPI(15) +
                          USRDTA('驗收明細')

             CALL       PUR0201
             DLTOVR     FILE(PUR020P)

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)

             CHGVAR     VAR(&P6601I) VALUE('PUR020P')
   /*00C*/   CALL       PUR020C2

             CLOF       OPNID(INTXTM)
             DLTOVR     FILE(INTXTM)

             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
 END:
             ENDPGM
