             PGM

             DCLF       FILE(SCWWPF)

             DCL        VAR(&CMDTXT)   TYPE(*CHAR) LEN(160)
             DCL        VAR(&CMDLEN)   TYPE(*DEC)  LEN(15 5)

    READF1:
             RCVF
             IF         COND(&WW01 *NE '14') THEN(GOTO CMDLBL(READF1))

             CHGVAR     VAR(&CMDTXT) VALUE('STRPCCMD PCCMD('|| +
                         &WW02)
             CHGVAR     VAR(&CMDLEN) VALUE(160)
   /*©I¥sPCµ{¦¡*/
/*           STRPCO                            */
/*           MONMSG     MSGID(IWS4010)           */
/*           CALL       PGM(QCMDEXC) PARM(&CMDTXT &CMDLEN)      */

             CALL       PGM(ECL100C) PARM('SCFLIB' 'SCWK12')

             GOTO       END
    END:
             ENDPGM
