             PGM

             DCL        VAR(&JOB)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&W#PROC) TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN10)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN14)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN96)   TYPE(*LGL)  LEN(1)

             RTVJOBA    JOB(&JOB)

             /* &W#PROC --> 0 =未處理, 1 =處理中*/
             RTVDTAARA  DTAARA(SCDA01 (5   1)) RTNVAR(&W#PROC)
             IF         COND(&W#PROC *EQ '1') THEN(DO)
             SNDBRKMSG  MSG('銷售批次作業目前正在處理中，請稍待！+
                        ') TOMSGQ(&JOB)
             RETURN
             ENDDO

             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')

             OVRPRTF    FILE(SEH001P) USRDTA('銷傳錯誤')

 START:      CALL       PGM(SEH0011) PARM(&IN03 &IN10 &IN14 &IN96)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')
             RETURN
             ENDDO

             IF         COND(&IN14) THEN(DO)

             /* LOCK CHECK */

             ALCOBJ     OBJ((*LIBL/SEHAPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTAPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             ALCOBJ     OBJ((*LIBL/INTBPF *FILE *EXCL)) WAIT(0)
             MONMSG     MSGID(CPF1002) EXEC(DO)
             CHGVAR     VAR(&IN96) VALUE('1')
             GOTO       CMDLBL(RLSOBJ)
             ENDDO

             /* 變更狀態碼 */
             CHGDTAARA  DTAARA(SCDA01 (5   1)) VALUE('1')

             CALL       PGM(SEH0011C)

             /* 執行完成,變更狀態 */
             CHGDTAARA  DTAARA(SCDA01 (5   1)) VALUE('0')

             ENDDO     /* IN14 */

             /* DEALLOCATE OBJECT    */
 RLSOBJ:     DLCOBJ     OBJ((*LIBL/SEHAPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTAPF *FILE *EXCL))
             DLCOBJ     OBJ((*LIBL/INTBPF *FILE *EXCL))

             GOTO       CMDLBL(START)

             ENDPGM
