   /*00A需求單號: 1081470                                          */
   /*00A IRIS 2019/12/10產出報表                                   */
             PGM

             DCLF       FILE(SCWWPF)

             DCL        VAR(&CMDTXT)   TYPE(*CHAR) LEN(160)
             DCL        VAR(&CMDLEN)   TYPE(*DEC)  LEN(15 5)

    READF:
             RCVF
             IF         COND(&WW01  *NE '21') THEN(GOTO CMDLBL(READF))

             CHGVAR     VAR(&CMDTXT) VALUE('STRPCCMD PCCMD('|| +
                         &WW02)
             CHGVAR     VAR(&CMDLEN) VALUE(160)
   /*呼叫PC程式*/
             STRPCO
             MONMSG     MSGID(IWS4010)
             CALL       PGM(QCMDEXC) PARM(&CMDTXT &CMDLEN)
   /*00A*/   CALL       PGM(ECL100C) PARM('QTEMP' 'SCWK19')
             ENDPGM
