             PGM
       /*  CHECK SCREEN */
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&IN03)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&IN10)   TYPE(*LGL)  LEN(1)
             DCL        VAR(&A01)    TYPE(*DEC) LEN(8 0)
             DCL        VAR(&A02)    TYPE(*DEC) LEN(8 0)
             DCL        VAR(&IN98)   TYPE(*LGL) LEN(1) VALUE('0')
             DCL        VAR(&IN97)   TYPE(*LGL) LEN(1) VALUE('0')
             CHGVAR     VAR(%SST(*LDA 162   1)) VALUE('2')
             CHGVAR     VAR(%SST(*LDA 125   3)) VALUE('001')
             CHGVAR     VAR(%SST(*LDA 598   2)) VALUE('00')

 START:      CALL       PGM(SER0101) PARM(&IN03 &IN98 &IN97)
             IF         COND(&IN03) THEN(DO)
             CHGVAR     VAR(%SST(*LDA 501 100)) VALUE(' ')
             RETURN
             ENDDO

             CHGVAR     VAR(&A01)    VALUE(%SST(*LDA 530 8))
             CHGVAR     VAR(&A02)    VALUE(%SST(*LDA 540 8))

             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)

             IF         COND(&$EVR *EQ '2') THEN(DO)
             SBMJOB     JOB(SER0101C) RQSDTA('CALL PGM(SER0101C)')

             CHGVAR     VAR(&IN97) VALUE('1')
             ENDDO

             ELSE       CMD(DO)
             CALL       PGM(SER0101C)
             CHGVAR     VAR(&IN98) VALUE('1')
             ENDDO

             GOTO       START

             ENDPGM
