             PGM

             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             DCL        VAR(&DATA)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&DHA01)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DHA02)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&A03)      TYPE(*CHAR) LEN(8)
             DCL        VAR(&A04)      TYPE(*CHAR) LEN(8)
             DCL        VAR(&@K01)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&@PM1)     TYPE(*CHAR) LEN(1)

             CHGVAR     VAR(&DHA01)    VALUE(%SST(*LDA 501 2))
             CHGVAR     VAR(&DHA02)    VALUE(%SST(*LDA 503 2))
             CHGVAR     VAR(&A03)      VALUE(%SST(*LDA 530 8))
             CHGVAR     VAR(&A04)      VALUE(%SST(*LDA 540 8))
             CHGVAR     VAR(&@PM1)     VALUE(%SST(*LDA 551 1))

             OVRPRTF    FILE(SER010P) USRDTA('¾P°â²§±`')

             OVRDBF     FILE(SEHAPF)   SHARE(*YES)
             OPNQRYF    FILE((SEHAPF)) OPTION(*ALL) QRYSLT('          +
                          HA01 = "' || &DHA01 || '"                   +
                        & HA02 = "' || &DHA02 || '"                   +
                        & HA03 = %RANGE( '|| &A03 ||'                 +
                                         '|| &A04 ||') ')             +
                          KEYFLD((HA01) (HA02) (HA03) (HA04) (HA05))

             OVRDBF     FILE(MANEPF)   SHARE(*YES)
             OPNQRYF    FILE((MANEPF)) OPTION(*ALL) QRYSLT('          +
                          NE01 = "' || &DHA01 || '"                   +
                        & NE02 = "' || &DHA02 || '"                   +
                        & NE16 = "A" ')                               +
                          KEYFLD((NE01)(NE02)(NE03))

             CLRPFM     SCWKPF
             CLRPFM     FILE(SCWK16)

             CALL       PGM(SER0102)
             CHGVAR     VAR(&@K01)     VALUE(%SST(*LDA 550 1))

  /* ¤U¸ü   */
  /*         IF         COND(&@K01 *NE ' ') THEN(DO)         */
             CALL       PGM(SER0103)
  /*         ENDDO                                           */

             CHGVAR     VAR(&@K01)     VALUE(%SST(*LDA 550 1))
             CLOF       OPNID(SEHAPF)
             CLOF       MANEPF
             DLTOVR     FILE(*ALL)

             IF         COND(&@PM1 *EQ '1') THEN(DO)
             RTVDTAARA  DTAARA(*LDA (162 1)) RTNVAR(&$EVR)
             RTVDTAARA  DTAARA(*LDA (125 3)) RTNVAR(&$CPY)
             RTVDTAARA  DTAARA(*LDA (598 2)) RTNVAR(&$PRTID)
             CHGVAR     VAR(&P6601I) VALUE('SER010P')
             CHGVAR     VAR(&P6602I) VALUE(&$EVR)
             CHGVAR     VAR(&P6603I) VALUE(&$CPY)
             CHGVAR     VAR(&P6604I) VALUE(&$PRTID)
             CALL       PGM(P66) PARM(&P6601I &P6602I &P6603I &P6604I)
             ENDDO

             ENDPGM
