 /*       泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
 /*                                                                 */
 /*        PROGRAM-ID   : SYS9022C                                  */
 /*        PROGRAM NAME :網頁工作清檔                             */
 /*        AUTHOR       : NANCY                                     */
 /*        CREATE DATE  : 2012.02.10                                */
 /*        UPDATE DATE  :                                           */
 /*00A需求單號: 1050180                                           */
 /*00A 2016/04/08 SHARON增加清除盤點工作檔                        */
 /*00B需求單號: 1140066                                           */
 /*00B 2025/02/18 DEREK增加FILE IN USE錯誤處理                  */
 /*-----------------------------------------------------------------*/
 /*00A- PGM     PARM(&CNT_C1 &CNT_C2 &CNT_C3 &CNT_C4) */
 PGM     PARM(&CNT_C1 &CNT_C2 &CNT_C3 &CNT_C4 &CNT_C5)        /*00A+*/

         DCLF  FILE(SYS902D)  RCDFMT(AP01F1)

         DCL   VAR(&CNT_C1)  TYPE(*CHAR) LEN(10)
         DCL   VAR(&CNT_C2)  TYPE(*CHAR) LEN(10)
         DCL   VAR(&CNT_C3)  TYPE(*CHAR) LEN(10)
         DCL   VAR(&CNT_C4)  TYPE(*CHAR) LEN(10)
 /*00A+*/DCL   VAR(&CNT_C5)  TYPE(*CHAR) LEN(10)
         DCL   VAR(&W#SYSD)  TYPE(*CHAR) LEN(8)

         DCL   VAR(&PFLD1) TYPE(*CHAR) LEN(1)
         DCL   VAR(&PFLD2) TYPE(*CHAR) LEN(1)
         DCL   VAR(&PFLD3) TYPE(*CHAR) LEN(1)
         DCL   VAR(&PFLD4) TYPE(*CHAR) LEN(1)
 /*00A+*/DCL   VAR(&PFLD5) TYPE(*CHAR) LEN(1)

         RTVJOBA    JOB(&S#DEVN)
         RTVDTAARA  DTAARA(*LDA (209 8))   RTNVAR(&W#SYSD)
         CHGVAR     VAR(&S#SYSD) VALUE(&W#SYSD)

         CHGVAR     VAR(&PCNT1)       VALUE(&CNT_C1)
         CHGVAR     VAR(&PCNT2)       VALUE(&CNT_C2)
         CHGVAR     VAR(&PCNT3)       VALUE(&CNT_C3)
         CHGVAR     VAR(&PCNT4)       VALUE(&CNT_C4)
 /*00A+*/CHGVAR     VAR(&PCNT5)       VALUE(&CNT_C5)

START:   SNDRCVF    RCDFMT(AP01F1)

         IF     COND(&IN03  *EQ '1') THEN(GOTO CMDLBL(END))

 /*00B-  IF     COND(&PFLD1 *EQ 'Y') THEN(CLRPFM SCWB01PF) */
 /*00B-  IF     COND(&PFLD2 *EQ 'Y') THEN(CLRPFM SCWB02PF) */
 /*00B-  IF     COND(&PFLD3 *EQ 'Y') THEN(CLRPFM SCWB03PF) */
 /*00B-  IF     COND(&PFLD4 *EQ 'Y') THEN(CLRPFM SCWB04PF) */
 /*00B-00A+  IF     COND(&PFLD5 *EQ 'Y') THEN(CLRPFM SCWB08PF) */
 /*00B+*/
 /*00B+*/    IF         COND(&PFLD1 *EQ 'Y') THEN(DO)
 /*00B+*/    CLRPFM     FILE(SCWB01PF)
 /*00B+*/    MONMSG     MSGID(CPF3156) EXEC(DO)
 /*00B+*/    ALCOBJ     OBJ((*LIBL/SCWB01PF *FILE *EXCL))
 /*00B+*/    CLRPFM     FILE(SCWB01PF)
 /*00B+*/    DLCOBJ     OBJ((*LIBL/SCWB01PF *FILE *EXCL))
 /*00B+*/    ENDDO
 /*00B+*/    ENDDO
 /*00B+*/
 /*00B+*/    IF         COND(&PFLD2 *EQ 'Y') THEN(DO)
 /*00B+*/    CLRPFM     FILE(SCWB02PF)
 /*00B+*/    MONMSG     MSGID(CPF3156) EXEC(DO)
 /*00B+*/    ALCOBJ     OBJ((*LIBL/SCWB02PF *FILE *EXCL))
 /*00B+*/    CLRPFM     FILE(SCWB02PF)
 /*00B+*/    DLCOBJ     OBJ((*LIBL/SCWB02PF *FILE *EXCL))
 /*00B+*/    ENDDO
 /*00B+*/    ENDDO
 /*00B+*/
 /*00B+*/    IF         COND(&PFLD3 *EQ 'Y') THEN(DO)
 /*00B+*/    CLRPFM     FILE(SCWB03PF)
 /*00B+*/    MONMSG     MSGID(CPF3156) EXEC(DO)
 /*00B+*/    ALCOBJ     OBJ((*LIBL/SCWB03PF *FILE *EXCL))
 /*00B+*/    CLRPFM     FILE(SCWB03PF)
 /*00B+*/    DLCOBJ     OBJ((*LIBL/SCWB03PF *FILE *EXCL))
 /*00B+*/    ENDDO
 /*00B+*/    ENDDO
 /*00B+*/
 /*00B+*/    IF         COND(&PFLD4 *EQ 'Y') THEN(DO)
 /*00B+*/    CLRPFM     FILE(SCWB04PF)
 /*00B+*/    MONMSG     MSGID(CPF3156) EXEC(DO)
 /*00B+*/    ALCOBJ     OBJ((*LIBL/SCWB04PF *FILE *EXCL))
 /*00B+*/    CLRPFM     FILE(SCWB04PF)
 /*00B+*/    DLCOBJ     OBJ((*LIBL/SCWB04PF *FILE *EXCL))
 /*00B+*/    ENDDO
 /*00B+*/    ENDDO
 /*00B+*/
 /*00B+*/    IF         COND(&PFLD5 *EQ 'Y') THEN(DO)
 /*00B+*/    CLRPFM     FILE(SCWB08PF)
 /*00B+*/    MONMSG     MSGID(CPF3156) EXEC(DO)
 /*00B+*/    ALCOBJ     OBJ((*LIBL/SCWB08PF *FILE *EXCL))
 /*00B+*/    CLRPFM     FILE(SCWB08PF)
 /*00B+*/    DLCOBJ     OBJ((*LIBL/SCWB08PF *FILE *EXCL))
 /*00B+*/    ENDDO
 /*00B+*/    ENDDO

         CALL   SYS9021C

END:     ENDPGM
