             PGM

             DCL        VAR(&SYSTIME) TYPE(*CHAR) LEN(6)

START:
             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&SYSTIME)
             IF         COND(&SYSTIME *GE '141000') THEN(GOTO +
                          CMDLBL(END))

             RUNSQLSTM  SRCFILE(SCPLIB/QSQLSRC) SRCMBR(UPD001SQL) +
                          COMMIT(*NONE)

             DLYJOB     DLY(120)
             GOTO       CMDLBL(START)

END:
             ENDPGM
