     /**************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250  */
     /*                                                            */
     /*    PROGRAM ID   : VOU006C1                                 */
     /*    PROGRAM NAME :傳票批次作業                            */
     /*    AUTHOR       : A1492 CAROL                              */
     /*    CREATE DATE  : 2010.02.01                               */
     /*    UPDATE DATE  :                                          */
     /*    SYSTEM       : 進銷存收TO總帳                       */
     /**************************************************************/
             PGM

             DCL        VAR(&D01)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&F01)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&F02)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&$EVR)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&$CPY)   TYPE(*CHAR) LEN(3)
             DCL        VAR(&$PRTID) TYPE(*CHAR) LEN(2)
             DCL        VAR(&P6601I) TYPE(*CHAR) LEN(10)
             DCL        VAR(&P6602I) TYPE(*DEC)  LEN(1 0)
             DCL        VAR(&P6603I) TYPE(*DEC)  LEN(3 0)
             DCL        VAR(&P6604I) TYPE(*DEC)  LEN(2 0)

             CHGVAR     VAR(&D01)   VALUE(%SST(*LDA 625 1))
             CHGVAR     VAR(&F01)   VALUE(%SST(*LDA 601 8))
             CHGVAR     VAR(&F02)   VALUE(%SST(*LDA 609 8))

     /* 01.銷售傳票批次*/
             CALL       PGM(VOU001C1)
     /* 02.採購傳票批次*/
             CALL       PGM(VOU002C1)
     /* 03.庫存異動傳票批次*/
             CALL       PGM(VOU003C1)
     /* 04.進貨退出傳票批次*/
             CALL       PGM(VOU004C1)
     /* 05.陳列轉進貨傳票批次*/
             CALL       PGM(VOU005C1)

             ENDPGM
