/********************************************************************/
/*                                                                  */
/* 5722SS1 V5R1M0 010525     RTVCLSRC Output     01/28/13 19:11:50  */
/*                                                                  */
/* Program name . . . . . . . . . . . . . . :   INM000C           PN*/
/* Library name . . . . . . . . . . . . . . :   SCPLIB            PL*/
/* Original source file . . . . . . . . . . :   QCLSRC            SN*/
/* Library name . . . . . . . . . . . . . . :   SCPLIB            SL*/
/* Original source member . . . . . . . . . :   INM000C           SM*/
/* Source file change                                               */
/*   date/time  . . . . . . . . . . . . . . :   12/14/12 18:29:06 SC*/
/* Patch option . . . . . . . . . . . . . . :   *NOPATCH          PO*/
/* User profile . . . . . . . . . . . . . . :   *USER             UP*/
/* Text . . . : ＶＩＰ管理系統主畫面                       A1492TX*/
/* Owner  . . . . . . . . . . . . . . . . . :   SCPGMR            OW*/
/* Patch change ID  . . . . . . . . . . . . :                     PC*/
/* Patch APAR ID  . . . . . . . . . . . . . :                     PA*/
/* User mod flag  . . . . . . . . . . . . . :   *YES              UM*/
/*                                                                ED*/
/********************************************************************/
     PGM
     DCL VAR(&WDATE) TYPE(*CHAR) LEN(6)
     DCL VAR(&$USER) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0101I) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0102I) TYPE(*CHAR) LEN(10)
     DCL VAR(&S0101O) TYPE(*CHAR) LEN(1)
     DCL VAR(&WUSER) TYPE(*CHAR) LEN(3)
     DCLF FILE(*LIBL/VPM000D) RCDFMT(DSPC1)
     RTVDTAARA DTAARA(*LDA (101 10)) RTNVAR(&$USER)
     RTVDTAARA DTAARA(*LDA (119 6)) RTNVAR(&WDATE)
     CHGVAR VAR(&$EGMDY) VALUE(&WDATE)
     CHGVAR VAR(&S0101I) VALUE(&$USER)
     CHGVAR VAR(&WUSER) VALUE(%SST(&$USER 1 3))
START:
     SNDRCVF DEV(*FILE) RCDFMT(DSPC1)
     CHGVAR VAR(&IN98) VALUE('0')
     IF COND(&IN03 *EQ '1') THEN(RETURN)
     IF COND(&DOPID *EQ '01') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VPA001')
     ENDDO
     IF COND(&DOPID *EQ '11') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VPB001C')
     ENDDO
     IF COND(&DOPID *EQ '12') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VPB002C')
     ENDDO
     IF COND(&DOPID *EQ '21') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VPR001C')
     ENDDO
     IF COND(&DOPID *EQ '22') THEN(DO)
     CHGVAR VAR(&S0102I) VALUE('VPR002C')
     ENDDO
     IF COND(&DOPID *EQ '  ') THEN(GOTO CMDLBL(START))
     GOTO CMDLBL(CHKAUT)
CHKAUT: +
     CALL PGM(S#S01) PARM(&S0101I &S0102I &S0101O)
     IF COND(&S0101O = 'Y') THEN(CALL PGM(&S0102I))
     ELSE CMD(CHGVAR VAR(&IN98) VALUE('1'))
     GOTO CMDLBL(START)
     ENDPGM
