     /***************************************************************/
     /*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250   */
     /*                                                             */
     /*    AUTHOR       : JONATHAN YEH                              */
     /*    CREATE DATE  : 103/04/07                                 */
     /*    UPDATE DATE  :                                           */
     /*    PROGRAM NAME : VPR002C1                                  */
     /*    SYSTEM       :                                           */
     /*    SUBSYSTEM    :                                           */
     /*    REMARK       :                                         */
     /***************************************************************/
             PGM

             DCL        VAR(&SELEC1)   TYPE(*CHAR) LEN(512)
             DCL        VAR(&DOWNL)    TYPE(*CHAR) LEN(1)
             DCL        VAR(&DATA)     TYPE(*CHAR) LEN(1)
             DCL        VAR(&DBGN1)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBGN2)    TYPE(*CHAR) LEN(2)
             DCL        VAR(&DBGN3)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DBGN4)    TYPE(*CHAR) LEN(4)
             DCL        VAR(&DBGN5)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&DBGN6)    TYPE(*CHAR) LEN(6)
             DCL        VAR(&WHA03S)   TYPE(*CHAR) LEN(8)
             DCL        VAR(&WHA03E)   TYPE(*CHAR) LEN(8)

             CHGVAR     VAR(&DOWNL)    VALUE(%SST(*LDA 600 1))
             CHGVAR     VAR(&DBGN1)    VALUE(%SST(*LDA 601 2))
             CHGVAR     VAR(&DBGN2)    VALUE(%SST(*LDA 603 2))
             CHGVAR     VAR(&DBGN3)    VALUE(%SST(*LDA 605 4))
             CHGVAR     VAR(&DBGN4)    VALUE(%SST(*LDA 609 4))
             CHGVAR     VAR(&DBGN5)    VALUE(%SST(*LDA 613 6))
             CHGVAR     VAR(&DBGN6)    VALUE(%SST(*LDA 619 6))
             CHGVAR     VAR(&WHA03S)   VALUE(%SST(*LDA 625 8))
             CHGVAR     VAR(&WHA03E)   VALUE(%SST(*LDA 633 8))

             CHGVAR     VAR(&SELEC1) VALUE('SD01 = "' || &DBGN1 || +
                          '" *and SD02 = "' || &DBGN2 || '" *and +
                          SD03 = %RANGE("' || &DBGN3 || '" "' || +
                          &DBGN4 || '") *AND   SD04 = %RANGE("' || +
                          &WHA03S || '" "' || &WHA03E || '") ')

             OVRDBF     FILE(VPSDPF) SHARE(*YES)
             OPNQRYF    FILE((VPSDPF)) QRYSLT(&SELEC1) KEYFLD(*FILE)

             CLRPFM     FILE(VPB004WF)
             CALL       PGM(VPR0021)
             CLOF       OPNID(VPSDPF)

             CALL       PGM(ECL100C) PARM('SCFLIB' 'VPB004WF')

             DLTOVR     FILE(*ALL)

             ENDPGM
