             PGM
             DCL        VAR(&DBGN1)   TYPE(*CHAR) LEN(2)
             CHGVAR     VAR(&DBGN1) VALUE(%SST(*LDA 601 2))
             CLRPFM     FILE(VPB003WF)
   /*呼叫程式*/

             CALL       PGM(VPR0011)
   /*轉成EXCEL */

             CALL       PGM(ECL100C) PARM('SCFLIB' 'VPB003WF')
    END:
             DLTOVR     FILE(*ALL)
             ENDPGM
