     /* ±ÄÁÊ³æ±H¥XFLAG SETTING (SCDA01 7)  */

             PGM      PARM(&PARM1)

             DCL      VAR(&PARM1)  TYPE(*CHAR) LEN(1)  /*ON/OFF  */

             IF       COND(&PARM1 *EQ '0') THEN(DO)
             CHGDTAARA  DTAARA(SCDA01 (7   1)) VALUE('0')
             ENDDO
             ELSE IF  COND(&PARM1 *EQ '1') THEN(DO)
             CHGDTAARA  DTAARA(SCDA01 (7   1)) VALUE('1')
             ENDDO

             ENDPGM
