             PGM        PARM(&PARM1 &PARM2 &PARM3 &PARM4 &PARM5 +
                             &PARM6 &MODE  &ERRRD &RTNCD &RTNDSC)

             DCL        VAR(&PARM1)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&PARM2)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&PARM3)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&PARM4)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&PARM5)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARM6)  TYPE(*CHAR) LEN(13)
             DCL        VAR(&MODE)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&ERRRD)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&RTNCD)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&RTNDSC) TYPE(*CHAR) LEN(60)

             CALL P63

             OVRDBF     FILE(PIZAPF) WAITFILE(2) WAITRCD(2)
             OVRDBF     FILE(PIZBPF) WAITFILE(2) WAITRCD(2)

             OVRDBF     FILE(SCWB08PF) SHARE(*YES)
             OPNQRYF    FILE((SCWB08PF)) OPTION(*ALL) QRYSLT(' +
                          WB0801  = "' || &PARM5  || '" ')       +
                        KEYFLD((WB0801) (WB0802))

             CALL       PGM(WEB025) PARM(&PARM1 &PARM2 &PARM3 &PARM4 +
                          &PARM5 &PARM6 &MODE &ERRRD &RTNCD &RTNDSC)

             CLOF       OPNID(SCWB08PF)
             DLTOVR     FILE(*ALL)
END:
             ENDPGM
