             PGM      PARM(&PARM1 &PARM2 &PARM3     +
                           &ERRRD &RTNCD &RTNDSC )
             DCL        VAR(&PARM1)  TYPE(*CHAR) LEN(13)
             DCL        VAR(&PARM2)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARM3)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&ERRRD)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&RTNCD)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&RTNDSC) TYPE(*CHAR) LEN(60)

             CALL P63

             OVRDBF     FILE(POCLPF) WAITFILE(2) WAITRCD(2)
             OVRDBF     FILE(POCMPF) WAITFILE(2) WAITRCD(2)

             OVRDBF     FILE(SCWB04PF) SHARE(*YES)
             OPNQRYF    FILE((SCWB04PF)) OPTION(*ALL) QRYSLT(' +
                          WB0401  = "' || &PARM1  || '" ')     +
                        KEYFLD((WB0401) (WB0402) )

             CALL       PGM(WEB029) PARM(&PARM1 &PARM2 &PARM3  +
                                         &ERRRD &RTNCD &RTNDSC)
             CLOF       OPNID(SCWB04PF)
             DLTOVR     FILE(*ALL)
END:
             ENDPGM
