             PGM        PARM(&PARM1 &PARM2 &PARM3 &PARM4 &PARM5 +
 /*00A+*/                    &PARM6 &PARM7 &MODE &ERRRD &RTNCD &RTNDSC)
 /*00A-                      &PARM6 &PARM7 &ERRRD &RTNCD &RTNDSC)   */

             DCL        VAR(&PARM1)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&PARM2)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&PARM3)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&PARM4)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&PARM5)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&PARM6)  TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARM7)  TYPE(*CHAR) LEN(13)
 /*00A+*/    DCL        VAR(&MODE)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&ERRRD)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&RTNCD)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&RTNDSC) TYPE(*CHAR) LEN(60)

             CALL P63

             OVRDBF     FILE(SCWB01PF) SHARE(*YES)
 /*          OPNQRYF    FILE((SCWB01PF)) OPTION(*ALL) QRYSLT('     +
                        WB0101 = "' || &PARM6 || '" ') KEYFLD((WB0101)+
                        (WB0102))                             */

             OPNQRYF    FILE((SCWB01PF)) OPTION(*ALL) QRYSLT(' +
                        WB0101 = "' || &PARM6  || '" ')       +
                        KEYFLD((WB0101) (WB0102) )

             CALL       PGM(WEB012) PARM(&PARM1 &PARM2 &PARM3 &PARM4 +
 /*00A+*/                 &PARM5 &PARM6 &PARM7 &MODE &ERRRD &RTNCD +
 /*00A+*/                 &RTNDSC)
 /*00A-                   &PARM5 &PARM6 &PARM7 &ERRRD &RTNCD &RTNDSC)*/

             CLOF       OPNID(SCWB01PF)
             DLTOVR     FILE(*ALL)
END:
             ENDPGM
