             PGM      PARM(&PARM1 &PARM2 &PARM3                +
                           &PARM4 &PARM5 &PARM6 &RTNCD &RTNDSC)

             DCL      VAR(&PARM1)  TYPE(*CHAR) LEN(2)  /*公司代號*/
             DCL      VAR(&PARM2)  TYPE(*CHAR) LEN(2)  /*通路代號*/
             DCL      VAR(&PARM3)  TYPE(*CHAR) LEN(5)  /*分店代號*/
             DCL      VAR(&PARM4)  TYPE(*CHAR) LEN(8)  /*訂貨日  */
             DCL      VAR(&PARM4D) TYPE(*DEC)  LEN(8 0)
             DCL      VAR(&PARM5)  TYPE(*CHAR) LEN(8)  /*到貨運日*/
             DCL      VAR(&PARM5D) TYPE(*DEC)  LEN(8 0)
             DCL      VAR(&PARM6)  TYPE(*CHAR) LEN(8)  /*到分店日*/
             DCL      VAR(&PARM6D) TYPE(*DEC)  LEN(8 0)
             DCL      VAR(&RTNCD)  TYPE(*CHAR) LEN(1)  /* RTN CODE */
             DCL      VAR(&RTNDSC) TYPE(*CHAR) LEN(60) /* RTN DESC */
             DCL      VAR(&CMDCD)  TYPE(*CHAR) LEN(1)  /*需求碼  */

             CHGVAR   VAR(&PARM4D) VALUE(&PARM4)
             CHGVAR   VAR(&PARM5D) VALUE(&PARM5)
             CHGVAR   VAR(&PARM6D) VALUE(&PARM6)
             CHGVAR   VAR(&CMDCD) VALUE('1')

             CALL     P63
             CALL     PGM(GET004) PARM(&CMDCD &PARM1 &PARM2  &PARM3          +
                                       &PARM4 &PARM5D &PARM6D &RTNCD )

             CHGVAR   VAR(&PARM4) VALUE(&PARM4D)
             CHGVAR   VAR(&PARM5) VALUE(&PARM5D)
             CHGVAR   VAR(&PARM6) VALUE(&PARM6D)

             IF       COND(&RTNCD *EQ 'N') THEN( CHGVAR VAR(&RTNDSC) +
                      VALUE('休假日期資料檔內無本月份記錄。') )

             ENDPGM
