             PGM        PARM(&PARM1 &PARM2 &PARM3 &PARM4 +
                             &MODE  &ERRRD &RTNCD &RTNDSC)

             DCL        VAR(&PARM1)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&PARM2)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&PARM3)  TYPE(*CHAR) LEN(8)
             DCL        VAR(&PARM4)  TYPE(*CHAR) LEN(5)
             DCL        VAR(&MODE)   TYPE(*CHAR) LEN(1)
             DCL        VAR(&ERRRD)  TYPE(*CHAR) LEN(3)
             DCL        VAR(&RTNCD)  TYPE(*CHAR) LEN(2)
             DCL        VAR(&RTNDSC) TYPE(*CHAR) LEN(60)

             CALL P63

             CALL       PGM(WEB027) PARM(&PARM1 &PARM2 &PARM3 &PARM4 +
                          &MODE &ERRRD &RTNCD &RTNDSC)

END:
             ENDPGM
