             PGM      PARM(&PARM1 &PARM2 &PARM3                 +
                           &PARM4 &RTNCD &RTNDSC)

             DCL      VAR(&PARM1)  TYPE(*CHAR) LEN(2)  /*公司代號*/
             DCL      VAR(&PARM2)  TYPE(*CHAR) LEN(2)  /*通路代號*/
             DCL      VAR(&PARM3)  TYPE(*CHAR) LEN(8)  /*盤點日期*/
             DCL      VAR(&PARM4)  TYPE(*CHAR) LEN(5)  /*分店代號*/
             DCL      VAR(&RTNCD)  TYPE(*CHAR) LEN(2)  /* RTN CODE */
             DCL      VAR(&RTNDSC) TYPE(*CHAR) LEN(60) /* RTN DESC */

             CALL     P63
             CALL       PGM(WEB026) PARM(&PARM1 &PARM2 &PARM3 &PARM4 +
                          &RTNCD &RTNDSC)

             ENDPGM
