            PGM      PARM(&RTNCD &RTNDSC)

            DCL        VAR(&RTNCD)  TYPE(*CHAR) LEN(1)
            DCL        VAR(&RTNDSC) TYPE(*CHAR) LEN(60)
            DCL        VAR(&W#PROC) TYPE(*CHAR) LEN(1)
            DCL        VAR(&LCK)    TYPE(*CHAR) LEN(1)

            /* &W#PROC --> 0 =未處理, 1 =處理中*/

            RTVDTAARA  DTAARA(SCDA01 (1   1)) RTNVAR(&W#PROC)
            IF         COND(&W#PROC *EQ '1') THEN(DO)
            CHGVAR     VAR(&RTNCD) VALUE('1')
            CHGVAR     VAR(&RTNDSC) +
            VALUE('日結作業目前正在處理中，請稍待！')
            RETURN
            ENDDO

            RTVDTAARA  DTAARA(SCDA01 (2   1)) RTNVAR(&W#PROC)
            IF         COND(&W#PROC *EQ '1') THEN(DO)
            CHGVAR     VAR(&RTNCD) VALUE('2')
            CHGVAR     VAR(&RTNDSC) +
            VALUE('月結作業目前正在處理中，請稍待！')
            RETURN
            ENDDO

            RTVDTAARA  DTAARA(SCDA01 (3   1)) RTNVAR(&W#PROC)
            IF         COND(&W#PROC *EQ '1') THEN(DO)
            CHGVAR     VAR(&RTNCD) VALUE('3')
            CHGVAR     VAR(&RTNDSC) +
            VALUE('採購批次作業目前正在處理中，請稍待！')
            RETURN
            ENDDO

            RTVDTAARA  DTAARA(SCDA01 (4   1)) RTNVAR(&W#PROC)
            IF         COND(&W#PROC *EQ '1') THEN(DO)
            CHGVAR     VAR(&RTNCD) VALUE('4')
            CHGVAR     VAR(&RTNDSC) +
            VALUE('運費月結作業目前正在處理中，請稍待！')
            RETURN
            ENDDO

            RTVDTAARA  DTAARA(SCDA01 (7   1)) RTNVAR(&W#PROC)
            IF         COND(&W#PROC *EQ '1') THEN(DO)
            CHGVAR     VAR(&RTNCD) VALUE('7')
            CHGVAR     VAR(&RTNDSC) +
            VALUE('採購單寄出作業目前正在處理中，請稍待！')
            RETURN
            ENDDO

            RTVDTAARA  DTAARA(SCDA01 (8   1)) RTNVAR(&W#PROC)
            IF         COND(&W#PROC *EQ '1') THEN(DO)
            CHGVAR     VAR(&RTNCD) VALUE('8')
            CHGVAR     VAR(&RTNDSC) +
            VALUE('應到貨箱數表寄出作業目前正在處理中，請稍待！')
            RETURN
            ENDDO

            RTVDTAARA  DTAARA(SCDA01 (9   1)) RTNVAR(&W#PROC)
            IF         COND(&W#PROC *EQ '1') THEN(DO)
            CHGVAR     VAR(&RTNCD) VALUE('9')
            CHGVAR     VAR(&RTNDSC) +
            VALUE('貨運實際箱數維護目前正在使用中，請稍待！')
            RETURN
            ENDDO

            ALCOBJ     OBJ((*LIBL/POCKPF *FILE *EXCL)) WAIT(0)
            MONMSG     MSGID(CPF1002) EXEC(DO)
            CHGVAR     VAR(&RTNCD) VALUE('E')
            CHGVAR     VAR(&RTNDSC) +
            VALUE('箱數表被使用中，無法執行應到貨箱數表寄出作業，請稍待！')
            RETURN
            ENDDO
             /* DEALLOCATE OBJECT    */
            DLCOBJ     OBJ((*LIBL/POCKPF *FILE *EXCL))

            ENDPGM
