             PGM

             DCL        VAR(&YM) TYPE(*CHAR) LEN(6)

             CHGVAR     VAR(&YM) VALUE('201504')

             CLRPFM     FILE(Z003F1)

             OVRDBF     FILE(INTBPF) SHARE(*YES)
             OPNQRYF    FILE((INTBPF)) QRYSLT(' CTB02 *EQ "' *CAT +
                          &YM *CAT '" ') KEYFLD(*FILE) +
                          MAPFLD((CTB02 TB02 *CHAR 6))
             CALL       PGM(Z003R1)
             CLOF       OPNID(INTBPF)
             DLTOVR     FILE(INTBPF)

             ENDPGM
